{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/Myworld/Dropbox/IncExpProject/WorkingFolder/indSCE_Est_log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}22 Mar 2020, 17:32:26
{txt}
{com}. 
. 
. ***************************
. **  Clean and Merge Data **
. ***************************
. 
. use "${c -(}folder{c )-}/SCE/IncExpSCEDstIndM",clear 
{txt}
{com}. 
. duplicates report year month userid

{p 0 4}{txt}Duplicates in terms of {res} year month userid{p_end}

{txt}{hline 10}{c TT}{hline 27}
   copies {c |} observations       surplus
{hline 10}{c +}{hline 27}
        1 {c |}        {res}85852             0
{txt}{hline 10}{c BT}{hline 27}

{com}. 
. ******************************
. *** Merge with demographics **
. *****************************
. 
. merge 1:1 year month userid using "${c -(}folder{c )-}/SCE/IncExpSCEProbIndM",keep(master match) 
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}          85,852{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge hh_info_merge
{res}{txt}
{com}. 
. *******************************
. **  Set Panel Data Structure **
. *******************************
. rename userid ID 
{res}{txt}
{com}. xtset ID date   /* this is not correct. ID is unique here.*/
{res}{txt}{col 8}panel variable:  {res}ID (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}date, 01jun2013 00:00:00 to 01may2019 00:00:00
{col 25}but with gaps
{txt}{col 17}delta:  {res}.001 seconds
{txt}
{com}. sort ID year month 
{txt}
{com}. 
. *******************************
. ** Exclude extreme outliers 
. ******************************
. 
. keep if Q32 <= 65 & Q32 >= 20
{txt}(8926 observations deleted)

{com}. 
. *****************************************
. ****  Renaming so that more consistent **
. *****************************************
. 
. rename Q24_mean incmean
{res}{txt}
{com}. rename Q24_var incvar
{res}{txt}
{com}. rename Q24_iqr inciqr
{res}{txt}
{com}. rename IncSkew incskew 
{res}{txt}
{com}. rename Q24_rmean rincmean
{res}{txt}
{com}. rename Q24_rvar rincvar
{res}{txt}
{com}. 
. rename Q36 educ
{res}{txt}
{com}. rename D6 HHinc 
{res}{txt}
{com}. rename Q32 age 
{res}{txt}
{com}. rename Q33 gender 
{res}{txt}
{com}. rename Q10_1 fulltime
{res}{txt}
{com}. rename Q10_2 parttime
{res}{txt}
{com}. rename Q12new selfemp
{res}{txt}
{com}. rename Q6new Stkprob
{res}{txt}
{com}. rename Q4new UEprobAgg
{res}{txt}
{com}. rename Q13new UEprobInd
{res}{txt}
{com}. rename Q26v2 spending_dum
{res}{txt}
{com}. rename Q26v2part2 spending 
{res}{txt}
{com}. 
. ************************
. ** focus on non-zero skewness
. ****************************
. 
. replace incskew = . if incskew==0
{txt}(28584 real changes made, 28584 to missing)

{com}. 
. 
. *************************
. *** Exclude outliers *****
. *************************
. 
. local Moments incmean rincmean incvar rincvar inciqr incskew 
{txt}
{com}. 
. foreach var in `Moments'{c -(}
{txt}  2{com}.       egen `var'pl=pctile(`var'),p(1)
{txt}  3{com}.           egen `var'pu=pctile(`var'),p(99)
{txt}  4{com}.           replace `var' = . if `var' <`var'pl | (`var' >`var'pu & `var'!=.)
{txt}  5{com}. {c )-}
{txt}(174 real changes made, 174 to missing)
(980 real changes made, 980 to missing)
(294 real changes made, 294 to missing)
(545 real changes made, 545 to missing)
(1054 real changes made, 1054 to missing)
(520 real changes made, 520 to missing)

{com}. 
. 
. * other thresholds 
. 
. 
. foreach var in `Moments'{c -(}
{txt}  2{com}.       egen `var'l_truc=pctile(`var'),p(8)
{txt}  3{com}.           egen `var'u_truc=pctile(`var'),p(92)
{txt}  4{com}.           replace `var' = . if `var' <`var'l_truc | (`var' >`var'u_truc & `var'!=.)
{txt}  5{com}. {c )-}
{txt}(8523 real changes made, 8523 to missing)
(7683 real changes made, 7683 to missing)
(4504 real changes made, 4504 to missing)
(7854 real changes made, 7854 to missing)
(8925 real changes made, 8925 to missing)
(2699 real changes made, 2699 to missing)

{com}. 
. 
. *****************************
. *** generate other vars *****
. *****************************
. 
. gen age_sq = age^2
{txt}
{com}. label var age_sq "Age-squared"
{txt}
{com}. 
. encode _STATE, gen(state_id)
{txt}
{com}. label var state_id "state id"
{txt}
{com}. 
. *****************************
. *** generate group vars *****
. *****************************
. 
. egen byear_g = cut(byear), group(4)
{txt}
{com}. 
. label define byearglb 0 "1950s" 1 "1960s" 2 "1970s" 3 "1980s"
{txt}
{com}. label value byear_g byearlb
{txt}
{com}. 
. egen age_g = cut(age), group(3)  
{txt}
{com}. label var age_g "age group"
{txt}
{com}. label define agelb 0 "young" 1 "middle-age" 2 "old"
{txt}
{com}. label value age_g agelb
{txt}
{com}. 
. egen edu_g = cut(educ), group(2) 
{txt}
{com}. label var edu_g "education group"
{txt}
{com}. label define edulb 0 "low educ" 1 "high educ" 
{txt}
{com}. label value edu_g edulb
{txt}
{com}. 
. label define gdlb 0 "Male" 1 "Female" 
{txt}
{com}. label value gender gdlb
{txt}
{com}. 
. egen HHinc_g = cut(HHinc), group(3)
{txt}(10760 missing values generated)

{com}. label var HHinc_g "Household income group"
{txt}
{com}. label define HHinc_glb 0 "low inc" 1 "middle inc" 2 "high inc"
{txt}
{com}. label value HHinc_g HHinc_glb
{txt}
{com}. 
. local group_vars byear_g age_g edu_g HHinc_g 
{txt}
{com}. 
. **********************************
. *** tables and hists of Vars *****
. **********************************
. /*
> 
> local Moments incmean incvar inciqr rincmean rincvar incskew
> 
> foreach gp in `group_vars' {c -(}
> tabstat `Moments', st(p10 p50 p90) by(`gp')
> {c )-}
> 
> 
> foreach gp in `group_vars' {c -(}
> table `gp', c(median incvar mean incvar median rincvar mean rincvar) by(year)
> {c )-}
> 
> 
> 
> ** histograms 
> 
> foreach mom in `Moments'{c -(}
> 
> twoway (hist `mom',fcolor(ltblue) lcolor(none)), ///
>            ytitle("") ///
>            title("`mom'")
> graph export "${c -(}sum_graph_folder{c )-}/hist/hist_`mom'.png",as(png) replace  
> 
> {c )-}
> 
> 
> * 4 groups 
> foreach gp in byear_g{c -(}
> foreach mom in `Moments'{c -(}
> twoway (hist `mom' if `gp'==0,fcolor(gs15) lcolor("")) /// 
>        (hist `mom' if `gp'==1,fcolor(ltblue) lcolor("")) ///
>            (hist `mom' if `gp'==2,fcolor(red) lcolor("")) ///
>            (hist `mom' if `gp'==3,fcolor(green) lcolor("")), ///
>            xtitle("") ///
>            ytitle("") ///
>            title("`mom'") ///
>            legend(label(1 `gp'=0) label(2 `gp'=1) label(3 `gp'=2) label(4 `gp'=3) col(1))
> 
> graph export "${c -(}sum_graph_folder{c )-}/hist/hist_`mom'_`gp'.png",as(png) replace  
> {c )-}
> {c )-}
> 
> * 3 groups 
> foreach gp in HHinc_g age_g{c -(}
> foreach mom in `Moments'{c -(}
> 
> twoway (hist `mom' if `gp'==0,fcolor(gs15) lcolor("")) /// 
>        (hist `mom' if `gp'==1,fcolor(ltblue) lcolor("")) ///
>            (hist `mom' if `gp'==2,fcolor(red) lcolor("")), ///
>            xtitle("") ///
>            ytitle("") ///
>            title("`mom'") ///
>            legend(label(1 `gp'=0) label(2 `gp'=1) label(3 `gp'=2) col(1))
> 
> graph export "${c -(}sum_graph_folder{c )-}/hist/hist_`mom'_`gp'.png",as(png) replace  
> 
> {c )-}
> {c )-}
> 
> * 2 groups 
> 
> 
> foreach gp in edu_g{c -(}
> foreach mom in `Moments'{c -(}
> 
> twoway (hist `mom' if `gp'==0,fcolor(gs15) lcolor("")) /// 
>        (hist `mom' if `gp'==1,fcolor(ltblue) lcolor("")), ///
>            xtitle("") ///
>            ytitle("") ///
>            title("`mom'") ///
>            legend(label(1 `gp'=0) label(2 `gp'=1) col(1))
> 
> graph export "${c -(}sum_graph_folder{c )-}/hist/hist_`mom'_`gp'.png",as(png) replace  
> 
> {c )-}
> {c )-}
> 
> */
. 
. 
. **********************************
. *** time series pltos by group *****
. **********************************
. 
. ** 4 groups 
. foreach agg in mean median{c -(}
{txt}  2{com}.   foreach gp in byear_g{c -(}
{txt}  3{com}.    preserve 
{txt}  4{com}.    
.    collapse (`agg') `Moments', by(year month `gp')
{txt}  5{com}.    gen date_str=string(year)+"m"+string(month) 
{txt}  6{com}.    gen date= monthly(date_str,"YM")
{txt}  7{com}.    format date %tm
{txt}  8{com}.    
. foreach mom in `Moments'{c -(}
{txt}  9{com}. keep if `mom'!=.
{txt} 10{com}. twoway (tsline `mom' if `gp'== 0,lp(solid) lwidth(thick)) ///
>        (tsline `mom' if `gp'== 1,lp(dash) lwidth(thick)) ///
>            (tsline `mom' if `gp'== 2,lp(shortdash) lwidth(thick)) ///
>            (tsline `mom' if `gp'== 3,lp(dash_dot) lwidth(thick)), ///
>        xtitle("date") ///
>            ytitle("") ///
>            title("`mom' by generation") ///
>            legend(label(1 "1950s") label(2 "1960s") label(3 "1970s") label(4 "1980s")  col(4))
{txt} 11{com}.  graph export "${c -(}sum_graph_folder{c )-}/ts/ts_`mom'_`gp'_`agg'.png",as(png) replace  
{txt} 12{com}.       {c )-}
{txt} 13{com}.   restore
{txt} 14{com}. {c )-}
{txt} 15{com}. {c )-}
{txt}(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incmean_byear_g_mean.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincmean_byear_g_mean.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incvar_byear_g_mean.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincvar_byear_g_mean.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_inciqr_byear_g_mean.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incskew_byear_g_mean.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incmean_byear_g_median.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincmean_byear_g_median.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incvar_byear_g_median.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincvar_byear_g_median.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_inciqr_byear_g_median.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incskew_byear_g_median.png written in PNG format)

{com}. 
. 
. ** 3 groups fo HH income 
. foreach agg in mean median{c -(}
{txt}  2{com}.   foreach gp in HHinc_g{c -(}
{txt}  3{com}.    preserve 
{txt}  4{com}.    
.    collapse (`agg') `Moments', by(year month `gp')
{txt}  5{com}.    gen date_str=string(year)+"m"+string(month) 
{txt}  6{com}.    gen date= monthly(date_str,"YM")
{txt}  7{com}.    format date %tm
{txt}  8{com}.    
. foreach mom in `Moments'{c -(}
{txt}  9{com}. keep if `mom'!=.
{txt} 10{com}. twoway (tsline `mom' if `gp'== 0,lp(solid) lwidth(thick)) ///
>        (tsline `mom' if `gp'== 1,lp(dash) lwidth(thick)) ///
>            (tsline `mom' if `gp'== 2,lp(shortdash) lwidth(thick)), ///
>        xtitle("date") ///
>            ytitle("") ///
>            title("`mom' by household income") ///
>            legend(label(1 "low") label(2 "median") label(3 "high")  col(3))
{txt} 11{com}.  graph export "${c -(}sum_graph_folder{c )-}/ts/ts_`mom'_`gp'_`agg'.png",as(png) replace  
{txt} 12{com}.       {c )-}
{txt} 13{com}.   restore
{txt} 14{com}. {c )-}
{txt} 15{com}. {c )-}
{txt}(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incmean_HHinc_g_mean.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincmean_HHinc_g_mean.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incvar_HHinc_g_mean.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincvar_HHinc_g_mean.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_inciqr_HHinc_g_mean.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incskew_HHinc_g_mean.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incmean_HHinc_g_median.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincmean_HHinc_g_median.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incvar_HHinc_g_median.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincvar_HHinc_g_median.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_inciqr_HHinc_g_median.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incskew_HHinc_g_median.png written in PNG format)

{com}. 
. 
. ** 3 groups fo HH income 
. foreach agg in mean median{c -(}
{txt}  2{com}.   foreach gp in age_g{c -(}
{txt}  3{com}.    preserve 
{txt}  4{com}.    
.    collapse (`agg') `Moments', by(year month `gp')
{txt}  5{com}.    gen date_str=string(year)+"m"+string(month) 
{txt}  6{com}.    gen date= monthly(date_str,"YM")
{txt}  7{com}.    format date %tm
{txt}  8{com}.    
. foreach mom in `Moments'{c -(}
{txt}  9{com}. keep if `mom'!=.
{txt} 10{com}. twoway (tsline `mom' if `gp'== 0,lp(solid) lwidth(thick)) ///
>        (tsline `mom' if `gp'== 1,lp(dash) lwidth(thick)) ///
>            (tsline `mom' if `gp'== 2,lp(shortdash) lwidth(thick)), ///
>        xtitle("date") ///
>            ytitle("") ///
>            title("`mom' by age") ///
>            legend(label(1 "young") label(2 "middle-age") label(3 "old")  col(3))
{txt} 11{com}.            
.  graph export "${c -(}sum_graph_folder{c )-}/ts/ts_`mom'_`gp'_`agg'.png",as(png) replace  
{txt} 12{com}.       {c )-}
{txt} 13{com}.   restore
{txt} 14{com}. {c )-}
{txt} 15{com}. {c )-}
{txt}(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incmean_age_g_mean.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincmean_age_g_mean.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incvar_age_g_mean.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincvar_age_g_mean.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_inciqr_age_g_mean.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incskew_age_g_mean.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incmean_age_g_median.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincmean_age_g_median.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incvar_age_g_median.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincvar_age_g_median.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_inciqr_age_g_median.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incskew_age_g_median.png written in PNG format)

{com}. 
. 
. ** 2 groups 
. foreach agg in mean median{c -(}
{txt}  2{com}.   foreach gp in edu_g{c -(}
{txt}  3{com}.    preserve 
{txt}  4{com}.    
.    collapse (`agg') `Moments', by(year month `gp')
{txt}  5{com}.    gen date_str=string(year)+"m"+string(month) 
{txt}  6{com}.    gen date= monthly(date_str,"YM")
{txt}  7{com}.    format date %tm
{txt}  8{com}.    
. foreach mom in `Moments'{c -(}
{txt}  9{com}. keep if `mom'!=.
{txt} 10{com}. twoway (tsline `mom' if `gp'== 0,lp(solid) lwidth(thick)) ///
>        (tsline `mom' if `gp'== 1,lp(dash) lwidth(thick)), ///
>        xtitle("date") ///
>            ytitle("") ///
>            title("`mom' by education") ///
>            legend(label(1 "low") label(2 "high") col(2))
{txt} 11{com}.  graph export "${c -(}sum_graph_folder{c )-}/ts/ts_`mom'_`gp'_`agg'.png",as(png) replace  
{txt} 12{com}.       {c )-}
{txt} 13{com}.   restore
{txt} 14{com}. {c )-}
{txt} 15{com}. {c )-}
{txt}(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incmean_edu_g_mean.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincmean_edu_g_mean.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incvar_edu_g_mean.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincvar_edu_g_mean.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_inciqr_edu_g_mean.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incskew_edu_g_mean.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incmean_edu_g_median.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincmean_edu_g_median.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incvar_edu_g_median.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincvar_edu_g_median.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_inciqr_edu_g_median.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incskew_edu_g_median.png written in PNG format)

{com}. 
. ddd
{err}unrecognized command:  ddd
{txt}{search r(199):r(199);}

end of do-file

{search r(199):r(199);}

{com}. clear

. 