{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/Myworld/Dropbox/IncExpProject/WorkingFolder/indSCE_Est_log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}14 Dec 2020, 10:43:16
{txt}
{com}. 
. *********************************************************
. *** before working with SCE, clean the stock market data 
. ********************************************************
. 
. use "${c -(}mainfolder{c )-}/OtherData/sp500.dta",clear 
{txt}
{com}. 
. generate new_date = dofc(DATE)
{txt}
{com}. *format new_date %tm
. gen year = year(new_date)
{txt}
{com}. gen month = month(new_date)
{txt}
{com}. gen date_str = string(year)+ "m"+string(month)
{txt}
{com}. gen date = monthly(date_str,"YM")
{txt}
{com}. format date %tm
{txt}
{com}. drop DATE date_str year month new_date 
{txt}
{com}. label var sp500 "growth rate (%) of sp500 index from last month"
{txt}
{com}. save "${c -(}mainfolder{c )-}/OtherData/sp500M.dta",replace 
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/OtherData/sp500M.dta saved

{com}. clear 
{txt}
{com}. 
. 
. ***************************
. **  Clean and Merge Data **
. ***************************
. 
. use "${c -(}folder{c )-}/SCE/IncExpSCEDstIndM",clear 
{txt}
{com}. 
. duplicates report year month userid

{p 0 4}{txt}Duplicates in terms of {res} year month userid{p_end}

{txt}{hline 10}{c TT}{hline 27}
   copies {c |} observations       surplus
{hline 10}{c +}{hline 27}
        1 {c |}        {res}95113             0
{txt}{hline 10}{c BT}{hline 27}

{com}. 
. ************************************************
. *** Merge with demographics and other moments **
. ************************************************
. 
. merge 1:1 year month userid using "${c -(}folder{c )-}/SCE/IncExpSCEProbIndM",keep(master match using) 
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}          95,113{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge hh_info_merge
{res}{txt}
{com}. 
. 
. ** format the date 
. drop date 
{txt}
{com}. gen date_str=string(year)+"m"+string(month) 
{txt}
{com}. gen date= monthly(date_str,"YM")
{txt}
{com}. format date %tm
{txt}
{com}. order userid date year month   
{txt}
{com}. 
. *************************************
. *** Merge with stock market data   **
. *************************************
. 
. merge m:1 date using "${c -(}mainfolder{c )-}/OtherData/sp500M.dta", keep(master match) 
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}          95,113{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge sp_merge
{res}{txt}
{com}. 
. *******************************
. **  Set Panel Data Structure **
. *******************************
. rename userid ID 
{res}{txt}
{com}. xtset ID date   /* this is not correct. ID is unique here.*/
{res}{txt}{col 8}panel variable:  {res}ID (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}date, 2013m6 to 2020m1, but with gaps
{txt}{col 17}delta:  {res}1 month
{txt}
{com}. sort ID year month 
{txt}
{com}. 
. *******************************
. ** Exclude extreme outliers 
. ******************************
. 
. keep if Q32 <= 65 & Q32 >= 20
{txt}(9973 observations deleted)

{com}. 
. *****************************************
. ****  Renaming so that more consistent **
. *****************************************
. 
. rename Q24_mean incmean
{res}{txt}
{com}. rename Q24_var incvar
{res}{txt}
{com}. rename Q24_iqr inciqr
{res}{txt}
{com}. rename IncSkew incskew 
{res}{txt}
{com}. rename Q24_rmean rincmean
{res}{txt}
{com}. rename Q24_rvar rincvar
{res}{txt}
{com}. 
. rename Q36 educ
{res}{txt}
{com}. rename D6 HHinc 
{res}{txt}
{com}. rename Q32 age 
{res}{txt}
{com}. rename Q33 gender 
{res}{txt}
{com}. rename Q10_1 fulltime
{res}{txt}
{com}. rename Q10_2 parttime
{res}{txt}
{com}. rename Q12new selfemp
{res}{txt}
{com}. rename Q6new Stkprob
{res}{txt}
{com}. rename Q4new UEprobAgg
{res}{txt}
{com}. rename Q13new UEprobInd
{res}{txt}
{com}. rename Q26v2 spending_dum
{res}{txt}
{com}. rename Q26v2part2 spending 
{res}{txt}
{com}. 
. 
. ************************
. ** focus on non-zero skewness
. ****************************
. 
. replace incskew = . if incskew==0
{txt}(31814 real changes made, 31814 to missing)

{com}. 
. 
. *************************
. *** Exclude outliers *****
. *************************
. 
. local Moments incmean rincmean incvar rincvar inciqr incskew 
{txt}
{com}. 
. foreach var in `Moments'{c -(}
{txt}  2{com}.       egen `var'pl=pctile(`var'),p(1)
{txt}  3{com}.           egen `var'pu=pctile(`var'),p(99)
{txt}  4{com}.           replace `var' = . if `var' <`var'pl | (`var' >`var'pu & `var'!=.)
{txt}  5{com}. {c )-}
{txt}(1136 real changes made, 1136 to missing)
(1088 real changes made, 1088 to missing)
(3040 real changes made, 3040 to missing)
(800 real changes made, 800 to missing)
(1176 real changes made, 1176 to missing)
(575 real changes made, 575 to missing)

{com}. 
. /*
> * other thresholds 
> 
> foreach var in `Moments'{c -(}
>       egen `var'l_truc=pctile(`var'),p(8)
>           egen `var'u_truc=pctile(`var'),p(92)
>           replace `var' = . if `var' <`var'l_truc | (`var' >`var'u_truc & `var'!=.)
> {c )-}
> */
. 
. *****************************
. *** generate other vars *****
. *****************************
. 
. gen age_sq = age^2
{txt}
{com}. label var age_sq "Age-squared"
{txt}
{com}. 
. encode state, gen(state_id)
{txt}
{com}. label var state_id "state id"
{txt}
{com}. 
. *****************************
. *** generate group vars *****
. *****************************
. 
. *egen byear_g = cut(byear), group(4)
. 
. gen byear_g = cond(byear>=1980,1,0)
{txt}
{com}. label define byearglb 0 "before 1980s" 1 "after 1980s"
{txt}
{com}. *label define byearglb 0 "1950s" 1 "1960s" 2 "1970s" 3 "1980s"
. label value byear_g byearlb
{txt}
{com}. 
. egen age_g = cut(age), group(3)  
{txt}
{com}. label var age_g "age group"
{txt}
{com}. label define agelb 0 "young" 1 "middle-age" 2 "old"
{txt}
{com}. label value age_g agelb
{txt}
{com}. 
. gen edu_g = . 
{txt}(85140 missing values generated)

{com}. replace edu_g = 1 if educ==1
{txt}(694 real changes made)

{com}. replace edu_g = 2 if educ==2 | educ ==3 | educ == 4
{txt}(36926 real changes made)

{com}. replace edu_g = 3 if educ <=9 & educ>4
{txt}(47520 real changes made)

{com}. 
. label var edu_g "education group"
{txt}
{com}. label define edu_glb 1 "HS dropout" 2 "HS graduate" 3 "College/above"
{txt}
{com}. label value edu_g edu_glb
{txt}
{com}. 
. label define gdlb 0 "Male" 1 "Female" 
{txt}
{com}. label value gender gdlb
{txt}
{com}. 
. egen HHinc_g = cut(HHinc), group(2)
{txt}(11858 missing values generated)

{com}. label var HHinc_g "Household income group"
{txt}
{com}. label define HHinc_glb 0 "low inc" 1 "high inc"
{txt}
{com}. label value HHinc_g HHinc_glb
{txt}
{com}. 
. label define gender_glb 1 "male" 2 "female"
{txt}
{com}. label value gender gender_glb
{txt}
{com}. 
. gen fbetter =cond(Q1>2,1,0)
{txt}
{com}. replace fbetter = . if Q1 ==3  
{txt}(37884 real changes made, 37884 to missing)

{com}. label var fbetter "finance better"
{txt}
{com}. 
. label define better_glb 0 "worse" 1 "better"
{txt}
{com}. label value fbetter better_glb
{txt}
{com}. 
. gen nlit_g = cond(nlit>=3,1,0) 
{txt}
{com}. replace nlit_g = . if nlit ==.
{txt}(30156 real changes made, 30156 to missing)

{com}. label var nlit_g "numeracy literacy score group"
{txt}
{com}. label define nlilb 0 "low" 1 "high" 
{txt}
{com}. label value nlit_g nlitlb
{txt}
{com}. 
. local group_vars byear_g age_g edu_g HHinc_g fbetter nlit_g
{txt}
{com}. 
. 
. *********************************
. *** bar charts *****
. **********************************
. 
. 
. graph bar incvar, ///
>            over(HHinc,relabel(1 "<10k" 2 "<20k" 3 "<30k" 4 "<40k" 5 "<50k" 6 "<60k" 7 "<75k" 8 "<100k" 9 "<150k" 10 "<200k" 11 ">200k")) ///
>                    bar(1, color(navy)) ///
>                    title("Perceived Risk by Household Income") ///
>                    b1title("Household income") ///
>                    ytitle("Average perceived risk") 
{res}{txt}
{com}. graph export "${c -(}sum_graph_folder{c )-}/boxplot_var_HHinc_stata.png", as(png) replace 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/boxplot_var_HHinc_stata.png written in PNG format)

{com}. 
. 
. *********************************
. *** generate group summary data file *****
. **********************************
. 
. * by age 
. 
. 
. preserve 
{txt}
{com}. collapse incvar, by(age) 
{txt}
{com}. save "${c -(}folder{c )-}/SCE/incvar_by_age.dta",replace
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/SurveyData//SCE/incvar_by_age.dta saved

{com}. restore 
{txt}
{com}. 
. * by age x education 
. preserve
{txt}
{com}. collapse incvar, by(age edu_g) 
{txt}
{com}. save "${c -(}folder{c )-}/SCE/incvar_by_age_edu.dta",replace 
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/SurveyData//SCE/incvar_by_age_edu.dta saved

{com}. restore 
{txt}
{com}. 
. 
. **********************************
. *** tables and hists of Vars *****
. **********************************
. 
. /*
> local Moments incmean incvar inciqr rincmean rincvar incskew
> 
> foreach gp in `group_vars' {c -(}
> tabstat `Moments', st(p10 p50 p90) by(`gp')
> {c )-}
> 
> 
> foreach gp in `group_vars' {c -(}
> table `gp', c(median incvar mean incvar median rincvar mean rincvar) by(year)
> {c )-}
> 
> 
> ** histograms 
> 
> foreach mom in `Moments'{c -(}
> 
> twoway (hist `mom',fcolor(ltblue) lcolor(none)), ///
>            ytitle("") ///
>            title("`mom'")
> graph export "${c -(}sum_graph_folder{c )-}/hist/hist_`mom'.png",as(png) replace  
> 
> {c )-}
> 
> 
> * 4 groups 
> foreach gp in byear_g{c -(}
> foreach mom in `Moments'{c -(}
> twoway (hist `mom' if `gp'==0,fcolor(gs15) lcolor("")) /// 
>        (hist `mom' if `gp'==1,fcolor(ltblue) lcolor("")) ///
>            (hist `mom' if `gp'==2,fcolor(red) lcolor("")) ///
>            (hist `mom' if `gp'==3,fcolor(green) lcolor("")), ///
>            xtitle("") ///
>            ytitle("") ///
>            title("`mom'") ///
>            legend(label(1 `gp'=0) label(2 `gp'=1) label(3 `gp'=2) label(4 `gp'=3) col(1))
> 
> graph export "${c -(}sum_graph_folder{c )-}/hist/hist_`mom'_`gp'.png",as(png) replace  
> {c )-}
> {c )-}
> 
> * 3 groups 
> foreach gp in HHinc_g age_g{c -(}
> foreach mom in `Moments'{c -(}
> 
> twoway (hist `mom' if `gp'==0,fcolor(gs15) lcolor("")) /// 
>        (hist `mom' if `gp'==1,fcolor(ltblue) lcolor("")) ///
>            (hist `mom' if `gp'==2,fcolor(red) lcolor("")), ///
>            xtitle("") ///
>            ytitle("") ///
>            title("`mom'") ///
>            legend(label(1 `gp'=0) label(2 `gp'=1) label(3 `gp'=2) col(1))
> 
> graph export "${c -(}sum_graph_folder{c )-}/hist/hist_`mom'_`gp'.png",as(png) replace  
> 
> {c )-}
> {c )-}
> 
> * 2 groups 
> 
> 
> foreach gp in edu_g fbetter{c -(}
> foreach mom in `Moments'{c -(}
> 
> twoway (hist `mom' if `gp'==0,fcolor(gs15) lcolor("")) /// 
>        (hist `mom' if `gp'==1,fcolor(ltblue) lcolor("")), ///
>            xtitle("") ///
>            ytitle("") ///
>            title("`mom'") ///
>            legend(label(1 `gp'=0) label(2 `gp'=1) col(1))
> 
> graph export "${c -(}sum_graph_folder{c )-}/hist/hist_`mom'_`gp'.png",as(png) replace  
> 
> {c )-}
> {c )-}
> 
> */
. 
. 
. **********************************
. *** time series pltos by group *****
. **********************************
. 
. 
. ** 2 groups 
. foreach agg in mean median{c -(}
{txt}  2{com}.   foreach gp in fbetter{c -(}
{txt}  3{com}.    preserve 
{txt}  4{com}.    
.    collapse (`agg') `Moments' sp500, by(date `gp')
{txt}  5{com}.    xtset `gp' date 
{txt}  6{com}. 
. foreach mom in `Moments'{c -(}
{txt}  7{com}. keep if `mom'!=.
{txt}  8{com}. * moments only 
. 
. twoway (tsline `mom' if `gp'== 0,lp(solid) lwidth(thick)) ///
>        (tsline `mom' if `gp'== 1,lp(dash) lwidth(thick)), ///
>        xtitle("date") ///
>            ytitle("") ///
>            title("`mom' by recent household finance condition") ///
>            legend(label(1 "worse") label(2 "better") col(4))
{txt}  9{com}.  graph export "${c -(}sum_graph_folder{c )-}/ts/ts_`mom'_`gp'_`agg'.png",as(png) replace  
{txt} 10{com}.  
. {c )-}
{txt} 11{com}.   restore
{txt} 12{com}. {c )-}
{txt} 13{com}. {c )-}
{res}{txt}{col 8}panel variable:  {res}fbetter (weakly balanced)
{txt}{col 9}time variable:  {res}{col 25}date, 2013m6 to 2020m1
{txt}{col 17}delta:  {res}1 month
{txt}(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incmean_fbetter_mean.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincmean_fbetter_mean.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incvar_fbetter_mean.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincvar_fbetter_mean.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_inciqr_fbetter_mean.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incskew_fbetter_mean.png written in PNG format)
{res}{txt}{col 8}panel variable:  {res}fbetter (weakly balanced)
{txt}{col 9}time variable:  {res}{col 25}date, 2013m6 to 2020m1
{txt}{col 17}delta:  {res}1 month
{txt}(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incmean_fbetter_median.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincmean_fbetter_median.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incvar_fbetter_median.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincvar_fbetter_median.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_inciqr_fbetter_median.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incskew_fbetter_median.png written in PNG format)

{com}. 
. 
. ** 2 groups 
. foreach agg in mean median{c -(}
{txt}  2{com}.   foreach gp in byear_g{c -(}
{txt}  3{com}.    preserve 
{txt}  4{com}.    
.    collapse (`agg') `Moments' sp500, by(date `gp')
{txt}  5{com}.    xtset `gp' date 
{txt}  6{com}. 
. foreach mom in `Moments'{c -(}
{txt}  7{com}. keep if `mom'!=.
{txt}  8{com}. * moments only 
. 
. twoway (tsline `mom' if `gp'== 0,lp(solid) lwidth(thick)) ///
>        (tsline `mom' if `gp'== 1,lp(dash) lwidth(thick)), ///
>        xtitle("date") ///
>            ytitle("") ///
>            title("`mom' by generation") ///
>            legend(label(1 "before 1980s") label(2 "after 1980s") col(4))
{txt}  9{com}.  graph export "${c -(}sum_graph_folder{c )-}/ts/ts_`mom'_`gp'_`agg'.png",as(png) replace  
{txt} 10{com}.  
.  
. ** compute correlation coefficients 
. pwcorr `mom' f2.sp500 if `gp'==0, star(0.05)
{txt} 11{com}. local rho_1: display %4.2f r(rho) 
{txt} 12{com}. pwcorr `mom' f2.sp500 if `gp'==1, star(0.05)
{txt} 13{com}. local rho_2: display %4.2f r(rho) 
{txt} 14{com}. pwcorr `mom' f2.sp500 if `gp'==2, star(0.05)
{txt} 15{com}. local rho_3: display %4.2f r(rho) 
{txt} 16{com}. pwcorr `mom' f2.sp500 if `gp'==3, star(0.05)
{txt} 17{com}. local rho_4: display %4.2f r(rho) 
{txt} 18{com}. 
. ** moments and sp500 
. *** correlation with stock market by group *****
. 
. twoway (bar sp500 date if `gp'== 1,yaxis(2) fcolor(gs10)) ///
>        (tsline `mom' if `gp'== 1,lp(shortdash) lwidth(thick)), ///         
>        xtitle("date") ///
>            ytitle("") ///
>            ytitle("sp500 return (%)",axis(2)) ///
>            title("`mom' by generation") ///
>            legend(label(1 "sp500 (RHS)")  label(2 "1980s") col(3)) ///
>            caption("{c -(}superscript:1950s corr =`rho_1', 1960s corr =`rho_2', 1970s corr =`rho_3',1980s corr =`rho_4',{c )-}", ///
>            justification(left) position(11) size(vlarge))
{txt} 19{com}.  graph export "${c -(}sum_graph_folder{c )-}/ts/ts_`mom'_`gp'_`agg'_stk.png",as(png) replace 
{txt} 20{com}.  
. {c )-}
{txt} 21{com}.   restore
{txt} 22{com}. {c )-}
{txt} 23{com}. {c )-}
{res}{txt}{col 8}panel variable:  {res}byear_g (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}date, 2013m6 to 2020m1
{txt}{col 17}delta:  {res}1 month
{txt}(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incmean_byear_g_mean.png written in PNG format)

             {c |}  incmean F2.sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.1559   1.0000 

             {txt}{c |}  incmean F2.sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.0486   1.0000 

             {txt}{c |}  incmean F2.sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}       . 
    {txt}F2.sp500 {c |} {res}       .        . 

             {txt}{c |}  incmean F2.sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}       . 
    {txt}F2.sp500 {c |} {res}       .        . 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incmean_byear_g_mean_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincmean_byear_g_mean.png written in PNG format)

             {c |} rincmean F2.sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.0243   1.0000 

             {txt}{c |} rincmean F2.sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.1729   1.0000 

             {txt}{c |} rincmean F2.sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}       . 
    {txt}F2.sp500 {c |} {res}       .        . 

             {txt}{c |} rincmean F2.sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}       . 
    {txt}F2.sp500 {c |} {res}       .        . 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincmean_byear_g_mean_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incvar_byear_g_mean.png written in PNG format)

             {c |}   incvar F2.sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.3332*  1.0000 

             {txt}{c |}   incvar F2.sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.0765   1.0000 

             {txt}{c |}   incvar F2.sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}       . 
    {txt}F2.sp500 {c |} {res}       .        . 

             {txt}{c |}   incvar F2.sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}       . 
    {txt}F2.sp500 {c |} {res}       .        . 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incvar_byear_g_mean_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincvar_byear_g_mean.png written in PNG format)

             {c |}  rincvar F2.sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.2097   1.0000 

             {txt}{c |}  rincvar F2.sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.0356   1.0000 

             {txt}{c |}  rincvar F2.sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}       . 
    {txt}F2.sp500 {c |} {res}       .        . 

             {txt}{c |}  rincvar F2.sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}       . 
    {txt}F2.sp500 {c |} {res}       .        . 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincvar_byear_g_mean_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_inciqr_byear_g_mean.png written in PNG format)

             {c |}   inciqr F2.sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.2922*  1.0000 

             {txt}{c |}   inciqr F2.sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.0396   1.0000 

             {txt}{c |}   inciqr F2.sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}       . 
    {txt}F2.sp500 {c |} {res}       .        . 

             {txt}{c |}   inciqr F2.sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}       . 
    {txt}F2.sp500 {c |} {res}       .        . 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_inciqr_byear_g_mean_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incskew_byear_g_mean.png written in PNG format)

             {c |}  incskew F2.sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.1295   1.0000 

             {txt}{c |}  incskew F2.sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.0293   1.0000 

             {txt}{c |}  incskew F2.sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}       . 
    {txt}F2.sp500 {c |} {res}       .        . 

             {txt}{c |}  incskew F2.sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}       . 
    {txt}F2.sp500 {c |} {res}       .        . 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incskew_byear_g_mean_stk.png written in PNG format)
{res}{txt}{col 8}panel variable:  {res}byear_g (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}date, 2013m6 to 2020m1
{txt}{col 17}delta:  {res}1 month
{txt}(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incmean_byear_g_median.png written in PNG format)

             {c |}  incmean F2.sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.0418   1.0000 

             {txt}{c |}  incmean F2.sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.0050   1.0000 

             {txt}{c |}  incmean F2.sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}       . 
    {txt}F2.sp500 {c |} {res}       .        . 

             {txt}{c |}  incmean F2.sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}       . 
    {txt}F2.sp500 {c |} {res}       .        . 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incmean_byear_g_median_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincmean_byear_g_median.png written in PNG format)

             {c |} rincmean F2.sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.0318   1.0000 

             {txt}{c |} rincmean F2.sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.1604   1.0000 

             {txt}{c |} rincmean F2.sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}       . 
    {txt}F2.sp500 {c |} {res}       .        . 

             {txt}{c |} rincmean F2.sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}       . 
    {txt}F2.sp500 {c |} {res}       .        . 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincmean_byear_g_median_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incvar_byear_g_median.png written in PNG format)

             {c |}   incvar F2.sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.0530   1.0000 

             {txt}{c |}   incvar F2.sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.0121   1.0000 

             {txt}{c |}   incvar F2.sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}       . 
    {txt}F2.sp500 {c |} {res}       .        . 

             {txt}{c |}   incvar F2.sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}       . 
    {txt}F2.sp500 {c |} {res}       .        . 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incvar_byear_g_median_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincvar_byear_g_median.png written in PNG format)

             {c |}  rincvar F2.sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.0830   1.0000 

             {txt}{c |}  rincvar F2.sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.0021   1.0000 

             {txt}{c |}  rincvar F2.sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}       . 
    {txt}F2.sp500 {c |} {res}       .        . 

             {txt}{c |}  rincvar F2.sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}       . 
    {txt}F2.sp500 {c |} {res}       .        . 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincvar_byear_g_median_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_inciqr_byear_g_median.png written in PNG format)

             {c |}   inciqr F2.sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.0178   1.0000 

             {txt}{c |}   inciqr F2.sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.0875   1.0000 

             {txt}{c |}   inciqr F2.sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}       . 
    {txt}F2.sp500 {c |} {res}       .        . 

             {txt}{c |}   inciqr F2.sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}       . 
    {txt}F2.sp500 {c |} {res}       .        . 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_inciqr_byear_g_median_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incskew_byear_g_median.png written in PNG format)

             {c |}  incskew F2.sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.0827   1.0000 

             {txt}{c |}  incskew F2.sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.1618   1.0000 

             {txt}{c |}  incskew F2.sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}       . 
    {txt}F2.sp500 {c |} {res}       .        . 

             {txt}{c |}  incskew F2.sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}       . 
    {txt}F2.sp500 {c |} {res}       .        . 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incskew_byear_g_median_stk.png written in PNG format)

{com}. 
. 
. 
. ** 4 groups 
. foreach agg in mean median{c -(}
{txt}  2{com}.   foreach gp in byear_g{c -(}
{txt}  3{com}.    preserve 
{txt}  4{com}.    
.    collapse (`agg') `Moments' sp500, by(date `gp')
{txt}  5{com}.    xtset `gp' date 
{txt}  6{com}. 
. foreach mom in `Moments'{c -(}
{txt}  7{com}. keep if `mom'!=.
{txt}  8{com}. * moments only 
. 
. twoway (tsline `mom' if `gp'== 0,lp(solid) lwidth(thick)) ///
>        (tsline `mom' if `gp'== 1,lp(dash) lwidth(thick)) ///
>            (tsline `mom' if `gp'== 2,lp(shortdash) lwidth(thick)) ///
>            (tsline `mom' if `gp'== 3,lp(dash_dot) lwidth(thick)), ///
>        xtitle("date") ///
>            ytitle("") ///
>            title("`mom' by generation") ///
>            legend(label(1 "1950s") label(2 "1960s") label(3 "1970s") label(4 "1980s")  col(4))
{txt}  9{com}.  graph export "${c -(}sum_graph_folder{c )-}/ts/ts_`mom'_`gp'_`agg'.png",as(png) replace  
{txt} 10{com}.  
.  
. ** compute correlation coefficients 
. pwcorr `mom' f11.sp500 if `gp'==0, star(0.05)
{txt} 11{com}. local rho_1: display %4.2f r(rho) 
{txt} 12{com}. pwcorr `mom' f11.sp500 if `gp'==1, star(0.05)
{txt} 13{com}. local rho_2: display %4.2f r(rho) 
{txt} 14{com}. pwcorr `mom' f11.sp500 if `gp'==2, star(0.05)
{txt} 15{com}. local rho_3: display %4.2f r(rho) 
{txt} 16{com}. pwcorr `mom' f11.sp500 if `gp'==3, star(0.05)
{txt} 17{com}. local rho_4: display %4.2f r(rho) 
{txt} 18{com}. 
. ** moments and sp500 
. *** correlation with stock market by group *****
. 
. twoway (bar sp500 date if `gp'== 3,yaxis(2) fcolor(gs10)) ///
>        (tsline `mom' if `gp'== 3,lp(shortdash) lwidth(thick)), ///         
>        xtitle("date") ///
>            ytitle("") ///
>            ytitle("sp500 return (%)",axis(2)) ///
>            title("`mom' by generation") ///
>            legend(label(1 "sp500 (RHS)")  label(2 "1980s") col(3)) ///
>            caption("{c -(}superscript:1950s corr =`rho_1', 1960s corr =`rho_2', 1970s corr =`rho_3',1980s corr =`rho_4',{c )-}", ///
>            justification(left) position(11) size(vlarge))
{txt} 19{com}.  graph export "${c -(}sum_graph_folder{c )-}/ts/ts_`mom'_`gp'_`agg'_stk.png",as(png) replace 
{txt} 20{com}.  
. {c )-}
{txt} 21{com}.   restore
{txt} 22{com}. {c )-}
{txt} 23{com}. {c )-}
{res}{txt}{col 8}panel variable:  {res}byear_g (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}date, 2013m6 to 2020m1
{txt}{col 17}delta:  {res}1 month
{txt}(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incmean_byear_g_mean.png written in PNG format)

             {c |}  incmean F..sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.2510*  1.0000 

             {txt}{c |}  incmean F..sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.3123*  1.0000 

             {txt}{c |}  incmean F..sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}       . 
   {txt}F11.sp500 {c |} {res}       .        . 

             {txt}{c |}  incmean F..sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}       . 
   {txt}F11.sp500 {c |} {res}       .        . 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incmean_byear_g_mean_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincmean_byear_g_mean.png written in PNG format)

             {c |} rincmean F..sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.0479   1.0000 

             {txt}{c |} rincmean F..sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.0871   1.0000 

             {txt}{c |} rincmean F..sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}       . 
   {txt}F11.sp500 {c |} {res}       .        . 

             {txt}{c |} rincmean F..sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}       . 
   {txt}F11.sp500 {c |} {res}       .        . 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincmean_byear_g_mean_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incvar_byear_g_mean.png written in PNG format)

             {c |}   incvar F..sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.0893   1.0000 

             {txt}{c |}   incvar F..sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.3176*  1.0000 

             {txt}{c |}   incvar F..sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}       . 
   {txt}F11.sp500 {c |} {res}       .        . 

             {txt}{c |}   incvar F..sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}       . 
   {txt}F11.sp500 {c |} {res}       .        . 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incvar_byear_g_mean_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincvar_byear_g_mean.png written in PNG format)

             {c |}  rincvar F..sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.1088   1.0000 

             {txt}{c |}  rincvar F..sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.0699   1.0000 

             {txt}{c |}  rincvar F..sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}       . 
   {txt}F11.sp500 {c |} {res}       .        . 

             {txt}{c |}  rincvar F..sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}       . 
   {txt}F11.sp500 {c |} {res}       .        . 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincvar_byear_g_mean_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_inciqr_byear_g_mean.png written in PNG format)

             {c |}   inciqr F..sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.2628*  1.0000 

             {txt}{c |}   inciqr F..sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.0028   1.0000 

             {txt}{c |}   inciqr F..sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}       . 
   {txt}F11.sp500 {c |} {res}       .        . 

             {txt}{c |}   inciqr F..sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}       . 
   {txt}F11.sp500 {c |} {res}       .        . 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_inciqr_byear_g_mean_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incskew_byear_g_mean.png written in PNG format)

             {c |}  incskew F..sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.0559   1.0000 

             {txt}{c |}  incskew F..sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res}  0.0127   1.0000 

             {txt}{c |}  incskew F..sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}       . 
   {txt}F11.sp500 {c |} {res}       .        . 

             {txt}{c |}  incskew F..sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}       . 
   {txt}F11.sp500 {c |} {res}       .        . 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incskew_byear_g_mean_stk.png written in PNG format)
{res}{txt}{col 8}panel variable:  {res}byear_g (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}date, 2013m6 to 2020m1
{txt}{col 17}delta:  {res}1 month
{txt}(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incmean_byear_g_median.png written in PNG format)

             {c |}  incmean F..sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.2068   1.0000 

             {txt}{c |}  incmean F..sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.1980   1.0000 

             {txt}{c |}  incmean F..sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}       . 
   {txt}F11.sp500 {c |} {res}       .        . 

             {txt}{c |}  incmean F..sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}       . 
   {txt}F11.sp500 {c |} {res}       .        . 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incmean_byear_g_median_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincmean_byear_g_median.png written in PNG format)

             {c |} rincmean F..sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.0612   1.0000 

             {txt}{c |} rincmean F..sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.2057   1.0000 

             {txt}{c |} rincmean F..sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}       . 
   {txt}F11.sp500 {c |} {res}       .        . 

             {txt}{c |} rincmean F..sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}       . 
   {txt}F11.sp500 {c |} {res}       .        . 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincmean_byear_g_median_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incvar_byear_g_median.png written in PNG format)

             {c |}   incvar F..sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.2474*  1.0000 

             {txt}{c |}   incvar F..sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.1948   1.0000 

             {txt}{c |}   incvar F..sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}       . 
   {txt}F11.sp500 {c |} {res}       .        . 

             {txt}{c |}   incvar F..sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}       . 
   {txt}F11.sp500 {c |} {res}       .        . 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incvar_byear_g_median_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincvar_byear_g_median.png written in PNG format)

             {c |}  rincvar F..sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.1061   1.0000 

             {txt}{c |}  rincvar F..sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.0339   1.0000 

             {txt}{c |}  rincvar F..sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}       . 
   {txt}F11.sp500 {c |} {res}       .        . 

             {txt}{c |}  rincvar F..sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}       . 
   {txt}F11.sp500 {c |} {res}       .        . 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincvar_byear_g_median_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_inciqr_byear_g_median.png written in PNG format)

             {c |}   inciqr F..sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.2755*  1.0000 

             {txt}{c |}   inciqr F..sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.0842   1.0000 

             {txt}{c |}   inciqr F..sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}       . 
   {txt}F11.sp500 {c |} {res}       .        . 

             {txt}{c |}   inciqr F..sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}       . 
   {txt}F11.sp500 {c |} {res}       .        . 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_inciqr_byear_g_median_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incskew_byear_g_median.png written in PNG format)

             {c |}  incskew F..sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.1473   1.0000 

             {txt}{c |}  incskew F..sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.1064   1.0000 

             {txt}{c |}  incskew F..sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}       . 
   {txt}F11.sp500 {c |} {res}       .        . 

             {txt}{c |}  incskew F..sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}       . 
   {txt}F11.sp500 {c |} {res}       .        . 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incskew_byear_g_median_stk.png written in PNG format)

{com}. 
. 
. ** 2 groups fo numeracy literacy 
. 
. foreach agg in mean median{c -(}
{txt}  2{com}.   foreach gp in nlit_g{c -(}
{txt}  3{com}.    preserve 
{txt}  4{com}.    
.    collapse (`agg') `Moments' sp500, by(date `gp')
{txt}  5{com}.    xtset `gp' date 
{txt}  6{com}.    
. foreach mom in `Moments'{c -(}
{txt}  7{com}. keep if `mom'!=.
{txt}  8{com}. twoway (tsline `mom' if `gp'== 0,lp(solid) lwidth(thick)) ///
>        (tsline `mom' if `gp'== 1,lp(dash) lwidth(thick)), ///
>        xtitle("date") ///
>            ytitle("") ///
>            title("`mom' by numeracy literacy") ///
>            legend(label(1 "low") label(2 "high") col(2))
{txt}  9{com}.  graph export "${c -(}sum_graph_folder{c )-}/ts/ts_`mom'_`gp'_`agg'.png",as(png) replace  
{txt} 10{com}.       
. {c )-}
{txt} 11{com}.  restore
{txt} 12{com}. {c )-}
{txt} 13{com}. {c )-}
{res}{txt}{col 8}panel variable:  {res}nlit_g (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}date, 2015m4 to 2020m1
{txt}{col 17}delta:  {res}1 month
{txt}(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incmean_nlit_g_mean.png written in PNG format)
(1 observation deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincmean_nlit_g_mean.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incvar_nlit_g_mean.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincvar_nlit_g_mean.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_inciqr_nlit_g_mean.png written in PNG format)
(10 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incskew_nlit_g_mean.png written in PNG format)
{res}{txt}{col 8}panel variable:  {res}nlit_g (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}date, 2015m4 to 2020m1
{txt}{col 17}delta:  {res}1 month
{txt}(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incmean_nlit_g_median.png written in PNG format)
(1 observation deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincmean_nlit_g_median.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incvar_nlit_g_median.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincvar_nlit_g_median.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_inciqr_nlit_g_median.png written in PNG format)
(10 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incskew_nlit_g_median.png written in PNG format)

{com}. 
. 
. ** 3 groups fo HH income 
. foreach agg in mean median{c -(}
{txt}  2{com}.   foreach gp in HHinc_g{c -(}
{txt}  3{com}.    preserve 
{txt}  4{com}.    
.    collapse (`agg') `Moments' sp500, by(date `gp')
{txt}  5{com}.    xtset `gp' date 
{txt}  6{com}.    
. ** plots for moments by group 
.    
. * moments only 
. foreach mom in `Moments'{c -(}
{txt}  7{com}. keep if `mom'!=.
{txt}  8{com}. 
. * moments only 
. twoway (tsline `mom' if `gp'== 0,lp(solid) lwidth(thick)) ///
>        (tsline `mom' if `gp'== 1,lp(dash) lwidth(thick)), ///
>        xtitle("date") ///
>            ytitle("") ///
>            title("`mom' by household income") ///
>            legend(label(1 "low") label(2 "high")  col(3))
{txt}  9{com}.  graph export "${c -(}sum_graph_folder{c )-}/ts/ts_`mom'_`gp'_`agg'.png",as(png) replace  
{txt} 10{com}.  
. ** compute correlation coefficients 
. pwcorr `mom' f2.sp500 if `gp'==0, star(0.05)
{txt} 11{com}. local rho_lw: display %4.2f r(rho) 
{txt} 12{com}. pwcorr `mom' f2.sp500 if `gp'==1, star(0.05)
{txt} 13{com}. local rho_md: display %4.2f r(rho) 
{txt} 14{com}. *pwcorr `mom' f2.sp500 if `gp'==2, star(0.05)
. *local rho_hg: display %4.2f r(rho) 
. 
. ** moments and sp500 
. *** correlation with stock market by group *****
. 
. twoway (bar sp500 date if `gp'== 1,yaxis(2) fcolor(gs10)) ///
>            (tsline `mom' if `gp'== 1,lp(shortdash) lwidth(thick)), ///
>        xtitle("date") ///
>            ytitle("") ///
>            ytitle("sp500 return (%)",axis(2)) ///
>            title("`mom' by household income") ///
>            legend(label(1 "sp500 (RHS)")  label(2 "high income") col(3)) ///
>            caption("{c -(}superscript:low corr =`rho_lw', med corr =`rho_md', high corr =`rho_hg',{c )-}", ///
>            justification(left) position(11) size(vlarge))
{txt} 15{com}.  graph export "${c -(}sum_graph_folder{c )-}/ts/ts_`mom'_`gp'_`agg'_stk.png",as(png) replace 
{txt} 16{com}. {c )-}
{txt} 17{com}.           
.   restore
{txt} 18{com}. {c )-}
{txt} 19{com}. {c )-}
{res}{txt}{col 8}panel variable:  {res}HHinc_g (weakly balanced)
{txt}{col 9}time variable:  {res}{col 25}date, 2013m6 to 2020m1
{txt}{col 17}delta:  {res}1 month
{txt}(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incmean_HHinc_g_mean.png written in PNG format)

             {c |}  incmean F2.sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.0545   1.0000 

             {txt}{c |}  incmean F2.sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.1296   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incmean_HHinc_g_mean_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincmean_HHinc_g_mean.png written in PNG format)

             {c |} rincmean F2.sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.1238   1.0000 

             {txt}{c |} rincmean F2.sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.0678   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincmean_HHinc_g_mean_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incvar_HHinc_g_mean.png written in PNG format)

             {c |}   incvar F2.sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.2150   1.0000 

             {txt}{c |}   incvar F2.sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.0596   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incvar_HHinc_g_mean_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincvar_HHinc_g_mean.png written in PNG format)

             {c |}  rincvar F2.sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.1456   1.0000 

             {txt}{c |}  rincvar F2.sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.1201   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincvar_HHinc_g_mean_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_inciqr_HHinc_g_mean.png written in PNG format)

             {c |}   inciqr F2.sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.0930   1.0000 

             {txt}{c |}   inciqr F2.sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.0841   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_inciqr_HHinc_g_mean_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incskew_HHinc_g_mean.png written in PNG format)

             {c |}  incskew F2.sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.0412   1.0000 

             {txt}{c |}  incskew F2.sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.1674   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incskew_HHinc_g_mean_stk.png written in PNG format)
{res}{txt}{col 8}panel variable:  {res}HHinc_g (weakly balanced)
{txt}{col 9}time variable:  {res}{col 25}date, 2013m6 to 2020m1
{txt}{col 17}delta:  {res}1 month
{txt}(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incmean_HHinc_g_median.png written in PNG format)

             {c |}  incmean F2.sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.1048   1.0000 

             {txt}{c |}  incmean F2.sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.0968   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incmean_HHinc_g_median_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincmean_HHinc_g_median.png written in PNG format)

             {c |} rincmean F2.sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.0859   1.0000 

             {txt}{c |} rincmean F2.sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.1180   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincmean_HHinc_g_median_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incvar_HHinc_g_median.png written in PNG format)

             {c |}   incvar F2.sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.0715   1.0000 

             {txt}{c |}   incvar F2.sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.0117   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incvar_HHinc_g_median_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincvar_HHinc_g_median.png written in PNG format)

             {c |}  rincvar F2.sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.1626   1.0000 

             {txt}{c |}  rincvar F2.sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.0196   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincvar_HHinc_g_median_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_inciqr_HHinc_g_median.png written in PNG format)

             {c |}   inciqr F2.sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.0389   1.0000 

             {txt}{c |}   inciqr F2.sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.0115   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_inciqr_HHinc_g_median_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incskew_HHinc_g_median.png written in PNG format)

             {c |}  incskew F2.sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.1253   1.0000 

             {txt}{c |}  incskew F2.sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.2027   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incskew_HHinc_g_median_stk.png written in PNG format)

{com}. 
. 
. ** 3 groups for age
. foreach agg in mean median{c -(}
{txt}  2{com}.   foreach gp in age_g{c -(}
{txt}  3{com}.    preserve 
{txt}  4{com}.    
.    collapse (`agg') `Moments' sp500, by(date `gp')
{txt}  5{com}.    xtset `gp' date 
{txt}  6{com}. 
.  ** moments only 
. foreach mom in `Moments'{c -(}
{txt}  7{com}. keep if `mom'!=.
{txt}  8{com}. twoway (tsline `mom' if `gp'== 0,lp(solid) lcolor(red) lwidth(thick)) ///
>        (tsline `mom' if `gp'== 1,lp(dash) lcolor(blue) lwidth(thick)) ///
>            (tsline `mom' if `gp'== 2,lp(shortdash) lcolor(black) lwidth(thick)), ///
>        xtitle("date") ///
>            ytitle("") ///
>            title("`mom' by age") ///
>            legend(label(1 "young") label(2 "middle-age") label(3 "old")  col(3))
{txt}  9{com}.            
.  graph export "${c -(}sum_graph_folder{c )-}/ts/ts_`mom'_`gp'_`agg'.png",as(png) replace  
{txt} 10{com}.  
.  
. ** compute correlation coefficients 
. pwcorr `mom' f2.sp500 if `gp'==0, star(0.05)
{txt} 11{com}. local rho_y: display %4.2f r(rho) 
{txt} 12{com}. pwcorr `mom' f2.sp500 if `gp'==1, star(0.05)
{txt} 13{com}. local rho_m: display %4.2f r(rho) 
{txt} 14{com}. pwcorr `mom' f2.sp500 if `gp'==2, star(0.05)
{txt} 15{com}. local rho_o: display %4.2f r(rho) 
{txt} 16{com}. 
. ** moments and sp500 
. *** correlation with stock market by group *****
. 
. twoway (bar sp500 date if `gp'== 2,yaxis(2) fcolor(gs10)) ///
>            (tsline `mom' if `gp'== 2,lp(shortdash) lwidth(thick)) , ///
>        xtitle("date") ///
>            ytitle("") ///
>            ytitle("sp500 return (%)",axis(2)) ///
>            title("`mom' by age") ///
>            legend(label(1 "sp500 (RHS)") label(2 "old")  col(3)) ///
>            caption("{c -(}superscript:young corr =`rho_y', middle-age corr =`rho_m', old corr =`rho_o',{c )-}", ///
>            justification(left) position(11) size(vlarge))
{txt} 17{com}.  graph export "${c -(}sum_graph_folder{c )-}/ts/ts_`mom'_`gp'_`agg'_stk.png",as(png) replace 
{txt} 18{com}.   {c )-}
{txt} 19{com}.  
.   restore
{txt} 20{com}. {c )-}
{txt} 21{com}. {c )-}
{res}{txt}{col 8}panel variable:  {res}age_g (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}date, 2013m6 to 2020m1
{txt}{col 17}delta:  {res}1 month
{txt}(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incmean_age_g_mean.png written in PNG format)

             {c |}  incmean F2.sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.0143   1.0000 

             {txt}{c |}  incmean F2.sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.0150   1.0000 

             {txt}{c |}  incmean F2.sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.2745*  1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incmean_age_g_mean_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincmean_age_g_mean.png written in PNG format)

             {c |} rincmean F2.sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.1446   1.0000 

             {txt}{c |} rincmean F2.sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.0317   1.0000 

             {txt}{c |} rincmean F2.sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.1139   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincmean_age_g_mean_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incvar_age_g_mean.png written in PNG format)

             {c |}   incvar F2.sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.0855   1.0000 

             {txt}{c |}   incvar F2.sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.3248*  1.0000 

             {txt}{c |}   incvar F2.sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.1444   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incvar_age_g_mean_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincvar_age_g_mean.png written in PNG format)

             {c |}  rincvar F2.sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.0989   1.0000 

             {txt}{c |}  rincvar F2.sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.1832   1.0000 

             {txt}{c |}  rincvar F2.sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.1151   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincvar_age_g_mean_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_inciqr_age_g_mean.png written in PNG format)

             {c |}   inciqr F2.sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.0419   1.0000 

             {txt}{c |}   inciqr F2.sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.2010   1.0000 

             {txt}{c |}   inciqr F2.sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.2336*  1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_inciqr_age_g_mean_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incskew_age_g_mean.png written in PNG format)

             {c |}  incskew F2.sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.0857   1.0000 

             {txt}{c |}  incskew F2.sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.0057   1.0000 

             {txt}{c |}  incskew F2.sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.2030   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incskew_age_g_mean_stk.png written in PNG format)
{res}{txt}{col 8}panel variable:  {res}age_g (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}date, 2013m6 to 2020m1
{txt}{col 17}delta:  {res}1 month
{txt}(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incmean_age_g_median.png written in PNG format)

             {c |}  incmean F2.sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.0006   1.0000 

             {txt}{c |}  incmean F2.sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.0316   1.0000 

             {txt}{c |}  incmean F2.sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.2030   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incmean_age_g_median_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincmean_age_g_median.png written in PNG format)

             {c |} rincmean F2.sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.1341   1.0000 

             {txt}{c |} rincmean F2.sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.0308   1.0000 

             {txt}{c |} rincmean F2.sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.0687   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincmean_age_g_median_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incvar_age_g_median.png written in PNG format)

             {c |}   incvar F2.sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.0102   1.0000 

             {txt}{c |}   incvar F2.sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.0387   1.0000 

             {txt}{c |}   incvar F2.sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.1354   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incvar_age_g_median_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincvar_age_g_median.png written in PNG format)

             {c |}  rincvar F2.sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.0065   1.0000 

             {txt}{c |}  rincvar F2.sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.0495   1.0000 

             {txt}{c |}  rincvar F2.sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.1294   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincvar_age_g_median_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_inciqr_age_g_median.png written in PNG format)

             {c |}   inciqr F2.sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.0724   1.0000 

             {txt}{c |}   inciqr F2.sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.0066   1.0000 

             {txt}{c |}   inciqr F2.sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.0912   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_inciqr_age_g_median_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incskew_age_g_median.png written in PNG format)

             {c |}  incskew F2.sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.1588   1.0000 

             {txt}{c |}  incskew F2.sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.0480   1.0000 

             {txt}{c |}  incskew F2.sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.2579*  1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incskew_age_g_median_stk.png written in PNG format)

{com}. 
. 
. ** 3 groups of education 
. foreach agg in mean median{c -(}
{txt}  2{com}.   foreach gp in edu_g{c -(}
{txt}  3{com}.    preserve 
{txt}  4{com}.    
.    collapse (`agg') `Moments' sp500, by(date `gp')
{txt}  5{com}.    xtset `gp' date 
{txt}  6{com}.    
. foreach mom in `Moments'{c -(}
{txt}  7{com}. keep if `mom'!=.
{txt}  8{com}. twoway (tsline `mom' if `gp'== 1,lp(solid) lwidth(thick)) ///
>        (tsline `mom' if `gp'== 2,lp(dash) lwidth(thick)) ///
>        (tsline `mom' if `gp'== 3,lp(shortdash) lwidth(thick)), ///
>        xtitle("date") ///
>            ytitle("") ///
>            title("`mom' by education") ///
>            legend(label(1 "HS dropout") label(2 "HS graduate") label(3 "College/above") col(2))
{txt}  9{com}.  graph export "${c -(}sum_graph_folder{c )-}/ts/ts_`mom'_`gp'_`agg'.png",as(png) replace  
{txt} 10{com}.       
.  
. ** compute correlation coefficients 
. pwcorr `mom' f2.sp500 if `gp'==1, star(0.05)
{txt} 11{com}. local rho_l: display %4.2f r(rho) 
{txt} 12{com}. pwcorr `mom' f2.sp500 if `gp'==2, star(0.05)
{txt} 13{com}. local rho_m: display %4.2f r(rho) 
{txt} 14{com}. pwcorr `mom' f2.sp500 if `gp'==3, star(0.05)
{txt} 15{com}. local rho_h: display %4.2f r(rho) 
{txt} 16{com}. 
. 
. ** moments and sp500 
. *** correlation with stock market by group *****
. 
. twoway (bar sp500 date if `gp'== 3,yaxis(2) fcolor(gs10)) ///
>            (tsline `mom' if `gp'== 3,lp(shortdash) lwidth(thick)), ///
>        xtitle("date") ///
>            ytitle("") ///
>            ytitle("sp500 return (%)",axis(2)) ///
>            title("`mom' by education") ///
>            legend(label(1 "sp500 (RHS)") label(2 "high") col(3)) ///
>            caption("{c -(}superscript:low corr =`rho_l', high corr =`rho_h',{c )-}", ///
>            justification(left) position(11) size(vlarge))
{txt} 17{com}.      graph export "${c -(}sum_graph_folder{c )-}/ts/ts_`mom'_`gp'_`agg'_stk.png",as(png) replace 
{txt} 18{com}. {c )-}
{txt} 19{com}.   
.  restore
{txt} 20{com}. {c )-}
{txt} 21{com}. {c )-}
{res}{txt}{col 8}panel variable:  {res}edu_g (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}date, 2013m6 to 2020m1
{txt}{col 17}delta:  {res}1 month
{txt}(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incmean_edu_g_mean.png written in PNG format)

             {c |}  incmean F2.sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.0132   1.0000 

             {txt}{c |}  incmean F2.sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.0406   1.0000 

             {txt}{c |}  incmean F2.sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.1331   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incmean_edu_g_mean_stk.png written in PNG format)
(5 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincmean_edu_g_mean.png written in PNG format)

             {c |} rincmean F2.sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.0736   1.0000 

             {txt}{c |} rincmean F2.sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.0738   1.0000 

             {txt}{c |} rincmean F2.sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.0653   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincmean_edu_g_mean_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incvar_edu_g_mean.png written in PNG format)

             {c |}   incvar F2.sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.0133   1.0000 

             {txt}{c |}   incvar F2.sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.2333*  1.0000 

             {txt}{c |}   incvar F2.sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.2250*  1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incvar_edu_g_mean_stk.png written in PNG format)
(1 observation deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincvar_edu_g_mean.png written in PNG format)

             {c |}  rincvar F2.sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.1195   1.0000 

             {txt}{c |}  rincvar F2.sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.2075   1.0000 

             {txt}{c |}  rincvar F2.sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.1051   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincvar_edu_g_mean_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_inciqr_edu_g_mean.png written in PNG format)

             {c |}   inciqr F2.sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.0999   1.0000 

             {txt}{c |}   inciqr F2.sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.1002   1.0000 

             {txt}{c |}   inciqr F2.sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.1870   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_inciqr_edu_g_mean_stk.png written in PNG format)
(9 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incskew_edu_g_mean.png written in PNG format)

             {c |}  incskew F2.sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.0147   1.0000 

             {txt}{c |}  incskew F2.sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.1112   1.0000 

             {txt}{c |}  incskew F2.sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.2774*  1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incskew_edu_g_mean_stk.png written in PNG format)
{res}{txt}{col 8}panel variable:  {res}edu_g (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}date, 2013m6 to 2020m1
{txt}{col 17}delta:  {res}1 month
{txt}(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incmean_edu_g_median.png written in PNG format)

             {c |}  incmean F2.sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.0466   1.0000 

             {txt}{c |}  incmean F2.sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.0190   1.0000 

             {txt}{c |}  incmean F2.sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.1402   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incmean_edu_g_median_stk.png written in PNG format)
(5 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincmean_edu_g_median.png written in PNG format)

             {c |} rincmean F2.sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.0363   1.0000 

             {txt}{c |} rincmean F2.sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.0962   1.0000 

             {txt}{c |} rincmean F2.sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.0666   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincmean_edu_g_median_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incvar_edu_g_median.png written in PNG format)

             {c |}   incvar F2.sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.0041   1.0000 

             {txt}{c |}   incvar F2.sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.0393   1.0000 

             {txt}{c |}   incvar F2.sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.1495   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incvar_edu_g_median_stk.png written in PNG format)
(1 observation deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincvar_edu_g_median.png written in PNG format)

             {c |}  rincvar F2.sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.0206   1.0000 

             {txt}{c |}  rincvar F2.sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.0203   1.0000 

             {txt}{c |}  rincvar F2.sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.0919   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincvar_edu_g_median_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_inciqr_edu_g_median.png written in PNG format)

             {c |}   inciqr F2.sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.0321   1.0000 

             {txt}{c |}   inciqr F2.sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.0392   1.0000 

             {txt}{c |}   inciqr F2.sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.0976   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_inciqr_edu_g_median_stk.png written in PNG format)
(9 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incskew_edu_g_median.png written in PNG format)

             {c |}  incskew F2.sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.0169   1.0000 

             {txt}{c |}  incskew F2.sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.1189   1.0000 

             {txt}{c |}  incskew F2.sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.2243*  1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incskew_edu_g_median_stk.png written in PNG format)

{com}. */
. 
. ********************
. ** Regression ******
. ********************
. 
. 
. global other_control i.gender i.Q34 Q35_1 Q35_2 Q35_3 Q35_4 Q35_5 Q35_6 
{txt}
{com}. global macro_ex_var UEprobAgg Stkprob Q9_mean UEprobInd
{txt}
{com}. 
. eststo clear
{txt}
{com}. 
. foreach mom in var iqr mean{c -(}
{txt}  2{com}. eststo: reg inc`mom' i.age_g i.edu_g i.HHinc_g i.byear_g i.year i.state_id, robust 
{txt}  3{com}. eststo: reg inc`mom' i.age_g i.edu_g i.HHinc_g i.byear_g i.year i.state_id ${c -(}other_control{c )-}, robust 
{txt}  4{com}. eststo: reg inc`mom' i.age_g i.edu_g i.HHinc_g i.byear_g i.year i.state_id ${c -(}other_control{c )-} ${c -(}macro_ex_var{c )-}, robust 
{txt}  5{com}. {c )-}

{txt}Linear regression                                      Number of obs ={res}   50014
                                                       {txt}F( 63, 49950) ={res}   12.66
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0134
                                                       {txt}Root MSE      = {res} .00082

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}        incvar{col 16}{c |}      Coef.{col 28}   Std. Err.{col 40}      t{col 48}   P>|t|{col 56}     [95% Con{col 69}f. Interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age_g {c |}
{space 3}middle-age  {c |}{col 16}{res}{space 2}-9.95e-06{col 28}{space 2} .0000179{col 39}{space 1}   -0.56{col 48}{space 3}0.578{col 56}{space 4} -.000045{col 69}{space 3} .0000251
{txt}{space 10}old  {c |}{col 16}{res}{space 2}-.0000443{col 28}{space 2} .0000184{col 39}{space 1}   -2.41{col 48}{space 3}0.016{col 56}{space 4}-.0000803{col 69}{space 3}-8.25e-06
{txt}{space 14} {c |}
{space 9}edu_g {c |}
{space 2}HS graduate  {c |}{col 16}{res}{space 2}-.0003475{col 28}{space 2} .0000877{col 39}{space 1}   -3.96{col 48}{space 3}0.000{col 56}{space 4}-.0005195{col 69}{space 3}-.0001756
{txt}College/above  {c |}{col 16}{res}{space 2} -.000326{col 28}{space 2} .0000876{col 39}{space 1}   -3.72{col 48}{space 3}0.000{col 56}{space 4}-.0004978{col 69}{space 3}-.0001543
{txt}{space 14} {c |}
{space 7}HHinc_g {c |}
{space 5}high inc  {c |}{col 16}{res}{space 2}-.0000846{col 28}{space 2} 8.61e-06{col 39}{space 1}   -9.82{col 48}{space 3}0.000{col 56}{space 4}-.0001015{col 69}{space 3}-.0000677
{txt}{space 5}1.byear_g {c |}{col 16}{res}{space 2} .0000906{col 28}{space 2} .0000182{col 39}{space 1}    4.97{col 48}{space 3}0.000{col 56}{space 4} .0000548{col 69}{space 3} .0001263
{txt}{space 14} {c |}
{space 10}year {c |}
{space 9}2014  {c |}{col 16}{res}{space 2} .0000204{col 28}{space 2} .0000152{col 39}{space 1}    1.34{col 48}{space 3}0.180{col 56}{space 4}-9.43e-06{col 69}{space 3} .0000503
{txt}{space 9}2015  {c |}{col 16}{res}{space 2}-9.48e-06{col 28}{space 2}  .000015{col 39}{space 1}   -0.63{col 48}{space 3}0.528{col 56}{space 4}-.0000389{col 69}{space 3}   .00002
{txt}{space 9}2016  {c |}{col 16}{res}{space 2}-8.28e-06{col 28}{space 2} .0000152{col 39}{space 1}   -0.55{col 48}{space 3}0.585{col 56}{space 4} -.000038{col 69}{space 3} .0000214
{txt}{space 9}2017  {c |}{col 16}{res}{space 2}-.0000176{col 28}{space 2} .0000151{col 39}{space 1}   -1.17{col 48}{space 3}0.244{col 56}{space 4}-.0000473{col 69}{space 3}  .000012
{txt}{space 9}2018  {c |}{col 16}{res}{space 2}-.0000273{col 28}{space 2} .0000152{col 39}{space 1}   -1.79{col 48}{space 3}0.073{col 56}{space 4}-.0000571{col 69}{space 3} 2.55e-06
{txt}{space 9}2019  {c |}{col 16}{res}{space 2}-.0000372{col 28}{space 2} .0000153{col 39}{space 1}   -2.43{col 48}{space 3}0.015{col 56}{space 4}-.0000672{col 69}{space 3}-7.19e-06
{txt}{space 9}2020  {c |}{col 16}{res}{space 2}-.0000264{col 28}{space 2} .0000346{col 39}{space 1}   -0.76{col 48}{space 3}0.446{col 56}{space 4}-.0000941{col 69}{space 3} .0000414
{txt}{space 14} {c |}
{space 6}state_id {c |}
{space 11}AL  {c |}{col 16}{res}{space 2} .0002199{col 28}{space 2} .0000547{col 39}{space 1}    4.02{col 48}{space 3}0.000{col 56}{space 4} .0001126{col 69}{space 3} .0003271
{txt}{space 11}AR  {c |}{col 16}{res}{space 2} .0002182{col 28}{space 2} .0000604{col 39}{space 1}    3.61{col 48}{space 3}0.000{col 56}{space 4} .0000998{col 69}{space 3} .0003367
{txt}{space 11}AZ  {c |}{col 16}{res}{space 2} .0002277{col 28}{space 2} .0000482{col 39}{space 1}    4.72{col 48}{space 3}0.000{col 56}{space 4} .0001333{col 69}{space 3} .0003222
{txt}{space 11}CA  {c |}{col 16}{res}{space 2} .0002751{col 28}{space 2} .0000426{col 39}{space 1}    6.45{col 48}{space 3}0.000{col 56}{space 4} .0001915{col 69}{space 3} .0003587
{txt}{space 11}CO  {c |}{col 16}{res}{space 2} .0002223{col 28}{space 2} .0000475{col 39}{space 1}    4.68{col 48}{space 3}0.000{col 56}{space 4} .0001292{col 69}{space 3} .0003153
{txt}{space 11}CT  {c |}{col 16}{res}{space 2} .0001543{col 28}{space 2} .0000508{col 39}{space 1}    3.04{col 48}{space 3}0.002{col 56}{space 4} .0000548{col 69}{space 3} .0002538
{txt}{space 11}DC  {c |}{col 16}{res}{space 2} .0002781{col 28}{space 2} .0000735{col 39}{space 1}    3.78{col 48}{space 3}0.000{col 56}{space 4}  .000134{col 69}{space 3} .0004221
{txt}{space 11}DE  {c |}{col 16}{res}{space 2}   .00012{col 28}{space 2} .0000747{col 39}{space 1}    1.61{col 48}{space 3}0.108{col 56}{space 4}-.0000265{col 69}{space 3} .0002665
{txt}{space 11}FL  {c |}{col 16}{res}{space 2} .0002652{col 28}{space 2} .0000442{col 39}{space 1}    6.01{col 48}{space 3}0.000{col 56}{space 4} .0001787{col 69}{space 3} .0003518
{txt}{space 11}GA  {c |}{col 16}{res}{space 2} .0002356{col 28}{space 2} .0000475{col 39}{space 1}    4.96{col 48}{space 3}0.000{col 56}{space 4} .0001425{col 69}{space 3} .0003287
{txt}{space 11}HI  {c |}{col 16}{res}{space 2} .0000689{col 28}{space 2} .0000652{col 39}{space 1}    1.06{col 48}{space 3}0.291{col 56}{space 4} -.000059{col 69}{space 3} .0001968
{txt}{space 11}IA  {c |}{col 16}{res}{space 2} .0000657{col 28}{space 2} .0000474{col 39}{space 1}    1.38{col 48}{space 3}0.166{col 56}{space 4}-.0000273{col 69}{space 3} .0001586
{txt}{space 11}ID  {c |}{col 16}{res}{space 2} .0001635{col 28}{space 2} .0000537{col 39}{space 1}    3.05{col 48}{space 3}0.002{col 56}{space 4} .0000583{col 69}{space 3} .0002687
{txt}{space 11}IL  {c |}{col 16}{res}{space 2} .0001697{col 28}{space 2} .0000439{col 39}{space 1}    3.87{col 48}{space 3}0.000{col 56}{space 4} .0000837{col 69}{space 3} .0002556
{txt}{space 11}IN  {c |}{col 16}{res}{space 2} .0002096{col 28}{space 2} .0000477{col 39}{space 1}    4.39{col 48}{space 3}0.000{col 56}{space 4} .0001161{col 69}{space 3} .0003031
{txt}{space 11}KS  {c |}{col 16}{res}{space 2} .0002517{col 28}{space 2} .0000596{col 39}{space 1}    4.23{col 48}{space 3}0.000{col 56}{space 4}  .000135{col 69}{space 3} .0003685
{txt}{space 11}KY  {c |}{col 16}{res}{space 2} .0002664{col 28}{space 2} .0000544{col 39}{space 1}    4.90{col 48}{space 3}0.000{col 56}{space 4} .0001599{col 69}{space 3}  .000373
{txt}{space 11}LA  {c |}{col 16}{res}{space 2} .0003671{col 28}{space 2} .0000593{col 39}{space 1}    6.19{col 48}{space 3}0.000{col 56}{space 4} .0002508{col 69}{space 3} .0004834
{txt}{space 11}MA  {c |}{col 16}{res}{space 2} .0001053{col 28}{space 2} .0000449{col 39}{space 1}    2.34{col 48}{space 3}0.019{col 56}{space 4} .0000172{col 69}{space 3} .0001934
{txt}{space 11}MD  {c |}{col 16}{res}{space 2} .0001837{col 28}{space 2} .0000482{col 39}{space 1}    3.82{col 48}{space 3}0.000{col 56}{space 4} .0000893{col 69}{space 3} .0002781
{txt}{space 11}ME  {c |}{col 16}{res}{space 2} .0001331{col 28}{space 2} .0000561{col 39}{space 1}    2.37{col 48}{space 3}0.018{col 56}{space 4} .0000232{col 69}{space 3}  .000243
{txt}{space 11}MI  {c |}{col 16}{res}{space 2}  .000187{col 28}{space 2} .0000448{col 39}{space 1}    4.18{col 48}{space 3}0.000{col 56}{space 4} .0000993{col 69}{space 3} .0002747
{txt}{space 11}MN  {c |}{col 16}{res}{space 2}  .000157{col 28}{space 2} .0000454{col 39}{space 1}    3.46{col 48}{space 3}0.001{col 56}{space 4} .0000681{col 69}{space 3}  .000246
{txt}{space 11}MO  {c |}{col 16}{res}{space 2} .0002427{col 28}{space 2} .0000482{col 39}{space 1}    5.04{col 48}{space 3}0.000{col 56}{space 4} .0001483{col 69}{space 3} .0003371
{txt}{space 11}MS  {c |}{col 16}{res}{space 2} .0002167{col 28}{space 2}  .000066{col 39}{space 1}    3.28{col 48}{space 3}0.001{col 56}{space 4} .0000873{col 69}{space 3} .0003461
{txt}{space 11}MT  {c |}{col 16}{res}{space 2} .0001355{col 28}{space 2} .0000757{col 39}{space 1}    1.79{col 48}{space 3}0.073{col 56}{space 4}-.0000129{col 69}{space 3} .0002838
{txt}{space 11}NC  {c |}{col 16}{res}{space 2} .0002562{col 28}{space 2} .0000469{col 39}{space 1}    5.46{col 48}{space 3}0.000{col 56}{space 4} .0001642{col 69}{space 3} .0003481
{txt}{space 11}ND  {c |}{col 16}{res}{space 2} .0000572{col 28}{space 2} .0000645{col 39}{space 1}    0.89{col 48}{space 3}0.375{col 56}{space 4}-.0000693{col 69}{space 3} .0001837
{txt}{space 11}NE  {c |}{col 16}{res}{space 2} .0001166{col 28}{space 2} .0000517{col 39}{space 1}    2.25{col 48}{space 3}0.024{col 56}{space 4} .0000152{col 69}{space 3}  .000218
{txt}{space 11}NH  {c |}{col 16}{res}{space 2} .0000557{col 28}{space 2} .0000546{col 39}{space 1}    1.02{col 48}{space 3}0.308{col 56}{space 4}-.0000513{col 69}{space 3} .0001627
{txt}{space 11}NJ  {c |}{col 16}{res}{space 2} .0002291{col 28}{space 2} .0000449{col 39}{space 1}    5.11{col 48}{space 3}0.000{col 56}{space 4} .0001412{col 69}{space 3} .0003171
{txt}{space 11}NM  {c |}{col 16}{res}{space 2} .0000778{col 28}{space 2} .0000616{col 39}{space 1}    1.26{col 48}{space 3}0.207{col 56}{space 4} -.000043{col 69}{space 3} .0001985
{txt}{space 11}NV  {c |}{col 16}{res}{space 2} .0004231{col 28}{space 2} .0000719{col 39}{space 1}    5.88{col 48}{space 3}0.000{col 56}{space 4} .0002821{col 69}{space 3} .0005641
{txt}{space 11}NY  {c |}{col 16}{res}{space 2} .0002218{col 28}{space 2} .0000436{col 39}{space 1}    5.09{col 48}{space 3}0.000{col 56}{space 4} .0001365{col 69}{space 3} .0003072
{txt}{space 11}OH  {c |}{col 16}{res}{space 2} .0001903{col 28}{space 2} .0000444{col 39}{space 1}    4.29{col 48}{space 3}0.000{col 56}{space 4} .0001033{col 69}{space 3} .0002773
{txt}{space 11}OK  {c |}{col 16}{res}{space 2} .0002492{col 28}{space 2} .0000545{col 39}{space 1}    4.58{col 48}{space 3}0.000{col 56}{space 4} .0001424{col 69}{space 3}  .000356
{txt}{space 11}OR  {c |}{col 16}{res}{space 2} .0001933{col 28}{space 2} .0000487{col 39}{space 1}    3.97{col 48}{space 3}0.000{col 56}{space 4} .0000979{col 69}{space 3} .0002887
{txt}{space 11}PA  {c |}{col 16}{res}{space 2} .0001206{col 28}{space 2} .0000426{col 39}{space 1}    2.83{col 48}{space 3}0.005{col 56}{space 4} .0000371{col 69}{space 3} .0002041
{txt}{space 11}RI  {c |}{col 16}{res}{space 2}-.0000569{col 28}{space 2} .0000487{col 39}{space 1}   -1.17{col 48}{space 3}0.243{col 56}{space 4}-.0001524{col 69}{space 3} .0000386
{txt}{space 11}SC  {c |}{col 16}{res}{space 2} .0002086{col 28}{space 2} .0000543{col 39}{space 1}    3.84{col 48}{space 3}0.000{col 56}{space 4} .0001022{col 69}{space 3}  .000315
{txt}{space 11}SD  {c |}{col 16}{res}{space 2} .0003074{col 28}{space 2} .0000814{col 39}{space 1}    3.78{col 48}{space 3}0.000{col 56}{space 4} .0001479{col 69}{space 3} .0004669
{txt}{space 11}TN  {c |}{col 16}{res}{space 2} .0002131{col 28}{space 2} .0000497{col 39}{space 1}    4.29{col 48}{space 3}0.000{col 56}{space 4} .0001157{col 69}{space 3} .0003105
{txt}{space 11}TX  {c |}{col 16}{res}{space 2}  .000267{col 28}{space 2} .0000431{col 39}{space 1}    6.19{col 48}{space 3}0.000{col 56}{space 4} .0001825{col 69}{space 3} .0003516
{txt}{space 11}UT  {c |}{col 16}{res}{space 2} .0001562{col 28}{space 2} .0000537{col 39}{space 1}    2.91{col 48}{space 3}0.004{col 56}{space 4}  .000051{col 69}{space 3} .0002614
{txt}{space 11}VA  {c |}{col 16}{res}{space 2}  .000217{col 28}{space 2} .0000458{col 39}{space 1}    4.74{col 48}{space 3}0.000{col 56}{space 4} .0001272{col 69}{space 3} .0003068
{txt}{space 11}VT  {c |}{col 16}{res}{space 2} .0000538{col 28}{space 2}  .000059{col 39}{space 1}    0.91{col 48}{space 3}0.362{col 56}{space 4}-.0000618{col 69}{space 3} .0001694
{txt}{space 11}WA  {c |}{col 16}{res}{space 2} .0002434{col 28}{space 2} .0000469{col 39}{space 1}    5.18{col 48}{space 3}0.000{col 56}{space 4} .0001514{col 69}{space 3} .0003354
{txt}{space 11}WI  {c |}{col 16}{res}{space 2} .0001763{col 28}{space 2} .0000474{col 39}{space 1}    3.72{col 48}{space 3}0.000{col 56}{space 4} .0000834{col 69}{space 3} .0002693
{txt}{space 11}WV  {c |}{col 16}{res}{space 2} .0001461{col 28}{space 2} .0000717{col 39}{space 1}    2.04{col 48}{space 3}0.041{col 56}{space 4} 5.64e-06{col 69}{space 3} .0002865
{txt}{space 11}WY  {c |}{col 16}{res}{space 2} .0002624{col 28}{space 2} .0000862{col 39}{space 1}    3.05{col 48}{space 3}0.002{col 56}{space 4} .0000935{col 69}{space 3} .0004313
{txt}{space 14} {c |}
{space 9}_cons {c |}{col 16}{res}{space 2} .0006086{col 28}{space 2} .0000989{col 39}{space 1}    6.15{col 48}{space 3}0.000{col 56}{space 4} .0004147{col 69}{space 3} .0008025
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est1{txt} stored)
{p 0 6 2}note: 2013.year omitted because of collinearity{p_end}

Linear regression                                      Number of obs ={res}     703
                                                       {help j_robustsingular:F( 52,   644) =}       .
                                                       {txt}Prob > F      = {res}      .
                                                       {txt}R-squared     = {res} 0.0841
                                                       {txt}Root MSE      = {res} .00077

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}        incvar{col 16}{c |}      Coef.{col 28}   Std. Err.{col 40}      t{col 48}   P>|t|{col 56}     [95% Con{col 69}f. Interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age_g {c |}
{space 3}middle-age  {c |}{col 16}{res}{space 2} .0000843{col 28}{space 2} .0000985{col 39}{space 1}    0.86{col 48}{space 3}0.393{col 56}{space 4}-.0001092{col 69}{space 3} .0002777
{txt}{space 10}old  {c |}{col 16}{res}{space 2} .0000947{col 28}{space 2} .0001041{col 39}{space 1}    0.91{col 48}{space 3}0.363{col 56}{space 4}-.0001097{col 69}{space 3} .0002991
{txt}{space 14} {c |}
{space 9}edu_g {c |}
{space 2}HS graduate  {c |}{col 16}{res}{space 2}  .000173{col 28}{space 2} .0001173{col 39}{space 1}    1.47{col 48}{space 3}0.141{col 56}{space 4}-.0000575{col 69}{space 3} .0004034
{txt}College/above  {c |}{col 16}{res}{space 2} .0002456{col 28}{space 2} .0001157{col 39}{space 1}    2.12{col 48}{space 3}0.034{col 56}{space 4} .0000184{col 69}{space 3} .0004728
{txt}{space 14} {c |}
{space 7}HHinc_g {c |}
{space 5}high inc  {c |}{col 16}{res}{space 2} .0000182{col 28}{space 2} .0000702{col 39}{space 1}    0.26{col 48}{space 3}0.795{col 56}{space 4}-.0001197{col 69}{space 3} .0001561
{txt}{space 5}1.byear_g {c |}{col 16}{res}{space 2} .0002047{col 28}{space 2} .0001179{col 39}{space 1}    1.74{col 48}{space 3}0.083{col 56}{space 4}-.0000268{col 69}{space 3} .0004362
{txt}{space 14} {c |}
{space 10}year {c |}
{space 9}2013  {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 14} {c |}
{space 6}state_id {c |}
{space 11}AR  {c |}{col 16}{res}{space 2}-.0000504{col 28}{space 2} .0003099{col 39}{space 1}   -0.16{col 48}{space 3}0.871{col 56}{space 4}-.0006589{col 69}{space 3} .0005582
{txt}{space 11}AZ  {c |}{col 16}{res}{space 2}-5.16e-06{col 28}{space 2} .0001073{col 39}{space 1}   -0.05{col 48}{space 3}0.962{col 56}{space 4}-.0002158{col 69}{space 3} .0002055
{txt}{space 11}CA  {c |}{col 16}{res}{space 2} .0007565{col 28}{space 2} .0002751{col 39}{space 1}    2.75{col 48}{space 3}0.006{col 56}{space 4} .0002164{col 69}{space 3} .0012967
{txt}{space 11}CO  {c |}{col 16}{res}{space 2} .0000254{col 28}{space 2} .0002136{col 39}{space 1}    0.12{col 48}{space 3}0.905{col 56}{space 4}-.0003941{col 69}{space 3} .0004449
{txt}{space 11}CT  {c |}{col 16}{res}{space 2} .0005898{col 28}{space 2} .0002631{col 39}{space 1}    2.24{col 48}{space 3}0.025{col 56}{space 4} .0000732{col 69}{space 3} .0011064
{txt}{space 11}DC  {c |}{col 16}{res}{space 2} .0012104{col 28}{space 2} .0000787{col 39}{space 1}   15.37{col 48}{space 3}0.000{col 56}{space 4} .0010558{col 69}{space 3}  .001365
{txt}{space 11}DE  {c |}{col 16}{res}{space 2} .0002677{col 28}{space 2} .0002319{col 39}{space 1}    1.15{col 48}{space 3}0.249{col 56}{space 4}-.0001876{col 69}{space 3}  .000723
{txt}{space 11}FL  {c |}{col 16}{res}{space 2} .0000183{col 28}{space 2} .0000683{col 39}{space 1}    0.27{col 48}{space 3}0.788{col 56}{space 4}-.0001157{col 69}{space 3} .0001524
{txt}{space 11}GA  {c |}{col 16}{res}{space 2} .0001783{col 28}{space 2} .0002009{col 39}{space 1}    0.89{col 48}{space 3}0.375{col 56}{space 4}-.0002161{col 69}{space 3} .0005728
{txt}{space 11}IA  {c |}{col 16}{res}{space 2} .0001434{col 28}{space 2} .0001217{col 39}{space 1}    1.18{col 48}{space 3}0.239{col 56}{space 4}-.0000955{col 69}{space 3} .0003823
{txt}{space 11}ID  {c |}{col 16}{res}{space 2} 1.38e-06{col 28}{space 2} .0001024{col 39}{space 1}    0.01{col 48}{space 3}0.989{col 56}{space 4}-.0001996{col 69}{space 3} .0002024
{txt}{space 11}IL  {c |}{col 16}{res}{space 2} .0004403{col 28}{space 2} .0001593{col 39}{space 1}    2.76{col 48}{space 3}0.006{col 56}{space 4} .0001276{col 69}{space 3} .0007531
{txt}{space 11}IN  {c |}{col 16}{res}{space 2} .0003365{col 28}{space 2} .0001325{col 39}{space 1}    2.54{col 48}{space 3}0.011{col 56}{space 4} .0000762{col 69}{space 3} .0005967
{txt}{space 11}KS  {c |}{col 16}{res}{space 2}  .000607{col 28}{space 2} .0002236{col 39}{space 1}    2.71{col 48}{space 3}0.007{col 56}{space 4} .0001679{col 69}{space 3}  .001046
{txt}{space 11}KY  {c |}{col 16}{res}{space 2} .0002253{col 28}{space 2} .0001263{col 39}{space 1}    1.78{col 48}{space 3}0.075{col 56}{space 4}-.0000227{col 69}{space 3} .0004733
{txt}{space 11}LA  {c |}{col 16}{res}{space 2} .0002213{col 28}{space 2} .0001267{col 39}{space 1}    1.75{col 48}{space 3}0.081{col 56}{space 4}-.0000274{col 69}{space 3}   .00047
{txt}{space 11}MA  {c |}{col 16}{res}{space 2} .0004598{col 28}{space 2} .0001817{col 39}{space 1}    2.53{col 48}{space 3}0.012{col 56}{space 4} .0001031{col 69}{space 3} .0008166
{txt}{space 11}MD  {c |}{col 16}{res}{space 2} .0003364{col 28}{space 2} .0003108{col 39}{space 1}    1.08{col 48}{space 3}0.280{col 56}{space 4}-.0002739{col 69}{space 3} .0009467
{txt}{space 11}ME  {c |}{col 16}{res}{space 2} .0001503{col 28}{space 2} .0001706{col 39}{space 1}    0.88{col 48}{space 3}0.379{col 56}{space 4}-.0001848{col 69}{space 3} .0004854
{txt}{space 11}MI  {c |}{col 16}{res}{space 2} .0002762{col 28}{space 2} .0001084{col 39}{space 1}    2.55{col 48}{space 3}0.011{col 56}{space 4} .0000633{col 69}{space 3}  .000489
{txt}{space 11}MN  {c |}{col 16}{res}{space 2} .0002552{col 28}{space 2} .0001772{col 39}{space 1}    1.44{col 48}{space 3}0.150{col 56}{space 4}-.0000927{col 69}{space 3} .0006032
{txt}{space 11}MO  {c |}{col 16}{res}{space 2} .0004388{col 28}{space 2} .0001843{col 39}{space 1}    2.38{col 48}{space 3}0.018{col 56}{space 4} .0000769{col 69}{space 3} .0008007
{txt}{space 11}MS  {c |}{col 16}{res}{space 2} .0000216{col 28}{space 2} .0000637{col 39}{space 1}    0.34{col 48}{space 3}0.734{col 56}{space 4}-.0001034{col 69}{space 3} .0001467
{txt}{space 11}NC  {c |}{col 16}{res}{space 2} .0002695{col 28}{space 2} .0001254{col 39}{space 1}    2.15{col 48}{space 3}0.032{col 56}{space 4} .0000233{col 69}{space 3} .0005157
{txt}{space 11}ND  {c |}{col 16}{res}{space 2} .0013247{col 28}{space 2} .0001228{col 39}{space 1}   10.79{col 48}{space 3}0.000{col 56}{space 4} .0010836{col 69}{space 3} .0015658
{txt}{space 11}NE  {c |}{col 16}{res}{space 2}-6.52e-06{col 28}{space 2} .0000747{col 39}{space 1}   -0.09{col 48}{space 3}0.931{col 56}{space 4}-.0001533{col 69}{space 3} .0001403
{txt}{space 11}NH  {c |}{col 16}{res}{space 2} .0000913{col 28}{space 2} .0000824{col 39}{space 1}    1.11{col 48}{space 3}0.269{col 56}{space 4}-.0000706{col 69}{space 3} .0002531
{txt}{space 11}NJ  {c |}{col 16}{res}{space 2} .0002042{col 28}{space 2}  .000105{col 39}{space 1}    1.95{col 48}{space 3}0.052{col 56}{space 4}-1.95e-06{col 69}{space 3} .0004103
{txt}{space 11}NY  {c |}{col 16}{res}{space 2} .0002711{col 28}{space 2} .0001184{col 39}{space 1}    2.29{col 48}{space 3}0.022{col 56}{space 4} .0000386{col 69}{space 3} .0005037
{txt}{space 11}OH  {c |}{col 16}{res}{space 2} .0002174{col 28}{space 2} .0001021{col 39}{space 1}    2.13{col 48}{space 3}0.034{col 56}{space 4}  .000017{col 69}{space 3} .0004179
{txt}{space 11}OK  {c |}{col 16}{res}{space 2} .0007099{col 28}{space 2}   .00053{col 39}{space 1}    1.34{col 48}{space 3}0.181{col 56}{space 4}-.0003309{col 69}{space 3} .0017507
{txt}{space 11}OR  {c |}{col 16}{res}{space 2} .0003772{col 28}{space 2} .0002849{col 39}{space 1}    1.32{col 48}{space 3}0.186{col 56}{space 4}-.0001823{col 69}{space 3} .0009366
{txt}{space 11}PA  {c |}{col 16}{res}{space 2}  .000303{col 28}{space 2} .0001123{col 39}{space 1}    2.70{col 48}{space 3}0.007{col 56}{space 4} .0000825{col 69}{space 3} .0005234
{txt}{space 11}RI  {c |}{col 16}{res}{space 2} .0000574{col 28}{space 2} .0000918{col 39}{space 1}    0.63{col 48}{space 3}0.532{col 56}{space 4}-.0001229{col 69}{space 3} .0002377
{txt}{space 11}SC  {c |}{col 16}{res}{space 2}  .000212{col 28}{space 2} .0002091{col 39}{space 1}    1.01{col 48}{space 3}0.311{col 56}{space 4}-.0001987{col 69}{space 3} .0006226
{txt}{space 11}SD  {c |}{col 16}{res}{space 2}  .000698{col 28}{space 2} .0005835{col 39}{space 1}    1.20{col 48}{space 3}0.232{col 56}{space 4}-.0004479{col 69}{space 3} .0018438
{txt}{space 11}TN  {c |}{col 16}{res}{space 2} .0001921{col 28}{space 2} .0001813{col 39}{space 1}    1.06{col 48}{space 3}0.290{col 56}{space 4}-.0001639{col 69}{space 3}  .000548
{txt}{space 11}TX  {c |}{col 16}{res}{space 2} .0005346{col 28}{space 2} .0003832{col 39}{space 1}    1.40{col 48}{space 3}0.163{col 56}{space 4}-.0002178{col 69}{space 3}  .001287
{txt}{space 11}UT  {c |}{col 16}{res}{space 2}-.0000228{col 28}{space 2} .0000889{col 39}{space 1}   -0.26{col 48}{space 3}0.797{col 56}{space 4}-.0001974{col 69}{space 3} .0001517
{txt}{space 11}VA  {c |}{col 16}{res}{space 2} .0005887{col 28}{space 2} .0002809{col 39}{space 1}    2.10{col 48}{space 3}0.036{col 56}{space 4} .0000371{col 69}{space 3} .0011403
{txt}{space 11}VT  {c |}{col 16}{res}{space 2} .0000226{col 28}{space 2} .0000757{col 39}{space 1}    0.30{col 48}{space 3}0.765{col 56}{space 4}-.0001261{col 69}{space 3} .0001714
{txt}{space 11}WA  {c |}{col 16}{res}{space 2} .0001089{col 28}{space 2} .0000956{col 39}{space 1}    1.14{col 48}{space 3}0.255{col 56}{space 4}-.0000787{col 69}{space 3} .0002966
{txt}{space 11}WI  {c |}{col 16}{res}{space 2}  .000321{col 28}{space 2} .0001404{col 39}{space 1}    2.29{col 48}{space 3}0.023{col 56}{space 4} .0000452{col 69}{space 3} .0005968
{txt}{space 11}WV  {c |}{col 16}{res}{space 2}-.0001679{col 28}{space 2} .0001179{col 39}{space 1}   -1.42{col 48}{space 3}0.155{col 56}{space 4}-.0003994{col 69}{space 3} .0000635
{txt}{space 14} {c |}
{space 8}gender {c |}
{space 7}female  {c |}{col 16}{res}{space 2} .0000955{col 28}{space 2} .0000635{col 39}{space 1}    1.50{col 48}{space 3}0.133{col 56}{space 4}-.0000291{col 69}{space 3} .0002201
{txt}{space 9}2.Q34 {c |}{col 16}{res}{space 2} .0000834{col 28}{space 2} .0002391{col 39}{space 1}    0.35{col 48}{space 3}0.727{col 56}{space 4}-.0003862{col 69}{space 3}  .000553
{txt}{space 9}Q35_1 {c |}{col 16}{res}{space 2} .0006421{col 28}{space 2} .0005059{col 39}{space 1}    1.27{col 48}{space 3}0.205{col 56}{space 4}-.0003513{col 69}{space 3} .0016354
{txt}{space 9}Q35_2 {c |}{col 16}{res}{space 2}  .000965{col 28}{space 2} .0005275{col 39}{space 1}    1.83{col 48}{space 3}0.068{col 56}{space 4}-.0000708{col 69}{space 3} .0020009
{txt}{space 9}Q35_3 {c |}{col 16}{res}{space 2}-.0002592{col 28}{space 2} .0002012{col 39}{space 1}   -1.29{col 48}{space 3}0.198{col 56}{space 4}-.0006544{col 69}{space 3}  .000136
{txt}{space 9}Q35_4 {c |}{col 16}{res}{space 2} .0006392{col 28}{space 2} .0004983{col 39}{space 1}    1.28{col 48}{space 3}0.200{col 56}{space 4}-.0003393{col 69}{space 3} .0016178
{txt}{space 9}Q35_5 {c |}{col 16}{res}{space 2} .0000739{col 28}{space 2} .0004315{col 39}{space 1}    0.17{col 48}{space 3}0.864{col 56}{space 4}-.0007734{col 69}{space 3} .0009212
{txt}{space 9}Q35_6 {c |}{col 16}{res}{space 2}  .000955{col 28}{space 2} .0006543{col 39}{space 1}    1.46{col 48}{space 3}0.145{col 56}{space 4}-.0003299{col 69}{space 3} .0022398
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}-.0010402{col 28}{space 2} .0006055{col 39}{space 1}   -1.72{col 48}{space 3}0.086{col 56}{space 4}-.0022293{col 69}{space 3} .0001488
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est2{txt} stored)
{p 0 6 2}note: 2013.year omitted because of collinearity{p_end}

Linear regression                                      Number of obs ={res}     572
                                                       {help j_robustsingular:F( 53,   510) =}       .
                                                       {txt}Prob > F      = {res}      .
                                                       {txt}R-squared     = {res} 0.1039
                                                       {txt}Root MSE      = {res} .00068

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}        incvar{col 16}{c |}      Coef.{col 28}   Std. Err.{col 40}      t{col 48}   P>|t|{col 56}     [95% Con{col 69}f. Interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age_g {c |}
{space 3}middle-age  {c |}{col 16}{res}{space 2} .0000716{col 28}{space 2} .0000992{col 39}{space 1}    0.72{col 48}{space 3}0.470{col 56}{space 4}-.0001232{col 69}{space 3} .0002665
{txt}{space 10}old  {c |}{col 16}{res}{space 2}-4.52e-06{col 28}{space 2} .0000933{col 39}{space 1}   -0.05{col 48}{space 3}0.961{col 56}{space 4}-.0001878{col 69}{space 3} .0001788
{txt}{space 14} {c |}
{space 9}edu_g {c |}
{space 2}HS graduate  {c |}{col 16}{res}{space 2} .0001333{col 28}{space 2} .0001289{col 39}{space 1}    1.03{col 48}{space 3}0.302{col 56}{space 4}  -.00012{col 69}{space 3} .0003866
{txt}College/above  {c |}{col 16}{res}{space 2}   .00013{col 28}{space 2} .0001267{col 39}{space 1}    1.03{col 48}{space 3}0.305{col 56}{space 4} -.000119{col 69}{space 3}  .000379
{txt}{space 14} {c |}
{space 7}HHinc_g {c |}
{space 5}high inc  {c |}{col 16}{res}{space 2} .0000424{col 28}{space 2} .0000636{col 39}{space 1}    0.67{col 48}{space 3}0.505{col 56}{space 4}-.0000825{col 69}{space 3} .0001672
{txt}{space 5}1.byear_g {c |}{col 16}{res}{space 2} .0001759{col 28}{space 2} .0001139{col 39}{space 1}    1.54{col 48}{space 3}0.123{col 56}{space 4}-.0000479{col 69}{space 3} .0003996
{txt}{space 14} {c |}
{space 10}year {c |}
{space 9}2013  {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 14} {c |}
{space 6}state_id {c |}
{space 11}AR  {c |}{col 16}{res}{space 2} .0001196{col 28}{space 2} .0002466{col 39}{space 1}    0.48{col 48}{space 3}0.628{col 56}{space 4}-.0003649{col 69}{space 3}  .000604
{txt}{space 11}AZ  {c |}{col 16}{res}{space 2} .0000189{col 28}{space 2} .0000989{col 39}{space 1}    0.19{col 48}{space 3}0.848{col 56}{space 4}-.0001755{col 69}{space 3} .0002133
{txt}{space 11}CA  {c |}{col 16}{res}{space 2} .0005793{col 28}{space 2} .0002672{col 39}{space 1}    2.17{col 48}{space 3}0.031{col 56}{space 4} .0000543{col 69}{space 3} .0011043
{txt}{space 11}CO  {c |}{col 16}{res}{space 2} .0000174{col 28}{space 2} .0002148{col 39}{space 1}    0.08{col 48}{space 3}0.935{col 56}{space 4}-.0004045{col 69}{space 3} .0004394
{txt}{space 11}CT  {c |}{col 16}{res}{space 2} .0003073{col 28}{space 2} .0001538{col 39}{space 1}    2.00{col 48}{space 3}0.046{col 56}{space 4} 5.14e-06{col 69}{space 3} .0006095
{txt}{space 11}DC  {c |}{col 16}{res}{space 2} .0011877{col 28}{space 2} .0000876{col 39}{space 1}   13.56{col 48}{space 3}0.000{col 56}{space 4} .0010156{col 69}{space 3} .0013597
{txt}{space 11}DE  {c |}{col 16}{res}{space 2} .0003164{col 28}{space 2} .0002321{col 39}{space 1}    1.36{col 48}{space 3}0.173{col 56}{space 4}-.0001395{col 69}{space 3} .0007724
{txt}{space 11}FL  {c |}{col 16}{res}{space 2} 4.20e-06{col 28}{space 2} .0000849{col 39}{space 1}    0.05{col 48}{space 3}0.961{col 56}{space 4}-.0001625{col 69}{space 3} .0001709
{txt}{space 11}GA  {c |}{col 16}{res}{space 2} .0002593{col 28}{space 2} .0002713{col 39}{space 1}    0.96{col 48}{space 3}0.340{col 56}{space 4}-.0002738{col 69}{space 3} .0007924
{txt}{space 11}IA  {c |}{col 16}{res}{space 2} .0001661{col 28}{space 2} .0001365{col 39}{space 1}    1.22{col 48}{space 3}0.224{col 56}{space 4}-.0001021{col 69}{space 3} .0004342
{txt}{space 11}ID  {c |}{col 16}{res}{space 2} 2.12e-07{col 28}{space 2} .0001034{col 39}{space 1}    0.00{col 48}{space 3}0.998{col 56}{space 4} -.000203{col 69}{space 3} .0002034
{txt}{space 11}IL  {c |}{col 16}{res}{space 2} .0001284{col 28}{space 2} .0001092{col 39}{space 1}    1.18{col 48}{space 3}0.240{col 56}{space 4}-.0000861{col 69}{space 3} .0003429
{txt}{space 11}IN  {c |}{col 16}{res}{space 2} .0002931{col 28}{space 2} .0001459{col 39}{space 1}    2.01{col 48}{space 3}0.045{col 56}{space 4} 6.55e-06{col 69}{space 3} .0005797
{txt}{space 11}KS  {c |}{col 16}{res}{space 2} .0006707{col 28}{space 2} .0002815{col 39}{space 1}    2.38{col 48}{space 3}0.018{col 56}{space 4} .0001176{col 69}{space 3} .0012237
{txt}{space 11}KY  {c |}{col 16}{res}{space 2}  .000311{col 28}{space 2} .0001451{col 39}{space 1}    2.14{col 48}{space 3}0.033{col 56}{space 4} .0000259{col 69}{space 3} .0005961
{txt}{space 11}LA  {c |}{col 16}{res}{space 2} .0001618{col 28}{space 2} .0001164{col 39}{space 1}    1.39{col 48}{space 3}0.165{col 56}{space 4}-.0000669{col 69}{space 3} .0003905
{txt}{space 11}MA  {c |}{col 16}{res}{space 2} .0003625{col 28}{space 2} .0002163{col 39}{space 1}    1.68{col 48}{space 3}0.094{col 56}{space 4}-.0000625{col 69}{space 3} .0007875
{txt}{space 11}MD  {c |}{col 16}{res}{space 2} .0005574{col 28}{space 2}  .000412{col 39}{space 1}    1.35{col 48}{space 3}0.177{col 56}{space 4} -.000252{col 69}{space 3} .0013668
{txt}{space 11}ME  {c |}{col 16}{res}{space 2} .0000833{col 28}{space 2} .0001075{col 39}{space 1}    0.77{col 48}{space 3}0.439{col 56}{space 4} -.000128{col 69}{space 3} .0002945
{txt}{space 11}MI  {c |}{col 16}{res}{space 2} .0002388{col 28}{space 2} .0001073{col 39}{space 1}    2.23{col 48}{space 3}0.027{col 56}{space 4}  .000028{col 69}{space 3} .0004497
{txt}{space 11}MN  {c |}{col 16}{res}{space 2} .0002968{col 28}{space 2} .0002329{col 39}{space 1}    1.27{col 48}{space 3}0.203{col 56}{space 4}-.0001607{col 69}{space 3} .0007543
{txt}{space 11}MO  {c |}{col 16}{res}{space 2} .0003763{col 28}{space 2} .0001749{col 39}{space 1}    2.15{col 48}{space 3}0.032{col 56}{space 4} .0000326{col 69}{space 3}   .00072
{txt}{space 11}MS  {c |}{col 16}{res}{space 2} .0000738{col 28}{space 2} .0001005{col 39}{space 1}    0.73{col 48}{space 3}0.463{col 56}{space 4}-.0001237{col 69}{space 3} .0002713
{txt}{space 11}NC  {c |}{col 16}{res}{space 2} .0002271{col 28}{space 2} .0001289{col 39}{space 1}    1.76{col 48}{space 3}0.079{col 56}{space 4}-.0000262{col 69}{space 3} .0004804
{txt}{space 11}ND  {c |}{col 16}{res}{space 2} .0013218{col 28}{space 2} .0001389{col 39}{space 1}    9.51{col 48}{space 3}0.000{col 56}{space 4} .0010488{col 69}{space 3} .0015947
{txt}{space 11}NE  {c |}{col 16}{res}{space 2} .0000303{col 28}{space 2} .0000991{col 39}{space 1}    0.31{col 48}{space 3}0.760{col 56}{space 4}-.0001644{col 69}{space 3} .0002251
{txt}{space 11}NH  {c |}{col 16}{res}{space 2} .0001261{col 28}{space 2} .0001026{col 39}{space 1}    1.23{col 48}{space 3}0.219{col 56}{space 4}-.0000754{col 69}{space 3} .0003276
{txt}{space 11}NJ  {c |}{col 16}{res}{space 2}  .000183{col 28}{space 2} .0000996{col 39}{space 1}    1.84{col 48}{space 3}0.067{col 56}{space 4}-.0000126{col 69}{space 3} .0003787
{txt}{space 11}NY  {c |}{col 16}{res}{space 2} .0002457{col 28}{space 2} .0001369{col 39}{space 1}    1.79{col 48}{space 3}0.073{col 56}{space 4}-.0000232{col 69}{space 3} .0005146
{txt}{space 11}OH  {c |}{col 16}{res}{space 2} .0002034{col 28}{space 2} .0001041{col 39}{space 1}    1.95{col 48}{space 3}0.051{col 56}{space 4}-1.18e-06{col 69}{space 3}  .000408
{txt}{space 11}OK  {c |}{col 16}{res}{space 2} .0000312{col 28}{space 2} .0002325{col 39}{space 1}    0.13{col 48}{space 3}0.893{col 56}{space 4}-.0004256{col 69}{space 3}  .000488
{txt}{space 11}OR  {c |}{col 16}{res}{space 2} .0006588{col 28}{space 2} .0003018{col 39}{space 1}    2.18{col 48}{space 3}0.029{col 56}{space 4} .0000659{col 69}{space 3} .0012518
{txt}{space 11}PA  {c |}{col 16}{res}{space 2} .0003286{col 28}{space 2}  .000136{col 39}{space 1}    2.42{col 48}{space 3}0.016{col 56}{space 4} .0000614{col 69}{space 3} .0005957
{txt}{space 11}RI  {c |}{col 16}{res}{space 2} .0000585{col 28}{space 2} .0001044{col 39}{space 1}    0.56{col 48}{space 3}0.576{col 56}{space 4}-.0001466{col 69}{space 3} .0002636
{txt}{space 11}SC  {c |}{col 16}{res}{space 2} .0001401{col 28}{space 2} .0002519{col 39}{space 1}    0.56{col 48}{space 3}0.578{col 56}{space 4}-.0003548{col 69}{space 3} .0006349
{txt}{space 11}SD  {c |}{col 16}{res}{space 2}-.0000114{col 28}{space 2} .0001598{col 39}{space 1}   -0.07{col 48}{space 3}0.943{col 56}{space 4}-.0003254{col 69}{space 3} .0003026
{txt}{space 11}TN  {c |}{col 16}{res}{space 2}  .000164{col 28}{space 2} .0001677{col 39}{space 1}    0.98{col 48}{space 3}0.329{col 56}{space 4}-.0001654{col 69}{space 3} .0004934
{txt}{space 11}TX  {c |}{col 16}{res}{space 2} .0007604{col 28}{space 2} .0004739{col 39}{space 1}    1.60{col 48}{space 3}0.109{col 56}{space 4}-.0001706{col 69}{space 3} .0016915
{txt}{space 11}VA  {c |}{col 16}{res}{space 2} .0006195{col 28}{space 2} .0002851{col 39}{space 1}    2.17{col 48}{space 3}0.030{col 56}{space 4} .0000594{col 69}{space 3} .0011795
{txt}{space 11}VT  {c |}{col 16}{res}{space 2} .0000401{col 28}{space 2} .0000719{col 39}{space 1}    0.56{col 48}{space 3}0.577{col 56}{space 4}-.0001012{col 69}{space 3} .0001814
{txt}{space 11}WA  {c |}{col 16}{res}{space 2} .0000528{col 28}{space 2} .0001184{col 39}{space 1}    0.45{col 48}{space 3}0.656{col 56}{space 4}-.0001797{col 69}{space 3} .0002854
{txt}{space 11}WI  {c |}{col 16}{res}{space 2} .0003844{col 28}{space 2} .0001622{col 39}{space 1}    2.37{col 48}{space 3}0.018{col 56}{space 4} .0000657{col 69}{space 3}  .000703
{txt}{space 11}WV  {c |}{col 16}{res}{space 2}-.0001123{col 28}{space 2} .0001385{col 39}{space 1}   -0.81{col 48}{space 3}0.418{col 56}{space 4}-.0003843{col 69}{space 3} .0001598
{txt}{space 14} {c |}
{space 8}gender {c |}
{space 7}female  {c |}{col 16}{res}{space 2} .0000411{col 28}{space 2} .0000565{col 39}{space 1}    0.73{col 48}{space 3}0.468{col 56}{space 4}-.0000699{col 69}{space 3} .0001521
{txt}{space 9}2.Q34 {c |}{col 16}{res}{space 2} .0001761{col 28}{space 2} .0001936{col 39}{space 1}    0.91{col 48}{space 3}0.363{col 56}{space 4}-.0002041{col 69}{space 3} .0005564
{txt}{space 9}Q35_1 {c |}{col 16}{res}{space 2} .0006639{col 28}{space 2} .0005607{col 39}{space 1}    1.18{col 48}{space 3}0.237{col 56}{space 4}-.0004376{col 69}{space 3} .0017654
{txt}{space 9}Q35_2 {c |}{col 16}{res}{space 2} .0010049{col 28}{space 2} .0005722{col 39}{space 1}    1.76{col 48}{space 3}0.080{col 56}{space 4}-.0001192{col 69}{space 3} .0021291
{txt}{space 9}Q35_3 {c |}{col 16}{res}{space 2}-.0000592{col 28}{space 2} .0001813{col 39}{space 1}   -0.33{col 48}{space 3}0.744{col 56}{space 4}-.0004155{col 69}{space 3}  .000297
{txt}{space 9}Q35_4 {c |}{col 16}{res}{space 2} .0007631{col 28}{space 2} .0005755{col 39}{space 1}    1.33{col 48}{space 3}0.185{col 56}{space 4}-.0003675{col 69}{space 3} .0018937
{txt}{space 9}Q35_5 {c |}{col 16}{res}{space 2}-.0003663{col 28}{space 2} .0002095{col 39}{space 1}   -1.75{col 48}{space 3}0.081{col 56}{space 4}-.0007778{col 69}{space 3} .0000453
{txt}{space 9}Q35_6 {c |}{col 16}{res}{space 2} .0008556{col 28}{space 2} .0006977{col 39}{space 1}    1.23{col 48}{space 3}0.221{col 56}{space 4}-.0005152{col 69}{space 3} .0022264
{txt}{space 5}UEprobAgg {c |}{col 16}{res}{space 2} 7.29e-07{col 28}{space 2} 1.09e-06{col 39}{space 1}    0.67{col 48}{space 3}0.506{col 56}{space 4}-1.42e-06{col 69}{space 3} 2.88e-06
{txt}{space 7}Stkprob {c |}{col 16}{res}{space 2} 1.55e-06{col 28}{space 2} 1.43e-06{col 39}{space 1}    1.09{col 48}{space 3}0.278{col 56}{space 4}-1.26e-06{col 69}{space 3} 4.36e-06
{txt}{space 7}Q9_mean {c |}{col 16}{res}{space 2}-.0001955{col 28}{space 2} .0015877{col 39}{space 1}   -0.12{col 48}{space 3}0.902{col 56}{space 4}-.0033147{col 69}{space 3} .0029237
{txt}{space 5}UEprobInd {c |}{col 16}{res}{space 2}-1.85e-07{col 28}{space 2} 1.34e-06{col 39}{space 1}   -0.14{col 48}{space 3}0.891{col 56}{space 4}-2.83e-06{col 69}{space 3} 2.46e-06
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} -.001123{col 28}{space 2} .0006624{col 39}{space 1}   -1.70{col 48}{space 3}0.091{col 56}{space 4}-.0024243{col 69}{space 3} .0001784
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est3{txt} stored)

Linear regression                                      Number of obs ={res}   55408
                                                       {txt}F( 63, 55344) ={res}   26.24
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0315
                                                       {txt}Root MSE      = {res} .03079

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}        inciqr{col 16}{c |}      Coef.{col 28}   Std. Err.{col 40}      t{col 48}   P>|t|{col 56}     [95% Con{col 69}f. Interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age_g {c |}
{space 3}middle-age  {c |}{col 16}{res}{space 2}-.0014976{col 28}{space 2} .0006527{col 39}{space 1}   -2.29{col 48}{space 3}0.022{col 56}{space 4}-.0027768{col 69}{space 3}-.0002183
{txt}{space 10}old  {c |}{col 16}{res}{space 2}-.0035456{col 28}{space 2} .0006702{col 39}{space 1}   -5.29{col 48}{space 3}0.000{col 56}{space 4}-.0048593{col 69}{space 3}-.0022319
{txt}{space 14} {c |}
{space 9}edu_g {c |}
{space 2}HS graduate  {c |}{col 16}{res}{space 2}-.0082178{col 28}{space 2} .0024646{col 39}{space 1}   -3.33{col 48}{space 3}0.001{col 56}{space 4}-.0130484{col 69}{space 3}-.0033872
{txt}College/above  {c |}{col 16}{res}{space 2}-.0097548{col 28}{space 2} .0024597{col 39}{space 1}   -3.97{col 48}{space 3}0.000{col 56}{space 4}-.0145759{col 69}{space 3}-.0049336
{txt}{space 14} {c |}
{space 7}HHinc_g {c |}
{space 5}high inc  {c |}{col 16}{res}{space 2}-.0069476{col 28}{space 2} .0003101{col 39}{space 1}  -22.41{col 48}{space 3}0.000{col 56}{space 4}-.0075554{col 69}{space 3}-.0063399
{txt}{space 5}1.byear_g {c |}{col 16}{res}{space 2} .0033194{col 28}{space 2} .0006645{col 39}{space 1}    4.99{col 48}{space 3}0.000{col 56}{space 4} .0020168{col 69}{space 3} .0046219
{txt}{space 14} {c |}
{space 10}year {c |}
{space 9}2014  {c |}{col 16}{res}{space 2}-.0001273{col 28}{space 2} .0005557{col 39}{space 1}   -0.23{col 48}{space 3}0.819{col 56}{space 4}-.0012164{col 69}{space 3} .0009619
{txt}{space 9}2015  {c |}{col 16}{res}{space 2}-.0011553{col 28}{space 2} .0005512{col 39}{space 1}   -2.10{col 48}{space 3}0.036{col 56}{space 4}-.0022357{col 69}{space 3}-.0000749
{txt}{space 9}2016  {c |}{col 16}{res}{space 2}-.0013935{col 28}{space 2}  .000548{col 39}{space 1}   -2.54{col 48}{space 3}0.011{col 56}{space 4}-.0024675{col 69}{space 3}-.0003195
{txt}{space 9}2017  {c |}{col 16}{res}{space 2} -.001293{col 28}{space 2}  .000551{col 39}{space 1}   -2.35{col 48}{space 3}0.019{col 56}{space 4} -.002373{col 69}{space 3}-.0002131
{txt}{space 9}2018  {c |}{col 16}{res}{space 2}-.0012448{col 28}{space 2} .0005593{col 39}{space 1}   -2.23{col 48}{space 3}0.026{col 56}{space 4}-.0023412{col 69}{space 3}-.0001485
{txt}{space 9}2019  {c |}{col 16}{res}{space 2}-.0012753{col 28}{space 2} .0005641{col 39}{space 1}   -2.26{col 48}{space 3}0.024{col 56}{space 4} -.002381{col 69}{space 3}-.0001697
{txt}{space 9}2020  {c |}{col 16}{res}{space 2}-.0008721{col 28}{space 2} .0012841{col 39}{space 1}   -0.68{col 48}{space 3}0.497{col 56}{space 4} -.003389{col 69}{space 3} .0016449
{txt}{space 14} {c |}
{space 6}state_id {c |}
{space 11}AL  {c |}{col 16}{res}{space 2}-.0079103{col 28}{space 2} .0062165{col 39}{space 1}   -1.27{col 48}{space 3}0.203{col 56}{space 4}-.0200947{col 69}{space 3} .0042741
{txt}{space 11}AR  {c |}{col 16}{res}{space 2}-.0093393{col 28}{space 2} .0062826{col 39}{space 1}   -1.49{col 48}{space 3}0.137{col 56}{space 4}-.0216532{col 69}{space 3} .0029746
{txt}{space 11}AZ  {c |}{col 16}{res}{space 2}-.0094116{col 28}{space 2} .0061411{col 39}{space 1}   -1.53{col 48}{space 3}0.125{col 56}{space 4}-.0214482{col 69}{space 3} .0026249
{txt}{space 11}CA  {c |}{col 16}{res}{space 2}-.0059971{col 28}{space 2} .0060988{col 39}{space 1}   -0.98{col 48}{space 3}0.325{col 56}{space 4}-.0179509{col 69}{space 3} .0059567
{txt}{space 11}CO  {c |}{col 16}{res}{space 2}-.0091036{col 28}{space 2} .0061379{col 39}{space 1}   -1.48{col 48}{space 3}0.138{col 56}{space 4} -.021134{col 69}{space 3} .0029267
{txt}{space 11}CT  {c |}{col 16}{res}{space 2}-.0098511{col 28}{space 2} .0061786{col 39}{space 1}   -1.59{col 48}{space 3}0.111{col 56}{space 4}-.0219612{col 69}{space 3}  .002259
{txt}{space 11}DC  {c |}{col 16}{res}{space 2}-.0016802{col 28}{space 2}  .006537{col 39}{space 1}   -0.26{col 48}{space 3}0.797{col 56}{space 4}-.0144927{col 69}{space 3} .0111323
{txt}{space 11}DE  {c |}{col 16}{res}{space 2}-.0119897{col 28}{space 2} .0065129{col 39}{space 1}   -1.84{col 48}{space 3}0.066{col 56}{space 4} -.024755{col 69}{space 3} .0007755
{txt}{space 11}FL  {c |}{col 16}{res}{space 2}-.0067691{col 28}{space 2} .0061121{col 39}{space 1}   -1.11{col 48}{space 3}0.268{col 56}{space 4}-.0187489{col 69}{space 3} .0052108
{txt}{space 11}GA  {c |}{col 16}{res}{space 2}-.0017974{col 28}{space 2} .0061644{col 39}{space 1}   -0.29{col 48}{space 3}0.771{col 56}{space 4}-.0138797{col 69}{space 3}  .010285
{txt}{space 11}HI  {c |}{col 16}{res}{space 2}-.0137102{col 28}{space 2} .0064617{col 39}{space 1}   -2.12{col 48}{space 3}0.034{col 56}{space 4}-.0263752{col 69}{space 3}-.0010452
{txt}{space 11}IA  {c |}{col 16}{res}{space 2}-.0155283{col 28}{space 2} .0061419{col 39}{space 1}   -2.53{col 48}{space 3}0.011{col 56}{space 4}-.0275664{col 69}{space 3}-.0034902
{txt}{space 11}ID  {c |}{col 16}{res}{space 2} -.010507{col 28}{space 2} .0062598{col 39}{space 1}   -1.68{col 48}{space 3}0.093{col 56}{space 4}-.0227761{col 69}{space 3} .0017622
{txt}{space 11}IL  {c |}{col 16}{res}{space 2}-.0105241{col 28}{space 2} .0061102{col 39}{space 1}   -1.72{col 48}{space 3}0.085{col 56}{space 4}-.0225001{col 69}{space 3} .0014519
{txt}{space 11}IN  {c |}{col 16}{res}{space 2}-.0100326{col 28}{space 2} .0061434{col 39}{space 1}   -1.63{col 48}{space 3}0.102{col 56}{space 4}-.0220737{col 69}{space 3} .0020085
{txt}{space 11}KS  {c |}{col 16}{res}{space 2}-.0038749{col 28}{space 2} .0062881{col 39}{space 1}   -0.62{col 48}{space 3}0.538{col 56}{space 4}-.0161996{col 69}{space 3} .0084499
{txt}{space 11}KY  {c |}{col 16}{res}{space 2}-.0076105{col 28}{space 2} .0062067{col 39}{space 1}   -1.23{col 48}{space 3}0.220{col 56}{space 4}-.0197756{col 69}{space 3} .0045546
{txt}{space 11}LA  {c |}{col 16}{res}{space 2}-.0022954{col 28}{space 2}  .006254{col 39}{space 1}   -0.37{col 48}{space 3}0.714{col 56}{space 4}-.0145534{col 69}{space 3} .0099625
{txt}{space 11}MA  {c |}{col 16}{res}{space 2}-.0111197{col 28}{space 2} .0061321{col 39}{space 1}   -1.81{col 48}{space 3}0.070{col 56}{space 4}-.0231386{col 69}{space 3} .0008991
{txt}{space 11}MD  {c |}{col 16}{res}{space 2}-.0100839{col 28}{space 2} .0061432{col 39}{space 1}   -1.64{col 48}{space 3}0.101{col 56}{space 4}-.0221247{col 69}{space 3} .0019568
{txt}{space 11}ME  {c |}{col 16}{res}{space 2}-.0071707{col 28}{space 2} .0063491{col 39}{space 1}   -1.13{col 48}{space 3}0.259{col 56}{space 4} -.019615{col 69}{space 3} .0052736
{txt}{space 11}MI  {c |}{col 16}{res}{space 2}-.0104831{col 28}{space 2} .0061167{col 39}{space 1}   -1.71{col 48}{space 3}0.087{col 56}{space 4}-.0224718{col 69}{space 3} .0015057
{txt}{space 11}MN  {c |}{col 16}{res}{space 2}-.0107391{col 28}{space 2} .0061325{col 39}{space 1}   -1.75{col 48}{space 3}0.080{col 56}{space 4}-.0227589{col 69}{space 3} .0012806
{txt}{space 11}MO  {c |}{col 16}{res}{space 2}-.0088855{col 28}{space 2}  .006149{col 39}{space 1}   -1.45{col 48}{space 3}0.148{col 56}{space 4}-.0209376{col 69}{space 3} .0031667
{txt}{space 11}MS  {c |}{col 16}{res}{space 2} .0004855{col 28}{space 2} .0064721{col 39}{space 1}    0.08{col 48}{space 3}0.940{col 56}{space 4}-.0121999{col 69}{space 3} .0131708
{txt}{space 11}MT  {c |}{col 16}{res}{space 2}-.0127893{col 28}{space 2} .0065076{col 39}{space 1}   -1.97{col 48}{space 3}0.049{col 56}{space 4}-.0255442{col 69}{space 3}-.0000344
{txt}{space 11}NC  {c |}{col 16}{res}{space 2}-.0083436{col 28}{space 2} .0061314{col 39}{space 1}   -1.36{col 48}{space 3}0.174{col 56}{space 4}-.0203613{col 69}{space 3}  .003674
{txt}{space 11}ND  {c |}{col 16}{res}{space 2}-.0161283{col 28}{space 2} .0063301{col 39}{space 1}   -2.55{col 48}{space 3}0.011{col 56}{space 4}-.0285352{col 69}{space 3}-.0037213
{txt}{space 11}NE  {c |}{col 16}{res}{space 2}-.0133699{col 28}{space 2} .0062103{col 39}{space 1}   -2.15{col 48}{space 3}0.031{col 56}{space 4}-.0255421{col 69}{space 3}-.0011978
{txt}{space 11}NH  {c |}{col 16}{res}{space 2}-.0161599{col 28}{space 2} .0062195{col 39}{space 1}   -2.60{col 48}{space 3}0.009{col 56}{space 4}-.0283501{col 69}{space 3}-.0039696
{txt}{space 11}NJ  {c |}{col 16}{res}{space 2}-.0084582{col 28}{space 2} .0061171{col 39}{space 1}   -1.38{col 48}{space 3}0.167{col 56}{space 4}-.0204479{col 69}{space 3} .0035314
{txt}{space 11}NM  {c |}{col 16}{res}{space 2}-.0139188{col 28}{space 2} .0063478{col 39}{space 1}   -2.19{col 48}{space 3}0.028{col 56}{space 4}-.0263606{col 69}{space 3} -.001477
{txt}{space 11}NV  {c |}{col 16}{res}{space 2} .0014761{col 28}{space 2} .0063832{col 39}{space 1}    0.23{col 48}{space 3}0.817{col 56}{space 4} -.011035{col 69}{space 3} .0139873
{txt}{space 11}NY  {c |}{col 16}{res}{space 2}-.0064908{col 28}{space 2} .0061101{col 39}{space 1}   -1.06{col 48}{space 3}0.288{col 56}{space 4}-.0184667{col 69}{space 3}  .005485
{txt}{space 11}OH  {c |}{col 16}{res}{space 2}-.0110201{col 28}{space 2} .0061156{col 39}{space 1}   -1.80{col 48}{space 3}0.072{col 56}{space 4}-.0230066{col 69}{space 3} .0009665
{txt}{space 11}OK  {c |}{col 16}{res}{space 2}-.0091783{col 28}{space 2}  .006199{col 39}{space 1}   -1.48{col 48}{space 3}0.139{col 56}{space 4}-.0213283{col 69}{space 3} .0029717
{txt}{space 11}OR  {c |}{col 16}{res}{space 2}-.0111136{col 28}{space 2} .0061462{col 39}{space 1}   -1.81{col 48}{space 3}0.071{col 56}{space 4}-.0231601{col 69}{space 3} .0009329
{txt}{space 11}PA  {c |}{col 16}{res}{space 2}-.0127614{col 28}{space 2} .0061023{col 39}{space 1}   -2.09{col 48}{space 3}0.037{col 56}{space 4} -.024722{col 69}{space 3}-.0008009
{txt}{space 11}RI  {c |}{col 16}{res}{space 2} -.019939{col 28}{space 2} .0061639{col 39}{space 1}   -3.23{col 48}{space 3}0.001{col 56}{space 4}-.0320202{col 69}{space 3}-.0078578
{txt}{space 11}SC  {c |}{col 16}{res}{space 2}-.0068161{col 28}{space 2} .0062416{col 39}{space 1}   -1.09{col 48}{space 3}0.275{col 56}{space 4}-.0190497{col 69}{space 3} .0054176
{txt}{space 11}SD  {c |}{col 16}{res}{space 2}-.0080659{col 28}{space 2} .0065033{col 39}{space 1}   -1.24{col 48}{space 3}0.215{col 56}{space 4}-.0208124{col 69}{space 3} .0046806
{txt}{space 11}TN  {c |}{col 16}{res}{space 2}-.0053793{col 28}{space 2} .0061903{col 39}{space 1}   -0.87{col 48}{space 3}0.385{col 56}{space 4}-.0175123{col 69}{space 3} .0067536
{txt}{space 11}TX  {c |}{col 16}{res}{space 2}-.0062839{col 28}{space 2} .0061043{col 39}{space 1}   -1.03{col 48}{space 3}0.303{col 56}{space 4}-.0182483{col 69}{space 3} .0056805
{txt}{space 11}UT  {c |}{col 16}{res}{space 2}-.0119128{col 28}{space 2} .0062087{col 39}{space 1}   -1.92{col 48}{space 3}0.055{col 56}{space 4}-.0240818{col 69}{space 3} .0002562
{txt}{space 11}VA  {c |}{col 16}{res}{space 2}-.0055004{col 28}{space 2} .0061432{col 39}{space 1}   -0.90{col 48}{space 3}0.371{col 56}{space 4}-.0175411{col 69}{space 3} .0065402
{txt}{space 11}VT  {c |}{col 16}{res}{space 2}-.0153136{col 28}{space 2} .0063644{col 39}{space 1}   -2.41{col 48}{space 3}0.016{col 56}{space 4}-.0277879{col 69}{space 3}-.0028393
{txt}{space 11}WA  {c |}{col 16}{res}{space 2}-.0110337{col 28}{space 2} .0061232{col 39}{space 1}   -1.80{col 48}{space 3}0.072{col 56}{space 4}-.0230352{col 69}{space 3} .0009678
{txt}{space 11}WI  {c |}{col 16}{res}{space 2} -.009705{col 28}{space 2} .0061505{col 39}{space 1}   -1.58{col 48}{space 3}0.115{col 56}{space 4}-.0217601{col 69}{space 3} .0023501
{txt}{space 11}WV  {c |}{col 16}{res}{space 2}-.0095132{col 28}{space 2} .0064907{col 39}{space 1}   -1.47{col 48}{space 3}0.143{col 56}{space 4}-.0222351{col 69}{space 3} .0032086
{txt}{space 11}WY  {c |}{col 16}{res}{space 2}-.0131053{col 28}{space 2} .0064669{col 39}{space 1}   -2.03{col 48}{space 3}0.043{col 56}{space 4}-.0257805{col 69}{space 3}  -.00043
{txt}{space 14} {c |}
{space 9}_cons {c |}{col 16}{res}{space 2} .0516306{col 28}{space 2} .0066116{col 39}{space 1}    7.81{col 48}{space 3}0.000{col 56}{space 4} .0386718{col 69}{space 3} .0645895
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est4{txt} stored)
{p 0 6 2}note: 2013.year omitted because of collinearity{p_end}

Linear regression                                      Number of obs ={res}     775
                                                       {help j_robustsingular:F( 53,   716) =}       .
                                                       {txt}Prob > F      = {res}      .
                                                       {txt}R-squared     = {res} 0.0791
                                                       {txt}Root MSE      = {res} .02818

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}        inciqr{col 16}{c |}      Coef.{col 28}   Std. Err.{col 40}      t{col 48}   P>|t|{col 56}     [95% Con{col 69}f. Interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age_g {c |}
{space 3}middle-age  {c |}{col 16}{res}{space 2}-.0025153{col 28}{space 2} .0040918{col 39}{space 1}   -0.61{col 48}{space 3}0.539{col 56}{space 4}-.0105486{col 69}{space 3}  .005518
{txt}{space 10}old  {c |}{col 16}{res}{space 2}-.0075017{col 28}{space 2} .0042429{col 39}{space 1}   -1.77{col 48}{space 3}0.077{col 56}{space 4}-.0158318{col 69}{space 3} .0008284
{txt}{space 14} {c |}
{space 9}edu_g {c |}
{space 2}HS graduate  {c |}{col 16}{res}{space 2}-.0148095{col 28}{space 2} .0190745{col 39}{space 1}   -0.78{col 48}{space 3}0.438{col 56}{space 4}-.0522581{col 69}{space 3} .0226392
{txt}College/above  {c |}{col 16}{res}{space 2}-.0172309{col 28}{space 2} .0190785{col 39}{space 1}   -0.90{col 48}{space 3}0.367{col 56}{space 4}-.0546874{col 69}{space 3} .0202255
{txt}{space 14} {c |}
{space 7}HHinc_g {c |}
{space 5}high inc  {c |}{col 16}{res}{space 2}-.0013573{col 28}{space 2} .0026372{col 39}{space 1}   -0.51{col 48}{space 3}0.607{col 56}{space 4}-.0065349{col 69}{space 3} .0038203
{txt}{space 5}1.byear_g {c |}{col 16}{res}{space 2} .0027987{col 28}{space 2} .0047005{col 39}{space 1}    0.60{col 48}{space 3}0.552{col 56}{space 4}-.0064297{col 69}{space 3} .0120272
{txt}{space 14} {c |}
{space 10}year {c |}
{space 9}2013  {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 14} {c |}
{space 6}state_id {c |}
{space 11}AR  {c |}{col 16}{res}{space 2}-.0387806{col 28}{space 2} .0301637{col 39}{space 1}   -1.29{col 48}{space 3}0.199{col 56}{space 4}-.0980004{col 69}{space 3} .0204393
{txt}{space 11}AZ  {c |}{col 16}{res}{space 2}-.0211976{col 28}{space 2} .0267195{col 39}{space 1}   -0.79{col 48}{space 3}0.428{col 56}{space 4}-.0736555{col 69}{space 3} .0312603
{txt}{space 11}CA  {c |}{col 16}{res}{space 2}-.0037828{col 28}{space 2} .0271414{col 39}{space 1}   -0.14{col 48}{space 3}0.889{col 56}{space 4}-.0570691{col 69}{space 3} .0495034
{txt}{space 11}CO  {c |}{col 16}{res}{space 2} -.021128{col 28}{space 2} .0274657{col 39}{space 1}   -0.77{col 48}{space 3}0.442{col 56}{space 4}-.0750509{col 69}{space 3} .0327948
{txt}{space 11}CT  {c |}{col 16}{res}{space 2} -.004415{col 28}{space 2} .0272486{col 39}{space 1}   -0.16{col 48}{space 3}0.871{col 56}{space 4}-.0579117{col 69}{space 3} .0490816
{txt}{space 11}DC  {c |}{col 16}{res}{space 2} .0072722{col 28}{space 2} .0266885{col 39}{space 1}    0.27{col 48}{space 3}0.785{col 56}{space 4} -.045125{col 69}{space 3} .0596693
{txt}{space 11}DE  {c |}{col 16}{res}{space 2}-.0123947{col 28}{space 2} .0271102{col 39}{space 1}   -0.46{col 48}{space 3}0.648{col 56}{space 4}-.0656196{col 69}{space 3} .0408302
{txt}{space 11}FL  {c |}{col 16}{res}{space 2}-.0263605{col 28}{space 2} .0265064{col 39}{space 1}   -0.99{col 48}{space 3}0.320{col 56}{space 4}-.0784001{col 69}{space 3} .0256791
{txt}{space 11}GA  {c |}{col 16}{res}{space 2}  -.01121{col 28}{space 2} .0273636{col 39}{space 1}   -0.41{col 48}{space 3}0.682{col 56}{space 4}-.0649324{col 69}{space 3} .0425125
{txt}{space 11}IA  {c |}{col 16}{res}{space 2}-.0058129{col 28}{space 2} .0296392{col 39}{space 1}   -0.20{col 48}{space 3}0.845{col 56}{space 4}-.0640031{col 69}{space 3} .0523773
{txt}{space 11}ID  {c |}{col 16}{res}{space 2}-.0263405{col 28}{space 2}  .026685{col 39}{space 1}   -0.99{col 48}{space 3}0.324{col 56}{space 4}-.0787308{col 69}{space 3} .0260497
{txt}{space 11}IL  {c |}{col 16}{res}{space 2}-.0056807{col 28}{space 2} .0270316{col 39}{space 1}   -0.21{col 48}{space 3}0.834{col 56}{space 4}-.0587514{col 69}{space 3}   .04739
{txt}{space 11}IN  {c |}{col 16}{res}{space 2}-.0074111{col 28}{space 2} .0269853{col 39}{space 1}   -0.27{col 48}{space 3}0.784{col 56}{space 4} -.060391{col 69}{space 3} .0455687
{txt}{space 11}KS  {c |}{col 16}{res}{space 2}-.0070817{col 28}{space 2} .0273556{col 39}{space 1}   -0.26{col 48}{space 3}0.796{col 56}{space 4}-.0607885{col 69}{space 3}  .046625
{txt}{space 11}KY  {c |}{col 16}{res}{space 2} .0151258{col 28}{space 2}  .033405{col 39}{space 1}    0.45{col 48}{space 3}0.651{col 56}{space 4}-.0504577{col 69}{space 3} .0807094
{txt}{space 11}LA  {c |}{col 16}{res}{space 2}-.0173775{col 28}{space 2} .0266738{col 39}{space 1}   -0.65{col 48}{space 3}0.515{col 56}{space 4}-.0697457{col 69}{space 3} .0349906
{txt}{space 11}MA  {c |}{col 16}{res}{space 2}-.0080712{col 28}{space 2} .0270096{col 39}{space 1}   -0.30{col 48}{space 3}0.765{col 56}{space 4}-.0610988{col 69}{space 3} .0449563
{txt}{space 11}MD  {c |}{col 16}{res}{space 2}-.0074587{col 28}{space 2} .0286033{col 39}{space 1}   -0.26{col 48}{space 3}0.794{col 56}{space 4}-.0636151{col 69}{space 3} .0486977
{txt}{space 11}ME  {c |}{col 16}{res}{space 2}-.0158274{col 28}{space 2} .0268409{col 39}{space 1}   -0.59{col 48}{space 3}0.556{col 56}{space 4}-.0685236{col 69}{space 3} .0368688
{txt}{space 11}MI  {c |}{col 16}{res}{space 2}-.0165043{col 28}{space 2} .0266634{col 39}{space 1}   -0.62{col 48}{space 3}0.536{col 56}{space 4}-.0688522{col 69}{space 3} .0358435
{txt}{space 11}MN  {c |}{col 16}{res}{space 2}-.0183784{col 28}{space 2} .0268355{col 39}{space 1}   -0.68{col 48}{space 3}0.494{col 56}{space 4} -.071064{col 69}{space 3} .0343072
{txt}{space 11}MO  {c |}{col 16}{res}{space 2}-.0122745{col 28}{space 2} .0269568{col 39}{space 1}   -0.46{col 48}{space 3}0.649{col 56}{space 4}-.0651982{col 69}{space 3} .0406493
{txt}{space 11}MS  {c |}{col 16}{res}{space 2}-.0239938{col 28}{space 2}  .026675{col 39}{space 1}   -0.90{col 48}{space 3}0.369{col 56}{space 4}-.0763645{col 69}{space 3} .0283768
{txt}{space 11}NC  {c |}{col 16}{res}{space 2}-.0097585{col 28}{space 2} .0271202{col 39}{space 1}   -0.36{col 48}{space 3}0.719{col 56}{space 4}-.0630032{col 69}{space 3} .0434862
{txt}{space 11}ND  {c |}{col 16}{res}{space 2}  .019723{col 28}{space 2} .0266301{col 39}{space 1}    0.74{col 48}{space 3}0.459{col 56}{space 4}-.0325595{col 69}{space 3} .0720055
{txt}{space 11}NE  {c |}{col 16}{res}{space 2} .0121201{col 28}{space 2} .0390817{col 39}{space 1}    0.31{col 48}{space 3}0.757{col 56}{space 4}-.0646083{col 69}{space 3} .0888485
{txt}{space 11}NH  {c |}{col 16}{res}{space 2}-.0209578{col 28}{space 2} .0267717{col 39}{space 1}   -0.78{col 48}{space 3}0.434{col 56}{space 4}-.0735182{col 69}{space 3} .0316027
{txt}{space 11}NJ  {c |}{col 16}{res}{space 2}-.0114283{col 28}{space 2} .0268289{col 39}{space 1}   -0.43{col 48}{space 3}0.670{col 56}{space 4} -.064101{col 69}{space 3} .0412444
{txt}{space 11}NY  {c |}{col 16}{res}{space 2}-.0136619{col 28}{space 2} .0266496{col 39}{space 1}   -0.51{col 48}{space 3}0.608{col 56}{space 4}-.0659825{col 69}{space 3} .0386588
{txt}{space 11}OH  {c |}{col 16}{res}{space 2}-.0177644{col 28}{space 2} .0265832{col 39}{space 1}   -0.67{col 48}{space 3}0.504{col 56}{space 4}-.0699548{col 69}{space 3}  .034426
{txt}{space 11}OK  {c |}{col 16}{res}{space 2}-.0018879{col 28}{space 2} .0298165{col 39}{space 1}   -0.06{col 48}{space 3}0.950{col 56}{space 4}-.0604262{col 69}{space 3} .0566504
{txt}{space 11}OR  {c |}{col 16}{res}{space 2}-.0090964{col 28}{space 2} .0273586{col 39}{space 1}   -0.33{col 48}{space 3}0.740{col 56}{space 4}-.0628091{col 69}{space 3} .0446163
{txt}{space 11}PA  {c |}{col 16}{res}{space 2}-.0098203{col 28}{space 2} .0266737{col 39}{space 1}   -0.37{col 48}{space 3}0.713{col 56}{space 4}-.0621884{col 69}{space 3} .0425478
{txt}{space 11}RI  {c |}{col 16}{res}{space 2}-.0230121{col 28}{space 2} .0268324{col 39}{space 1}   -0.86{col 48}{space 3}0.391{col 56}{space 4}-.0756917{col 69}{space 3} .0296675
{txt}{space 11}SC  {c |}{col 16}{res}{space 2} -.005681{col 28}{space 2} .0287459{col 39}{space 1}   -0.20{col 48}{space 3}0.843{col 56}{space 4}-.0621174{col 69}{space 3} .0507553
{txt}{space 11}SD  {c |}{col 16}{res}{space 2}  -.00945{col 28}{space 2} .0295488{col 39}{space 1}   -0.32{col 48}{space 3}0.749{col 56}{space 4}-.0674626{col 69}{space 3} .0485626
{txt}{space 11}TN  {c |}{col 16}{res}{space 2}-.0008308{col 28}{space 2} .0280789{col 39}{space 1}   -0.03{col 48}{space 3}0.976{col 56}{space 4}-.0559575{col 69}{space 3} .0542959
{txt}{space 11}TX  {c |}{col 16}{res}{space 2}-.0113384{col 28}{space 2} .0273401{col 39}{space 1}   -0.41{col 48}{space 3}0.678{col 56}{space 4}-.0650148{col 69}{space 3}  .042338
{txt}{space 11}UT  {c |}{col 16}{res}{space 2}-.0288869{col 28}{space 2} .0266239{col 39}{space 1}   -1.08{col 48}{space 3}0.278{col 56}{space 4}-.0811572{col 69}{space 3} .0233834
{txt}{space 11}VA  {c |}{col 16}{res}{space 2}-.0002804{col 28}{space 2} .0284173{col 39}{space 1}   -0.01{col 48}{space 3}0.992{col 56}{space 4}-.0560716{col 69}{space 3} .0555109
{txt}{space 11}VT  {c |}{col 16}{res}{space 2}-.0235929{col 28}{space 2} .0266206{col 39}{space 1}   -0.89{col 48}{space 3}0.376{col 56}{space 4}-.0758566{col 69}{space 3} .0286709
{txt}{space 11}WA  {c |}{col 16}{res}{space 2}-.0198589{col 28}{space 2} .0267553{col 39}{space 1}   -0.74{col 48}{space 3}0.458{col 56}{space 4}-.0723872{col 69}{space 3} .0326694
{txt}{space 11}WI  {c |}{col 16}{res}{space 2}-.0156039{col 28}{space 2} .0267935{col 39}{space 1}   -0.58{col 48}{space 3}0.560{col 56}{space 4}-.0682071{col 69}{space 3} .0369993
{txt}{space 11}WV  {c |}{col 16}{res}{space 2}-.0292177{col 28}{space 2}  .026259{col 39}{space 1}   -1.11{col 48}{space 3}0.266{col 56}{space 4}-.0807716{col 69}{space 3} .0223362
{txt}{space 14} {c |}
{space 8}gender {c |}
{space 7}female  {c |}{col 16}{res}{space 2} .0012688{col 28}{space 2} .0022091{col 39}{space 1}    0.57{col 48}{space 3}0.566{col 56}{space 4}-.0030684{col 69}{space 3} .0056059
{txt}{space 9}2.Q34 {c |}{col 16}{res}{space 2} .0031251{col 28}{space 2} .0075319{col 39}{space 1}    0.41{col 48}{space 3}0.678{col 56}{space 4}-.0116621{col 69}{space 3} .0179124
{txt}{space 9}Q35_1 {c |}{col 16}{res}{space 2} .0073788{col 28}{space 2} .0112768{col 39}{space 1}    0.65{col 48}{space 3}0.513{col 56}{space 4}-.0147608{col 69}{space 3} .0295183
{txt}{space 9}Q35_2 {c |}{col 16}{res}{space 2} .0094929{col 28}{space 2} .0112607{col 39}{space 1}    0.84{col 48}{space 3}0.400{col 56}{space 4} -.012615{col 69}{space 3} .0316008
{txt}{space 9}Q35_3 {c |}{col 16}{res}{space 2}-.0043129{col 28}{space 2} .0049289{col 39}{space 1}   -0.88{col 48}{space 3}0.382{col 56}{space 4}-.0139896{col 69}{space 3} .0053639
{txt}{space 9}Q35_4 {c |}{col 16}{res}{space 2} .0064545{col 28}{space 2} .0117812{col 39}{space 1}    0.55{col 48}{space 3}0.584{col 56}{space 4}-.0166753{col 69}{space 3} .0295844
{txt}{space 9}Q35_5 {c |}{col 16}{res}{space 2}-.0058594{col 28}{space 2} .0087854{col 39}{space 1}   -0.67{col 48}{space 3}0.505{col 56}{space 4}-.0231077{col 69}{space 3} .0113889
{txt}{space 9}Q35_6 {c |}{col 16}{res}{space 2}  .022859{col 28}{space 2}  .013799{col 39}{space 1}    1.66{col 48}{space 3}0.098{col 56}{space 4}-.0042324{col 69}{space 3} .0499503
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} .0457964{col 28}{space 2} .0366741{col 39}{space 1}    1.25{col 48}{space 3}0.212{col 56}{space 4}-.0262054{col 69}{space 3} .1177981
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est5{txt} stored)
{p 0 6 2}note: 2013.year omitted because of collinearity{p_end}

Linear regression                                      Number of obs ={res}     621
                                                       {help j_robustsingular:F( 54,   559) =}       .
                                                       {txt}Prob > F      = {res}      .
                                                       {txt}R-squared     = {res} 0.1297
                                                       {txt}Root MSE      = {res} .02317

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}        inciqr{col 16}{c |}      Coef.{col 28}   Std. Err.{col 40}      t{col 48}   P>|t|{col 56}     [95% Con{col 69}f. Interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age_g {c |}
{space 3}middle-age  {c |}{col 16}{res}{space 2}-.0049164{col 28}{space 2} .0041379{col 39}{space 1}   -1.19{col 48}{space 3}0.235{col 56}{space 4}-.0130442{col 69}{space 3} .0032113
{txt}{space 10}old  {c |}{col 16}{res}{space 2}-.0086429{col 28}{space 2} .0042013{col 39}{space 1}   -2.06{col 48}{space 3}0.040{col 56}{space 4}-.0168952{col 69}{space 3}-.0003906
{txt}{space 14} {c |}
{space 9}edu_g {c |}
{space 2}HS graduate  {c |}{col 16}{res}{space 2}-.0177877{col 28}{space 2} .0201732{col 39}{space 1}   -0.88{col 48}{space 3}0.378{col 56}{space 4}-.0574123{col 69}{space 3} .0218369
{txt}College/above  {c |}{col 16}{res}{space 2}-.0200373{col 28}{space 2} .0203558{col 39}{space 1}   -0.98{col 48}{space 3}0.325{col 56}{space 4}-.0600204{col 69}{space 3} .0199458
{txt}{space 14} {c |}
{space 7}HHinc_g {c |}
{space 5}high inc  {c |}{col 16}{res}{space 2}-.0023342{col 28}{space 2} .0024356{col 39}{space 1}   -0.96{col 48}{space 3}0.338{col 56}{space 4}-.0071182{col 69}{space 3} .0024497
{txt}{space 5}1.byear_g {c |}{col 16}{res}{space 2}  .003723{col 28}{space 2} .0048863{col 39}{space 1}    0.76{col 48}{space 3}0.446{col 56}{space 4}-.0058747{col 69}{space 3} .0133208
{txt}{space 14} {c |}
{space 10}year {c |}
{space 9}2013  {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 14} {c |}
{space 6}state_id {c |}
{space 11}AR  {c |}{col 16}{res}{space 2}-.0172957{col 28}{space 2}  .016101{col 39}{space 1}   -1.07{col 48}{space 3}0.283{col 56}{space 4}-.0489216{col 69}{space 3} .0143302
{txt}{space 11}AZ  {c |}{col 16}{res}{space 2}  .006111{col 28}{space 2} .0053164{col 39}{space 1}    1.15{col 48}{space 3}0.251{col 56}{space 4}-.0043315{col 69}{space 3} .0165535
{txt}{space 11}CA  {c |}{col 16}{res}{space 2} .0210459{col 28}{space 2} .0082889{col 39}{space 1}    2.54{col 48}{space 3}0.011{col 56}{space 4} .0047647{col 69}{space 3}  .037327
{txt}{space 11}CO  {c |}{col 16}{res}{space 2}  .004671{col 28}{space 2} .0089362{col 39}{space 1}    0.52{col 48}{space 3}0.601{col 56}{space 4}-.0128816{col 69}{space 3} .0222236
{txt}{space 11}CT  {c |}{col 16}{res}{space 2} .0159404{col 28}{space 2} .0064189{col 39}{space 1}    2.48{col 48}{space 3}0.013{col 56}{space 4} .0033323{col 69}{space 3} .0285485
{txt}{space 11}DC  {c |}{col 16}{res}{space 2} .0317484{col 28}{space 2} .0059266{col 39}{space 1}    5.36{col 48}{space 3}0.000{col 56}{space 4} .0201073{col 69}{space 3} .0433895
{txt}{space 11}DE  {c |}{col 16}{res}{space 2} .0165019{col 28}{space 2} .0071851{col 39}{space 1}    2.30{col 48}{space 3}0.022{col 56}{space 4} .0023889{col 69}{space 3} .0306149
{txt}{space 11}FL  {c |}{col 16}{res}{space 2} .0017864{col 28}{space 2} .0053436{col 39}{space 1}    0.33{col 48}{space 3}0.738{col 56}{space 4}-.0087097{col 69}{space 3} .0122824
{txt}{space 11}GA  {c |}{col 16}{res}{space 2}  .009532{col 28}{space 2} .0074531{col 39}{space 1}    1.28{col 48}{space 3}0.201{col 56}{space 4}-.0051076{col 69}{space 3} .0241715
{txt}{space 11}IA  {c |}{col 16}{res}{space 2}  .019268{col 28}{space 2} .0132947{col 39}{space 1}    1.45{col 48}{space 3}0.148{col 56}{space 4}-.0068455{col 69}{space 3} .0453816
{txt}{space 11}ID  {c |}{col 16}{res}{space 2} .0017581{col 28}{space 2} .0062423{col 39}{space 1}    0.28{col 48}{space 3}0.778{col 56}{space 4}-.0105032{col 69}{space 3} .0140193
{txt}{space 11}IL  {c |}{col 16}{res}{space 2}  .012957{col 28}{space 2} .0066139{col 39}{space 1}    1.96{col 48}{space 3}0.051{col 56}{space 4}-.0000341{col 69}{space 3} .0259481
{txt}{space 11}IN  {c |}{col 16}{res}{space 2} .0148044{col 28}{space 2} .0073354{col 39}{space 1}    2.02{col 48}{space 3}0.044{col 56}{space 4}  .000396{col 69}{space 3} .0292127
{txt}{space 11}KS  {c |}{col 16}{res}{space 2} .0181971{col 28}{space 2} .0088288{col 39}{space 1}    2.06{col 48}{space 3}0.040{col 56}{space 4} .0008555{col 69}{space 3} .0355388
{txt}{space 11}KY  {c |}{col 16}{res}{space 2} .0145805{col 28}{space 2} .0063569{col 39}{space 1}    2.29{col 48}{space 3}0.022{col 56}{space 4} .0020941{col 69}{space 3} .0270669
{txt}{space 11}LA  {c |}{col 16}{res}{space 2} .0072186{col 28}{space 2} .0058793{col 39}{space 1}    1.23{col 48}{space 3}0.220{col 56}{space 4}-.0043296{col 69}{space 3} .0187667
{txt}{space 11}MA  {c |}{col 16}{res}{space 2} .0077145{col 28}{space 2} .0060273{col 39}{space 1}    1.28{col 48}{space 3}0.201{col 56}{space 4}-.0041244{col 69}{space 3} .0195534
{txt}{space 11}MD  {c |}{col 16}{res}{space 2} .0260542{col 28}{space 2} .0140262{col 39}{space 1}    1.86{col 48}{space 3}0.064{col 56}{space 4}-.0014962{col 69}{space 3} .0536047
{txt}{space 11}ME  {c |}{col 16}{res}{space 2} .0045105{col 28}{space 2} .0061282{col 39}{space 1}    0.74{col 48}{space 3}0.462{col 56}{space 4}-.0075267{col 69}{space 3} .0165476
{txt}{space 11}MI  {c |}{col 16}{res}{space 2} .0090406{col 28}{space 2} .0056372{col 39}{space 1}    1.60{col 48}{space 3}0.109{col 56}{space 4} -.002032{col 69}{space 3} .0201132
{txt}{space 11}MN  {c |}{col 16}{res}{space 2} .0092132{col 28}{space 2} .0082059{col 39}{space 1}    1.12{col 48}{space 3}0.262{col 56}{space 4} -.006905{col 69}{space 3} .0253315
{txt}{space 11}MO  {c |}{col 16}{res}{space 2} .0108558{col 28}{space 2} .0062691{col 39}{space 1}    1.73{col 48}{space 3}0.084{col 56}{space 4}-.0014582{col 69}{space 3} .0231697
{txt}{space 11}MS  {c |}{col 16}{res}{space 2} .0020998{col 28}{space 2} .0052996{col 39}{space 1}    0.40{col 48}{space 3}0.692{col 56}{space 4}-.0083098{col 69}{space 3} .0125093
{txt}{space 11}NC  {c |}{col 16}{res}{space 2} .0108448{col 28}{space 2} .0057379{col 39}{space 1}    1.89{col 48}{space 3}0.059{col 56}{space 4}-.0004257{col 69}{space 3} .0221152
{txt}{space 11}ND  {c |}{col 16}{res}{space 2} .0461869{col 28}{space 2} .0064142{col 39}{space 1}    7.20{col 48}{space 3}0.000{col 56}{space 4} .0335879{col 69}{space 3} .0587858
{txt}{space 11}NE  {c |}{col 16}{res}{space 2} .0408734{col 28}{space 2} .0262455{col 39}{space 1}    1.56{col 48}{space 3}0.120{col 56}{space 4}-.0106785{col 69}{space 3} .0924253
{txt}{space 11}NH  {c |}{col 16}{res}{space 2} .0101109{col 28}{space 2} .0065302{col 39}{space 1}    1.55{col 48}{space 3}0.122{col 56}{space 4}-.0027158{col 69}{space 3} .0229376
{txt}{space 11}NJ  {c |}{col 16}{res}{space 2} .0093339{col 28}{space 2} .0058111{col 39}{space 1}    1.61{col 48}{space 3}0.109{col 56}{space 4}-.0020804{col 69}{space 3} .0207482
{txt}{space 11}NY  {c |}{col 16}{res}{space 2} .0113165{col 28}{space 2} .0057002{col 39}{space 1}    1.99{col 48}{space 3}0.048{col 56}{space 4} .0001201{col 69}{space 3} .0225129
{txt}{space 11}OH  {c |}{col 16}{res}{space 2} .0080179{col 28}{space 2} .0053115{col 39}{space 1}    1.51{col 48}{space 3}0.132{col 56}{space 4}-.0024152{col 69}{space 3} .0184509
{txt}{space 11}OK  {c |}{col 16}{res}{space 2} .0019547{col 28}{space 2} .0086732{col 39}{space 1}    0.23{col 48}{space 3}0.822{col 56}{space 4}-.0150812{col 69}{space 3} .0189907
{txt}{space 11}OR  {c |}{col 16}{res}{space 2} .0228682{col 28}{space 2}   .00854{col 39}{space 1}    2.68{col 48}{space 3}0.008{col 56}{space 4} .0060938{col 69}{space 3} .0396426
{txt}{space 11}PA  {c |}{col 16}{res}{space 2} .0134858{col 28}{space 2} .0058412{col 39}{space 1}    2.31{col 48}{space 3}0.021{col 56}{space 4} .0020123{col 69}{space 3} .0249592
{txt}{space 11}RI  {c |}{col 16}{res}{space 2} .0024059{col 28}{space 2} .0067696{col 39}{space 1}    0.36{col 48}{space 3}0.722{col 56}{space 4}-.0108911{col 69}{space 3} .0157029
{txt}{space 11}SC  {c |}{col 16}{res}{space 2} .0196973{col 28}{space 2} .0160854{col 39}{space 1}    1.22{col 48}{space 3}0.221{col 56}{space 4}-.0118979{col 69}{space 3} .0512926
{txt}{space 11}SD  {c |}{col 16}{res}{space 2} .0027934{col 28}{space 2}  .006863{col 39}{space 1}    0.41{col 48}{space 3}0.684{col 56}{space 4}-.0106871{col 69}{space 3} .0162739
{txt}{space 11}TN  {c |}{col 16}{res}{space 2} .0150143{col 28}{space 2} .0084447{col 39}{space 1}    1.78{col 48}{space 3}0.076{col 56}{space 4} -.001573{col 69}{space 3} .0316016
{txt}{space 11}TX  {c |}{col 16}{res}{space 2} .0212775{col 28}{space 2} .0092974{col 39}{space 1}    2.29{col 48}{space 3}0.022{col 56}{space 4} .0030154{col 69}{space 3} .0395396
{txt}{space 11}VA  {c |}{col 16}{res}{space 2} .0243695{col 28}{space 2} .0114029{col 39}{space 1}    2.14{col 48}{space 3}0.033{col 56}{space 4} .0019717{col 69}{space 3} .0467673
{txt}{space 11}VT  {c |}{col 16}{res}{space 2} .0032733{col 28}{space 2} .0051353{col 39}{space 1}    0.64{col 48}{space 3}0.524{col 56}{space 4}-.0068135{col 69}{space 3} .0133601
{txt}{space 11}WA  {c |}{col 16}{res}{space 2} .0056198{col 28}{space 2} .0084545{col 39}{space 1}    0.66{col 48}{space 3}0.507{col 56}{space 4}-.0109866{col 69}{space 3} .0222262
{txt}{space 11}WI  {c |}{col 16}{res}{space 2} .0126602{col 28}{space 2} .0060158{col 39}{space 1}    2.10{col 48}{space 3}0.036{col 56}{space 4} .0008437{col 69}{space 3} .0244766
{txt}{space 11}WV  {c |}{col 16}{res}{space 2}-.0012059{col 28}{space 2} .0052582{col 39}{space 1}   -0.23{col 48}{space 3}0.819{col 56}{space 4} -.011534{col 69}{space 3} .0091223
{txt}{space 14} {c |}
{space 8}gender {c |}
{space 7}female  {c |}{col 16}{res}{space 2}-.0024357{col 28}{space 2} .0022349{col 39}{space 1}   -1.09{col 48}{space 3}0.276{col 56}{space 4}-.0068255{col 69}{space 3}  .001954
{txt}{space 9}2.Q34 {c |}{col 16}{res}{space 2} .0077431{col 28}{space 2} .0087871{col 39}{space 1}    0.88{col 48}{space 3}0.379{col 56}{space 4}-.0095167{col 69}{space 3} .0250029
{txt}{space 9}Q35_1 {c |}{col 16}{res}{space 2}-.0003949{col 28}{space 2}  .011882{col 39}{space 1}   -0.03{col 48}{space 3}0.973{col 56}{space 4}-.0237337{col 69}{space 3} .0229438
{txt}{space 9}Q35_2 {c |}{col 16}{res}{space 2}  .002986{col 28}{space 2} .0116529{col 39}{space 1}    0.26{col 48}{space 3}0.798{col 56}{space 4}-.0199029{col 69}{space 3} .0258749
{txt}{space 9}Q35_3 {c |}{col 16}{res}{space 2} .0022368{col 28}{space 2} .0038405{col 39}{space 1}    0.58{col 48}{space 3}0.561{col 56}{space 4}-.0053067{col 69}{space 3} .0097803
{txt}{space 9}Q35_4 {c |}{col 16}{res}{space 2} .0014434{col 28}{space 2} .0123353{col 39}{space 1}    0.12{col 48}{space 3}0.907{col 56}{space 4}-.0227858{col 69}{space 3} .0256726
{txt}{space 9}Q35_5 {c |}{col 16}{res}{space 2}-.0096625{col 28}{space 2} .0063398{col 39}{space 1}   -1.52{col 48}{space 3}0.128{col 56}{space 4}-.0221152{col 69}{space 3} .0027902
{txt}{space 9}Q35_6 {c |}{col 16}{res}{space 2} .0212089{col 28}{space 2} .0138673{col 39}{space 1}    1.53{col 48}{space 3}0.127{col 56}{space 4}-.0060295{col 69}{space 3} .0484473
{txt}{space 5}UEprobAgg {c |}{col 16}{res}{space 2}-.0000482{col 28}{space 2} .0000432{col 39}{space 1}   -1.12{col 48}{space 3}0.265{col 56}{space 4} -.000133{col 69}{space 3} .0000366
{txt}{space 7}Stkprob {c |}{col 16}{res}{space 2} .0000692{col 28}{space 2} .0000501{col 39}{space 1}    1.38{col 48}{space 3}0.168{col 56}{space 4}-.0000293{col 69}{space 3} .0001677
{txt}{space 7}Q9_mean {c |}{col 16}{res}{space 2}-.0090767{col 28}{space 2} .0562417{col 39}{space 1}   -0.16{col 48}{space 3}0.872{col 56}{space 4}-.1195476{col 69}{space 3} .1013942
{txt}{space 5}UEprobInd {c |}{col 16}{res}{space 2} .0000901{col 28}{space 2} .0000669{col 39}{space 1}    1.35{col 48}{space 3}0.179{col 56}{space 4}-.0000414{col 69}{space 3} .0002215
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} .0266859{col 28}{space 2} .0263518{col 39}{space 1}    1.01{col 48}{space 3}0.312{col 56}{space 4}-.0250748{col 69}{space 3} .0784466
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est6{txt} stored)

Linear regression                                      Number of obs ={res}   50416
                                                       {txt}F( 63, 50352) ={res}   17.27
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0218
                                                       {txt}Root MSE      = {res} .02223

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}       incmean{col 16}{c |}      Coef.{col 28}   Std. Err.{col 40}      t{col 48}   P>|t|{col 56}     [95% Con{col 69}f. Interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age_g {c |}
{space 3}middle-age  {c |}{col 16}{res}{space 2}-.0013246{col 28}{space 2} .0004749{col 39}{space 1}   -2.79{col 48}{space 3}0.005{col 56}{space 4}-.0022553{col 69}{space 3}-.0003938
{txt}{space 10}old  {c |}{col 16}{res}{space 2}-.0021568{col 28}{space 2} .0004952{col 39}{space 1}   -4.36{col 48}{space 3}0.000{col 56}{space 4}-.0031273{col 69}{space 3}-.0011863
{txt}{space 14} {c |}
{space 9}edu_g {c |}
{space 2}HS graduate  {c |}{col 16}{res}{space 2} .0035097{col 28}{space 2}   .00139{col 39}{space 1}    2.52{col 48}{space 3}0.012{col 56}{space 4} .0007852{col 69}{space 3} .0062342
{txt}College/above  {c |}{col 16}{res}{space 2} .0048135{col 28}{space 2}  .001387{col 39}{space 1}    3.47{col 48}{space 3}0.001{col 56}{space 4}  .002095{col 69}{space 3}  .007532
{txt}{space 14} {c |}
{space 7}HHinc_g {c |}
{space 5}high inc  {c |}{col 16}{res}{space 2} .0022065{col 28}{space 2} .0002238{col 39}{space 1}    9.86{col 48}{space 3}0.000{col 56}{space 4} .0017679{col 69}{space 3} .0026451
{txt}{space 5}1.byear_g {c |}{col 16}{res}{space 2} .0033012{col 28}{space 2}  .000487{col 39}{space 1}    6.78{col 48}{space 3}0.000{col 56}{space 4} .0023467{col 69}{space 3} .0042556
{txt}{space 14} {c |}
{space 10}year {c |}
{space 9}2014  {c |}{col 16}{res}{space 2} .0015525{col 28}{space 2} .0004291{col 39}{space 1}    3.62{col 48}{space 3}0.000{col 56}{space 4} .0007114{col 69}{space 3} .0023936
{txt}{space 9}2015  {c |}{col 16}{res}{space 2} .0020356{col 28}{space 2} .0004291{col 39}{space 1}    4.74{col 48}{space 3}0.000{col 56}{space 4} .0011946{col 69}{space 3} .0028767
{txt}{space 9}2016  {c |}{col 16}{res}{space 2} .0003664{col 28}{space 2} .0004184{col 39}{space 1}    0.88{col 48}{space 3}0.381{col 56}{space 4}-.0004536{col 69}{space 3} .0011864
{txt}{space 9}2017  {c |}{col 16}{res}{space 2} .0009749{col 28}{space 2} .0004159{col 39}{space 1}    2.34{col 48}{space 3}0.019{col 56}{space 4} .0001597{col 69}{space 3} .0017902
{txt}{space 9}2018  {c |}{col 16}{res}{space 2} .0013212{col 28}{space 2} .0004203{col 39}{space 1}    3.14{col 48}{space 3}0.002{col 56}{space 4} .0004973{col 69}{space 3} .0021451
{txt}{space 9}2019  {c |}{col 16}{res}{space 2} .0005012{col 28}{space 2} .0004198{col 39}{space 1}    1.19{col 48}{space 3}0.232{col 56}{space 4}-.0003215{col 69}{space 3}  .001324
{txt}{space 9}2020  {c |}{col 16}{res}{space 2} .0011306{col 28}{space 2} .0008984{col 39}{space 1}    1.26{col 48}{space 3}0.208{col 56}{space 4}-.0006303{col 69}{space 3} .0028915
{txt}{space 14} {c |}
{space 6}state_id {c |}
{space 11}AL  {c |}{col 16}{res}{space 2} -.008897{col 28}{space 2} .0036827{col 39}{space 1}   -2.42{col 48}{space 3}0.016{col 56}{space 4}-.0161151{col 69}{space 3}-.0016789
{txt}{space 11}AR  {c |}{col 16}{res}{space 2}-.0080403{col 28}{space 2} .0037413{col 39}{space 1}   -2.15{col 48}{space 3}0.032{col 56}{space 4}-.0153733{col 69}{space 3}-.0007074
{txt}{space 11}AZ  {c |}{col 16}{res}{space 2}-.0055106{col 28}{space 2} .0036681{col 39}{space 1}   -1.50{col 48}{space 3}0.133{col 56}{space 4}   -.0127{col 69}{space 3} .0016789
{txt}{space 11}CA  {c |}{col 16}{res}{space 2}-.0052826{col 28}{space 2}  .003604{col 39}{space 1}   -1.47{col 48}{space 3}0.143{col 56}{space 4}-.0123464{col 69}{space 3} .0017812
{txt}{space 11}CO  {c |}{col 16}{res}{space 2}-.0073559{col 28}{space 2} .0036393{col 39}{space 1}   -2.02{col 48}{space 3}0.043{col 56}{space 4}-.0144889{col 69}{space 3}-.0002228
{txt}{space 11}CT  {c |}{col 16}{res}{space 2}-.0089845{col 28}{space 2} .0036938{col 39}{space 1}   -2.43{col 48}{space 3}0.015{col 56}{space 4}-.0162243{col 69}{space 3}-.0017447
{txt}{space 11}DC  {c |}{col 16}{res}{space 2} -.005399{col 28}{space 2} .0040491{col 39}{space 1}   -1.33{col 48}{space 3}0.182{col 56}{space 4}-.0133354{col 69}{space 3} .0025373
{txt}{space 11}DE  {c |}{col 16}{res}{space 2} -.011462{col 28}{space 2} .0040345{col 39}{space 1}   -2.84{col 48}{space 3}0.004{col 56}{space 4}-.0193697{col 69}{space 3}-.0035543
{txt}{space 11}FL  {c |}{col 16}{res}{space 2}-.0059591{col 28}{space 2} .0036135{col 39}{space 1}   -1.65{col 48}{space 3}0.099{col 56}{space 4}-.0130416{col 69}{space 3} .0011234
{txt}{space 11}GA  {c |}{col 16}{res}{space 2}-.0086586{col 28}{space 2} .0036351{col 39}{space 1}   -2.38{col 48}{space 3}0.017{col 56}{space 4}-.0157835{col 69}{space 3}-.0015337
{txt}{space 11}HI  {c |}{col 16}{res}{space 2}-.0045989{col 28}{space 2} .0044445{col 39}{space 1}   -1.03{col 48}{space 3}0.301{col 56}{space 4}-.0133102{col 69}{space 3} .0041123
{txt}{space 11}IA  {c |}{col 16}{res}{space 2}-.0096251{col 28}{space 2} .0036564{col 39}{space 1}   -2.63{col 48}{space 3}0.008{col 56}{space 4}-.0167918{col 69}{space 3}-.0024584
{txt}{space 11}ID  {c |}{col 16}{res}{space 2}-.0062933{col 28}{space 2}  .003826{col 39}{space 1}   -1.64{col 48}{space 3}0.100{col 56}{space 4}-.0137922{col 69}{space 3} .0012057
{txt}{space 11}IL  {c |}{col 16}{res}{space 2}-.0072505{col 28}{space 2} .0036153{col 39}{space 1}   -2.01{col 48}{space 3}0.045{col 56}{space 4}-.0143365{col 69}{space 3}-.0001645
{txt}{space 11}IN  {c |}{col 16}{res}{space 2}-.0093063{col 28}{space 2} .0036461{col 39}{space 1}   -2.55{col 48}{space 3}0.011{col 56}{space 4}-.0164527{col 69}{space 3}-.0021598
{txt}{space 11}KS  {c |}{col 16}{res}{space 2}-.0094691{col 28}{space 2} .0037059{col 39}{space 1}   -2.56{col 48}{space 3}0.011{col 56}{space 4}-.0167329{col 69}{space 3}-.0022054
{txt}{space 11}KY  {c |}{col 16}{res}{space 2}-.0083641{col 28}{space 2} .0037107{col 39}{space 1}   -2.25{col 48}{space 3}0.024{col 56}{space 4}-.0156372{col 69}{space 3}-.0010911
{txt}{space 11}LA  {c |}{col 16}{res}{space 2} -.008366{col 28}{space 2} .0037255{col 39}{space 1}   -2.25{col 48}{space 3}0.025{col 56}{space 4}-.0156681{col 69}{space 3}-.0010639
{txt}{space 11}MA  {c |}{col 16}{res}{space 2}-.0064326{col 28}{space 2} .0036351{col 39}{space 1}   -1.77{col 48}{space 3}0.077{col 56}{space 4}-.0135574{col 69}{space 3} .0006923
{txt}{space 11}MD  {c |}{col 16}{res}{space 2}-.0072176{col 28}{space 2} .0036595{col 39}{space 1}   -1.97{col 48}{space 3}0.049{col 56}{space 4}-.0143902{col 69}{space 3} -.000045
{txt}{space 11}ME  {c |}{col 16}{res}{space 2}-.0114088{col 28}{space 2} .0037754{col 39}{space 1}   -3.02{col 48}{space 3}0.003{col 56}{space 4}-.0188087{col 69}{space 3}-.0040089
{txt}{space 11}MI  {c |}{col 16}{res}{space 2}-.0087192{col 28}{space 2} .0036233{col 39}{space 1}   -2.41{col 48}{space 3}0.016{col 56}{space 4}-.0158209{col 69}{space 3}-.0016175
{txt}{space 11}MN  {c |}{col 16}{res}{space 2}-.0095611{col 28}{space 2} .0036263{col 39}{space 1}   -2.64{col 48}{space 3}0.008{col 56}{space 4}-.0166686{col 69}{space 3}-.0024535
{txt}{space 11}MO  {c |}{col 16}{res}{space 2} -.011098{col 28}{space 2}  .003635{col 39}{space 1}   -3.05{col 48}{space 3}0.002{col 56}{space 4}-.0182226{col 69}{space 3}-.0039733
{txt}{space 11}MS  {c |}{col 16}{res}{space 2}-.0100196{col 28}{space 2} .0038155{col 39}{space 1}   -2.63{col 48}{space 3}0.009{col 56}{space 4} -.017498{col 69}{space 3}-.0025412
{txt}{space 11}MT  {c |}{col 16}{res}{space 2}-.0057479{col 28}{space 2} .0040656{col 39}{space 1}   -1.41{col 48}{space 3}0.157{col 56}{space 4}-.0137165{col 69}{space 3} .0022208
{txt}{space 11}NC  {c |}{col 16}{res}{space 2}-.0070643{col 28}{space 2}   .00363{col 39}{space 1}   -1.95{col 48}{space 3}0.052{col 56}{space 4}-.0141793{col 69}{space 3} .0000506
{txt}{space 11}ND  {c |}{col 16}{res}{space 2}-.0131619{col 28}{space 2} .0038297{col 39}{space 1}   -3.44{col 48}{space 3}0.001{col 56}{space 4}-.0206681{col 69}{space 3}-.0056556
{txt}{space 11}NE  {c |}{col 16}{res}{space 2}-.0074424{col 28}{space 2} .0037667{col 39}{space 1}   -1.98{col 48}{space 3}0.048{col 56}{space 4}-.0148251{col 69}{space 3}-.0000597
{txt}{space 11}NH  {c |}{col 16}{res}{space 2}-.0109075{col 28}{space 2} .0037635{col 39}{space 1}   -2.90{col 48}{space 3}0.004{col 56}{space 4} -.018284{col 69}{space 3} -.003531
{txt}{space 11}NJ  {c |}{col 16}{res}{space 2}-.0070498{col 28}{space 2} .0036299{col 39}{space 1}   -1.94{col 48}{space 3}0.052{col 56}{space 4}-.0141644{col 69}{space 3} .0000648
{txt}{space 11}NM  {c |}{col 16}{res}{space 2}-.0121517{col 28}{space 2} .0038819{col 39}{space 1}   -3.13{col 48}{space 3}0.002{col 56}{space 4}-.0197603{col 69}{space 3}-.0045431
{txt}{space 11}NV  {c |}{col 16}{res}{space 2}-.0023523{col 28}{space 2} .0038362{col 39}{space 1}   -0.61{col 48}{space 3}0.540{col 56}{space 4}-.0098714{col 69}{space 3} .0051667
{txt}{space 11}NY  {c |}{col 16}{res}{space 2}-.0067319{col 28}{space 2} .0036135{col 39}{space 1}   -1.86{col 48}{space 3}0.062{col 56}{space 4}-.0138144{col 69}{space 3} .0003507
{txt}{space 11}OH  {c |}{col 16}{res}{space 2} -.007485{col 28}{space 2} .0036153{col 39}{space 1}   -2.07{col 48}{space 3}0.038{col 56}{space 4} -.014571{col 69}{space 3} -.000399
{txt}{space 11}OK  {c |}{col 16}{res}{space 2}-.0065466{col 28}{space 2} .0037396{col 39}{space 1}   -1.75{col 48}{space 3}0.080{col 56}{space 4}-.0138763{col 69}{space 3} .0007831
{txt}{space 11}OR  {c |}{col 16}{res}{space 2}-.0068613{col 28}{space 2} .0036588{col 39}{space 1}   -1.88{col 48}{space 3}0.061{col 56}{space 4}-.0140326{col 69}{space 3}   .00031
{txt}{space 11}PA  {c |}{col 16}{res}{space 2}-.0087121{col 28}{space 2} .0036039{col 39}{space 1}   -2.42{col 48}{space 3}0.016{col 56}{space 4}-.0157758{col 69}{space 3}-.0016483
{txt}{space 11}RI  {c |}{col 16}{res}{space 2}-.0117443{col 28}{space 2}  .003836{col 39}{space 1}   -3.06{col 48}{space 3}0.002{col 56}{space 4} -.019263{col 69}{space 3}-.0042257
{txt}{space 11}SC  {c |}{col 16}{res}{space 2}-.0060712{col 28}{space 2} .0037247{col 39}{space 1}   -1.63{col 48}{space 3}0.103{col 56}{space 4}-.0133717{col 69}{space 3} .0012292
{txt}{space 11}SD  {c |}{col 16}{res}{space 2} .0022623{col 28}{space 2} .0040763{col 39}{space 1}    0.55{col 48}{space 3}0.579{col 56}{space 4}-.0057273{col 69}{space 3} .0102518
{txt}{space 11}TN  {c |}{col 16}{res}{space 2}-.0089546{col 28}{space 2} .0036561{col 39}{space 1}   -2.45{col 48}{space 3}0.014{col 56}{space 4}-.0161206{col 69}{space 3}-.0017887
{txt}{space 11}TX  {c |}{col 16}{res}{space 2}-.0060698{col 28}{space 2} .0036066{col 39}{space 1}   -1.68{col 48}{space 3}0.092{col 56}{space 4}-.0131388{col 69}{space 3} .0009992
{txt}{space 11}UT  {c |}{col 16}{res}{space 2} -.007156{col 28}{space 2} .0037222{col 39}{space 1}   -1.92{col 48}{space 3}0.055{col 56}{space 4}-.0144515{col 69}{space 3} .0001395
{txt}{space 11}VA  {c |}{col 16}{res}{space 2}-.0075417{col 28}{space 2} .0036331{col 39}{space 1}   -2.08{col 48}{space 3}0.038{col 56}{space 4}-.0146625{col 69}{space 3}-.0004208
{txt}{space 11}VT  {c |}{col 16}{res}{space 2} -.007625{col 28}{space 2} .0040209{col 39}{space 1}   -1.90{col 48}{space 3}0.058{col 56}{space 4} -.015506{col 69}{space 3} .0002561
{txt}{space 11}WA  {c |}{col 16}{res}{space 2}-.0080474{col 28}{space 2} .0036287{col 39}{space 1}   -2.22{col 48}{space 3}0.027{col 56}{space 4}-.0151596{col 69}{space 3}-.0009351
{txt}{space 11}WI  {c |}{col 16}{res}{space 2}-.0086385{col 28}{space 2} .0036477{col 39}{space 1}   -2.37{col 48}{space 3}0.018{col 56}{space 4} -.015788{col 69}{space 3}-.0014889
{txt}{space 11}WV  {c |}{col 16}{res}{space 2}-.0120605{col 28}{space 2} .0039395{col 39}{space 1}   -3.06{col 48}{space 3}0.002{col 56}{space 4}-.0197819{col 69}{space 3}-.0043391
{txt}{space 11}WY  {c |}{col 16}{res}{space 2}-.0111758{col 28}{space 2}  .004193{col 39}{space 1}   -2.67{col 48}{space 3}0.008{col 56}{space 4}-.0193941{col 69}{space 3}-.0029574
{txt}{space 14} {c |}
{space 9}_cons {c |}{col 16}{res}{space 2} .0291631{col 28}{space 2} .0038793{col 39}{space 1}    7.52{col 48}{space 3}0.000{col 56}{space 4} .0215597{col 69}{space 3} .0367665
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est7{txt} stored)
{p 0 6 2}note: 2013.year omitted because of collinearity{p_end}

Linear regression                                      Number of obs ={res}     681
                                                       {help j_robustsingular:F( 52,   622) =}       .
                                                       {txt}Prob > F      = {res}      .
                                                       {txt}R-squared     = {res} 0.1087
                                                       {txt}Root MSE      = {res} .02195

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}       incmean{col 16}{c |}      Coef.{col 28}   Std. Err.{col 40}      t{col 48}   P>|t|{col 56}     [95% Con{col 69}f. Interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age_g {c |}
{space 3}middle-age  {c |}{col 16}{res}{space 2}-.0028632{col 28}{space 2} .0031452{col 39}{space 1}   -0.91{col 48}{space 3}0.363{col 56}{space 4}-.0090396{col 69}{space 3} .0033133
{txt}{space 10}old  {c |}{col 16}{res}{space 2} -.003672{col 28}{space 2} .0031966{col 39}{space 1}   -1.15{col 48}{space 3}0.251{col 56}{space 4}-.0099494{col 69}{space 3} .0026054
{txt}{space 14} {c |}
{space 9}edu_g {c |}
{space 2}HS graduate  {c |}{col 16}{res}{space 2} .0108905{col 28}{space 2} .0105081{col 39}{space 1}    1.04{col 48}{space 3}0.300{col 56}{space 4}-.0097452{col 69}{space 3} .0315262
{txt}College/above  {c |}{col 16}{res}{space 2} .0121974{col 28}{space 2} .0104221{col 39}{space 1}    1.17{col 48}{space 3}0.242{col 56}{space 4}-.0082693{col 69}{space 3} .0326641
{txt}{space 14} {c |}
{space 7}HHinc_g {c |}
{space 5}high inc  {c |}{col 16}{res}{space 2} .0007989{col 28}{space 2} .0019979{col 39}{space 1}    0.40{col 48}{space 3}0.689{col 56}{space 4}-.0031245{col 69}{space 3} .0047224
{txt}{space 5}1.byear_g {c |}{col 16}{res}{space 2}  .005315{col 28}{space 2} .0037042{col 39}{space 1}    1.43{col 48}{space 3}0.152{col 56}{space 4}-.0019593{col 69}{space 3} .0125892
{txt}{space 14} {c |}
{space 10}year {c |}
{space 9}2013  {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 14} {c |}
{space 6}state_id {c |}
{space 11}AR  {c |}{col 16}{res}{space 2} .0091555{col 28}{space 2} .0091713{col 39}{space 1}    1.00{col 48}{space 3}0.319{col 56}{space 4} -.008855{col 69}{space 3}  .027166
{txt}{space 11}AZ  {c |}{col 16}{res}{space 2} .0010631{col 28}{space 2} .0087911{col 39}{space 1}    0.12{col 48}{space 3}0.904{col 56}{space 4}-.0162008{col 69}{space 3} .0183269
{txt}{space 11}CA  {c |}{col 16}{res}{space 2} .0133288{col 28}{space 2} .0087055{col 39}{space 1}    1.53{col 48}{space 3}0.126{col 56}{space 4}-.0037668{col 69}{space 3} .0304245
{txt}{space 11}CO  {c |}{col 16}{res}{space 2} .0126228{col 28}{space 2} .0076917{col 39}{space 1}    1.64{col 48}{space 3}0.101{col 56}{space 4}-.0024821{col 69}{space 3} .0277276
{txt}{space 11}CT  {c |}{col 16}{res}{space 2} .0199068{col 28}{space 2} .0092944{col 39}{space 1}    2.14{col 48}{space 3}0.033{col 56}{space 4} .0016546{col 69}{space 3}  .038159
{txt}{space 11}DC  {c |}{col 16}{res}{space 2} -.004619{col 28}{space 2} .0064767{col 39}{space 1}   -0.71{col 48}{space 3}0.476{col 56}{space 4}-.0173378{col 69}{space 3} .0080998
{txt}{space 11}DE  {c |}{col 16}{res}{space 2} .0234034{col 28}{space 2} .0161864{col 39}{space 1}    1.45{col 48}{space 3}0.149{col 56}{space 4}-.0083831{col 69}{space 3}   .05519
{txt}{space 11}FL  {c |}{col 16}{res}{space 2} .0040844{col 28}{space 2} .0081984{col 39}{space 1}    0.50{col 48}{space 3}0.619{col 56}{space 4}-.0120156{col 69}{space 3} .0201843
{txt}{space 11}GA  {c |}{col 16}{res}{space 2} .0090209{col 28}{space 2} .0089185{col 39}{space 1}    1.01{col 48}{space 3}0.312{col 56}{space 4}-.0084931{col 69}{space 3} .0265349
{txt}{space 11}IA  {c |}{col 16}{res}{space 2} .0038591{col 28}{space 2} .0065481{col 39}{space 1}    0.59{col 48}{space 3}0.556{col 56}{space 4}-.0089999{col 69}{space 3} .0167181
{txt}{space 11}ID  {c |}{col 16}{res}{space 2} .0228377{col 28}{space 2} .0183544{col 39}{space 1}    1.24{col 48}{space 3}0.214{col 56}{space 4}-.0132063{col 69}{space 3} .0588818
{txt}{space 11}IL  {c |}{col 16}{res}{space 2} .0143176{col 28}{space 2} .0071227{col 39}{space 1}    2.01{col 48}{space 3}0.045{col 56}{space 4} .0003302{col 69}{space 3}  .028305
{txt}{space 11}IN  {c |}{col 16}{res}{space 2} .0101231{col 28}{space 2} .0068993{col 39}{space 1}    1.47{col 48}{space 3}0.143{col 56}{space 4}-.0034256{col 69}{space 3} .0236718
{txt}{space 11}KS  {c |}{col 16}{res}{space 2}-.0010594{col 28}{space 2} .0076581{col 39}{space 1}   -0.14{col 48}{space 3}0.890{col 56}{space 4}-.0160983{col 69}{space 3} .0139795
{txt}{space 11}KY  {c |}{col 16}{res}{space 2}-.0060109{col 28}{space 2} .0090077{col 39}{space 1}   -0.67{col 48}{space 3}0.505{col 56}{space 4}-.0237002{col 69}{space 3} .0116783
{txt}{space 11}LA  {c |}{col 16}{res}{space 2}  .007165{col 28}{space 2} .0064296{col 39}{space 1}    1.11{col 48}{space 3}0.266{col 56}{space 4}-.0054613{col 69}{space 3} .0197913
{txt}{space 11}MA  {c |}{col 16}{res}{space 2}  .012488{col 28}{space 2} .0072738{col 39}{space 1}    1.72{col 48}{space 3}0.087{col 56}{space 4}-.0017962{col 69}{space 3} .0267722
{txt}{space 11}MD  {c |}{col 16}{res}{space 2} .0070347{col 28}{space 2} .0074189{col 39}{space 1}    0.95{col 48}{space 3}0.343{col 56}{space 4}-.0075344{col 69}{space 3} .0216038
{txt}{space 11}ME  {c |}{col 16}{res}{space 2} .0205768{col 28}{space 2} .0129662{col 39}{space 1}    1.59{col 48}{space 3}0.113{col 56}{space 4} -.004886{col 69}{space 3} .0460396
{txt}{space 11}MI  {c |}{col 16}{res}{space 2} .0050706{col 28}{space 2} .0067034{col 39}{space 1}    0.76{col 48}{space 3}0.450{col 56}{space 4}-.0080934{col 69}{space 3} .0182345
{txt}{space 11}MN  {c |}{col 16}{res}{space 2}   .00518{col 28}{space 2} .0087095{col 39}{space 1}    0.59{col 48}{space 3}0.552{col 56}{space 4}-.0119236{col 69}{space 3} .0222836
{txt}{space 11}MO  {c |}{col 16}{res}{space 2} .0097986{col 28}{space 2} .0089448{col 39}{space 1}    1.10{col 48}{space 3}0.274{col 56}{space 4}-.0077672{col 69}{space 3} .0273644
{txt}{space 11}MS  {c |}{col 16}{res}{space 2} .0010581{col 28}{space 2} .0063599{col 39}{space 1}    0.17{col 48}{space 3}0.868{col 56}{space 4}-.0114313{col 69}{space 3} .0135475
{txt}{space 11}NC  {c |}{col 16}{res}{space 2} .0112262{col 28}{space 2} .0085073{col 39}{space 1}    1.32{col 48}{space 3}0.187{col 56}{space 4}-.0054804{col 69}{space 3} .0279328
{txt}{space 11}ND  {c |}{col 16}{res}{space 2} .0432874{col 28}{space 2} .0068305{col 39}{space 1}    6.34{col 48}{space 3}0.000{col 56}{space 4} .0298739{col 69}{space 3}  .056701
{txt}{space 11}NE  {c |}{col 16}{res}{space 2}-.0113348{col 28}{space 2} .0084155{col 39}{space 1}   -1.35{col 48}{space 3}0.179{col 56}{space 4}-.0278611{col 69}{space 3} .0051915
{txt}{space 11}NH  {c |}{col 16}{res}{space 2} .0028704{col 28}{space 2} .0067691{col 39}{space 1}    0.42{col 48}{space 3}0.672{col 56}{space 4}-.0104226{col 69}{space 3} .0161635
{txt}{space 11}NJ  {c |}{col 16}{res}{space 2} .0077795{col 28}{space 2} .0066195{col 39}{space 1}    1.18{col 48}{space 3}0.240{col 56}{space 4}-.0052198{col 69}{space 3} .0207787
{txt}{space 11}NY  {c |}{col 16}{res}{space 2} .0100222{col 28}{space 2} .0065159{col 39}{space 1}    1.54{col 48}{space 3}0.125{col 56}{space 4}-.0027735{col 69}{space 3} .0228179
{txt}{space 11}OH  {c |}{col 16}{res}{space 2} .0106439{col 28}{space 2}  .006588{col 39}{space 1}    1.62{col 48}{space 3}0.107{col 56}{space 4}-.0022935{col 69}{space 3} .0235813
{txt}{space 11}OK  {c |}{col 16}{res}{space 2} .0147744{col 28}{space 2}   .01276{col 39}{space 1}    1.16{col 48}{space 3}0.247{col 56}{space 4}-.0102836{col 69}{space 3} .0398323
{txt}{space 11}OR  {c |}{col 16}{res}{space 2} .0219714{col 28}{space 2} .0070892{col 39}{space 1}    3.10{col 48}{space 3}0.002{col 56}{space 4} .0080497{col 69}{space 3} .0358931
{txt}{space 11}PA  {c |}{col 16}{res}{space 2}   .01265{col 28}{space 2} .0067263{col 39}{space 1}    1.88{col 48}{space 3}0.060{col 56}{space 4}-.0005591{col 69}{space 3} .0258591
{txt}{space 11}RI  {c |}{col 16}{res}{space 2} .0141473{col 28}{space 2} .0062354{col 39}{space 1}    2.27{col 48}{space 3}0.024{col 56}{space 4} .0019023{col 69}{space 3} .0263924
{txt}{space 11}SC  {c |}{col 16}{res}{space 2} .0298233{col 28}{space 2} .0146833{col 39}{space 1}    2.03{col 48}{space 3}0.043{col 56}{space 4} .0009884{col 69}{space 3} .0586582
{txt}{space 11}SD  {c |}{col 16}{res}{space 2} .0306374{col 28}{space 2} .0220552{col 39}{space 1}    1.39{col 48}{space 3}0.165{col 56}{space 4}-.0126743{col 69}{space 3} .0739492
{txt}{space 11}TN  {c |}{col 16}{res}{space 2} .0095153{col 28}{space 2} .0087686{col 39}{space 1}    1.09{col 48}{space 3}0.278{col 56}{space 4}-.0077045{col 69}{space 3}  .026735
{txt}{space 11}TX  {c |}{col 16}{res}{space 2} .0119836{col 28}{space 2} .0093182{col 39}{space 1}    1.29{col 48}{space 3}0.199{col 56}{space 4}-.0063152{col 69}{space 3} .0302825
{txt}{space 11}UT  {c |}{col 16}{res}{space 2}-.0066566{col 28}{space 2} .0064161{col 39}{space 1}   -1.04{col 48}{space 3}0.300{col 56}{space 4}-.0192563{col 69}{space 3} .0059432
{txt}{space 11}VA  {c |}{col 16}{res}{space 2} .0057954{col 28}{space 2} .0094011{col 39}{space 1}    0.62{col 48}{space 3}0.538{col 56}{space 4}-.0126664{col 69}{space 3} .0242571
{txt}{space 11}VT  {c |}{col 16}{res}{space 2} .0134266{col 28}{space 2} .0062865{col 39}{space 1}    2.14{col 48}{space 3}0.033{col 56}{space 4} .0010812{col 69}{space 3} .0257719
{txt}{space 11}WA  {c |}{col 16}{res}{space 2}-.0082521{col 28}{space 2} .0067877{col 39}{space 1}   -1.22{col 48}{space 3}0.225{col 56}{space 4}-.0215818{col 69}{space 3} .0050775
{txt}{space 11}WI  {c |}{col 16}{res}{space 2} .0134031{col 28}{space 2} .0080242{col 39}{space 1}    1.67{col 48}{space 3}0.095{col 56}{space 4}-.0023547{col 69}{space 3} .0291609
{txt}{space 11}WV  {c |}{col 16}{res}{space 2} .0017941{col 28}{space 2} .0063945{col 39}{space 1}    0.28{col 48}{space 3}0.779{col 56}{space 4}-.0107633{col 69}{space 3} .0143516
{txt}{space 14} {c |}
{space 8}gender {c |}
{space 7}female  {c |}{col 16}{res}{space 2} .0051285{col 28}{space 2} .0018196{col 39}{space 1}    2.82{col 48}{space 3}0.005{col 56}{space 4} .0015552{col 69}{space 3} .0087018
{txt}{space 9}2.Q34 {c |}{col 16}{res}{space 2} .0011899{col 28}{space 2} .0050608{col 39}{space 1}    0.24{col 48}{space 3}0.814{col 56}{space 4}-.0087483{col 69}{space 3} .0111282
{txt}{space 9}Q35_1 {c |}{col 16}{res}{space 2} .0069116{col 28}{space 2} .0119819{col 39}{space 1}    0.58{col 48}{space 3}0.564{col 56}{space 4}-.0166182{col 69}{space 3} .0304414
{txt}{space 9}Q35_2 {c |}{col 16}{res}{space 2} .0081571{col 28}{space 2} .0114348{col 39}{space 1}    0.71{col 48}{space 3}0.476{col 56}{space 4}-.0142984{col 69}{space 3} .0306126
{txt}{space 9}Q35_3 {c |}{col 16}{res}{space 2} .0163647{col 28}{space 2} .0074968{col 39}{space 1}    2.18{col 48}{space 3}0.029{col 56}{space 4} .0016427{col 69}{space 3} .0310867
{txt}{space 9}Q35_4 {c |}{col 16}{res}{space 2} .0100935{col 28}{space 2} .0118728{col 39}{space 1}    0.85{col 48}{space 3}0.396{col 56}{space 4} -.013222{col 69}{space 3}  .033409
{txt}{space 9}Q35_5 {c |}{col 16}{res}{space 2}  .006817{col 28}{space 2} .0163981{col 39}{space 1}    0.42{col 48}{space 3}0.678{col 56}{space 4}-.0253854{col 69}{space 3} .0390193
{txt}{space 9}Q35_6 {c |}{col 16}{res}{space 2} .0062617{col 28}{space 2} .0138441{col 39}{space 1}    0.45{col 48}{space 3}0.651{col 56}{space 4}-.0209252{col 69}{space 3} .0334486
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}-.0053997{col 28}{space 2} .0180197{col 39}{space 1}   -0.30{col 48}{space 3}0.765{col 56}{space 4}-.0407865{col 69}{space 3}  .029987
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est8{txt} stored)
{p 0 6 2}note: 2013.year omitted because of collinearity{p_end}

Linear regression                                      Number of obs ={res}     565
                                                       {help j_robustsingular:F( 52,   503) =}       .
                                                       {txt}Prob > F      = {res}      .
                                                       {txt}R-squared     = {res} 0.1919
                                                       {txt}Root MSE      = {res} .01998

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}       incmean{col 16}{c |}      Coef.{col 28}   Std. Err.{col 40}      t{col 48}   P>|t|{col 56}     [95% Con{col 69}f. Interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age_g {c |}
{space 3}middle-age  {c |}{col 16}{res}{space 2}-.0067144{col 28}{space 2} .0034011{col 39}{space 1}   -1.97{col 48}{space 3}0.049{col 56}{space 4}-.0133966{col 69}{space 3}-.0000323
{txt}{space 10}old  {c |}{col 16}{res}{space 2}-.0081042{col 28}{space 2} .0033386{col 39}{space 1}   -2.43{col 48}{space 3}0.016{col 56}{space 4}-.0146636{col 69}{space 3}-.0015449
{txt}{space 14} {c |}
{space 9}edu_g {c |}
{space 2}HS graduate  {c |}{col 16}{res}{space 2}  .004993{col 28}{space 2} .0085705{col 39}{space 1}    0.58{col 48}{space 3}0.560{col 56}{space 4}-.0118454{col 69}{space 3} .0218315
{txt}College/above  {c |}{col 16}{res}{space 2} .0037806{col 28}{space 2} .0084903{col 39}{space 1}    0.45{col 48}{space 3}0.656{col 56}{space 4}-.0129002{col 69}{space 3} .0204614
{txt}{space 14} {c |}
{space 7}HHinc_g {c |}
{space 5}high inc  {c |}{col 16}{res}{space 2} .0016472{col 28}{space 2} .0019882{col 39}{space 1}    0.83{col 48}{space 3}0.408{col 56}{space 4}-.0022591{col 69}{space 3} .0055535
{txt}{space 5}1.byear_g {c |}{col 16}{res}{space 2} .0034104{col 28}{space 2} .0038405{col 39}{space 1}    0.89{col 48}{space 3}0.375{col 56}{space 4}-.0041351{col 69}{space 3} .0109558
{txt}{space 14} {c |}
{space 10}year {c |}
{space 9}2013  {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 14} {c |}
{space 6}state_id {c |}
{space 11}AR  {c |}{col 16}{res}{space 2}-.0004478{col 28}{space 2} .0101332{col 39}{space 1}   -0.04{col 48}{space 3}0.965{col 56}{space 4}-.0203565{col 69}{space 3} .0194608
{txt}{space 11}AZ  {c |}{col 16}{res}{space 2}-.0111247{col 28}{space 2} .0075951{col 39}{space 1}   -1.46{col 48}{space 3}0.144{col 56}{space 4}-.0260468{col 69}{space 3} .0037973
{txt}{space 11}CA  {c |}{col 16}{res}{space 2} .0076158{col 28}{space 2} .0096566{col 39}{space 1}    0.79{col 48}{space 3}0.431{col 56}{space 4}-.0113564{col 69}{space 3}  .026588
{txt}{space 11}CO  {c |}{col 16}{res}{space 2} .0080908{col 28}{space 2}   .00913{col 39}{space 1}    0.89{col 48}{space 3}0.376{col 56}{space 4}-.0098468{col 69}{space 3} .0260283
{txt}{space 11}CT  {c |}{col 16}{res}{space 2} .0085598{col 28}{space 2} .0102999{col 39}{space 1}    0.83{col 48}{space 3}0.406{col 56}{space 4}-.0116763{col 69}{space 3} .0287959
{txt}{space 11}DC  {c |}{col 16}{res}{space 2}-.0068689{col 28}{space 2} .0077918{col 39}{space 1}   -0.88{col 48}{space 3}0.378{col 56}{space 4}-.0221773{col 69}{space 3} .0084395
{txt}{space 11}DE  {c |}{col 16}{res}{space 2} .0107408{col 28}{space 2} .0126231{col 39}{space 1}    0.85{col 48}{space 3}0.395{col 56}{space 4}-.0140597{col 69}{space 3} .0355412
{txt}{space 11}FL  {c |}{col 16}{res}{space 2}-.0002547{col 28}{space 2} .0102887{col 39}{space 1}   -0.02{col 48}{space 3}0.980{col 56}{space 4}-.0204689{col 69}{space 3} .0199595
{txt}{space 11}GA  {c |}{col 16}{res}{space 2} .0055766{col 28}{space 2} .0104499{col 39}{space 1}    0.53{col 48}{space 3}0.594{col 56}{space 4}-.0149542{col 69}{space 3} .0261073
{txt}{space 11}IA  {c |}{col 16}{res}{space 2}-.0051849{col 28}{space 2} .0081097{col 39}{space 1}   -0.64{col 48}{space 3}0.523{col 56}{space 4} -.021118{col 69}{space 3} .0107482
{txt}{space 11}ID  {c |}{col 16}{res}{space 2} .0170314{col 28}{space 2}  .018497{col 39}{space 1}    0.92{col 48}{space 3}0.358{col 56}{space 4}-.0193096{col 69}{space 3} .0533724
{txt}{space 11}IL  {c |}{col 16}{res}{space 2}-.0001125{col 28}{space 2} .0078367{col 39}{space 1}   -0.01{col 48}{space 3}0.989{col 56}{space 4}-.0155093{col 69}{space 3} .0152842
{txt}{space 11}IN  {c |}{col 16}{res}{space 2} .0052981{col 28}{space 2} .0082022{col 39}{space 1}    0.65{col 48}{space 3}0.519{col 56}{space 4}-.0108166{col 69}{space 3} .0214128
{txt}{space 11}KS  {c |}{col 16}{res}{space 2}-.0099288{col 28}{space 2} .0092505{col 39}{space 1}   -1.07{col 48}{space 3}0.284{col 56}{space 4}-.0281031{col 69}{space 3} .0082456
{txt}{space 11}KY  {c |}{col 16}{res}{space 2}-.0085859{col 28}{space 2} .0113108{col 39}{space 1}   -0.76{col 48}{space 3}0.448{col 56}{space 4}-.0308082{col 69}{space 3} .0136363
{txt}{space 11}LA  {c |}{col 16}{res}{space 2} .0007992{col 28}{space 2} .0078987{col 39}{space 1}    0.10{col 48}{space 3}0.919{col 56}{space 4}-.0147194{col 69}{space 3} .0163177
{txt}{space 11}MA  {c |}{col 16}{res}{space 2}-.0024058{col 28}{space 2} .0078291{col 39}{space 1}   -0.31{col 48}{space 3}0.759{col 56}{space 4}-.0177875{col 69}{space 3}  .012976
{txt}{space 11}MD  {c |}{col 16}{res}{space 2} .0001241{col 28}{space 2} .0089176{col 39}{space 1}    0.01{col 48}{space 3}0.989{col 56}{space 4}-.0173963{col 69}{space 3} .0176445
{txt}{space 11}ME  {c |}{col 16}{res}{space 2} .0038377{col 28}{space 2} .0108096{col 39}{space 1}    0.36{col 48}{space 3}0.723{col 56}{space 4}-.0173998{col 69}{space 3} .0250752
{txt}{space 11}MI  {c |}{col 16}{res}{space 2}-.0033249{col 28}{space 2} .0076369{col 39}{space 1}   -0.44{col 48}{space 3}0.663{col 56}{space 4} -.018329{col 69}{space 3} .0116793
{txt}{space 11}MN  {c |}{col 16}{res}{space 2} .0012579{col 28}{space 2} .0102835{col 39}{space 1}    0.12{col 48}{space 3}0.903{col 56}{space 4}-.0189459{col 69}{space 3} .0214617
{txt}{space 11}MO  {c |}{col 16}{res}{space 2}-.0036113{col 28}{space 2} .0079054{col 39}{space 1}   -0.46{col 48}{space 3}0.648{col 56}{space 4} -.019143{col 69}{space 3} .0119204
{txt}{space 11}MS  {c |}{col 16}{res}{space 2}-.0064618{col 28}{space 2} .0074705{col 39}{space 1}   -0.86{col 48}{space 3}0.387{col 56}{space 4}-.0211391{col 69}{space 3} .0082154
{txt}{space 11}NC  {c |}{col 16}{res}{space 2} .0083473{col 28}{space 2} .0090834{col 39}{space 1}    0.92{col 48}{space 3}0.359{col 56}{space 4}-.0094988{col 69}{space 3} .0261933
{txt}{space 11}ND  {c |}{col 16}{res}{space 2} .0313609{col 28}{space 2} .0081528{col 39}{space 1}    3.85{col 48}{space 3}0.000{col 56}{space 4} .0153432{col 69}{space 3} .0473786
{txt}{space 11}NE  {c |}{col 16}{res}{space 2}-.0192038{col 28}{space 2} .0101787{col 39}{space 1}   -1.89{col 48}{space 3}0.060{col 56}{space 4}-.0392019{col 69}{space 3} .0007943
{txt}{space 11}NH  {c |}{col 16}{res}{space 2}-.0032984{col 28}{space 2}  .008343{col 39}{space 1}   -0.40{col 48}{space 3}0.693{col 56}{space 4}-.0196898{col 69}{space 3} .0130931
{txt}{space 11}NJ  {c |}{col 16}{res}{space 2}-.0017515{col 28}{space 2} .0076775{col 39}{space 1}   -0.23{col 48}{space 3}0.820{col 56}{space 4}-.0168353{col 69}{space 3} .0133324
{txt}{space 11}NY  {c |}{col 16}{res}{space 2} .0022181{col 28}{space 2}  .007709{col 39}{space 1}    0.29{col 48}{space 3}0.774{col 56}{space 4}-.0129278{col 69}{space 3} .0173639
{txt}{space 11}OH  {c |}{col 16}{res}{space 2} .0016215{col 28}{space 2} .0076446{col 39}{space 1}    0.21{col 48}{space 3}0.832{col 56}{space 4}-.0133978{col 69}{space 3} .0166408
{txt}{space 11}OK  {c |}{col 16}{res}{space 2} .0015767{col 28}{space 2} .0113353{col 39}{space 1}    0.14{col 48}{space 3}0.889{col 56}{space 4}-.0206937{col 69}{space 3}  .023847
{txt}{space 11}OR  {c |}{col 16}{res}{space 2} .0158156{col 28}{space 2} .0074228{col 39}{space 1}    2.13{col 48}{space 3}0.034{col 56}{space 4} .0012321{col 69}{space 3} .0303991
{txt}{space 11}PA  {c |}{col 16}{res}{space 2} .0067312{col 28}{space 2} .0079832{col 39}{space 1}    0.84{col 48}{space 3}0.400{col 56}{space 4}-.0089534{col 69}{space 3} .0224157
{txt}{space 11}RI  {c |}{col 16}{res}{space 2} .0058387{col 28}{space 2} .0086466{col 39}{space 1}    0.68{col 48}{space 3}0.500{col 56}{space 4}-.0111492{col 69}{space 3} .0228267
{txt}{space 11}SC  {c |}{col 16}{res}{space 2} .0066485{col 28}{space 2} .0174444{col 39}{space 1}    0.38{col 48}{space 3}0.703{col 56}{space 4}-.0276244{col 69}{space 3} .0409214
{txt}{space 11}SD  {c |}{col 16}{res}{space 2}-.0216145{col 28}{space 2} .0084872{col 39}{space 1}   -2.55{col 48}{space 3}0.011{col 56}{space 4}-.0382892{col 69}{space 3}-.0049398
{txt}{space 11}TN  {c |}{col 16}{res}{space 2} .0012825{col 28}{space 2} .0095213{col 39}{space 1}    0.13{col 48}{space 3}0.893{col 56}{space 4} -.017424{col 69}{space 3} .0199889
{txt}{space 11}TX  {c |}{col 16}{res}{space 2} .0118801{col 28}{space 2} .0099716{col 39}{space 1}    1.19{col 48}{space 3}0.234{col 56}{space 4} -.007711{col 69}{space 3} .0314713
{txt}{space 11}VA  {c |}{col 16}{res}{space 2}-.0033028{col 28}{space 2} .0090598{col 39}{space 1}   -0.36{col 48}{space 3}0.716{col 56}{space 4}-.0211024{col 69}{space 3} .0144968
{txt}{space 11}VT  {c |}{col 16}{res}{space 2} .0081461{col 28}{space 2} .0074259{col 39}{space 1}    1.10{col 48}{space 3}0.273{col 56}{space 4}-.0064435{col 69}{space 3} .0227357
{txt}{space 11}WA  {c |}{col 16}{res}{space 2}-.0184806{col 28}{space 2} .0081029{col 39}{space 1}   -2.28{col 48}{space 3}0.023{col 56}{space 4}-.0344003{col 69}{space 3}-.0025609
{txt}{space 11}WI  {c |}{col 16}{res}{space 2} .0087469{col 28}{space 2} .0091316{col 39}{space 1}    0.96{col 48}{space 3}0.339{col 56}{space 4}-.0091939{col 69}{space 3} .0266876
{txt}{space 11}WV  {c |}{col 16}{res}{space 2}-.0066015{col 28}{space 2} .0073185{col 39}{space 1}   -0.90{col 48}{space 3}0.367{col 56}{space 4}-.0209801{col 69}{space 3} .0077772
{txt}{space 14} {c |}
{space 8}gender {c |}
{space 7}female  {c |}{col 16}{res}{space 2} .0030232{col 28}{space 2} .0020096{col 39}{space 1}    1.50{col 48}{space 3}0.133{col 56}{space 4}-.0009251{col 69}{space 3} .0069714
{txt}{space 9}2.Q34 {c |}{col 16}{res}{space 2} .0048556{col 28}{space 2} .0058451{col 39}{space 1}    0.83{col 48}{space 3}0.407{col 56}{space 4}-.0066281{col 69}{space 3} .0163394
{txt}{space 9}Q35_1 {c |}{col 16}{res}{space 2} .0098717{col 28}{space 2} .0113185{col 39}{space 1}    0.87{col 48}{space 3}0.384{col 56}{space 4}-.0123658{col 69}{space 3} .0321091
{txt}{space 9}Q35_2 {c |}{col 16}{res}{space 2} .0126934{col 28}{space 2} .0102252{col 39}{space 1}    1.24{col 48}{space 3}0.215{col 56}{space 4}-.0073961{col 69}{space 3} .0327828
{txt}{space 9}Q35_3 {c |}{col 16}{res}{space 2} .0156631{col 28}{space 2} .0078567{col 39}{space 1}    1.99{col 48}{space 3}0.047{col 56}{space 4} .0002271{col 69}{space 3} .0310992
{txt}{space 9}Q35_4 {c |}{col 16}{res}{space 2} .0124179{col 28}{space 2} .0116382{col 39}{space 1}    1.07{col 48}{space 3}0.286{col 56}{space 4}-.0104475{col 69}{space 3} .0352833
{txt}{space 9}Q35_5 {c |}{col 16}{res}{space 2}-.0212622{col 28}{space 2} .0077103{col 39}{space 1}   -2.76{col 48}{space 3}0.006{col 56}{space 4}-.0364106{col 69}{space 3}-.0061138
{txt}{space 9}Q35_6 {c |}{col 16}{res}{space 2} .0101861{col 28}{space 2} .0128566{col 39}{space 1}    0.79{col 48}{space 3}0.429{col 56}{space 4}-.0150731{col 69}{space 3} .0354453
{txt}{space 5}UEprobAgg {c |}{col 16}{res}{space 2}-.0000626{col 28}{space 2} .0000414{col 39}{space 1}   -1.51{col 48}{space 3}0.131{col 56}{space 4} -.000144{col 69}{space 3} .0000187
{txt}{space 7}Stkprob {c |}{col 16}{res}{space 2} .0002054{col 28}{space 2}  .000047{col 39}{space 1}    4.37{col 48}{space 3}0.000{col 56}{space 4}  .000113{col 69}{space 3} .0002978
{txt}{space 7}Q9_mean {c |}{col 16}{res}{space 2} .1514954{col 28}{space 2} .0496443{col 39}{space 1}    3.05{col 48}{space 3}0.002{col 56}{space 4} .0539596{col 69}{space 3} .2490312
{txt}{space 5}UEprobInd {c |}{col 16}{res}{space 2} -.000082{col 28}{space 2} .0000497{col 39}{space 1}   -1.65{col 48}{space 3}0.100{col 56}{space 4}-.0001797{col 69}{space 3} .0000157
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}-.0036623{col 28}{space 2} .0177778{col 39}{space 1}   -0.21{col 48}{space 3}0.837{col 56}{space 4}-.0385901{col 69}{space 3} .0312656
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est9{txt} stored)

{com}. 
. esttab using "${c -(}sum_table_folder{c )-}/mom_group.csv", ///
>              se r2 drop(0.age_g 1.edu_g 0.HHinc_g 0.byear_g  *.year *state_id 1.gender 1.Q34 _cons) ///
>                          label replace
{res}{txt}(output written to {browse  `"/Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/mom_group.csv"'})

{com}. 
. */      
. log close 
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/Myworld/Dropbox/IncExpProject/WorkingFolder/indSCE_Est_log.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}14 Dec 2020, 10:51:01
{txt}{.-}
{smcl}
{txt}{sf}{ul off}