{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/Myworld/Dropbox/IncExpProject/WorkingFolder/indSCE_log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}20 Mar 2020, 15:32:52
{txt}
{com}. 
. 
. ***************************
. **  Clean and Merge Data **
. ***************************
. 
. use "${c -(}folder{c )-}/SCE/IncExpSCEProbIndM",clear 
{txt}
{com}. 
. duplicates report year month userid

{p 0 4}{txt}Duplicates in terms of {res} year month userid{p_end}

{txt}{hline 10}{c TT}{hline 27}
   copies {c |} observations       surplus
{hline 10}{c +}{hline 27}
        1 {c |}        {res}85852             0
{txt}{hline 10}{c BT}{hline 27}

{com}. 
. rename userid ID 
{res}{txt}
{com}. 
. *******************************
. **  Set Panel Data Structure **
. *******************************
. 
. xtset ID date
{res}{txt}{col 8}panel variable:  {res}ID (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}date, 2013m6 to 2019m5, but with gaps
{txt}{col 17}delta:  {res}1 month
{txt}
{com}. sort ID year month 
{txt}
{com}. 
. 
. *******************************
. **  Summary Statistics of SCE **
. *******************************
. 
. tabstat ID,s(count) by(date) column(statistics)

{txt}Summary for variables: ID
{col 6}by categories of: date 

{ralign 9:date} {...}
{c |}         N
{hline 10}{c +}{hline 10}
{ralign 9: 2013m6} {...}
{c |}{...}
 {res}     1157
{txt}{ralign 9: 2013m7} {...}
{c |}{...}
 {res}     1099
{txt}{ralign 9: 2013m8} {...}
{c |}{...}
 {res}     1613
{txt}{ralign 9: 2013m9} {...}
{c |}{...}
 {res}     1403
{txt}{ralign 9:2013m10} {...}
{c |}{...}
 {res}     1416
{txt}{ralign 9:2013m11} {...}
{c |}{...}
 {res}     1408
{txt}{ralign 9:2013m12} {...}
{c |}{...}
 {res}     1241
{txt}{ralign 9: 2014m1} {...}
{c |}{...}
 {res}     1217
{txt}{ralign 9: 2014m2} {...}
{c |}{...}
 {res}     1193
{txt}{ralign 9: 2014m3} {...}
{c |}{...}
 {res}     1208
{txt}{ralign 9: 2014m4} {...}
{c |}{...}
 {res}     1208
{txt}{ralign 9: 2014m5} {...}
{c |}{...}
 {res}     1173
{txt}{ralign 9: 2014m6} {...}
{c |}{...}
 {res}     1192
{txt}{ralign 9: 2014m7} {...}
{c |}{...}
 {res}     1253
{txt}{ralign 9: 2014m8} {...}
{c |}{...}
 {res}     1228
{txt}{ralign 9: 2014m9} {...}
{c |}{...}
 {res}     1205
{txt}{ralign 9:2014m10} {...}
{c |}{...}
 {res}     1203
{txt}{ralign 9:2014m11} {...}
{c |}{...}
 {res}     1197
{txt}{ralign 9:2014m12} {...}
{c |}{...}
 {res}     1182
{txt}{ralign 9: 2015m1} {...}
{c |}{...}
 {res}     1190
{txt}{ralign 9: 2015m2} {...}
{c |}{...}
 {res}     1196
{txt}{ralign 9: 2015m3} {...}
{c |}{...}
 {res}     1165
{txt}{ralign 9: 2015m4} {...}
{c |}{...}
 {res}     1165
{txt}{ralign 9: 2015m5} {...}
{c |}{...}
 {res}     1161
{txt}{ralign 9: 2015m6} {...}
{c |}{...}
 {res}     1151
{txt}{ralign 9: 2015m7} {...}
{c |}{...}
 {res}     1135
{txt}{ralign 9: 2015m8} {...}
{c |}{...}
 {res}     1099
{txt}{ralign 9: 2015m9} {...}
{c |}{...}
 {res}     1136
{txt}{ralign 9:2015m10} {...}
{c |}{...}
 {res}     1127
{txt}{ralign 9:2015m11} {...}
{c |}{...}
 {res}     1125
{txt}{ralign 9:2015m12} {...}
{c |}{...}
 {res}     1090
{txt}{ralign 9: 2016m1} {...}
{c |}{...}
 {res}     1115
{txt}{ralign 9: 2016m2} {...}
{c |}{...}
 {res}     1065
{txt}{ralign 9: 2016m3} {...}
{c |}{...}
 {res}     1128
{txt}{ralign 9: 2016m4} {...}
{c |}{...}
 {res}     1100
{txt}{ralign 9: 2016m5} {...}
{c |}{...}
 {res}     1152
{txt}{ralign 9: 2016m6} {...}
{c |}{...}
 {res}     1151
{txt}{ralign 9: 2016m7} {...}
{c |}{...}
 {res}     1193
{txt}{ralign 9: 2016m8} {...}
{c |}{...}
 {res}     1156
{txt}{ralign 9: 2016m9} {...}
{c |}{...}
 {res}     1199
{txt}{ralign 9:2016m10} {...}
{c |}{...}
 {res}     1195
{txt}{ralign 9:2016m11} {...}
{c |}{...}
 {res}     1191
{txt}{ralign 9:2016m12} {...}
{c |}{...}
 {res}     1223
{txt}{ralign 9: 2017m1} {...}
{c |}{...}
 {res}     1223
{txt}{ralign 9: 2017m2} {...}
{c |}{...}
 {res}     1206
{txt}{ralign 9: 2017m3} {...}
{c |}{...}
 {res}     1228
{txt}{ralign 9: 2017m4} {...}
{c |}{...}
 {res}     1143
{txt}{ralign 9: 2017m5} {...}
{c |}{...}
 {res}     1212
{txt}{ralign 9: 2017m6} {...}
{c |}{...}
 {res}     1218
{txt}{ralign 9: 2017m7} {...}
{c |}{...}
 {res}     1221
{txt}{ralign 9: 2017m8} {...}
{c |}{...}
 {res}     1221
{txt}{ralign 9: 2017m9} {...}
{c |}{...}
 {res}     1196
{txt}{ralign 9:2017m10} {...}
{c |}{...}
 {res}     1245
{txt}{ralign 9:2017m11} {...}
{c |}{...}
 {res}     1214
{txt}{ralign 9:2017m12} {...}
{c |}{...}
 {res}     1157
{txt}{ralign 9: 2018m1} {...}
{c |}{...}
 {res}     1193
{txt}{ralign 9: 2018m2} {...}
{c |}{...}
 {res}     1195
{txt}{ralign 9: 2018m3} {...}
{c |}{...}
 {res}     1183
{txt}{ralign 9: 2018m4} {...}
{c |}{...}
 {res}     1160
{txt}{ralign 9: 2018m5} {...}
{c |}{...}
 {res}     1163
{txt}{ralign 9: 2018m6} {...}
{c |}{...}
 {res}     1157
{txt}{ralign 9: 2018m7} {...}
{c |}{...}
 {res}     1167
{txt}{ralign 9: 2018m8} {...}
{c |}{...}
 {res}     1174
{txt}{ralign 9: 2018m9} {...}
{c |}{...}
 {res}     1142
{txt}{ralign 9:2018m10} {...}
{c |}{...}
 {res}     1191
{txt}{ralign 9:2018m11} {...}
{c |}{...}
 {res}     1160
{txt}{ralign 9:2018m12} {...}
{c |}{...}
 {res}     1103
{txt}{ralign 9: 2019m1} {...}
{c |}{...}
 {res}     1201
{txt}{ralign 9: 2019m2} {...}
{c |}{...}
 {res}     1194
{txt}{ralign 9: 2019m3} {...}
{c |}{...}
 {res}     1210
{txt}{ralign 9: 2019m4} {...}
{c |}{...}
 {res}     1192
{txt}{ralign 9: 2019m5} {...}
{c |}{...}
 {res}     1179
{txt}{hline 10}{c +}{hline 10}
{ralign 9:Total} {...}
{c |}{...}
 {res}    85852
{txt}{hline 10}{c BT}{hline 10}

{com}. 
. 
. *****************************************
. ****  Renaming so that more consistent **
. *****************************************
. 
. rename Q24_mean SCE_Mean
{res}{txt}
{com}. rename Q24_var SCE_Var
{res}{txt}
{com}. 
. *******************************
. **  Generate Variables       **
. *******************************
. 
. gen IncExp_Mean = .
{txt}(85852 missing values generated)

{com}. gen IncExp_Var = .
{txt}(85852 missing values generated)

{com}. 
. gen IncExp_Mean_ch = .
{txt}(85852 missing values generated)

{com}. gen IncExp_Var_ch = .
{txt}(85852 missing values generated)

{com}. 
. gen IncExp_Mean_rv = .
{txt}(85852 missing values generated)

{com}. gen IncExp_Var_rv = .
{txt}(85852 missing values generated)

{com}. 
. ************************************************
. ** Auto Regression of the Individual Moments  **
. ************************************************
. 
. eststo clear
{txt}
{com}. 
. foreach mom in Mean Var{c -(}
{txt}  2{com}.    foreach var in SCE{c -(}
{txt}  3{com}.     replace IncExp_`mom' = `var'_`mom'
{txt}  4{com}.         xtset ID date
{txt}  5{com}.     replace IncExp_`mom'_ch = IncExp_`mom'-l1.IncExp_`mom'
{txt}  6{com}. 
.         eststo `var'_`mom'lvl: reg IncExp_`mom' l(3/5).IncExp_`mom', vce(cluster date)
{txt}  7{com}.     eststo `var'_`mom'diff: reg IncExp_`mom'_ch l(3/5).IncExp_`mom'_ch, vce(cluster date)
{txt}  8{com}.   {c )-}
{txt}  9{com}. {c )-}
{txt}(55690 real changes made)
{res}{txt}{col 8}panel variable:  {res}ID (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}date, 2013m6 to 2019m5, but with gaps
{txt}{col 17}delta:  {res}1 month
{txt}(40217 real changes made)

Linear regression                                      Number of obs ={res}   17301
                                                       {txt}F(  3,    66) ={res} 3166.29
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.4609
                                                       {txt}Root MSE      = {res} 1.5409

{txt}{ralign 78:(Std. Err. adjusted for {res:67} clusters in date)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} IncExp_Mean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}IncExp_Mean {c |}
{space 9}L3. {c |}{col 14}{res}{space 2}   .34429{col 26}{space 2} .0127151{col 37}{space 1}   27.08{col 46}{space 3}0.000{col 54}{space 4} .3189035{col 67}{space 3} .3696766
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .2477158{col 26}{space 2} .0127953{col 37}{space 1}   19.36{col 46}{space 3}0.000{col 54}{space 4} .2221691{col 67}{space 3} .2732625
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .1743793{col 26}{space 2} .0101257{col 37}{space 1}   17.22{col 46}{space 3}0.000{col 54}{space 4} .1541627{col 67}{space 3} .1945959
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .5804723{col 26}{space 2} .0194167{col 37}{space 1}   29.90{col 46}{space 3}0.000{col 54}{space 4} .5417057{col 67}{space 3} .6192389
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}   11965
                                                       {txt}F(  3,    65) ={res}    1.85
                                                       {txt}Prob > F      = {res} 0.1464
                                                       {txt}R-squared     = {res} 0.0008
                                                       {txt}Root MSE      = {res} 1.5977

{txt}{ralign 80:(Std. Err. adjusted for {res:66} clusters in date)}
{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}IncExp_Mean_ch{col 16}{c |}      Coef.{col 28}   Std. Err.{col 40}      t{col 48}   P>|t|{col 56}     [95% Con{col 69}f. Interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
IncExp_Mean_ch {c |}
{space 11}L3. {c |}{col 16}{res}{space 2}-.0220923{col 28}{space 2} .0147593{col 39}{space 1}   -1.50{col 48}{space 3}0.139{col 56}{space 4}-.0515686{col 69}{space 3}  .007384
{txt}{space 11}L4. {c |}{col 16}{res}{space 2} .0081748{col 28}{space 2} .0146079{col 39}{space 1}    0.56{col 48}{space 3}0.578{col 56}{space 4}-.0209992{col 69}{space 3} .0373488
{txt}{space 11}L5. {c |}{col 16}{res}{space 2}  .002831{col 28}{space 2} .0121179{col 39}{space 1}    0.23{col 48}{space 3}0.816{col 56}{space 4}-.0213701{col 69}{space 3}  .027032
{txt}{space 14} {c |}
{space 9}_cons {c |}{col 16}{res}{space 2}-.0117755{col 28}{space 2} .0141742{col 39}{space 1}   -0.83{col 48}{space 3}0.409{col 56}{space 4}-.0400833{col 69}{space 3} .0165322
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(55481 real changes made)
{res}{txt}{col 8}panel variable:  {res}ID (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}date, 2013m6 to 2019m5, but with gaps
{txt}{col 17}delta:  {res}1 month
{txt}(39603 real changes made)

Linear regression                                      Number of obs ={res}   16519
                                                       {txt}F(  3,    66) ={res}  372.36
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.2916
                                                       {txt}Root MSE      = {res} 7.9249

{txt}{ralign 78:(Std. Err. adjusted for {res:67} clusters in date)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}  IncExp_Var{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}IncExp_Var {c |}
{space 9}L3. {c |}{col 14}{res}{space 2} .2756931{col 26}{space 2}   .01662{col 37}{space 1}   16.59{col 46}{space 3}0.000{col 54}{space 4} .2425103{col 67}{space 3} .3088759
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .2198281{col 26}{space 2} .0132809{col 37}{space 1}   16.55{col 46}{space 3}0.000{col 54}{space 4} .1933119{col 67}{space 3} .2463444
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}  .128768{col 26}{space 2} .0123911{col 37}{space 1}   10.39{col 46}{space 3}0.000{col 54}{space 4} .1040284{col 67}{space 3} .1535076
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.375269{col 26}{space 2} .0919059{col 37}{space 1}   14.96{col 46}{space 3}0.000{col 54}{space 4} 1.191773{col 67}{space 3} 1.558765
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}   11096
                                                       {txt}F(  3,    65) ={res}    1.75
                                                       {txt}Prob > F      = {res} 0.1656
                                                       {txt}R-squared     = {res} 0.0012
                                                       {txt}Root MSE      = {res} 8.7753

{txt}{ralign 79:(Std. Err. adjusted for {res:66} clusters in date)}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}IncExp_Var_ch{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
IncExp_Var_ch {c |}
{space 10}L3. {c |}{col 15}{res}{space 2} -.006759{col 27}{space 2} .0231483{col 38}{space 1}   -0.29{col 47}{space 3}0.771{col 55}{space 4}-.0529893{col 68}{space 3} .0394714
{txt}{space 10}L4. {c |}{col 15}{res}{space 2} .0083351{col 27}{space 2} .0230404{col 38}{space 1}    0.36{col 47}{space 3}0.719{col 55}{space 4}-.0376797{col 68}{space 3} .0543498
{txt}{space 10}L5. {c |}{col 15}{res}{space 2}-.0224622{col 27}{space 2} .0150058{col 38}{space 1}   -1.50{col 47}{space 3}0.139{col 55}{space 4}-.0524309{col 68}{space 3} .0075065
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2}-.0216715{col 27}{space 2} .0837254{col 38}{space 1}   -0.26{col 47}{space 3}0.797{col 55}{space 4}-.1888827{col 68}{space 3} .1455397
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. esttab using "${c -(}sum_table_folder{c )-}/ind/autoregSCEIndM.csv", mtitles se  r2 replace
{res}{txt}(output written to {browse  `"/Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/ind/autoregSCEIndM.csv"'})

{com}. eststo clear
{txt}
{com}. 
. 
. 
. 
. *******************************************************
. ***  Weak test on changes of forecst and uncertainty **
. *******************************************************
. 
. ** Generate central tendency measures
. 
. foreach var in SCE{c -(}
{txt}  2{com}. foreach mom in Mean{c -(}
{txt}  3{com}.    egen `var'_`mom'_ct50 = pctile(`var'_`mom'),p(50) by(date)
{txt}  4{com}.    label var `var'_`mom'_ct50 "Median 1-year-ahead income growth"
{txt}  5{com}. {c )-}
{txt}  6{com}. {c )-}
{txt}
{com}. 
. eststo clear
{txt}
{com}. 
. foreach var in SCE{c -(}
{txt}  2{com}.   foreach mom in Mean{c -(}
{txt}  3{com}.      replace IncExp_`mom'_ch =  `var'_`mom' - l1.`var'_`mom'
{txt}  4{com}.          eststo `var'`mom'diff0: reg IncExp_`mom'_ch, vce(cluster date)
{txt}  5{com}.      eststo `var'`mom'diff1: reg IncExp_`mom'_ch l1.IncExp_`mom'_ch, vce(cluster date)
{txt}  6{com}.          capture eststo `var'`mom'diff2: reg  IncExp_`mom'_ch l(1/3).IncExp_`mom'_ch, vce(cluster date)
{txt}  7{com}.          capture eststo `var'`mom'diff3: reg  IncExp_`mom'_ch l(1/6).IncExp_`mom'_ch, vce(cluster date)
{txt}  8{com}.  {c )-}
{txt}  9{com}. {c )-}
{txt}(0 real changes made)

Linear regression                                      Number of obs ={res}   40217
                                                       {txt}F(  0,    70) ={res}    0.00
                                                       {txt}Prob > F      = {res}      .
                                                       {txt}R-squared     = {res} 0.0000
                                                       {txt}Root MSE      = {res} 1.9046

{txt}{ralign 78:(Std. Err. adjusted for {res:71} clusters in date)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}IncExp_Mea~h{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0347662{col 26}{space 2} .0105699{col 37}{space 1}   -3.29{col 46}{space 3}0.002{col 54}{space 4}-.0558471{col 67}{space 3}-.0136853
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}   30760
                                                       {txt}F(  1,    69) ={res} 1928.71
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.2023
                                                       {txt}Root MSE      = {res} 1.5978

{txt}{ralign 80:(Std. Err. adjusted for {res:70} clusters in date)}
{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}IncExp_Mean_ch{col 16}{c |}      Coef.{col 28}   Std. Err.{col 40}      t{col 48}   P>|t|{col 56}     [95% Con{col 69}f. Interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
IncExp_Mean_ch {c |}
{space 11}L1. {c |}{col 16}{res}{space 2}-.4359279{col 28}{space 2} .0099262{col 39}{space 1}  -43.92{col 48}{space 3}0.000{col 56}{space 4}-.4557301{col 69}{space 3}-.4161258
{txt}{space 14} {c |}
{space 9}_cons {c |}{col 16}{res}{space 2}-.0403224{col 28}{space 2} .0110566{col 39}{space 1}   -3.65{col 48}{space 3}0.001{col 56}{space 4}-.0623797{col 69}{space 3}-.0182652
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. foreach var in SCE{c -(}
{txt}  2{com}.   foreach mom in Var{c -(}
{txt}  3{com}.      replace IncExp_`mom'_ch =  `var'_`mom' - l1.`var'_`mom'
{txt}  4{com}.          eststo `var'`mom'diff0: reg IncExp_`mom'_ch, vce(cluster date) 
{txt}  5{com}.      eststo `var'`mom'diff1: reg IncExp_`mom'_ch l1.IncExp_`mom'_ch, vce(cluster date) 
{txt}  6{com}.          eststo `var'`mom'diff2: reg  IncExp_`mom'_ch l(1/3).IncExp_`mom'_ch, vce(cluster date) 
{txt}  7{com}.          capture eststo `var'`mom'diff3: reg  IncExp_`mom'_ch l(1/6).IncExp_`mom'_ch, vce(cluster date)
{txt}  8{com}.  {c )-}
{txt}  9{com}. {c )-}
{txt}(0 real changes made)

Linear regression                                      Number of obs ={res}   39603
                                                       {txt}F(  0,    70) ={res}    0.00
                                                       {txt}Prob > F      = {res}      .
                                                       {txt}R-squared     = {res} 0.0000
                                                       {txt}Root MSE      = {res} 10.415

{txt}{ralign 78:(Std. Err. adjusted for {res:71} clusters in date)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}IncExp_Var~h{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2}-.2181543{col 26}{space 2} .0538096{col 37}{space 1}   -4.05{col 46}{space 3}0.000{col 54}{space 4}-.3254741{col 67}{space 3}-.1108344
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}   29783
                                                       {txt}F(  1,    69) ={res} 1223.31
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.2229
                                                       {txt}Root MSE      = {res} 8.6327

{txt}{ralign 79:(Std. Err. adjusted for {res:70} clusters in date)}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}IncExp_Var_ch{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
IncExp_Var_ch {c |}
{space 10}L1. {c |}{col 15}{res}{space 2}-.4517506{col 27}{space 2} .0129161{col 38}{space 1}  -34.98{col 47}{space 3}0.000{col 55}{space 4}-.4775175{col 68}{space 3}-.4259838
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2}-.2807255{col 27}{space 2} .0583403{col 38}{space 1}   -4.81{col 47}{space 3}0.000{col 55}{space 4}-.3971111{col 68}{space 3}-.1643399
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}   17520
                                                       {txt}F(  3,    67) ={res}  286.62
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.2958
                                                       {txt}Root MSE      = {res} 7.4655

{txt}{ralign 79:(Std. Err. adjusted for {res:68} clusters in date)}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}IncExp_Var_ch{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
IncExp_Var_ch {c |}
{space 10}L1. {c |}{col 15}{res}{space 2}-.6215016{col 27}{space 2} .0212163{col 38}{space 1}  -29.29{col 47}{space 3}0.000{col 55}{space 4}-.6638494{col 68}{space 3}-.5791538
{txt}{space 10}L2. {c |}{col 15}{res}{space 2}-.3718819{col 27}{space 2} .0205403{col 38}{space 1}  -18.10{col 47}{space 3}0.000{col 55}{space 4}-.4128805{col 68}{space 3}-.3308833
{txt}{space 10}L3. {c |}{col 15}{res}{space 2}-.1695912{col 27}{space 2} .0134223{col 38}{space 1}  -12.64{col 47}{space 3}0.000{col 55}{space 4}-.1963823{col 68}{space 3}-.1428002
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2}-.3348915{col 27}{space 2} .0584262{col 38}{space 1}   -5.73{col 47}{space 3}0.000{col 55}{space 4}-.4515107{col 68}{space 3}-.2182722
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. esttab using "${c -(}sum_table_folder{c )-}/ind/ChEfficiencySCEIndQ.csv", mtitles b(%8.3f) se(%8.3f) scalars(N r2) sfmt(%8.3f %8.3f %8.3f) replace
{res}{txt}(output written to {browse  `"/Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/ind/ChEfficiencySCEIndQ.csv"'})

{com}. 
. 
. log close 
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/Myworld/Dropbox/IncExpProject/WorkingFolder/indSCE_log.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}20 Mar 2020, 15:33:01
{txt}{.-}
{smcl}
{txt}{sf}{ul off}