{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/Myworld/Dropbox/IncExpProject/WorkingFolder/indSCE_log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 8 Jun 2021, 14:58:42
{txt}
{com}. 
. 
. *********************************************************
. *** before working with SCE, clean the macro monthly data 
. ********************************************************
. 
. use "${c -(}mainfolder{c )-}/OtherData/macroM_raw.dta",clear 
{txt}
{com}. 
. generate new_date = dofc(DATE)
{txt}
{com}. *format new_date %tm
. gen year = year(new_date)
{txt}
{com}. gen month = month(new_date)
{txt}
{com}. gen date_str = string(year)+ "m"+string(month)
{txt}
{com}. gen date = monthly(date_str,"YM")
{txt}
{com}. format date %tm
{txt}
{com}. drop DATE date_str year month new_date 
{txt}
{com}. label var sp500 "growth rate (%) of sp500 index from last month"
{txt}
{com}. rename UNRATE uerate
{res}{txt}
{com}. label var uerate "unemployment rate"
{txt}
{com}. label var he "quarterly growth in hourly earning"
{txt}
{com}. rename VIXCLS vix 
{res}{txt}
{com}. label var vix "vix indices"
{txt}
{com}. save "${c -(}mainfolder{c )-}/OtherData/macroM.dta",replace 
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/OtherData/macroM.dta saved

{com}. clear 
{txt}
{com}. 
. 
. *****************************************
. ** Prepare estimated income risks data **
. ******************************************
. 
. ** full sample
. use "${c -(}otherdata_folder{c )-}/sipp/sipp_history_vol_decomposed.dta", clear 
{txt}
{com}. 
. drop index 
{txt}
{com}. gen year = floor(YM/100)
{txt}
{com}. gen month = YM - year*100
{txt}
{com}. gen date_str=string(year)+"M"+string(month)
{txt}
{com}. gen date = monthly(date_str,"YM")
{txt}
{com}. format date %tm
{txt}
{com}. drop date_str 
{txt}
{com}. 
. table date

{txt}{hline 10}{c TT}{hline 11}
     date {c |}      Freq.
{hline 10}{c +}{hline 11}
   2013m3 {c |}          {res}1
   {txt}2013m4 {c |}          {res}1
   {txt}2013m5 {c |}          {res}1
   {txt}2013m6 {c |}          {res}1
   {txt}2013m7 {c |}          {res}1
   {txt}2013m8 {c |}          {res}1
   {txt}2013m9 {c |}          {res}1
  {txt}2013m10 {c |}          {res}1
  {txt}2013m11 {c |}          {res}1
  {txt}2013m12 {c |}          {res}1
   {txt}2014m1 {c |}          {res}1
   {txt}2014m2 {c |}          {res}1
   {txt}2014m3 {c |}          {res}1
   {txt}2014m4 {c |}          {res}1
   {txt}2014m5 {c |}          {res}1
   {txt}2014m6 {c |}          {res}1
   {txt}2014m7 {c |}          {res}1
   {txt}2014m8 {c |}          {res}1
   {txt}2014m9 {c |}          {res}1
  {txt}2014m10 {c |}          {res}1
  {txt}2014m11 {c |}          {res}1
  {txt}2014m12 {c |}          {res}1
   {txt}2015m1 {c |}          {res}1
   {txt}2015m2 {c |}          {res}1
   {txt}2015m3 {c |}          {res}1
   {txt}2015m4 {c |}          {res}1
   {txt}2015m5 {c |}          {res}1
   {txt}2015m6 {c |}          {res}1
   {txt}2015m7 {c |}          {res}1
   {txt}2015m8 {c |}          {res}1
   {txt}2015m9 {c |}          {res}1
  {txt}2015m10 {c |}          {res}1
  {txt}2015m11 {c |}          {res}1
  {txt}2015m12 {c |}          {res}1
   {txt}2016m1 {c |}          {res}1
   {txt}2016m2 {c |}          {res}1
   {txt}2016m3 {c |}          {res}1
   {txt}2016m4 {c |}          {res}1
   {txt}2016m5 {c |}          {res}1
   {txt}2016m6 {c |}          {res}1
   {txt}2016m7 {c |}          {res}1
   {txt}2016m8 {c |}          {res}1
   {txt}2016m9 {c |}          {res}1
  {txt}2016m10 {c |}          {res}1
  {txt}2016m11 {c |}          {res}1
  {txt}2016m12 {c |}          {res}1
   {txt}2017m1 {c |}          {res}1
   {txt}2017m2 {c |}          {res}1
   {txt}2017m3 {c |}          {res}1
   {txt}2017m4 {c |}          {res}1
   {txt}2017m5 {c |}          {res}1
   {txt}2017m6 {c |}          {res}1
   {txt}2017m7 {c |}          {res}1
   {txt}2017m8 {c |}          {res}1
   {txt}2017m9 {c |}          {res}1
  {txt}2017m10 {c |}          {res}1
  {txt}2017m11 {c |}          {res}1
  {txt}2017m12 {c |}          {res}1
{txt}{hline 10}{c BT}{hline 11}

{com}. 
. tsset date
{res}{txt}{col 9}time variable:  {res}{col 25}date, 2013m3 to 2017m12
{txt}{col 17}delta:  {res}1 month
{txt}
{com}. tsfill
{txt}
{com}. replace month=1 if f1.month==2 & month==.
{txt}(0 real changes made)

{com}. replace year = f1.year if f1.month==2 & month==1
{txt}(0 real changes made)

{com}. replace YM = 100*year+month if YM==.
{txt}(0 real changes made)

{com}. 
. 
. rename permanent prisk_all
{res}{txt}
{com}. rename transitory trisk_all
{res}{txt}
{com}. label var prisk_all "estimated full-sample permanent risk(std)"
{txt}
{com}. label var trisk_all "estimated full-sample transitory risk (std)"
{txt}
{com}. 
. ** estimated risks in variances 
. 
. gen prisk2_all=prisk_all^2
{txt}(4 missing values generated)

{com}. gen trisk2_all=trisk_all^2
{txt}
{com}. 
. 
. label var prisk2_all "full sample permanent risk (var)"
{txt}
{com}. label var trisk2_all "full sample transitory risk  (var)"
{txt}
{com}. 
. 
. ***********************************
. ** Fill some estimation risk for january 
. *************************************
. 
. replace prisk2_all=(l1.prisk2_all+f1.prisk2_all)/2 if month==1
{txt}(4 real changes made)

{com}. replace trisk2_all=(l1.trisk2_all+f1.trisk2_all)/2 if month==1
{txt}(4 real changes made)

{com}. 
. ***********************************
. ** Time aggregation of estimation risk
. *************************************
. 
. foreach x in all{c -(}
{txt}  2{com}. gen prisk2_`x'_rl = (f1.prisk2_`x'+f2.prisk2_`x'+f3.prisk2_`x'+f4.prisk2_`x'+ ///
>                       f5.prisk2_`x'+f6.prisk2_`x'+f7.prisk2_`x'+f8.prisk2_`x'+ ///
>                                           f9.prisk2_`x'+ f10.prisk2_`x'+ f11.prisk2_`x'+f12.prisk2_`x') 
{txt}  3{com}. 
. gen trisk2_`x'_rl = (f1.trisk2_`x'+f2.trisk2_`x'+f3.trisk2_`x'+f4.trisk2_`x'+ ///
>                       f5.trisk2_`x'+f6.trisk2_`x'+f7.trisk2_`x'+f8.trisk2_`x'+ ///
>                                           f9.trisk2_`x'+ f10.trisk2_`x'+ f11.trisk2_`x'+f12.trisk2_`x')/12 
{txt}  4{com}. 
. gen rincvar_`x'_rl = prisk2_`x'_rl+ trisk2_`x'_rl
{txt}  5{com}. {c )-}
{txt}(24 missing values generated)
(12 missing values generated)
(24 missing values generated)

{com}. 
. label var rincvar_all_rl "realized full-sample annual risk 12 m from now"
{txt}
{com}. 
. 
. gen rincvar_all_now = l12.rincvar_all_rl
{txt}(24 missing values generated)

{com}. label var rincvar_all_now "realized full-sample annual risk since 12 m ago"
{txt}
{com}. 
. drop year month
{txt}
{com}. save "${c -(}otherdata_folder{c )-}/sipp/sipp_history_vol_decomposed_annual.dta",replace 
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/OtherData/sipp/sipp_history_vol_decomposed_annual.dta saved

{com}. 
. 
. *****************************
. ** subsample sample
. ******************************
. 
. use "${c -(}otherdata_folder{c )-}/sipp/sipp_history_vol_decomposed_edu_gender_age5.dta", clear
{txt}
{com}. 
. drop index 
{txt}
{com}. gen year = floor(YM/100)
{txt}
{com}. gen month = YM - year*100
{txt}
{com}. gen date_str=string(year)+"M"+string(month)
{txt}
{com}. gen date = monthly(date_str,"YM")
{txt}
{com}. format date %tm
{txt}
{com}. drop date_str 
{txt}
{com}. 
. table date

{txt}{hline 10}{c TT}{hline 11}
     date {c |}      Freq.
{hline 10}{c +}{hline 11}
   2013m3 {c |}         {res}48
   {txt}2013m4 {c |}         {res}48
   {txt}2013m5 {c |}         {res}48
   {txt}2013m6 {c |}         {res}48
   {txt}2013m7 {c |}         {res}48
   {txt}2013m8 {c |}         {res}48
   {txt}2013m9 {c |}         {res}48
  {txt}2013m10 {c |}         {res}48
  {txt}2013m11 {c |}         {res}48
  {txt}2013m12 {c |}         {res}48
   {txt}2014m1 {c |}         {res}48
   {txt}2014m2 {c |}         {res}48
   {txt}2014m3 {c |}         {res}48
   {txt}2014m4 {c |}         {res}48
   {txt}2014m5 {c |}         {res}48
   {txt}2014m6 {c |}         {res}48
   {txt}2014m7 {c |}         {res}48
   {txt}2014m8 {c |}         {res}48
   {txt}2014m9 {c |}         {res}48
  {txt}2014m10 {c |}         {res}48
  {txt}2014m11 {c |}         {res}48
  {txt}2014m12 {c |}         {res}48
   {txt}2015m1 {c |}         {res}48
   {txt}2015m2 {c |}         {res}48
   {txt}2015m3 {c |}         {res}48
   {txt}2015m4 {c |}         {res}48
   {txt}2015m5 {c |}         {res}48
   {txt}2015m6 {c |}         {res}48
   {txt}2015m7 {c |}         {res}48
   {txt}2015m8 {c |}         {res}48
   {txt}2015m9 {c |}         {res}48
  {txt}2015m10 {c |}         {res}48
  {txt}2015m11 {c |}         {res}48
  {txt}2015m12 {c |}         {res}48
   {txt}2016m1 {c |}         {res}48
   {txt}2016m2 {c |}         {res}48
   {txt}2016m3 {c |}         {res}48
   {txt}2016m4 {c |}         {res}48
   {txt}2016m5 {c |}         {res}48
   {txt}2016m6 {c |}         {res}48
   {txt}2016m7 {c |}         {res}48
   {txt}2016m8 {c |}         {res}48
   {txt}2016m9 {c |}         {res}48
  {txt}2016m10 {c |}         {res}48
  {txt}2016m11 {c |}         {res}48
  {txt}2016m12 {c |}         {res}48
   {txt}2017m1 {c |}         {res}48
   {txt}2017m2 {c |}         {res}48
   {txt}2017m3 {c |}         {res}48
   {txt}2017m4 {c |}         {res}48
   {txt}2017m5 {c |}         {res}48
   {txt}2017m6 {c |}         {res}48
   {txt}2017m7 {c |}         {res}48
   {txt}2017m8 {c |}         {res}48
   {txt}2017m9 {c |}         {res}48
  {txt}2017m10 {c |}         {res}48
  {txt}2017m11 {c |}         {res}48
  {txt}2017m12 {c |}         {res}48
{txt}{hline 10}{c BT}{hline 11}

{com}. ************************************************
. egen groupid = group(gender educ age_5yr)
{txt}
{com}. xtset groupid date 
{res}{txt}{col 8}panel variable:  {res}groupid (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}date, 2013m3 to 2017m12
{txt}{col 17}delta:  {res}1 month
{txt}
{com}. ********************************************
. tsfill
{txt}
{com}. replace month=1 if f1.month==2 & month==.
{txt}(0 real changes made)

{com}. replace year = f1.year if f1.month==2 & month==1
{txt}(0 real changes made)

{com}. replace YM = 100*year+month if YM==.
{txt}(0 real changes made)

{com}. 
. rename permanent prisk_sub
{res}{txt}
{com}. rename transitory trisk_sub
{res}{txt}
{com}. label var prisk_sub "estimated sub-sample permanent risk(std)"
{txt}
{com}. label var trisk_sub "estimated sub-sample transitory risk (std)"
{txt}
{com}. 
. ** estimated risks in variances 
. gen prisk2_sub=prisk_sub^2
{txt}(48 missing values generated)

{com}. gen trisk2_sub = trisk_sub^2 
{txt}
{com}. 
. label var prisk2_sub "sub sample permanent risk  (var)"
{txt}
{com}. label var trisk2_sub "sub sample transitory risk  (var)"
{txt}
{com}. 
. 
. foreach var in prisk2_sub trisk2_sub{c -(}
{txt}  2{com}.       egen `var'pl=pctile(`var'),p(1) by(date)
{txt}  3{com}.           egen `var'pu=pctile(`var'),p(99) by(date)
{txt}  4{com}.           replace `var' = . if `var' <`var'pl | (`var' >`var'pu & `var'!=.)
{txt}  5{com}. {c )-}
{txt}(48 missing values generated)
(48 missing values generated)
(0 real changes made)
(0 real changes made)

{com}. 
. ***********************************
. ** Fill some estimation risk for january 
. *************************************
. 
. replace prisk2_sub=(l1.prisk2_sub+f1.prisk2_sub)/2 if month==1
{txt}(192 real changes made)

{com}. replace trisk2_sub=(l1.trisk2_sub+f1.trisk2_sub)/2 if month==1
{txt}(192 real changes made)

{com}. 
. ***********************************
. ** Time aggregation of estimation risk
. *************************************
. 
. foreach x in sub{c -(}
{txt}  2{com}. gen prisk2_`x'_rl = (f1.prisk2_`x'+f2.prisk2_`x'+f3.prisk2_`x'+f4.prisk2_`x'+ ///
>                       f5.prisk2_`x'+f6.prisk2_`x'+f7.prisk2_`x'+f8.prisk2_`x'+ ///
>                                           f9.prisk2_`x'+ f10.prisk2_`x'+ f11.prisk2_`x'+f12.prisk2_`x') 
{txt}  3{com}. 
. gen trisk2_`x'_rl = (f1.trisk2_`x'+f2.trisk2_`x'+f3.trisk2_`x'+f4.trisk2_`x'+ ///
>                       f5.trisk2_`x'+f6.trisk2_`x'+f7.trisk2_`x'+f8.trisk2_`x'+ ///
>                                           f9.trisk2_`x'+ f10.trisk2_`x'+ f11.trisk2_`x'+f12.trisk2_`x')/12 
{txt}  4{com}. 
. gen rincvar_`x'_rl = prisk2_`x'_rl+ trisk2_`x'_rl
{txt}  5{com}. {c )-}
{txt}(1152 missing values generated)
(576 missing values generated)
(1152 missing values generated)

{com}. 
. label var rincvar_sub_rl "realized sub-sampel annual risk"
{txt}
{com}. 
. gen rincvar_sub_now = l12.rincvar_sub_rl
{txt}(1152 missing values generated)

{com}. label var rincvar_sub_now "realized sub-sample annual risk since 12m ago"
{txt}
{com}. 
. drop year month groupid 
{txt}
{com}. save "${c -(}otherdata_folder{c )-}/sipp/sipp_history_vol_decomposed_edu_gender_age5_annual.dta",replace
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/OtherData/sipp/sipp_history_vol_decomposed_edu_gender_age5_annual.dta saved

{com}.  
. ***************************
. **  Clean and Merge Data **
. ***************************
. 
. use "${c -(}folder{c )-}/SCE/IncExpSCEProbIndM",clear 
{txt}
{com}. 
. duplicates report year month userid

{p 0 4}{txt}Duplicates in terms of {res} year month userid{p_end}

{txt}{hline 10}{c TT}{hline 27}
   copies {c |} observations       surplus
{hline 10}{c +}{hline 27}
        1 {c |}        {res}98593             0
{txt}{hline 10}{c BT}{hline 27}

{com}. 
. ************************************
. **  merge with estimated moments **
. ***********************************
. 
. * IncExpSCEDstIndM is the output from ../Pythoncode/DoDensityEst.ipynb
. merge 1:1 userid date using "${c -(}folder{c )-}/SCE/IncExpSCEDstIndM.dta", keep(master match) 
{res}{txt}{p 0 7 2}
(note: variable
date was 
float, now double to accommodate using data's values)
{p_end}

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}          98,593
{txt}{col 9}from master{col 30}{res}          98,593{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}               0{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge IndEst_merge
{res}{txt}
{com}. 
. duplicates report year month userid

{p 0 4}{txt}Duplicates in terms of {res} year month userid{p_end}

{txt}{hline 10}{c TT}{hline 27}
   copies {c |} observations       surplus
{hline 10}{c +}{hline 27}
        1 {c |}        {res}98593             0
{txt}{hline 10}{c BT}{hline 27}

{com}. 
. 
. ** merge labor market module  
. merge 1:1 year month userid using "${c -(}otherfolder{c )-}/data/SCE/LaborExpSCEIndM", keep(master match)
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}          81,988
{txt}{col 9}from master{col 30}{res}          81,988{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}          16,605{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge labor_merge
{res}{txt}
{com}. rename userid ID 
{res}{txt}
{com}. 
. *****************************************
. ****  Renaming so that more consistent **
. *****************************************
. 
. rename Q24_mean incmean
{res}{txt}
{com}. rename Q24_var incvar
{res}{txt}
{com}. rename Q24_iqr inciqr
{res}{txt}
{com}. rename IncSkew incskew 
{res}{txt}
{com}. rename Q24_rmean rincmean
{res}{txt}
{com}. rename Q24_rvar rincvar
{res}{txt}
{com}. 
. *rename Q36 educ
. rename D6 HHinc 
{res}{txt}
{com}. rename Q32 age 
{res}{txt}
{com}. rename Q33 gender 
{res}{txt}
{com}. gen fulltime = Q10_1 
{txt}
{com}. gen parttime = Q10_2 
{txt}
{com}. rename Q12new selfemp
{res}{txt}
{com}. gen Stkprob= Q6new/100
{txt}(824 missing values generated)

{com}. gen UEprobAgg=Q4new/100
{txt}(284 missing values generated)

{com}. gen  UEprobInd4m = oo1_5/100
{txt}(90397 missing values generated)

{com}. gen UEprobInd=Q13new/100
{txt}(36015 missing values generated)

{com}. rename Q26v2 spending_dum
{res}{txt}
{com}. rename Q26v2part2 spending 
{res}{txt}
{com}. replace spending = spending/100
{txt}(93211 real changes made)

{com}. 
. gen exp_offer = oo2u/100
{txt}(95414 missing values generated)

{com}. gen EUprobInd = Q22new/100
{txt}(35809 missing values generated)

{com}. 
. ***********************
. ** merge other data ***
. **************************
. 
. 
. **macro data
. merge m:1 date using "${c -(}mainfolder{c )-}/OtherData/macroM.dta",keep(master match)
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}          98,593{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename CPIAUCSL CPIAU
{res}{txt}
{com}. drop _merge 
{txt}
{com}. 
. 
. * flow rate data
. merge m:1 year month using "${c -(}otherfolder{c )-}/workingdata/CPS_worker_flows.dta",keep(master match)
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}          98,593{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge 
{txt}
{com}. 
. 
. * income risk estimation data
. gen YM = year*100+month
{txt}
{com}. 
. ** merge population estimation 
. merge m:1 YM using "${c -(}otherdata_folder{c )-}/sipp/sipp_history_vol_decomposed_annual.dta", keep(master match)
{res}{txt}{p 0 7 2}
(note: variable
YM was 
float, now double to accommodate using data's values)
{p_end}

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}          32,709
{txt}{col 9}from master{col 30}{res}          32,709{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}          65,884{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge 
{txt}
{com}. 
. ********************
. ** group variables *
. ********************
. 
. egen byear_5yr = cut(byear), ///
>      at(1915 1920 1925 1930 1935 1940 ///
>             1945 1950 1955 1960 1965 1970 ///
>             1975 1980 1985 1990 1995 2000 ///
>                 2005 2010)
{txt}
{com}. label var byear_5yr "5-year cohort"
{txt}
{com}. 
. egen age_5yr = cut(age), ///
>      at(20 25 30 35 40 45 ///
>             50 55 60)
{txt}(25717 missing values generated)

{com}. label var age_5yr "5-year age"
{txt}
{com}. 
. 
. gen edu_g = . 
{txt}(98593 missing values generated)

{com}. replace edu_g = 1 if educ==1
{txt}(855 real changes made)

{com}. replace edu_g = 2 if educ==2 | educ ==3 | educ == 4
{txt}(42895 real changes made)

{com}. replace edu_g = 3 if educ <=9 & educ>4
{txt}(54843 real changes made)

{com}. 
. label var edu_g "education group"
{txt}
{com}. label define edu_glb 1 "HS dropout" 2 "HS graduate" 3 "College/above"
{txt}
{com}. label value edu_g edu_glb
{txt}
{com}. 
. replace educ = edu_g 
{txt}(87619 real changes made)

{com}. 
. merge m:1 gender educ age_5yr YM ///
>          using "${c -(}otherdata_folder{c )-}/sipp/sipp_history_vol_decomposed_edu_gender_age5_annual.dta", keep(master match)
{res}{txt}{p 0 7 2}
(note: variable
educ was 
float, now double to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
gender was 
byte, now long to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
age_5yr was 
float, now double to accommodate using data's values)
{p_end}

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}          57,974
{txt}{col 9}from master{col 30}{res}          57,974{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}          40,619{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop _merge 
{txt}
{com}. 
. *******************************
. **  Set Panel Data Structure **
. *******************************
. 
. xtset ID date
{res}{txt}{col 8}panel variable:  {res}ID (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}date, 2013m6 to 2020m4, but with gaps
{txt}{col 17}delta:  {res}1 month
{txt}
{com}. sort ID date
{txt}
{com}. 
. *******************************
. ** Exclude youth and retired
. ******************************
. keep if age <= 60 & age >= 20
{txt}(23030 observations deleted)

{com}. 
. *******************************
. **  Summary Statistics of SCE **
. *******************************
. 
. tabstat ID,s(count) by(date) column(statistics)

{txt}Summary for variables: ID
{col 6}by categories of: date 

{ralign 9:date} {...}
{c |}         N
{hline 10}{c +}{hline 10}
{ralign 9: 2013m6} {...}
{c |}{...}
 {res}      891
{txt}{ralign 9: 2013m7} {...}
{c |}{...}
 {res}      850
{txt}{ralign 9: 2013m8} {...}
{c |}{...}
 {res}     1233
{txt}{ralign 9: 2013m9} {...}
{c |}{...}
 {res}     1082
{txt}{ralign 9:2013m10} {...}
{c |}{...}
 {res}     1091
{txt}{ralign 9:2013m11} {...}
{c |}{...}
 {res}     1083
{txt}{ralign 9:2013m12} {...}
{c |}{...}
 {res}      947
{txt}{ralign 9: 2014m1} {...}
{c |}{...}
 {res}      938
{txt}{ralign 9: 2014m2} {...}
{c |}{...}
 {res}      915
{txt}{ralign 9: 2014m3} {...}
{c |}{...}
 {res}      938
{txt}{ralign 9: 2014m4} {...}
{c |}{...}
 {res}      927
{txt}{ralign 9: 2014m5} {...}
{c |}{...}
 {res}      892
{txt}{ralign 9: 2014m6} {...}
{c |}{...}
 {res}      910
{txt}{ralign 9: 2014m7} {...}
{c |}{...}
 {res}      954
{txt}{ralign 9: 2014m8} {...}
{c |}{...}
 {res}      936
{txt}{ralign 9: 2014m9} {...}
{c |}{...}
 {res}      915
{txt}{ralign 9:2014m10} {...}
{c |}{...}
 {res}      903
{txt}{ralign 9:2014m11} {...}
{c |}{...}
 {res}      913
{txt}{ralign 9:2014m12} {...}
{c |}{...}
 {res}      882
{txt}{ralign 9: 2015m1} {...}
{c |}{...}
 {res}      900
{txt}{ralign 9: 2015m2} {...}
{c |}{...}
 {res}      907
{txt}{ralign 9: 2015m3} {...}
{c |}{...}
 {res}      869
{txt}{ralign 9: 2015m4} {...}
{c |}{...}
 {res}      885
{txt}{ralign 9: 2015m5} {...}
{c |}{...}
 {res}      891
{txt}{ralign 9: 2015m6} {...}
{c |}{...}
 {res}      885
{txt}{ralign 9: 2015m7} {...}
{c |}{...}
 {res}      869
{txt}{ralign 9: 2015m8} {...}
{c |}{...}
 {res}      848
{txt}{ralign 9: 2015m9} {...}
{c |}{...}
 {res}      879
{txt}{ralign 9:2015m10} {...}
{c |}{...}
 {res}      868
{txt}{ralign 9:2015m11} {...}
{c |}{...}
 {res}      866
{txt}{ralign 9:2015m12} {...}
{c |}{...}
 {res}      843
{txt}{ralign 9: 2016m1} {...}
{c |}{...}
 {res}      861
{txt}{ralign 9: 2016m2} {...}
{c |}{...}
 {res}      815
{txt}{ralign 9: 2016m3} {...}
{c |}{...}
 {res}      872
{txt}{ralign 9: 2016m4} {...}
{c |}{...}
 {res}      841
{txt}{ralign 9: 2016m5} {...}
{c |}{...}
 {res}      879
{txt}{ralign 9: 2016m6} {...}
{c |}{...}
 {res}      877
{txt}{ralign 9: 2016m7} {...}
{c |}{...}
 {res}      918
{txt}{ralign 9: 2016m8} {...}
{c |}{...}
 {res}      884
{txt}{ralign 9: 2016m9} {...}
{c |}{...}
 {res}      911
{txt}{ralign 9:2016m10} {...}
{c |}{...}
 {res}      906
{txt}{ralign 9:2016m11} {...}
{c |}{...}
 {res}      895
{txt}{ralign 9:2016m12} {...}
{c |}{...}
 {res}      933
{txt}{ralign 9: 2017m1} {...}
{c |}{...}
 {res}      936
{txt}{ralign 9: 2017m2} {...}
{c |}{...}
 {res}      932
{txt}{ralign 9: 2017m3} {...}
{c |}{...}
 {res}      949
{txt}{ralign 9: 2017m4} {...}
{c |}{...}
 {res}      886
{txt}{ralign 9: 2017m5} {...}
{c |}{...}
 {res}      944
{txt}{ralign 9: 2017m6} {...}
{c |}{...}
 {res}      941
{txt}{ralign 9: 2017m7} {...}
{c |}{...}
 {res}      948
{txt}{ralign 9: 2017m8} {...}
{c |}{...}
 {res}      942
{txt}{ralign 9: 2017m9} {...}
{c |}{...}
 {res}      919
{txt}{ralign 9:2017m10} {...}
{c |}{...}
 {res}      956
{txt}{ralign 9:2017m11} {...}
{c |}{...}
 {res}      921
{txt}{ralign 9:2017m12} {...}
{c |}{...}
 {res}      870
{txt}{ralign 9: 2018m1} {...}
{c |}{...}
 {res}      906
{txt}{ralign 9: 2018m2} {...}
{c |}{...}
 {res}      908
{txt}{ralign 9: 2018m3} {...}
{c |}{...}
 {res}      896
{txt}{ralign 9: 2018m4} {...}
{c |}{...}
 {res}      875
{txt}{ralign 9: 2018m5} {...}
{c |}{...}
 {res}      878
{txt}{ralign 9: 2018m6} {...}
{c |}{...}
 {res}      873
{txt}{ralign 9: 2018m7} {...}
{c |}{...}
 {res}      910
{txt}{ralign 9: 2018m8} {...}
{c |}{...}
 {res}      897
{txt}{ralign 9: 2018m9} {...}
{c |}{...}
 {res}      884
{txt}{ralign 9:2018m10} {...}
{c |}{...}
 {res}      931
{txt}{ralign 9:2018m11} {...}
{c |}{...}
 {res}      907
{txt}{ralign 9:2018m12} {...}
{c |}{...}
 {res}      855
{txt}{ralign 9: 2019m1} {...}
{c |}{...}
 {res}      937
{txt}{ralign 9: 2019m2} {...}
{c |}{...}
 {res}      917
{txt}{ralign 9: 2019m3} {...}
{c |}{...}
 {res}      925
{txt}{ralign 9: 2019m4} {...}
{c |}{...}
 {res}      912
{txt}{ralign 9: 2019m5} {...}
{c |}{...}
 {res}      895
{txt}{ralign 9: 2019m6} {...}
{c |}{...}
 {res}      896
{txt}{ralign 9: 2019m7} {...}
{c |}{...}
 {res}      908
{txt}{ralign 9: 2019m8} {...}
{c |}{...}
 {res}      894
{txt}{ralign 9: 2019m9} {...}
{c |}{...}
 {res}      904
{txt}{ralign 9:2019m10} {...}
{c |}{...}
 {res}      880
{txt}{ralign 9:2019m11} {...}
{c |}{...}
 {res}      867
{txt}{ralign 9:2019m12} {...}
{c |}{...}
 {res}      874
{txt}{ralign 9: 2020m1} {...}
{c |}{...}
 {res}      896
{txt}{ralign 9: 2020m2} {...}
{c |}{...}
 {res}      913
{txt}{ralign 9: 2020m3} {...}
{c |}{...}
 {res}      884
{txt}{ralign 9: 2020m4} {...}
{c |}{...}
 {res}      895
{txt}{hline 10}{c +}{hline 10}
{ralign 9:Total} {...}
{c |}{...}
 {res}    75563
{txt}{hline 10}{c BT}{hline 10}

{com}. 
. *******************************
. **  Generate Variables       **
. *******************************
. 
. gen Incmean = .
{txt}(75563 missing values generated)

{com}. gen Incvar = .
{txt}(75563 missing values generated)

{com}. gen Inciqr = .
{txt}(75563 missing values generated)

{com}. 
. gen Incmean_ch = .
{txt}(75563 missing values generated)

{com}. gen Incvar_ch = .
{txt}(75563 missing values generated)

{com}. gen Inciqr_ch = .
{txt}(75563 missing values generated)

{com}. 
. 
. gen Inc_mom = .
{txt}(75563 missing values generated)

{com}. gen Inc_mom_ch = .
{txt}(75563 missing values generated)

{com}. 
. *** take the log
. 
. foreach mom in var{c -(}
{txt}  2{com}. gen linc`mom'= log(inc`mom') 
{txt}  3{com}. gen lrinc`mom' = log(rinc`mom') 
{txt}  4{com}. {c )-}
{txt}(18103 missing values generated)
(21604 missing values generated)

{com}. 
. 
. foreach mom in iqr{c -(}
{txt}  2{com}. gen linc`mom'= log(inc`mom') 
{txt}  3{com}. {c )-}
{txt}(13752 missing values generated)

{com}. 
. label var linciqr "log perceived iqr"
{txt}
{com}. label var lincvar "log perceived risk"
{txt}
{com}. label var lrincvar "log perceived risk (real)"
{txt}
{com}. label var spending "expected growth in spending"
{txt}
{com}. 
. *************************************
. *** Poisson rate in expectations 
. **************************************
. 
. 
. gen exp_s = log(1-UEprobInd4m)/(-3) 
{txt}(69290 missing values generated)

{com}. * can use exp_eu from micro data 
. label var exp_s "expected Poisson separation rate"
{txt}
{com}. 
. gen exp_f =log(1-EUprobInd)/(-4)
{txt}(24519 missing values generated)

{com}. * can use exp_ue from micro data 
. label var exp_f "expected Poisson job-finding rate"
{txt}
{com}. 
. gen exp_s_1y = log(1-UEprobInd)/(-12) 
{txt}(19941 missing values generated)

{com}. * can use exp_eu from micro data 
. label var exp_s_1y "expected Poisson separation rate (1 year)"
{txt}
{com}. 
. *************************************
. *** Variables for overreaction test 
. **************************************
. 
. 
. ** earning risk 
. 
. gen rincvar_rv = rincvar - l1.rincvar
{txt}(37156 missing values generated)

{com}. label var rincvar "revision in earning risk"
{txt}
{com}. gen incvar_rv = incvar - l1.incvar
{txt}(33370 missing values generated)

{com}. label var incvar "revision in earning risk"
{txt}
{com}. 
. gen rincvar_all_fe = rincvar-rincvar_all_rl
{txt}(54562 missing values generated)

{com}. label var rincvar_all_fe "forecast error in earning risk"
{txt}
{com}. gen rincvar_sub_fe = rincvar-rincvar_sub_rl
{txt}(57737 missing values generated)

{com}. label var rincvar_all_fe "forecast error in earning risk"
{txt}
{com}. 
. ** negative fe means underestimation 
. 
. foreach var in prisk2_all trisk2_all prisk2_sub trisk2_sub rincvar_all_now rincvar_sub_now{c -(}
{txt}  2{com}. gen `var'_ch = `var'-l1.`var'
{txt}  3{com}. {c )-}
{txt}(37907 missing values generated)
(36441 missing values generated)
(46377 missing values generated)
(45253 missing values generated)
(52761 missing values generated)
(56542 missing values generated)

{com}. 
. ** separation risk
. gen exp_s_1y_fe = exp_s_1y - f1.s
{txt}(32064 missing values generated)

{com}. label var exp_s_1y_fe "forecast error of separation rate"
{txt}
{com}. 
. gen exp_s_1y_rv = exp_s_1y - l1.exp_s_1y
{txt}(33477 missing values generated)

{com}. label var exp_s_1y_rv "revision in separation rate"
{txt}
{com}. 
. gen exp_s_fe = exp_s - f4.s
{txt}(72028 missing values generated)

{com}. label var exp_s_fe "forecast error of separation rate"
{txt}
{com}. gen exp_s_rv = exp_s - l4.exp_s
{txt}(73211 missing values generated)

{com}. label var exp_s_rv "revision in separation rate"
{txt}
{com}. 
. gen exp_f_fe = exp_f - f1.f
{txt}(35569 missing values generated)

{com}. label var exp_s_fe "forecast error of separation rate"
{txt}
{com}. 
. gen exp_f_rv = exp_f - l1.exp_f
{txt}(38120 missing values generated)

{com}. label var exp_f_rv "revision in separation rate"
{txt}
{com}. 
. ***********************************************
. **** Job experiences/transitions/search *****
. ***********************************************
. 
. gen emp_status = .
{txt}(75563 missing values generated)

{com}. 
. replace emp_status = 1 if Q10_1==1|Q10_2==1|Q10_5==1
{txt}(62970 real changes made)

{com}. replace emp_status = 2 if Q10_3==1|Q10_4==1
{txt}(3137 real changes made)

{com}. replace emp_status = 3 if Q10_6==1|Q10_7==1|Q10_8==1|Q10_9==1
{txt}(12548 real changes made)

{com}. 
. label define emp_status_lb 1 "employed" 2 "unemployed" 3 "non-working"
{txt}
{com}. label value emp_status emp_status_lb
{txt}
{com}. 
. gen e2u = cond(emp_status==2 & (l1.emp_status==1|l2.emp_status==1|l3.emp_status==1|l4.emp_status==1),1,0)
{txt}
{com}. label var e2u "employed since m-4 and unemployed now"
{txt}
{com}. 
. gen u2e = cond(emp_status==1 &  (l1.emp_status==2|l2.emp_status==2|l3.emp_status==2|l4.emp_status==2),1,0)
{txt}
{com}. label var u2e "unemployed since m-4 and employed now"
{txt}
{com}. 
. 
. gen e2um8 = cond(emp_status==2 & ///
>                  (l1.emp_status==1|l2.emp_status==1|l3.emp_status==1|l4.emp_status==1| ///
>                                   l5.emp_status==1|l6.emp_status==1|l7.emp_status==1|l8.emp_status==1),1,0)
{txt}
{com}. label var e2um8 "employed since m-8 and unemployed now"
{txt}
{com}. 
. gen u2em8 = cond(emp_status==1 &  ///
>                (l1.emp_status==2|l2.emp_status==2|l3.emp_status==2|l4.emp_status==2| ///
>                            l5.emp_status==2|l6.emp_status==2|l7.emp_status==2|l5.emp_status==2),1,0)
{txt}
{com}. label var u2em8 "unemployed since m-8 and employed now"
{txt}
{com}. 
. 
. gen e2um12 = cond(emp_status==2 & ///
>                  (l1.emp_status==1|l2.emp_status==1|l3.emp_status==1|l4.emp_status==1| ///
>                                   l5.emp_status==1|l6.emp_status==1|l7.emp_status==1|l8.emp_status==1| ///
>                                   l9.emp_status==1|l10.emp_status==1|l11.emp_status==1|l12.emp_status==1),1,0)
{txt}
{com}. label var e2um12 "employed since y-1 and unemployed now"
{txt}
{com}. 
. gen u2em12 = cond(emp_status==1 &  ///
>                (l1.emp_status==2|l2.emp_status==2|l3.emp_status==2|l4.emp_status==2| ///
>                            l5.emp_status==2|l6.emp_status==2|l7.emp_status==2|l5.emp_status==2| ///
>                             l9.emp_status==2|l10.emp_status==2|l11.emp_status==2|l12.emp_status==2),1,0)
{txt}
{com}. label var u2em12 "unemployed since y-1 and employed now"
{txt}
{com}. 
. *************************
. *** Exclude outliers *****
. *************************
. 
. local vars incvar rincvar l3
{txt}
{com}. 
. foreach var in `vars'{c -(}
{txt}  2{com}.       egen `var'pl=pctile(`var'),p(1)
{txt}  3{com}.           egen `var'pu=pctile(`var'),p(99)
{txt}  4{com}.           replace `var' = . if `var' <`var'pl | (`var' >`var'pu & `var'!=.)
{txt}  5{com}. {c )-}
{txt}(2858 real changes made, 2858 to missing)
(767 real changes made, 767 to missing)
(201 real changes made, 201 to missing)

{com}. 
. *************************
. ** macro variables normalization
. *****************************
. 
. replace he = he*l3.CPIAU/CPIAU
{txt}(75563 real changes made, 29796 to missing)

{com}. label var he "real hourly earning growth"
{txt}
{com}. 
. gen ue_chg = uerate - l3.uerate
{txt}(29796 missing values generated)

{com}. label var ue_chg "change in unemployment rate"
{txt}
{com}. 
. ************************
. ** group variables ****
. ************************
. ** age square
. gen age2 = age^2
{txt}
{com}. label var age2 "age squared"
{txt}
{com}. 
. 
. ***********************************
. ** new variables SCE realizations **
. **********************************
. 
. * log earning 
. gen wage_1y = l3*100/CPIAU
{txt}(65427 missing values generated)

{com}. label var wage_1y "average real annual earning from primary job"
{txt}
{com}. 
. ** average earning 
. egen wage_1y_av = mean(wage_1y), by(ID)
{txt}(26147 missing values generated)

{com}. label var wage_1y_av "average real annual earning across time"
{txt}
{com}. 
. ** income decile
. egen earning_gp = xtile(wage_1y_av), by(date) n(10) 
{txt}(26147 missing values generated)

{com}. label var earning_gp "decile of earning from low to high"
{txt}
{com}. 
. gen lwage_1y = log(wage_1y)
{txt}(65427 missing values generated)

{com}. label var lwage_1y "log average annual earning from primary job"
{txt}
{com}. 
. gen lwage_1y_gm4 = lwage_1y-l4.lwage_1y
{txt}(70650 missing values generated)

{com}. label var lwage_1y_gm4 "log annual earning growth from previous m-4 to m"
{txt}
{com}. 
. egen lwage_1y_gm4_sd = sd(lwage_1y_gm4), by(date)
{txt}(61951 missing values generated)

{com}. label var lwage_1y_gm4 "std log annual earning growth from previous m-4 to m"
{txt}
{com}. 
. ** generate cross-sectional std
. egen lwage_1y_sd = sd(lwage_1y), by(date)
{txt}(61013 missing values generated)

{com}. 
. ** mincer regressions 
. reghdfe lwage_1y age age2, a(i.gender i.edu_g) resid
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 3 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     8,751
{txt}Absorbing 2 HDFE groups{col 51}F({res}   2{txt},{res}   8745{txt}){col 67}= {res}     58.44
{txt}{col 51}Prob > F{col 67}= {res}    0.0000
{txt}{col 51}R-squared{col 67}= {res}    0.1281
{txt}{col 51}Adj R-squared{col 67}= {res}    0.1276
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0132
{txt}{col 51}Root MSE{col 67}= {res}    0.9399

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    lwage_1y{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2}  .087877{col 26}{space 2} .0085779{col 37}{space 1}   10.24{col 46}{space 3}0.000{col 54}{space 4} .0710623{col 67}{space 3} .1046917
{txt}{space 8}age2 {c |}{col 14}{res}{space 2}-.0009885{col 26}{space 2}  .000101{col 37}{space 1}   -9.78{col 46}{space 3}0.000{col 54}{space 4}-.0011865{col 67}{space 3}-.0007904
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 7.991126{col 26}{space 2} .1740459{col 37}{space 1}   45.91{col 46}{space 3}0.000{col 54}{space 4} 7.649955{col 67}{space 3} 8.332297
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}      gender{col 14}{c |}{space 1}        2{col 27}{space 1}        0{col 39}{result}{space 1}        2{col 53}{text} {col 54}{c |}
{col 1}{text}       edu_g{col 14}{c |}{space 1}        3{col 27}{space 1}        1{col 39}{result}{space 1}        2{col 53}{text} {col 54}{c |}
{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}

{com}. predict lwage_1y_shk, residuals
{txt}(66812 missing values generated)

{com}. 
. * including aggregate shock
. reghdfe lwage_1y age age2, a(i.date i.gender i.edu_g) resid
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 4 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     8,751
{txt}Absorbing 3 HDFE groups{col 51}F({res}   2{txt},{res}   8730{txt}){col 67}= {res}     58.40
{txt}{col 51}Prob > F{col 67}= {res}    0.0000
{txt}{col 51}R-squared{col 67}= {res}    0.1296
{txt}{col 51}Adj R-squared{col 67}= {res}    0.1276
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0132
{txt}{col 51}Root MSE{col 67}= {res}    0.9399

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    lwage_1y{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2}  .087862{col 26}{space 2}  .008584{col 37}{space 1}   10.24{col 46}{space 3}0.000{col 54}{space 4} .0710354{col 67}{space 3} .1046886
{txt}{space 8}age2 {c |}{col 14}{res}{space 2}-.0009881{col 26}{space 2} .0001011{col 37}{space 1}   -9.77{col 46}{space 3}0.000{col 54}{space 4}-.0011863{col 67}{space 3}-.0007899
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 7.991048{col 26}{space 2} .1741738{col 37}{space 1}   45.88{col 46}{space 3}0.000{col 54}{space 4} 7.649627{col 67}{space 3}  8.33247
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}        date{col 14}{c |}{space 1}       16{col 27}{space 1}        0{col 39}{result}{space 1}       16{col 53}{text} {col 54}{c |}
{col 1}{text}      gender{col 14}{c |}{space 1}        2{col 27}{space 1}        1{col 39}{result}{space 1}        1{col 53}{text} {col 54}{c |}
{col 1}{text}       edu_g{col 14}{c |}{space 1}        3{col 27}{space 1}        1{col 39}{result}{space 1}        2{col 53}{text}?{col 54}{c |}
{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
? = number of redundant parameters may be higher

{com}. predict lwage_1y_id_shk, residuals
{txt}(66812 missing values generated)

{com}. 
. gen lwage_1y_ag_shk = lwage_1y_shk- lwage_1y_id_shk
{txt}(66812 missing values generated)

{com}. 
. label var lwage_1y_shk "log wage shock"
{txt}
{com}. label var lwage_1y_id_shk "log wage idiosyncratic shock"
{txt}
{com}. label var lwage_1y_ag_shk "log wage aggregate shock"
{txt}
{com}. 
. ** first difference
. foreach var in lwage_1y_shk lwage_1y_id_shk lwage_1y_ag_shk{c -(}
{txt}  2{com}. gen `var'_gr = `var'- l4.`var'
{txt}  3{com}. {c )-}
{txt}(71469 missing values generated)
(71469 missing values generated)
(71469 missing values generated)

{com}. 
. label var lwage_1y_shk_gr "log growth of unexplained wage"
{txt}
{com}. label var lwage_1y_id_shk_gr "log growth of idiosyncratic unexplained wage"
{txt}
{com}. label var lwage_1y_ag_shk_gr "log growth of aggregate unexplained wage"
{txt}
{com}. 
. 
. ** inequality  
. gen lwage_1y_shk2 = log(lwage_1y_shk^2)
{txt}(66812 missing values generated)

{com}. label var lwage_1y_shk2 "squared log residuals"
{txt}
{com}. 
. ** volatility 
. gen lwage_1y_shk_gr2 = log(lwage_1y_shk_gr^2)
{txt}(71469 missing values generated)

{com}. label var lwage_1y_shk_gr2 "squared log shocks"
{txt}
{com}. 
. egen lwage_1y_shk_gr_sd = sd(lwage_1y_shk_gr), by(date)
{txt}(61951 missing values generated)

{com}. label var lwage_1y_shk_gr_sd "standard deviation of log shocks"
{txt}
{com}. 
. gen lwage_1y_shk_gr_var = lwage_1y_shk_gr_sd^2
{txt}(61951 missing values generated)

{com}. label var lwage_1y_shk_gr_sd "var of log shocks"
{txt}
{com}. 
. 
. /*
> ***********************************************
> ** summary chart of unconditional wages ********
> ************************************************
> 
> preserve
> 
> collapse (mean) lwage_1y lwage_1y_sd, by(date year month) 
> ** average log wage whole sample
> twoway  (connected lwage_1y date) if lwage_1y!=., title("The mean of log real wages") 
> graph export "${c -(}graph_folder{c )-}/log_wage_av.png", as(png) replace 
> 
> ** std log wage whole sample
> twoway  (connected lwage_1y_sd date) if lwage_1y_sd!=., title("The standard deviation of log real wages") 
> graph export "${c -(}graph_folder{c )-}/log_wage_sd.png", as(png) replace 
> restore 
> 
> 
> ************************************************
> ** summary chart of conditional wages ********
> ************************************************
> 
> preserve
> 
> collapse (mean) lwage_1y_shk_gr lwage_1y_shk_gr_sd, by(year month date) 
> ** average log wage shock whole sample
> twoway  (connected lwage_1y_shk_gr date) if lwage_1y_shk_gr!=., title("The mean of log real wage shocks") 
> graph export "${c -(}graph_folder{c )-}/log_wage_shk_gr.png", as(png) replace 
> 
> ** std log wage whole sample
> twoway  (connected lwage_1y_shk_gr_sd date) if lwage_1y_shk_gr_sd!=., title("The standard deviation of log real wage shocks") 
> graph export "${c -(}graph_folder{c )-}/log_wage_shk_gr_sd.png", as(png) replace
> restore 
> */
. 
. ***************************************
. **** earning level and risk perceptions
. ***************************************
. 
. gen rincsd = sqrt(rincvar)
{txt}(22371 missing values generated)

{com}. 
. graph bar rincsd, ///
>            over(earning_gp,relabel(1 "10%" 2 "20%" 3 "30%" 4 "40%" 5 "50%" 6 "60%" 7 "70%" 8 "80%" 9 "90%" 10 "100%")) ///
>                    bar(1, color(navy)) ///
>                    title("Perceived risk by real earning") ///
>                    b1title("earning decile") ///
>                    ytitle("Average perceived risk (std)") 
{res}{txt}
{com}. graph export "${c -(}sum_graph_folder{c )-}/boxplot_rvar_earning.png", as(png) replace 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/boxplot_rvar_earning.png written in PNG format)

{com}. 
. 
. ***************************************
. **** unemployment experience and risk perceptions
. ***************************************
. 
. /*
> graph box rincsd, over(u2e,relabel(1 "other" 2 "recently unemployed")) ///
>          title("Perceived risk by unemployment experience") ///
>                  ytitle("Average perceived risk (std)") 
> graph export "${c -(}sum_graph_folder{c )-}/boxplot_rvar_ue_peperience.png", as(png) replace 
> 
> 
> graph box rincsd, over(u2em12,relabel(1 "other" 2 "unemployed within past year")) ///
>          title("Perceived risk by unemployment experience") ///
>                  ytitle("Average perceived risk (std)") 
> graph export "${c -(}sum_graph_folder{c )-}/boxplot_rvar_ue_peperience_m12.png", as(png) replace 
> */
. 
. 
. ************************************************
. ** income shock /volatility and risk perceptions ********
. ************************************************
. 
. ** earning risks 
. 
. eststo clear
{txt}
{com}. label var prisk2_all_ch  "change in p risk from m-1 to m"
{txt}
{com}. label var trisk2_all_ch "change in t risk from m-1 to m"
{txt}
{com}. label var rincvar_all_now_ch "change in annual earning risk from m-1 to m"
{txt}
{com}. label var rincvar_sub_now_ch "change in annual group earning risk from m-1 to m"
{txt}
{com}. label var rincvar_all_now "realized annual earning risk"
{txt}
{com}. label var rincvar_sub_now "realized annual group earning risk"
{txt}
{com}. 
. eststo: reghdfe rincvar_rv prisk2_all_ch trisk2_all_ch, a(ID)
{res}{txt}(dropped 707 {browse "http://scorreia.com/research/singletons.pdf":singleton observations})
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 1 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}    23,902
{txt}Absorbing 1 HDFE group{col 51}F({res}   2{txt},{res}  19919{txt}){col 67}= {res}      3.25
{txt}{col 51}Prob > F{col 67}= {res}    0.0388
{txt}{col 51}R-squared{col 67}= {res}    0.0958
{txt}{col 51}Adj R-squared{col 67}= {res}   -0.0849
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0003
{txt}{col 51}Root MSE{col 67}= {res}    0.0017

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   rincvar_rv{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
prisk2_all_ch {c |}{col 15}{res}{space 2} .0266915{col 27}{space 2} .0123164{col 38}{space 1}    2.17{col 47}{space 3}0.030{col 55}{space 4} .0025505{col 68}{space 3} .0508326
{txt}trisk2_all_ch {c |}{col 15}{res}{space 2}-.0567356{col 27}{space 2} .0306319{col 38}{space 1}   -1.85{col 47}{space 3}0.064{col 55}{space 4}-.1167768{col 68}{space 3} .0033055
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}-.0001012{col 27}{space 2} .0000107{col 38}{space 1}   -9.44{col 47}{space 3}0.000{col 55}{space 4}-.0001222{col 68}{space 3}-.0000802
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}          ID{col 14}{c |}{space 1}     3981{col 27}{space 1}        0{col 39}{result}{space 1}     3981{col 53}{text} {col 54}{c |}
{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
({res}est1{txt} stored)

{com}. eststo: reghdfe rincvar_rv prisk2_sub_ch trisk2_sub_ch, a(ID)
{res}{txt}(dropped 1060 {browse "http://scorreia.com/research/singletons.pdf":singleton observations})
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 1 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}    18,261
{txt}Absorbing 1 HDFE group{col 51}F({res}   2{txt},{res}  15175{txt}){col 67}= {res}      0.94
{txt}{col 51}Prob > F{col 67}= {res}    0.3905
{txt}{col 51}R-squared{col 67}= {res}    0.1020
{txt}{col 51}Adj R-squared{col 67}= {res}   -0.0805
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0001
{txt}{col 51}Root MSE{col 67}= {res}    0.0016

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   rincvar_rv{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
prisk2_sub_ch {c |}{col 15}{res}{space 2}-.0008882{col 27}{space 2} .0011794{col 38}{space 1}   -0.75{col 47}{space 3}0.451{col 55}{space 4}   -.0032{col 68}{space 3} .0014237
{txt}trisk2_sub_ch {c |}{col 15}{res}{space 2}-.0039282{col 27}{space 2} .0034854{col 38}{space 1}   -1.13{col 47}{space 3}0.260{col 55}{space 4}-.0107601{col 68}{space 3} .0029036
{txt}{space 8}_cons {c |}{col 15}{res}{space 2} -.000115{col 27}{space 2}  .000012{col 38}{space 1}   -9.60{col 47}{space 3}0.000{col 55}{space 4}-.0001385{col 68}{space 3}-.0000916
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}          ID{col 14}{c |}{space 1}     3084{col 27}{space 1}        0{col 39}{result}{space 1}     3084{col 53}{text} {col 54}{c |}
{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
({res}est2{txt} stored)

{com}. 
. eststo: reghdfe rincvar_rv rincvar_all_now_ch, a(ID)
{res}{txt}(dropped 488 {browse "http://scorreia.com/research/singletons.pdf":singleton observations})
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 1 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}    14,617
{txt}Absorbing 1 HDFE group{col 51}F({res}   1{txt},{res}  12220{txt}){col 67}= {res}      4.18
{txt}{col 51}Prob > F{col 67}= {res}    0.0409
{txt}{col 51}R-squared{col 67}= {res}    0.0878
{txt}{col 51}Adj R-squared{col 67}= {res}   -0.0911
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0003
{txt}{col 51}Root MSE{col 67}= {res}    0.0016

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        rincvar_rv{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      t{col 52}   P>|t|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
rincvar_all_now_ch {c |}{col 20}{res}{space 2} .0341592{col 32}{space 2} .0167095{col 43}{space 1}    2.04{col 52}{space 3}0.041{col 60}{space 4}  .001406{col 73}{space 3} .0669124
{txt}{space 13}_cons {c |}{col 20}{res}{space 2}-.0001153{col 32}{space 2} .0000141{col 43}{space 1}   -8.20{col 52}{space 3}0.000{col 60}{space 4}-.0001428{col 73}{space 3}-.0000877
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}          ID{col 14}{c |}{space 1}     2396{col 27}{space 1}        0{col 39}{result}{space 1}     2396{col 53}{text} {col 54}{c |}
{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
({res}est3{txt} stored)

{com}. eststo: reghdfe rincvar_rv rincvar_sub_now_ch, a(ID)
{res}{txt}(dropped 520 {browse "http://scorreia.com/research/singletons.pdf":singleton observations})
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 1 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}    12,208
{txt}Absorbing 1 HDFE group{col 51}F({res}   1{txt},{res}  10120{txt}){col 67}= {res}      0.18
{txt}{col 51}Prob > F{col 67}= {res}    0.6716
{txt}{col 51}R-squared{col 67}= {res}    0.0908
{txt}{col 51}Adj R-squared{col 67}= {res}   -0.0967
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0000
{txt}{col 51}Root MSE{col 67}= {res}    0.0016

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        rincvar_rv{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      t{col 52}   P>|t|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
rincvar_sub_now_ch {c |}{col 20}{res}{space 2} .0006623{col 32}{space 2} .0015622{col 43}{space 1}    0.42{col 52}{space 3}0.672{col 60}{space 4}-.0023999{col 73}{space 3} .0037246
{txt}{space 13}_cons {c |}{col 20}{res}{space 2}-.0001211{col 32}{space 2} .0000146{col 43}{space 1}   -8.29{col 52}{space 3}0.000{col 60}{space 4}-.0001498{col 73}{space 3}-.0000925
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}          ID{col 14}{c |}{space 1}     2087{col 27}{space 1}        0{col 39}{result}{space 1}     2087{col 53}{text} {col 54}{c |}
{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
({res}est4{txt} stored)

{com}. 
. eststo: reghdfe rincvar rincvar_all_now, a(ID)
{res}{txt}(dropped 1411 {browse "http://scorreia.com/research/singletons.pdf":singleton observations})
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 1 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}    20,372
{txt}Absorbing 1 HDFE group{col 51}F({res}   1{txt},{res}  17323{txt}){col 67}= {res}    101.99
{txt}{col 51}Prob > F{col 67}= {res}    0.0000
{txt}{col 51}R-squared{col 67}= {res}    0.5578
{txt}{col 51}Adj R-squared{col 67}= {res}    0.4801
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0059
{txt}{col 51}Root MSE{col 67}= {res}    0.0012

{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        rincvar{col 17}{c |}      Coef.{col 29}   Std. Err.{col 41}      t{col 49}   P>|t|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
rincvar_all_now {c |}{col 17}{res}{space 2}-.0559146{col 29}{space 2} .0055365{col 40}{space 1}  -10.10{col 49}{space 3}0.000{col 57}{space 4}-.0667667{col 70}{space 3}-.0450624
{txt}{space 10}_cons {c |}{col 17}{res}{space 2} .0018105{col 29}{space 2} .0000624{col 40}{space 1}   29.01{col 49}{space 3}0.000{col 57}{space 4} .0016882{col 70}{space 3} .0019328
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}          ID{col 14}{c |}{space 1}     3048{col 27}{space 1}        0{col 39}{result}{space 1}     3048{col 53}{text} {col 54}{c |}
{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
({res}est5{txt} stored)

{com}. eststo: reghdfe rincvar rincvar_sub_now, a(ID)
{res}{txt}(dropped 1308 {browse "http://scorreia.com/research/singletons.pdf":singleton observations})
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 1 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}    17,343
{txt}Absorbing 1 HDFE group{col 51}F({res}   1{txt},{res}  14586{txt}){col 67}= {res}      0.01
{txt}{col 51}Prob > F{col 67}= {res}    0.9420
{txt}{col 51}R-squared{col 67}= {res}    0.5589
{txt}{col 51}Adj R-squared{col 67}= {res}    0.4755
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0000
{txt}{col 51}Root MSE{col 67}= {res}    0.0012

{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        rincvar{col 17}{c |}      Coef.{col 29}   Std. Err.{col 41}      t{col 49}   P>|t|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
rincvar_sub_now {c |}{col 17}{res}{space 2}-.0000484{col 29}{space 2} .0006658{col 40}{space 1}   -0.07{col 49}{space 3}0.942{col 57}{space 4}-.0013534{col 70}{space 3} .0012566
{txt}{space 10}_cons {c |}{col 17}{res}{space 2} .0011918{col 29}{space 2} .0000135{col 40}{space 1}   88.39{col 49}{space 3}0.000{col 57}{space 4} .0011653{col 70}{space 3} .0012182
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}          ID{col 14}{c |}{space 1}     2756{col 27}{space 1}        0{col 39}{result}{space 1}     2756{col 53}{text} {col 54}{c |}
{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
({res}est6{txt} stored)

{com}. 
. esttab using "${c -(}sum_table_folder{c )-}/ind/extrapolation_earning_risk.csv", label mtitles se r2 ///
> drop(_cons) replace
{res}{txt}(output written to {browse  `"/Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/ind/extrapolation_earning_risk.csv"'})

{com}. eststo clear
{txt}
{com}. ddd
{err}unrecognized command:  ddd
{txt}{search r(199):r(199);}

end of do-file

{search r(199):r(199);}

{com}. reghdfe rincvar_rv l1.prisk2_all_ch l1.trisk2_all_ch, a(ID)
{res}{txt}(dropped 652 {browse "http://scorreia.com/research/singletons.pdf":singleton observations})
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 1 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}    19,833
{txt}Absorbing 1 HDFE group{col 51}F({res}   2{txt},{res}  16342{txt}){col 67}= {res}      0.66
{txt}{col 51}Prob > F{col 67}= {res}    0.5179
{txt}{col 51}R-squared{col 67}= {res}    0.0841
{txt}{col 51}Adj R-squared{col 67}= {res}   -0.1115
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0001
{txt}{col 51}Root MSE{col 67}= {res}    0.0016

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   rincvar_rv{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
prisk2_all_ch {c |}
{space 10}L1. {c |}{col 15}{res}{space 2} .0060163{col 27}{space 2} .0130042{col 38}{space 1}    0.46{col 47}{space 3}0.644{col 55}{space 4}-.0194734{col 68}{space 3} .0315061
{txt}{space 13} {c |}
trisk2_all_ch {c |}
{space 10}L1. {c |}{col 15}{res}{space 2} .0288153{col 27}{space 2} .0322177{col 38}{space 1}    0.89{col 47}{space 3}0.371{col 55}{space 4}-.0343349{col 68}{space 3} .0919656
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2}-.0000687{col 27}{space 2} .0000113{col 38}{space 1}   -6.10{col 47}{space 3}0.000{col 55}{space 4}-.0000908{col 68}{space 3}-.0000466
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}          ID{col 14}{c |}{space 1}     3489{col 27}{space 1}        0{col 39}{result}{space 1}     3489{col 53}{text} {col 54}{c |}
{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}

{com}. reghdfe rincvar_rv l(0/1).prisk2_all_ch l(0/1).trisk2_all_ch, a(ID)
{res}{txt}(dropped 642 {browse "http://scorreia.com/research/singletons.pdf":singleton observations})
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 1 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}    19,052
{txt}Absorbing 1 HDFE group{col 51}F({res}   4{txt},{res}  15630{txt}){col 67}= {res}      1.69
{txt}{col 51}Prob > F{col 67}= {res}    0.1497
{txt}{col 51}R-squared{col 67}= {res}    0.0862
{txt}{col 51}Adj R-squared{col 67}= {res}   -0.1137
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0004
{txt}{col 51}Root MSE{col 67}= {res}    0.0016

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   rincvar_rv{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
prisk2_all_ch {c |}
{space 10}--. {c |}{col 15}{res}{space 2} .0275798{col 27}{space 2}  .013659{col 38}{space 1}    2.02{col 47}{space 3}0.043{col 55}{space 4} .0008066{col 68}{space 3}  .054353
{txt}{space 10}L1. {c |}{col 15}{res}{space 2} .0107067{col 27}{space 2} .0138845{col 38}{space 1}    0.77{col 47}{space 3}0.441{col 55}{space 4}-.0165086{col 68}{space 3}  .037922
{txt}{space 13} {c |}
trisk2_all_ch {c |}
{space 10}--. {c |}{col 15}{res}{space 2}-.0419185{col 27}{space 2} .0339255{col 38}{space 1}   -1.24{col 47}{space 3}0.217{col 55}{space 4}-.1084165{col 68}{space 3} .0245795
{txt}{space 10}L1. {c |}{col 15}{res}{space 2} .0345187{col 27}{space 2} .0349354{col 38}{space 1}    0.99{col 47}{space 3}0.323{col 55}{space 4}-.0339588{col 68}{space 3} .1029962
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2}-.0000691{col 27}{space 2} .0000115{col 38}{space 1}   -6.01{col 47}{space 3}0.000{col 55}{space 4}-.0000916{col 68}{space 3}-.0000466
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}          ID{col 14}{c |}{space 1}     3418{col 27}{space 1}        0{col 39}{result}{space 1}     3418{col 53}{text} {col 54}{c |}
{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}

{com}. reghdfe rincvar_rv l(0/1).prisk2_all_ch l(0/1).trisk2_all_ch, a(i.ID)
{res}{txt}(dropped 642 {browse "http://scorreia.com/research/singletons.pdf":singleton observations})
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 1 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}    19,052
{txt}Absorbing 1 HDFE group{col 51}F({res}   4{txt},{res}  15630{txt}){col 67}= {res}      1.69
{txt}{col 51}Prob > F{col 67}= {res}    0.1497
{txt}{col 51}R-squared{col 67}= {res}    0.0862
{txt}{col 51}Adj R-squared{col 67}= {res}   -0.1137
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0004
{txt}{col 51}Root MSE{col 67}= {res}    0.0016

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   rincvar_rv{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
prisk2_all_ch {c |}
{space 10}--. {c |}{col 15}{res}{space 2} .0275798{col 27}{space 2}  .013659{col 38}{space 1}    2.02{col 47}{space 3}0.043{col 55}{space 4} .0008066{col 68}{space 3}  .054353
{txt}{space 10}L1. {c |}{col 15}{res}{space 2} .0107067{col 27}{space 2} .0138845{col 38}{space 1}    0.77{col 47}{space 3}0.441{col 55}{space 4}-.0165086{col 68}{space 3}  .037922
{txt}{space 13} {c |}
trisk2_all_ch {c |}
{space 10}--. {c |}{col 15}{res}{space 2}-.0419185{col 27}{space 2} .0339255{col 38}{space 1}   -1.24{col 47}{space 3}0.217{col 55}{space 4}-.1084165{col 68}{space 3} .0245795
{txt}{space 10}L1. {c |}{col 15}{res}{space 2} .0345187{col 27}{space 2} .0349354{col 38}{space 1}    0.99{col 47}{space 3}0.323{col 55}{space 4}-.0339588{col 68}{space 3} .1029962
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2}-.0000691{col 27}{space 2} .0000115{col 38}{space 1}   -6.01{col 47}{space 3}0.000{col 55}{space 4}-.0000916{col 68}{space 3}-.0000466
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}          ID{col 14}{c |}{space 1}     3418{col 27}{space 1}        0{col 39}{result}{space 1}     3418{col 53}{text} {col 54}{c |}
{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}

{com}. reghdfe rincvar_rv l(0/3).prisk2_all_ch l(0/3).trisk2_all_ch, a(i.ID)
{res}{txt}(dropped 528 {browse "http://scorreia.com/research/singletons.pdf":singleton observations})
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 1 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}    11,892
{txt}Absorbing 1 HDFE group{col 51}F({res}   8{txt},{res}   9427{txt}){col 67}= {res}      0.81
{txt}{col 51}Prob > F{col 67}= {res}    0.5917
{txt}{col 51}R-squared{col 67}= {res}    0.0934
{txt}{col 51}Adj R-squared{col 67}= {res}   -0.1436
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0007
{txt}{col 51}Root MSE{col 67}= {res}    0.0015

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   rincvar_rv{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
prisk2_all_ch {c |}
{space 10}--. {c |}{col 15}{res}{space 2} .0212395{col 27}{space 2} .0178646{col 38}{space 1}    1.19{col 47}{space 3}0.235{col 55}{space 4} -.013779{col 68}{space 3}  .056258
{txt}{space 10}L1. {c |}{col 15}{res}{space 2}   .00954{col 27}{space 2} .0196876{col 38}{space 1}    0.48{col 47}{space 3}0.628{col 55}{space 4} -.029052{col 68}{space 3}  .048132
{txt}{space 10}L2. {c |}{col 15}{res}{space 2} .0342358{col 27}{space 2} .0215544{col 38}{space 1}    1.59{col 47}{space 3}0.112{col 55}{space 4}-.0080154{col 68}{space 3}  .076487
{txt}{space 10}L3. {c |}{col 15}{res}{space 2} .0040766{col 27}{space 2} .0197982{col 38}{space 1}    0.21{col 47}{space 3}0.837{col 55}{space 4}-.0347322{col 68}{space 3} .0428855
{txt}{space 13} {c |}
trisk2_all_ch {c |}
{space 10}--. {c |}{col 15}{res}{space 2}-.0235294{col 27}{space 2} .0493779{col 38}{space 1}   -0.48{col 47}{space 3}0.634{col 55}{space 4}-.1203208{col 68}{space 3}  .073262
{txt}{space 10}L1. {c |}{col 15}{res}{space 2} .0116947{col 27}{space 2} .0540248{col 38}{space 1}    0.22{col 47}{space 3}0.829{col 55}{space 4}-.0942056{col 68}{space 3}  .117595
{txt}{space 10}L2. {c |}{col 15}{res}{space 2}-.0195682{col 27}{space 2} .0490149{col 38}{space 1}   -0.40{col 47}{space 3}0.690{col 55}{space 4}-.1156479{col 68}{space 3} .0765115
{txt}{space 10}L3. {c |}{col 15}{res}{space 2}-.0382128{col 27}{space 2}  .045742{col 38}{space 1}   -0.84{col 47}{space 3}0.404{col 55}{space 4} -.127877{col 68}{space 3} .0514515
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2}-.0000418{col 27}{space 2}  .000014{col 38}{space 1}   -2.99{col 47}{space 3}0.003{col 55}{space 4}-.0000693{col 68}{space 3}-.0000144
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}          ID{col 14}{c |}{space 1}     2457{col 27}{space 1}        0{col 39}{result}{space 1}     2457{col 53}{text} {col 54}{c |}
{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}

{com}. clear

. 