{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/Myworld/Dropbox/IncExpProject/WorkingFolder/indSCE_Maro_log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}31 Mar 2020, 15:03:57
{txt}
{com}. 
. use "${c -(}folder{c )-}/SCE/IncExpSCEPopMacroM.dta"
{txt}
{com}. 
. 
. ************************
. ***** date *************
. ***********************
. generate new_date = dofc(index)
{txt}
{com}. gen year = year(new_date)
{txt}
{com}. gen month = month(new_date)
{txt}
{com}. gen date_str = string(year)+ "m"+string(month)
{txt}
{com}. drop index new_date 
{txt}
{com}. gen date = monthly(date_str,"YM")
{txt}
{com}. format date %tm
{txt}
{com}. drop date_str
{txt}
{com}. tsset date 
{res}{txt}{col 9}time variable:  {res}{col 25}date, 2013m6 to 2019m5
{txt}{col 17}delta:  {res}1 month
{txt}
{com}. 
. **********************
. ***** Other measures **
. ************************
. 
. 
. local Moments varMean iqrMean rvarMean skewMean varMed iqrMed rvarMed skewMed
{txt}
{com}. 
. foreach mom in `Moments'{c -(}
{txt}  2{com}. gen `mom'_ch = `mom' - l1.`mom'
{txt}  3{com}. label var `mom'_ch "change in `mom'"
{txt}  4{com}. {c )-}
{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

{com}. 
. 
. 
. ************************
. ***** regression *******
. ***********************
. 
. 
. foreach mom in `Moments'{c -(}
{txt}  2{com}. forvalues i=1(1)12{c -(}
{txt}  3{com}. reg  `mom'  f`i'.sp500
{txt}  4{com}. return list 
{txt}  5{com}. local id = `i'+1
{txt}  6{com}. putexcel set "${c -(}sum_table_folder{c )-}/macro_corr_stata_3m.xls", sheet("`mom'") modify 
{txt}  7{com}. local coeff = _b[f`i'.sp500]
{txt}  8{com}. local coeff : display %5.3f `coeff'
{txt}  9{com}. local se = _se[f`i'.sp500]
{txt} 10{com}. local t = `coeff'/`se'
{txt} 11{com}. local p = 2*ttail(e(df_r),abs(`t'))
{txt} 12{com}. 
. local star = ""
{txt} 13{com}. if `p'< =0.01 local star = "***"
{txt} 14{com}. if `p'<=0.05 & `p'> 0.01 local star = "**"
{txt} 15{com}. if `p' <=0.1 & `p'> 0.05 local star = "*"
{txt} 16{com}. *local coeff_str: display `coeff' `star'
. 
. putexcel A`id' =(`i')
{txt} 17{com}. putexcel B`id' = (`coeff')
{txt} 18{com}. *putexcel C`id' = (`se')
. *putexcel D`id' =(`p')
. putexcel C`id' =("`star'")
{txt} 19{com}. 
. {c )-}
{txt} 20{com}. putexcel A1 =("# months ahead")
{txt} 21{com}. putexcel B1 = ("coefficients")
{txt} 22{com}. putexcel C1 = ("star")
{txt} 23{com}. putexcel D1 = ("`mom'")
{txt} 24{com}. 
. {c )-}

      {txt}Source {c |}       SS       df       MS              Number of obs ={res}      71
{txt}{hline 13}{char +}{hline 30}           F(  1,    69) ={res}    0.09
    {txt}   Model {char |} {res} .013344237     1  .013344237           {txt}Prob > F      = {res} 0.7632
    {txt}Residual {char |} {res} 10.0675358    69  .145906316           {txt}R-squared     = {res} 0.0013
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0131
    {txt}   Total {char |} {res} 10.0808801    70  .144012572           {txt}Root MSE      = {res} .38198

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     varMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F1. {c |}{col 14}{res}{space 2}-.2968943{col 26}{space 2}   .98173{col 37}{space 1}   -0.30{col 46}{space 3}0.763{col 54}{space 4}-2.255392{col 67}{space 3} 1.661603
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 3.413854{col 26}{space 2} .0513096{col 37}{space 1}   66.53{col 46}{space 3}0.000{col 54}{space 4} 3.311494{col 67}{space 3} 3.516214
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      70
{txt}{hline 13}{char +}{hline 30}           F(  1,    68) ={res}    0.10
    {txt}   Model {char |} {res} .015327029     1  .015327029           {txt}Prob > F      = {res} 0.7470
    {txt}Residual {char |} {res} 9.93336456    68  .146078891           {txt}R-squared     = {res} 0.0015
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0131
    {txt}   Total {char |} {res} 9.94869159    69  .144183936           {txt}Root MSE      = {res}  .3822

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     varMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F2. {c |}{col 14}{res}{space 2} .3181895{col 26}{space 2} .9823146{col 37}{space 1}    0.32{col 46}{space 3}0.747{col 54}{space 4}-1.641989{col 67}{space 3} 2.278368
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 3.403948{col 26}{space 2} .0516328{col 37}{space 1}   65.93{col 46}{space 3}0.000{col 54}{space 4} 3.300916{col 67}{space 3}  3.50698
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      69
{txt}{hline 13}{char +}{hline 30}           F(  1,    67) ={res}    0.00
    {txt}   Model {char |} {res} .000360778     1  .000360778           {txt}Prob > F      = {res} 0.9606
    {txt}Residual {char |} {res}  9.8130958    67  .146464116           {txt}R-squared     = {res} 0.0000
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0149
    {txt}   Total {char |} {res} 9.81345658    68  .144315538           {txt}Root MSE      = {res} .38271

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     varMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F3. {c |}{col 14}{res}{space 2} .0489579{col 26}{space 2} .9864345{col 37}{space 1}    0.05{col 46}{space 3}0.961{col 54}{space 4}-1.919974{col 67}{space 3} 2.017889
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 3.415856{col 26}{space 2} .0518327{col 37}{space 1}   65.90{col 46}{space 3}0.000{col 54}{space 4} 3.312397{col 67}{space 3} 3.519314
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      68
{txt}{hline 13}{char +}{hline 30}           F(  1,    66) ={res}    0.24
    {txt}   Model {char |} {res} .035788829     1  .035788829           {txt}Prob > F      = {res} 0.6247
    {txt}Residual {char |} {res} 9.77581216    66  .148118366           {txt}R-squared     = {res} 0.0036
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0114
    {txt}   Total {char |} {res} 9.81160099    67  .146441806           {txt}Root MSE      = {res} .38486

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     varMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F4. {c |}{col 14}{res}{space 2}-.4884639{col 26}{space 2} .9937182{col 37}{space 1}   -0.49{col 46}{space 3}0.625{col 54}{space 4}-2.472486{col 67}{space 3} 1.495558
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 3.429586{col 26}{space 2} .0525977{col 37}{space 1}   65.20{col 46}{space 3}0.000{col 54}{space 4} 3.324571{col 67}{space 3} 3.534601
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      67
{txt}{hline 13}{char +}{hline 30}           F(  1,    65) ={res}    2.95
    {txt}   Model {char |} {res} .418742606     1  .418742606           {txt}Prob > F      = {res} 0.0908
    {txt}Residual {char |} {res} 9.23360461    65  .142055455           {txt}R-squared     = {res} 0.0434
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0287
    {txt}   Total {char |} {res} 9.65234721    66  .146247685           {txt}Root MSE      = {res}  .3769

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     varMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F5. {c |}{col 14}{res}{space 2}-1.673422{col 26}{space 2} .9746772{col 37}{space 1}   -1.72{col 46}{space 3}0.091{col 54}{space 4}-3.619987{col 67}{space 3}  .273143
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 3.463887{col 26}{space 2} .0516865{col 37}{space 1}   67.02{col 46}{space 3}0.000{col 54}{space 4} 3.360662{col 67}{space 3} 3.567112
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      66
{txt}{hline 13}{char +}{hline 30}           F(  1,    64) ={res}    2.04
    {txt}   Model {char |} {res}  .29614126     1   .29614126           {txt}Prob > F      = {res} 0.1581
    {txt}Residual {char |} {res} 9.29154924    64  .145180457           {txt}R-squared     = {res} 0.0309
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0157
    {txt}   Total {char |} {res}  9.5876905    65  .147502931           {txt}Root MSE      = {res} .38103

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     varMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F6. {c |}{col 14}{res}{space 2}-1.408675{col 26}{space 2} .9863143{col 37}{space 1}   -1.43{col 46}{space 3}0.158{col 54}{space 4}-3.379064{col 67}{space 3} .5617146
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 3.460969{col 26}{space 2} .0524611{col 37}{space 1}   65.97{col 46}{space 3}0.000{col 54}{space 4} 3.356166{col 67}{space 3} 3.565772
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      65
{txt}{hline 13}{char +}{hline 30}           F(  1,    63) ={res}    1.60
    {txt}   Model {char |} {res}  .23610709     1   .23610709           {txt}Prob > F      = {res} 0.2110
    {txt}Residual {char |} {res} 9.31422567    63  .147844852           {txt}R-squared     = {res} 0.0247
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0092
    {txt}   Total {char |} {res} 9.55033276    64  .149223949           {txt}Root MSE      = {res} .38451

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     varMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F7. {c |}{col 14}{res}{space 2}-1.283821{col 26}{space 2} 1.015905{col 37}{space 1}   -1.26{col 46}{space 3}0.211{col 54}{space 4}-3.313945{col 67}{space 3}  .746303
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 3.459428{col 26}{space 2} .0529526{col 37}{space 1}   65.33{col 46}{space 3}0.000{col 54}{space 4} 3.353611{col 67}{space 3} 3.565246
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      64
{txt}{hline 13}{char +}{hline 30}           F(  1,    62) ={res}    0.56
    {txt}   Model {char |} {res} .082595964     1  .082595964           {txt}Prob > F      = {res} 0.4567
    {txt}Residual {char |} {res} 9.12905746    62  .147242862           {txt}R-squared     = {res} 0.0090
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0070
    {txt}   Total {char |} {res} 9.21165342    63  .146216721           {txt}Root MSE      = {res} .38372

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     varMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F8. {c |}{col 14}{res}{space 2}-.7736514{col 26}{space 2} 1.032959{col 37}{space 1}   -0.75{col 46}{space 3}0.457{col 54}{space 4}-2.838507{col 67}{space 3} 1.291204
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 3.456026{col 26}{space 2} .0528684{col 37}{space 1}   65.37{col 46}{space 3}0.000{col 54}{space 4} 3.350344{col 67}{space 3} 3.561709
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      63
{txt}{hline 13}{char +}{hline 30}           F(  1,    61) ={res}    1.41
    {txt}   Model {char |} {res} .201633987     1  .201633987           {txt}Prob > F      = {res} 0.2394
    {txt}Residual {char |} {res} 8.71420079    61  .142855751           {txt}R-squared     = {res} 0.0226
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0066
    {txt}   Total {char |} {res} 8.91583478    62  .143803787           {txt}Root MSE      = {res} .37796

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     varMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F9. {c |}{col 14}{res}{space 2}-1.208987{col 26}{space 2} 1.017627{col 37}{space 1}   -1.19{col 46}{space 3}0.239{col 54}{space 4}-3.243859{col 67}{space 3} .8258843
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 3.474093{col 26}{space 2} .0524615{col 37}{space 1}   66.22{col 46}{space 3}0.000{col 54}{space 4}  3.36919{col 67}{space 3} 3.578997
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      62
{txt}{hline 13}{char +}{hline 30}           F(  1,    60) ={res}    3.44
    {txt}   Model {char |} {res} .471644961     1  .471644961           {txt}Prob > F      = {res} 0.0685
    {txt}Residual {char |} {res} 8.22164222    60   .13702737           {txt}R-squared     = {res} 0.0543
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0385
    {txt}   Total {char |} {res} 8.69328718    61  .142512905           {txt}Root MSE      = {res} .37017

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     varMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 8}F10. {c |}{col 14}{res}{space 2}-1.849443{col 26}{space 2} .9968663{col 37}{space 1}   -1.86{col 46}{space 3}0.068{col 54}{space 4}-3.843472{col 67}{space 3} .1445869
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 3.495269{col 26}{space 2} .0516712{col 37}{space 1}   67.64{col 46}{space 3}0.000{col 54}{space 4} 3.391911{col 67}{space 3} 3.598627
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      61
{txt}{hline 13}{char +}{hline 30}           F(  1,    59) ={res}    4.32
    {txt}   Model {char |} {res} .592338362     1  .592338362           {txt}Prob > F      = {res} 0.0420
    {txt}Residual {char |} {res} 8.08666354    59  .137062094           {txt}R-squared     = {res} 0.0682
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0525
    {txt}   Total {char |} {res}  8.6790019    60  .144650032           {txt}Root MSE      = {res} .37022

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     varMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 8}F11. {c |}{col 14}{res}{space 2}-2.073181{col 26}{space 2} .9972658{col 37}{space 1}   -2.08{col 46}{space 3}0.042{col 54}{space 4}-4.068705{col 67}{space 3}-.0776565
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 3.502318{col 26}{space 2} .0520879{col 37}{space 1}   67.24{col 46}{space 3}0.000{col 54}{space 4} 3.398091{col 67}{space 3} 3.606546
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      60
{txt}{hline 13}{char +}{hline 30}           F(  1,    58) ={res}    0.08
    {txt}   Model {char |} {res} .011619357     1  .011619357           {txt}Prob > F      = {res} 0.7795
    {txt}Residual {char |} {res} 8.52068897    58  .146908431           {txt}R-squared     = {res} 0.0014
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0159
    {txt}   Total {char |} {res} 8.53230833    59  .144615395           {txt}Root MSE      = {res} .38329

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     varMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 8}F12. {c |}{col 14}{res}{space 2}-.2915848{col 26}{space 2} 1.036805{col 37}{space 1}   -0.28{col 46}{space 3}0.780{col 54}{space 4}-2.366976{col 67}{space 3} 1.783807
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 3.457249{col 26}{space 2} .0540984{col 37}{space 1}   63.91{col 46}{space 3}0.000{col 54}{space 4}  3.34896{col 67}{space 3} 3.565539
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      71
{txt}{hline 13}{char +}{hline 30}           F(  1,    69) ={res}    0.06
    {txt}   Model {char |} {res} .000596616     1  .000596616           {txt}Prob > F      = {res} 0.8068
    {txt}Residual {char |} {res} .683268018    69  .009902435           {txt}R-squared     = {res} 0.0009
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0136
    {txt}   Total {char |} {res} .683864634    70  .009769495           {txt}Root MSE      = {res} .09951

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     iqrMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F1. {c |}{col 14}{res}{space 2}-.0627773{col 26}{space 2} .2557561{col 37}{space 1}   -0.25{col 46}{space 3}0.807{col 54}{space 4}-.5729968{col 67}{space 3} .4474422
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.060473{col 26}{space 2}  .013367{col 37}{space 1}  154.15{col 46}{space 3}0.000{col 54}{space 4} 2.033806{col 67}{space 3} 2.087139
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      70
{txt}{hline 13}{char +}{hline 30}           F(  1,    68) ={res}    0.26
    {txt}   Model {char |} {res} .002555951     1  .002555951           {txt}Prob > F      = {res} 0.6117
    {txt}Residual {char |} {res} .668350537    68  .009828684           {txt}R-squared     = {res} 0.0038
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0108
    {txt}   Total {char |} {res} .670906488    69  .009723282           {txt}Root MSE      = {res} .09914

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     iqrMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F2. {c |}{col 14}{res}{space 2} .1299371{col 26}{space 2}  .254803{col 37}{space 1}    0.51{col 46}{space 3}0.612{col 54}{space 4}-.3785144{col 67}{space 3} .6383886
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.057367{col 26}{space 2} .0133931{col 37}{space 1}  153.61{col 46}{space 3}0.000{col 54}{space 4} 2.030642{col 67}{space 3} 2.084093
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      69
{txt}{hline 13}{char +}{hline 30}           F(  1,    67) ={res}    0.00
    {txt}   Model {char |} {res} .000042742     1  .000042742           {txt}Prob > F      = {res} 0.9476
    {txt}Residual {char |} {res} .657548938    67  .009814163           {txt}R-squared     = {res} 0.0001
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0149
    {txt}   Total {char |} {res}  .65759168    68  .009670466           {txt}Root MSE      = {res} .09907

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     iqrMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F3. {c |}{col 14}{res}{space 2}-.0168512{col 26}{space 2} .2553461{col 37}{space 1}   -0.07{col 46}{space 3}0.948{col 54}{space 4}-.5265242{col 67}{space 3} .4928218
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.062617{col 26}{space 2} .0134173{col 37}{space 1}  153.73{col 46}{space 3}0.000{col 54}{space 4} 2.035836{col 67}{space 3} 2.089398
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      68
{txt}{hline 13}{char +}{hline 30}           F(  1,    66) ={res}    0.38
    {txt}   Model {char |} {res} .003805373     1  .003805373           {txt}Prob > F      = {res} 0.5374
    {txt}Residual {char |} {res} .653271881    66  .009898059           {txt}R-squared     = {res} 0.0058
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0093
    {txt}   Total {char |} {res} .657077254    67  .009807123           {txt}Root MSE      = {res} .09949

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     iqrMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F4. {c |}{col 14}{res}{space 2}-.1592786{col 26}{space 2} .2568821{col 37}{space 1}   -0.62{col 46}{space 3}0.537{col 54}{space 4}-.6721602{col 67}{space 3}  .353603
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}  2.06643{col 26}{space 2} .0135968{col 37}{space 1}  151.98{col 46}{space 3}0.000{col 54}{space 4} 2.039283{col 67}{space 3} 2.093577
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      67
{txt}{hline 13}{char +}{hline 30}           F(  1,    65) ={res}    3.25
    {txt}   Model {char |} {res} .030877148     1  .030877148           {txt}Prob > F      = {res} 0.0758
    {txt}Residual {char |} {res} .616598559    65  .009486132           {txt}R-squared     = {res} 0.0477
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0330
    {txt}   Total {char |} {res} .647475706    66  .009810238           {txt}Root MSE      = {res}  .0974

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     iqrMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F5. {c |}{col 14}{res}{space 2}-.4544127{col 26}{space 2}   .25187{col 37}{space 1}   -1.80{col 46}{space 3}0.076{col 54}{space 4}-.9574318{col 67}{space 3} .0486064
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}  2.07494{col 26}{space 2} .0133565{col 37}{space 1}  155.35{col 46}{space 3}0.000{col 54}{space 4} 2.048265{col 67}{space 3} 2.101615
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      66
{txt}{hline 13}{char +}{hline 30}           F(  1,    64) ={res}    2.20
    {txt}   Model {char |} {res} .021141894     1  .021141894           {txt}Prob > F      = {res} 0.1429
    {txt}Residual {char |} {res} .615051294    64  .009610176           {txt}R-squared     = {res} 0.0332
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0181
    {txt}   Total {char |} {res} .636193188    65  .009787588           {txt}Root MSE      = {res} .09803

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     iqrMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F6. {c |}{col 14}{res}{space 2}-.3763858{col 26}{space 2} .2537622{col 37}{space 1}   -1.48{col 46}{space 3}0.143{col 54}{space 4} -.883334{col 67}{space 3} .1305625
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.074561{col 26}{space 2} .0134974{col 37}{space 1}  153.70{col 46}{space 3}0.000{col 54}{space 4} 2.047597{col 67}{space 3} 2.101525
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      65
{txt}{hline 13}{char +}{hline 30}           F(  1,    63) ={res}    2.39
    {txt}   Model {char |} {res} .022783076     1  .022783076           {txt}Prob > F      = {res} 0.1272
    {txt}Residual {char |} {res} .600812845    63  .009536712           {txt}R-squared     = {res} 0.0365
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0212
    {txt}   Total {char |} {res}  .62359592    64  .009743686           {txt}Root MSE      = {res} .09766

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     iqrMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F7. {c |}{col 14}{res}{space 2}-.3988009{col 26}{space 2} .2580176{col 37}{space 1}   -1.55{col 46}{space 3}0.127{col 54}{space 4}-.9144079{col 67}{space 3} .1168061
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.076337{col 26}{space 2} .0134488{col 37}{space 1}  154.39{col 46}{space 3}0.000{col 54}{space 4} 2.049462{col 67}{space 3} 2.103213
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      64
{txt}{hline 13}{char +}{hline 30}           F(  1,    62) ={res}    1.54
    {txt}   Model {char |} {res} .014093737     1  .014093737           {txt}Prob > F      = {res} 0.2197
    {txt}Residual {char |} {res} .568318443    62  .009166427           {txt}R-squared     = {res} 0.0242
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0085
    {txt}   Total {char |} {res}  .58241218    63  .009244638           {txt}Root MSE      = {res} .09574

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     iqrMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F8. {c |}{col 14}{res}{space 2}-.3195796{col 26}{space 2} .2577306{col 37}{space 1}   -1.24{col 46}{space 3}0.220{col 54}{space 4}-.8347757{col 67}{space 3} .1956165
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}  2.07733{col 26}{space 2}  .013191{col 37}{space 1}  157.48{col 46}{space 3}0.000{col 54}{space 4} 2.050962{col 67}{space 3} 2.103699
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      63
{txt}{hline 13}{char +}{hline 30}           F(  1,    61) ={res}    2.71
    {txt}   Model {char |} {res} .024150092     1  .024150092           {txt}Prob > F      = {res} 0.1047
    {txt}Residual {char |} {res} .543015863    61  .008901899           {txt}R-squared     = {res} 0.0426
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0269
    {txt}   Total {char |} {res} .567165955    62  .009147838           {txt}Root MSE      = {res} .09435

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     iqrMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F9. {c |}{col 14}{res}{space 2}-.4184074{col 26}{space 2} .2540278{col 37}{space 1}   -1.65{col 46}{space 3}0.105{col 54}{space 4}-.9263674{col 67}{space 3} .0895526
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.081447{col 26}{space 2} .0130958{col 37}{space 1}  158.94{col 46}{space 3}0.000{col 54}{space 4} 2.055261{col 67}{space 3} 2.107634
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      62
{txt}{hline 13}{char +}{hline 30}           F(  1,    60) ={res}    3.94
    {txt}   Model {char |} {res} .033748551     1  .033748551           {txt}Prob > F      = {res} 0.0516
    {txt}Residual {char |} {res} .513384091    60  .008556402           {txt}R-squared     = {res} 0.0617
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0460
    {txt}   Total {char |} {res} .547132642    61  .008969388           {txt}Root MSE      = {res}  .0925

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     iqrMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 8}F10. {c |}{col 14}{res}{space 2}-.4947216{col 26}{space 2} .2491029{col 37}{space 1}   -1.99{col 46}{space 3}0.052{col 54}{space 4}-.9930016{col 67}{space 3} .0035585
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.085302{col 26}{space 2} .0129119{col 37}{space 1}  161.50{col 46}{space 3}0.000{col 54}{space 4} 2.059474{col 67}{space 3}  2.11113
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      61
{txt}{hline 13}{char +}{hline 30}           F(  1,    59) ={res}    3.64
    {txt}   Model {char |} {res} .030939457     1  .030939457           {txt}Prob > F      = {res} 0.0614
    {txt}Residual {char |} {res} .501839023    59  .008505746           {txt}R-squared     = {res} 0.0581
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0421
    {txt}   Total {char |} {res}  .53277848    60  .008879641           {txt}Root MSE      = {res} .09223

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     iqrMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 8}F11. {c |}{col 14}{res}{space 2}-.4738148{col 26}{space 2} .2484325{col 37}{space 1}   -1.91{col 46}{space 3}0.061{col 54}{space 4}-.9709271{col 67}{space 3} .0232976
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.086867{col 26}{space 2} .0129758{col 37}{space 1}  160.83{col 46}{space 3}0.000{col 54}{space 4} 2.060903{col 67}{space 3} 2.112832
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      60
{txt}{hline 13}{char +}{hline 30}           F(  1,    58) ={res}    0.27
    {txt}   Model {char |} {res} .002405169     1  .002405169           {txt}Prob > F      = {res} 0.6070
    {txt}Residual {char |} {res} .521439162    58   .00899033           {txt}R-squared     = {res} 0.0046
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0126
    {txt}   Total {char |} {res} .523844331    59  .008878717           {txt}Root MSE      = {res} .09482

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     iqrMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 8}F12. {c |}{col 14}{res}{space 2}-.1326621{col 26}{space 2} .2564849{col 37}{space 1}   -0.52{col 46}{space 3}0.607{col 54}{space 4}-.6460723{col 67}{space 3} .3807482
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.077844{col 26}{space 2} .0133829{col 37}{space 1}  155.26{col 46}{space 3}0.000{col 54}{space 4} 2.051055{col 67}{space 3} 2.104633
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      71
{txt}{hline 13}{char +}{hline 30}           F(  1,    69) ={res}    0.16
    {txt}   Model {char |} {res} .153774179     1  .153774179           {txt}Prob > F      = {res} 0.6920
    {txt}Residual {char |} {res} 67.0344776    69  .971514169           {txt}R-squared     = {res} 0.0023
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0122
    {txt}   Total {char |} {res} 67.1882518    70  .959832169           {txt}Root MSE      = {res} .98565

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    rvarMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F1. {c |}{col 14}{res}{space 2}-1.007852{col 26}{space 2} 2.533259{col 37}{space 1}   -0.40{col 46}{space 3}0.692{col 54}{space 4}-6.061565{col 67}{space 3} 4.045861
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 8.907422{col 26}{space 2} .1323995{col 37}{space 1}   67.28{col 46}{space 3}0.000{col 54}{space 4} 8.643292{col 67}{space 3} 9.171552
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      70
{txt}{hline 13}{char +}{hline 30}           F(  1,    68) ={res}    0.60
    {txt}   Model {char |} {res} .569403082     1  .569403082           {txt}Prob > F      = {res} 0.4427
    {txt}Residual {char |} {res} 64.9337209    68   .95490766           {txt}R-squared     = {res} 0.0087
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0059
    {txt}   Total {char |} {res} 65.5031239    69  .949320637           {txt}Root MSE      = {res} .97719

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    rvarMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F2. {c |}{col 14}{res}{space 2} 1.939397{col 26}{space 2} 2.511525{col 37}{space 1}    0.77{col 46}{space 3}0.443{col 54}{space 4}-3.072273{col 67}{space 3} 6.951068
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}  8.85365{col 26}{space 2} .1320117{col 37}{space 1}   67.07{col 46}{space 3}0.000{col 54}{space 4} 8.590225{col 67}{space 3} 9.117076
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      69
{txt}{hline 13}{char +}{hline 30}           F(  1,    67) ={res}    3.05
    {txt}   Model {char |} {res} 2.76308268     1  2.76308268           {txt}Prob > F      = {res} 0.0852
    {txt}Residual {char |} {res} 60.6661745    67  .905465291           {txt}R-squared     = {res} 0.0436
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0293
    {txt}   Total {char |} {res} 63.4292572    68  .932783194           {txt}Root MSE      = {res} .95156

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    rvarMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F3. {c |}{col 14}{res}{space 2} 4.284494{col 26}{space 2} 2.452667{col 37}{space 1}    1.75{col 46}{space 3}0.085{col 54}{space 4}-.6110489{col 67}{space 3} 9.180037
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 8.818736{col 26}{space 2} .1288766{col 37}{space 1}   68.43{col 46}{space 3}0.000{col 54}{space 4} 8.561497{col 67}{space 3} 9.075975
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      68
{txt}{hline 13}{char +}{hline 30}           F(  1,    66) ={res}    1.42
    {txt}   Model {char |} {res} 1.32728746     1  1.32728746           {txt}Prob > F      = {res} 0.2377
    {txt}Residual {char |} {res} 61.6985167    66   .93482601           {txt}R-squared     = {res} 0.0211
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0062
    {txt}   Total {char |} {res} 63.0258041    67  .940683644           {txt}Root MSE      = {res} .96686

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    rvarMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F4. {c |}{col 14}{res}{space 2} 2.974687{col 26}{space 2} 2.496457{col 37}{space 1}    1.19{col 46}{space 3}0.238{col 54}{space 4}-2.009651{col 67}{space 3} 7.959025
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 8.858549{col 26}{space 2} .1321379{col 37}{space 1}   67.04{col 46}{space 3}0.000{col 54}{space 4} 8.594727{col 67}{space 3}  9.12237
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      67
{txt}{hline 13}{char +}{hline 30}           F(  1,    65) ={res}    1.02
    {txt}   Model {char |} {res} .969813533     1  .969813533           {txt}Prob > F      = {res} 0.3168
    {txt}Residual {char |} {res} 61.9470626    65  .953031733           {txt}R-squared     = {res} 0.0154
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0003
    {txt}   Total {char |} {res} 62.9168762    66  .953286002           {txt}Root MSE      = {res} .97623

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    rvarMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F5. {c |}{col 14}{res}{space 2}-2.546689{col 26}{space 2} 2.524559{col 37}{space 1}   -1.01{col 46}{space 3}0.317{col 54}{space 4}-7.588582{col 67}{space 3} 2.495203
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 8.997393{col 26}{space 2} .1338759{col 37}{space 1}   67.21{col 46}{space 3}0.000{col 54}{space 4} 8.730024{col 67}{space 3} 9.264761
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      66
{txt}{hline 13}{char +}{hline 30}           F(  1,    64) ={res}    3.78
    {txt}   Model {char |} {res} 3.37806541     1  3.37806541           {txt}Prob > F      = {res} 0.0562
    {txt}Residual {char |} {res} 57.1406429    64  .892822545           {txt}R-squared     = {res} 0.0558
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0411
    {txt}   Total {char |} {res} 60.5187083    65  .931057051           {txt}Root MSE      = {res} .94489

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    rvarMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F6. {c |}{col 14}{res}{space 2} -4.75768{col 26}{space 2} 2.445929{col 37}{space 1}   -1.95{col 46}{space 3}0.056{col 54}{space 4}-9.643985{col 67}{space 3} .1286241
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 9.072712{col 26}{space 2} .1300966{col 37}{space 1}   69.74{col 46}{space 3}0.000{col 54}{space 4} 8.812814{col 67}{space 3}  9.33261
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      65
{txt}{hline 13}{char +}{hline 30}           F(  1,    63) ={res}    3.08
    {txt}   Model {char |} {res} 2.79396616     1  2.79396616           {txt}Prob > F      = {res} 0.0841
    {txt}Residual {char |} {res} 57.1453759    63  .907069458           {txt}R-squared     = {res} 0.0466
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0315
    {txt}   Total {char |} {res}  59.939342    64  .936552219           {txt}Root MSE      = {res}  .9524

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    rvarMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F7. {c |}{col 14}{res}{space 2} -4.41632{col 26}{space 2} 2.516345{col 37}{space 1}   -1.76{col 46}{space 3}0.084{col 54}{space 4}-9.444835{col 67}{space 3} .6121949
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 9.070982{col 26}{space 2}  .131161{col 37}{space 1}   69.16{col 46}{space 3}0.000{col 54}{space 4} 8.808877{col 67}{space 3} 9.333086
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      64
{txt}{hline 13}{char +}{hline 30}           F(  1,    62) ={res}    0.97
    {txt}   Model {char |} {res}  .87623496     1   .87623496           {txt}Prob > F      = {res} 0.3284
    {txt}Residual {char |} {res} 55.9800987    62  .902904818           {txt}R-squared     = {res} 0.0154
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0005
    {txt}   Total {char |} {res} 56.8563337    63  .902481487           {txt}Root MSE      = {res} .95021

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    rvarMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F8. {c |}{col 14}{res}{space 2}-2.519859{col 26}{space 2}  2.55792{col 37}{space 1}   -0.99{col 46}{space 3}0.328{col 54}{space 4}-7.633067{col 67}{space 3}  2.59335
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 9.052419{col 26}{space 2} .1309181{col 37}{space 1}   69.15{col 46}{space 3}0.000{col 54}{space 4} 8.790717{col 67}{space 3}  9.31412
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      63
{txt}{hline 13}{char +}{hline 30}           F(  1,    61) ={res}    0.71
    {txt}   Model {char |} {res} .616415283     1  .616415283           {txt}Prob > F      = {res} 0.4013
    {txt}Residual {char |} {res} 52.6350457    61  .862869602           {txt}R-squared     = {res} 0.0116
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0046
    {txt}   Total {char |} {res}  53.251461    62  .858894532           {txt}Root MSE      = {res} .92891

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    rvarMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F9. {c |}{col 14}{res}{space 2}-2.113862{col 26}{space 2} 2.500993{col 37}{space 1}   -0.85{col 46}{space 3}0.401{col 54}{space 4}-7.114907{col 67}{space 3} 2.887183
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 9.073809{col 26}{space 2}  .128933{col 37}{space 1}   70.38{col 46}{space 3}0.000{col 54}{space 4} 8.815991{col 67}{space 3} 9.331626
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      62
{txt}{hline 13}{char +}{hline 30}           F(  1,    60) ={res}    1.54
    {txt}   Model {char |} {res} 1.31422826     1  1.31422826           {txt}Prob > F      = {res} 0.2196
    {txt}Residual {char |} {res} 51.2294764    60  .853824607           {txt}R-squared     = {res} 0.0250
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0088
    {txt}   Total {char |} {res} 52.5437047    61  .861372208           {txt}Root MSE      = {res} .92403

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    rvarMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 8}F10. {c |}{col 14}{res}{space 2}-3.087228{col 26}{space 2} 2.488385{col 37}{space 1}   -1.24{col 46}{space 3}0.220{col 54}{space 4}-8.064739{col 67}{space 3} 1.890284
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 9.107947{col 26}{space 2} .1289821{col 37}{space 1}   70.61{col 46}{space 3}0.000{col 54}{space 4} 8.849944{col 67}{space 3} 9.365949
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      61
{txt}{hline 13}{char +}{hline 30}           F(  1,    59) ={res}    0.41
    {txt}   Model {char |} {res} .356579606     1  .356579606           {txt}Prob > F      = {res} 0.5232
    {txt}Residual {char |} {res}  50.995253    59  .864326322           {txt}R-squared     = {res} 0.0069
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0099
    {txt}   Total {char |} {res} 51.3518326    60  .855863877           {txt}Root MSE      = {res} .92969

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    rvarMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 8}F11. {c |}{col 14}{res}{space 2}-1.608535{col 26}{space 2} 2.504327{col 37}{space 1}   -0.64{col 46}{space 3}0.523{col 54}{space 4}-6.619682{col 67}{space 3} 3.402613
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 9.094119{col 26}{space 2} .1308029{col 37}{space 1}   69.53{col 46}{space 3}0.000{col 54}{space 4} 8.832383{col 67}{space 3} 9.355855
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      60
{txt}{hline 13}{char +}{hline 30}           F(  1,    58) ={res}    0.10
    {txt}   Model {char |} {res} .086116621     1  .086116621           {txt}Prob > F      = {res} 0.7554
    {txt}Residual {char |} {res} 50.9934001    58  .879196554           {txt}R-squared     = {res} 0.0017
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0155
    {txt}   Total {char |} {res} 51.0795168    59  .865754521           {txt}Root MSE      = {res} .93765

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    rvarMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 8}F12. {c |}{col 14}{res}{space 2} .7938115{col 26}{space 2} 2.536395{col 37}{space 1}    0.31{col 46}{space 3}0.755{col 54}{space 4}-4.283335{col 67}{space 3} 5.870958
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 9.033924{col 26}{space 2}  .132344{col 37}{space 1}   68.26{col 46}{space 3}0.000{col 54}{space 4} 8.769009{col 67}{space 3} 9.298839
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      71
{txt}{hline 13}{char +}{hline 30}           F(  1,    69) ={res}    0.01
    {txt}   Model {char |} {res} 6.0512e-06     1  6.0512e-06           {txt}Prob > F      = {res} 0.9182
    {txt}Residual {char |} {res}  .03930044    69  .000569572           {txt}R-squared     = {res} 0.0002
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0143
    {txt}   Total {char |} {res} .039306492    70  .000561521           {txt}Root MSE      = {res} .02387

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    skewMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F1. {c |}{col 14}{res}{space 2} .0063223{col 26}{space 2} .0613379{col 37}{space 1}    0.10{col 46}{space 3}0.918{col 54}{space 4}-.1160435{col 67}{space 3} .1286882
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .1104065{col 26}{space 2} .0032058{col 37}{space 1}   34.44{col 46}{space 3}0.000{col 54}{space 4} .1040111{col 67}{space 3} .1168019
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      70
{txt}{hline 13}{char +}{hline 30}           F(  1,    68) ={res}    1.42
    {txt}   Model {char |} {res} .000801836     1  .000801836           {txt}Prob > F      = {res} 0.2375
    {txt}Residual {char |} {res} .038384411    68  .000564477           {txt}R-squared     = {res} 0.0205
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0061
    {txt}   Total {char |} {res} .039186247    69  .000567917           {txt}Root MSE      = {res} .02376

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    skewMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F2. {c |}{col 14}{res}{space 2}-.0727779{col 26}{space 2} .0610632{col 37}{space 1}   -1.19{col 46}{space 3}0.237{col 54}{space 4}-.1946277{col 67}{space 3} .0490719
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .1124997{col 26}{space 2} .0032096{col 37}{space 1}   35.05{col 46}{space 3}0.000{col 54}{space 4}  .106095{col 67}{space 3} .1189044
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      69
{txt}{hline 13}{char +}{hline 30}           F(  1,    67) ={res}    0.83
    {txt}   Model {char |} {res} .000480061     1  .000480061           {txt}Prob > F      = {res} 0.3648
    {txt}Residual {char |} {res} .038629456    67  .000576559           {txt}R-squared     = {res} 0.0123
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0025
    {txt}   Total {char |} {res} .039109517    68   .00057514           {txt}Root MSE      = {res} .02401

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    skewMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F3. {c |}{col 14}{res}{space 2}-.0564743{col 26}{space 2} .0618906{col 37}{space 1}   -0.91{col 46}{space 3}0.365{col 54}{space 4}-.1800084{col 67}{space 3} .0670598
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .1119504{col 26}{space 2} .0032521{col 37}{space 1}   34.42{col 46}{space 3}0.000{col 54}{space 4} .1054592{col 67}{space 3} .1184415
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      68
{txt}{hline 13}{char +}{hline 30}           F(  1,    66) ={res}    3.73
    {txt}   Model {char |} {res} .002079896     1  .002079896           {txt}Prob > F      = {res} 0.0576
    {txt}Residual {char |} {res} .036756824    66  .000556922           {txt}R-squared     = {res} 0.0536
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0392
    {txt}   Total {char |} {res}  .03883672    67  .000579653           {txt}Root MSE      = {res}  .0236

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    skewMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F4. {c |}{col 14}{res}{space 2}-.1177551{col 26}{space 2} .0609335{col 37}{space 1}   -1.93{col 46}{space 3}0.058{col 54}{space 4}-.2394126{col 67}{space 3} .0039025
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .1132239{col 26}{space 2} .0032252{col 37}{space 1}   35.11{col 46}{space 3}0.000{col 54}{space 4} .1067845{col 67}{space 3} .1196632
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      67
{txt}{hline 13}{char +}{hline 30}           F(  1,    65) ={res}    0.00
    {txt}   Model {char |} {res} 2.3535e-06     1  2.3535e-06           {txt}Prob > F      = {res} 0.9501
    {txt}Residual {char |} {res} .038820552    65  .000597239           {txt}R-squared     = {res} 0.0001
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0153
    {txt}   Total {char |} {res} .038822906    66  .000588226           {txt}Root MSE      = {res} .02444

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    skewMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F5. {c |}{col 14}{res}{space 2} .0039672{col 26}{space 2} .0631984{col 37}{space 1}    0.06{col 46}{space 3}0.950{col 54}{space 4}-.1222487{col 67}{space 3} .1301831
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}  .110199{col 26}{space 2} .0033514{col 37}{space 1}   32.88{col 46}{space 3}0.000{col 54}{space 4} .1035059{col 67}{space 3} .1168922
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      66
{txt}{hline 13}{char +}{hline 30}           F(  1,    64) ={res}    0.01
    {txt}   Model {char |} {res} 6.2822e-06     1  6.2822e-06           {txt}Prob > F      = {res} 0.9192
    {txt}Residual {char |} {res} .038755101    64  .000605548           {txt}R-squared     = {res} 0.0002
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0155
    {txt}   Total {char |} {res} .038761383    65  .000596329           {txt}Root MSE      = {res} .02461

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    skewMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F6. {c |}{col 14}{res}{space 2} .0064881{col 26}{space 2} .0636994{col 37}{space 1}    0.10{col 46}{space 3}0.919{col 54}{space 4}-.1207662{col 67}{space 3} .1337424
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .1102579{col 26}{space 2} .0033881{col 37}{space 1}   32.54{col 46}{space 3}0.000{col 54}{space 4} .1034894{col 67}{space 3} .1170265
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      65
{txt}{hline 13}{char +}{hline 30}           F(  1,    63) ={res}    0.85
    {txt}   Model {char |} {res} .000495457     1  .000495457           {txt}Prob > F      = {res} 0.3606
    {txt}Residual {char |} {res} .036804875    63  .000584204           {txt}R-squared     = {res} 0.0133
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0024
    {txt}   Total {char |} {res} .037300332    64  .000582818           {txt}Root MSE      = {res} .02417

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    skewMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F7. {c |}{col 14}{res}{space 2}-.0588103{col 26}{space 2} .0638605{col 37}{space 1}   -0.92{col 46}{space 3}0.361{col 54}{space 4}-.1864253{col 67}{space 3} .0688048
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}  .111161{col 26}{space 2} .0033286{col 37}{space 1}   33.40{col 46}{space 3}0.000{col 54}{space 4} .1045092{col 67}{space 3} .1178127
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      64
{txt}{hline 13}{char +}{hline 30}           F(  1,    62) ={res}    2.66
    {txt}   Model {char |} {res} .001534194     1  .001534194           {txt}Prob > F      = {res} 0.1079
    {txt}Residual {char |} {res} .035736198    62   .00057639           {txt}R-squared     = {res} 0.0412
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0257
    {txt}   Total {char |} {res} .037270391    63  .000591594           {txt}Root MSE      = {res} .02401

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    skewMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F8. {c |}{col 14}{res}{space 2}-.1054401{col 26}{space 2} .0646285{col 37}{space 1}   -1.63{col 46}{space 3}0.108{col 54}{space 4}-.2346307{col 67}{space 3} .0237504
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .1120138{col 26}{space 2} .0033078{col 37}{space 1}   33.86{col 46}{space 3}0.000{col 54}{space 4} .1054016{col 67}{space 3} .1186259
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      63
{txt}{hline 13}{char +}{hline 30}           F(  1,    61) ={res}    1.50
    {txt}   Model {char |} {res} .000895126     1  .000895126           {txt}Prob > F      = {res} 0.2252
    {txt}Residual {char |} {res} .036367765    61  .000596193           {txt}R-squared     = {res} 0.0240
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0080
    {txt}   Total {char |} {res} .037262891    62  .000601014           {txt}Root MSE      = {res} .02442

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    skewMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F9. {c |}{col 14}{res}{space 2} -.080553{col 26}{space 2} .0657405{col 37}{space 1}   -1.23{col 46}{space 3}0.225{col 54}{space 4}-.2120094{col 67}{space 3} .0509033
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .1114436{col 26}{space 2} .0033891{col 37}{space 1}   32.88{col 46}{space 3}0.000{col 54}{space 4} .1046667{col 67}{space 3} .1182206
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      62
{txt}{hline 13}{char +}{hline 30}           F(  1,    60) ={res}    0.02
    {txt}   Model {char |} {res} .000013217     1  .000013217           {txt}Prob > F      = {res} 0.8843
    {txt}Residual {char |} {res} .037149036    60  .000619151           {txt}R-squared     = {res} 0.0004
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0163
    {txt}   Total {char |} {res} .037162253    61  .000609217           {txt}Root MSE      = {res} .02488

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    skewMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 8}F10. {c |}{col 14}{res}{space 2} .0097902{col 26}{space 2} .0670087{col 37}{space 1}    0.15{col 46}{space 3}0.884{col 54}{space 4}-.1242472{col 67}{space 3} .1438276
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .1093299{col 26}{space 2} .0034733{col 37}{space 1}   31.48{col 46}{space 3}0.000{col 54}{space 4} .1023822{col 67}{space 3} .1162775
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      61
{txt}{hline 13}{char +}{hline 30}           F(  1,    59) ={res}    0.28
    {txt}   Model {char |} {res} .000175068     1  .000175068           {txt}Prob > F      = {res} 0.5978
    {txt}Residual {char |} {res} .036700463    59  .000622042           {txt}R-squared     = {res} 0.0047
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0121
    {txt}   Total {char |} {res} .036875531    60  .000614592           {txt}Root MSE      = {res} .02494

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    skewMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 8}F11. {c |}{col 14}{res}{space 2}-.0356414{col 26}{space 2} .0671834{col 37}{space 1}   -0.53{col 46}{space 3}0.598{col 54}{space 4}-.1700751{col 67}{space 3} .0987923
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .1105875{col 26}{space 2}  .003509{col 37}{space 1}   31.52{col 46}{space 3}0.000{col 54}{space 4} .1035659{col 67}{space 3} .1176091
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      60
{txt}{hline 13}{char +}{hline 30}           F(  1,    58) ={res}    0.60
    {txt}   Model {char |} {res} .000377903     1  .000377903           {txt}Prob > F      = {res} 0.4415
    {txt}Residual {char |} {res} .036492467    58   .00062918           {txt}R-squared     = {res} 0.0102
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0068
    {txt}   Total {char |} {res}  .03687037    59  .000624922           {txt}Root MSE      = {res} .02508

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    skewMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 8}F12. {c |}{col 14}{res}{space 2}-.0525853{col 26}{space 2} .0678518{col 37}{space 1}   -0.78{col 46}{space 3}0.441{col 54}{space 4}-.1884054{col 67}{space 3} .0832349
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .1108873{col 26}{space 2} .0035404{col 37}{space 1}   31.32{col 46}{space 3}0.000{col 54}{space 4} .1038005{col 67}{space 3} .1179741
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      71
{txt}{hline 13}{char +}{hline 30}           F(  1,    69) ={res}    0.88
    {txt}   Model {char |} {res} .005674426     1  .005674426           {txt}Prob > F      = {res} 0.3518
    {txt}Residual {char |} {res} .445607305    69  .006458077           {txt}R-squared     = {res} 0.0126
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0017
    {txt}   Total {char |} {res} .451281731    70  .006446882           {txt}Root MSE      = {res} .08036

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      varMed{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F1. {c |}{col 14}{res}{space 2}-.1936047{col 26}{space 2} .2065412{col 37}{space 1}   -0.94{col 46}{space 3}0.352{col 54}{space 4}-.6056431{col 67}{space 3} .2184336
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .7008413{col 26}{space 2} .0107948{col 37}{space 1}   64.92{col 46}{space 3}0.000{col 54}{space 4} .6793064{col 67}{space 3} .7223763
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      70
{txt}{hline 13}{char +}{hline 30}           F(  1,    68) ={res}    0.92
    {txt}   Model {char |} {res} .006018005     1  .006018005           {txt}Prob > F      = {res} 0.3406
    {txt}Residual {char |} {res} .444384938    68  .006535073           {txt}R-squared     = {res} 0.0134
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0011
    {txt}   Total {char |} {res} .450402943    69  .006527579           {txt}Root MSE      = {res} .08084

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      varMed{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F2. {c |}{col 14}{res}{space 2}-.1993807{col 26}{space 2} .2077696{col 37}{space 1}   -0.96{col 46}{space 3}0.341{col 54}{space 4}-.6139785{col 67}{space 3} .2152171
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .7014064{col 26}{space 2} .0109209{col 37}{space 1}   64.23{col 46}{space 3}0.000{col 54}{space 4} .6796142{col 67}{space 3} .7231987
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      69
{txt}{hline 13}{char +}{hline 30}           F(  1,    67) ={res}    3.12
    {txt}   Model {char |} {res} .019996943     1  .019996943           {txt}Prob > F      = {res} 0.0819
    {txt}Residual {char |} {res} .429501739    67  .006410474           {txt}R-squared     = {res} 0.0445
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0302
    {txt}   Total {char |} {res} .449498682    68  .006610275           {txt}Root MSE      = {res} .08007

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      varMed{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F3. {c |}{col 14}{res}{space 2} -.364489{col 26}{space 2} .2063705{col 37}{space 1}   -1.77{col 46}{space 3}0.082{col 54}{space 4}-.7764063{col 67}{space 3} .0474283
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .7057296{col 26}{space 2} .0108438{col 37}{space 1}   65.08{col 46}{space 3}0.000{col 54}{space 4} .6840852{col 67}{space 3}  .727374
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      68
{txt}{hline 13}{char +}{hline 30}           F(  1,    66) ={res}    1.31
    {txt}   Model {char |} {res} .008705032     1  .008705032           {txt}Prob > F      = {res} 0.2572
    {txt}Residual {char |} {res} .439862793    66  .006664588           {txt}R-squared     = {res} 0.0194
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0045
    {txt}   Total {char |} {res} .448567825    67  .006695042           {txt}Root MSE      = {res} .08164

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      varMed{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F4. {c |}{col 14}{res}{space 2} -.240904{col 26}{space 2} .2107878{col 37}{space 1}   -1.14{col 46}{space 3}0.257{col 54}{space 4}-.6617553{col 67}{space 3} .1799474
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .7032802{col 26}{space 2}  .011157{col 37}{space 1}   63.03{col 46}{space 3}0.000{col 54}{space 4} .6810045{col 67}{space 3} .7255559
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      67
{txt}{hline 13}{char +}{hline 30}           F(  1,    65) ={res}    0.13
    {txt}   Model {char |} {res} .000876747     1  .000876747           {txt}Prob > F      = {res} 0.7221
    {txt}Residual {char |} {res} .446732435    65  .006872807           {txt}R-squared     = {res} 0.0020
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0134
    {txt}   Total {char |} {res} .447609182    66  .006781957           {txt}Root MSE      = {res}  .0829

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      varMed{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F5. {c |}{col 14}{res}{space 2}-.0765718{col 26}{space 2} .2143872{col 37}{space 1}   -0.36{col 46}{space 3}0.722{col 54}{space 4}-.5047327{col 67}{space 3}  .351589
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .6997034{col 26}{space 2} .0113688{col 37}{space 1}   61.55{col 46}{space 3}0.000{col 54}{space 4} .6769983{col 67}{space 3} .7224085
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      66
{txt}{hline 13}{char +}{hline 30}           F(  1,    64) ={res}    0.17
    {txt}   Model {char |} {res} .001211992     1  .001211992           {txt}Prob > F      = {res} 0.6778
    {txt}Residual {char |} {res} .445409497    64  .006959523           {txt}R-squared     = {res} 0.0027
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0129
    {txt}   Total {char |} {res} .446621489    65    .0068711           {txt}Root MSE      = {res} .08342

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      varMed{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F6. {c |}{col 14}{res}{space 2}-.0901179{col 26}{space 2} .2159489{col 37}{space 1}   -0.42{col 46}{space 3}0.678{col 54}{space 4}-.5215254{col 67}{space 3} .3412896
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}  .700479{col 26}{space 2} .0114861{col 37}{space 1}   60.98{col 46}{space 3}0.000{col 54}{space 4} .6775329{col 67}{space 3} .7234252
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      65
{txt}{hline 13}{char +}{hline 30}           F(  1,    63) ={res}    0.54
    {txt}   Model {char |} {res} .003754359     1  .003754359           {txt}Prob > F      = {res} 0.4671
    {txt}Residual {char |} {res} .441849046    63  .007013477           {txt}R-squared     = {res} 0.0084
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0073
    {txt}   Total {char |} {res} .445603405    64  .006962553           {txt}Root MSE      = {res} .08375

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      varMed{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F7. {c |}{col 14}{res}{space 2}-.1618892{col 26}{space 2}  .221267{col 37}{space 1}   -0.73{col 46}{space 3}0.467{col 54}{space 4}-.6040561{col 67}{space 3} .2802776
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .7024853{col 26}{space 2} .0115332{col 37}{space 1}   60.91{col 46}{space 3}0.000{col 54}{space 4}  .679438{col 67}{space 3} .7255327
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      64
{txt}{hline 13}{char +}{hline 30}           F(  1,    62) ={res}    2.26
    {txt}   Model {char |} {res} .015656283     1  .015656283           {txt}Prob > F      = {res} 0.1376
    {txt}Residual {char |} {res} .428897223    62  .006917697           {txt}R-squared     = {res} 0.0352
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0197
    {txt}   Total {char |} {res} .444553507    63  .007056405           {txt}Root MSE      = {res} .08317

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      varMed{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F8. {c |}{col 14}{res}{space 2}-.3368296{col 26}{space 2} .2238962{col 37}{space 1}   -1.50{col 46}{space 3}0.138{col 54}{space 4}-.7843917{col 67}{space 3} .1107325
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .7065714{col 26}{space 2} .0114593{col 37}{space 1}   61.66{col 46}{space 3}0.000{col 54}{space 4} .6836645{col 67}{space 3} .7294783
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      63
{txt}{hline 13}{char +}{hline 30}           F(  1,    61) ={res}    0.39
    {txt}   Model {char |} {res} .002804441     1  .002804441           {txt}Prob > F      = {res} 0.5356
    {txt}Residual {char |} {res} .440665837    61   .00722403           {txt}R-squared     = {res} 0.0063
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0100
    {txt}   Total {char |} {res} .443470278    62  .007152746           {txt}Root MSE      = {res} .08499

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      varMed{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F9. {c |}{col 14}{res}{space 2}-.1425815{col 26}{space 2} .2288388{col 37}{space 1}   -0.62{col 46}{space 3}0.536{col 54}{space 4} -.600173{col 67}{space 3} .3150101
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .7029238{col 26}{space 2} .0117973{col 37}{space 1}   59.58{col 46}{space 3}0.000{col 54}{space 4} .6793338{col 67}{space 3} .7265139
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      62
{txt}{hline 13}{char +}{hline 30}           F(  1,    60) ={res}    0.04
    {txt}   Model {char |} {res}  .00026213     1   .00026213           {txt}Prob > F      = {res} 0.8510
    {txt}Residual {char |} {res} .442089976    60  .007368166           {txt}R-squared     = {res} 0.0006
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0161
    {txt}   Total {char |} {res} .442352106    61  .007251674           {txt}Root MSE      = {res} .08584

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      varMed{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 8}F10. {c |}{col 14}{res}{space 2} .0436005{col 26}{space 2} .2311602{col 37}{space 1}    0.19{col 46}{space 3}0.851{col 54}{space 4}-.4187886{col 67}{space 3} .5059897
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .6994365{col 26}{space 2} .0119819{col 37}{space 1}   58.37{col 46}{space 3}0.000{col 54}{space 4} .6754692{col 67}{space 3} .7234038
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      61
{txt}{hline 13}{char +}{hline 30}           F(  1,    59) ={res}    0.65
    {txt}   Model {char |} {res} .004775621     1  .004775621           {txt}Prob > F      = {res} 0.4249
    {txt}Residual {char |} {res} .436421652    59  .007396977           {txt}R-squared     = {res} 0.0108
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0059
    {txt}   Total {char |} {res} .441197273    60  .007353288           {txt}Root MSE      = {res} .08601

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      varMed{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 8}F11. {c |}{col 14}{res}{space 2} .1861518{col 26}{space 2} .2316751{col 37}{space 1}    0.80{col 46}{space 3}0.425{col 54}{space 4}-.2774291{col 67}{space 3} .6497326
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .6968965{col 26}{space 2} .0121006{col 37}{space 1}   57.59{col 46}{space 3}0.000{col 54}{space 4} .6726833{col 67}{space 3} .7211096
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      60
{txt}{hline 13}{char +}{hline 30}           F(  1,    58) ={res}    0.02
    {txt}   Model {char |} {res} .000132848     1  .000132848           {txt}Prob > F      = {res} 0.8953
    {txt}Residual {char |} {res} .440992621    58  .007603321           {txt}R-squared     = {res} 0.0003
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0169
    {txt}   Total {char |} {res} .441125469    59  .007476703           {txt}Root MSE      = {res}  .0872

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      varMed{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 8}F12. {c |}{col 14}{res}{space 2} .0311783{col 26}{space 2} .2358716{col 37}{space 1}    0.13{col 46}{space 3}0.895{col 54}{space 4}  -.44097{col 67}{space 3} .5033265
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .7004094{col 26}{space 2} .0123073{col 37}{space 1}   56.91{col 46}{space 3}0.000{col 54}{space 4} .6757737{col 67}{space 3} .7250452
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      71
{txt}{hline 13}{char +}{hline 30}           F(  1,    69) ={res}    0.80
    {txt}   Model {char |} {res} .002620543     1  .002620543           {txt}Prob > F      = {res} 0.3756
    {txt}Residual {char |} {res} .227396596    69  .003295603           {txt}R-squared     = {res} 0.0114
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0029
    {txt}   Total {char |} {res} .230017139    70  .003285959           {txt}Root MSE      = {res} .05741

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      iqrMed{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F1. {c |}{col 14}{res}{space 2}-.1315681{col 26}{space 2} .1475443{col 37}{space 1}   -0.89{col 46}{space 3}0.376{col 54}{space 4}-.4259109{col 67}{space 3} .1627747
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.191444{col 26}{space 2} .0077113{col 37}{space 1}  154.51{col 46}{space 3}0.000{col 54}{space 4}  1.17606{col 67}{space 3} 1.206827
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      70
{txt}{hline 13}{char +}{hline 30}           F(  1,    68) ={res}    0.71
    {txt}   Model {char |} {res} .002380996     1  .002380996           {txt}Prob > F      = {res} 0.4017
    {txt}Residual {char |} {res} .227354942    68  .003343455           {txt}R-squared     = {res} 0.0104
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0042
    {txt}   Total {char |} {res} .229735938    69  .003329506           {txt}Root MSE      = {res} .05782

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      iqrMed{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F2. {c |}{col 14}{res}{space 2}-.1254112{col 26}{space 2} .1486122{col 37}{space 1}   -0.84{col 46}{space 3}0.402{col 54}{space 4}-.4219623{col 67}{space 3}   .17114
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.191533{col 26}{space 2} .0078114{col 37}{space 1}  152.54{col 46}{space 3}0.000{col 54}{space 4} 1.175945{col 67}{space 3}  1.20712
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      69
{txt}{hline 13}{char +}{hline 30}           F(  1,    67) ={res}    3.59
    {txt}   Model {char |} {res} .011667273     1  .011667273           {txt}Prob > F      = {res} 0.0625
    {txt}Residual {char |} {res} .217779314    67  .003250438           {txt}R-squared     = {res} 0.0508
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0367
    {txt}   Total {char |} {res} .229446587    68  .003374215           {txt}Root MSE      = {res} .05701

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      iqrMed{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F3. {c |}{col 14}{res}{space 2}-.2784116{col 26}{space 2} .1469513{col 37}{space 1}   -1.89{col 46}{space 3}0.062{col 54}{space 4}-.5717277{col 67}{space 3} .0149045
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.195408{col 26}{space 2} .0077216{col 37}{space 1}  154.81{col 46}{space 3}0.000{col 54}{space 4} 1.179995{col 67}{space 3}  1.21082
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      68
{txt}{hline 13}{char +}{hline 30}           F(  1,    66) ={res}    0.84
    {txt}   Model {char |} {res} .002873071     1  .002873071           {txt}Prob > F      = {res} 0.3633
    {txt}Residual {char |} {res} .226275654    66  .003428419           {txt}R-squared     = {res} 0.0125
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0024
    {txt}   Total {char |} {res} .229148725    67   .00342013           {txt}Root MSE      = {res} .05855

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      iqrMed{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F4. {c |}{col 14}{res}{space 2}-.1383987{col 26}{space 2}  .151184{col 37}{space 1}   -0.92{col 46}{space 3}0.363{col 54}{space 4}-.4402472{col 67}{space 3} .1634498
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.192335{col 26}{space 2} .0080022{col 37}{space 1}  149.00{col 46}{space 3}0.000{col 54}{space 4} 1.176358{col 67}{space 3} 1.208312
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      67
{txt}{hline 13}{char +}{hline 30}           F(  1,    65) ={res}    0.08
    {txt}   Model {char |} {res} .000277989     1  .000277989           {txt}Prob > F      = {res} 0.7795
    {txt}Residual {char |} {res} .228563983    65  .003516369           {txt}R-squared     = {res} 0.0012
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0142
    {txt}   Total {char |} {res} .228841972    66  .003467303           {txt}Root MSE      = {res}  .0593

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      iqrMed{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F5. {c |}{col 14}{res}{space 2} .0431167{col 26}{space 2} .1533483{col 37}{space 1}    0.28{col 46}{space 3}0.779{col 54}{space 4} -.263141{col 67}{space 3} .3493745
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.188178{col 26}{space 2}  .008132{col 37}{space 1}  146.11{col 46}{space 3}0.000{col 54}{space 4} 1.171937{col 67}{space 3} 1.204419
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      66
{txt}{hline 13}{char +}{hline 30}           F(  1,    64) ={res}    0.01
    {txt}   Model {char |} {res} .000046565     1  .000046565           {txt}Prob > F      = {res} 0.9094
    {txt}Residual {char |} {res} .228479359    64   .00356999           {txt}R-squared     = {res} 0.0002
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0154
    {txt}   Total {char |} {res} .228525923    65  .003515783           {txt}Root MSE      = {res} .05975

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      iqrMed{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F6. {c |}{col 14}{res}{space 2} -.017664{col 26}{space 2}  .154666{col 37}{space 1}   -0.11{col 46}{space 3}0.909{col 54}{space 4}-.3266448{col 67}{space 3} .2913167
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.189905{col 26}{space 2} .0082265{col 37}{space 1}  144.64{col 46}{space 3}0.000{col 54}{space 4} 1.173471{col 67}{space 3} 1.206339
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      65
{txt}{hline 13}{char +}{hline 30}           F(  1,    63) ={res}    0.52
    {txt}   Model {char |} {res}  .00185994     1   .00185994           {txt}Prob > F      = {res} 0.4745
    {txt}Residual {char |} {res}  .22634021    63  .003592702           {txt}R-squared     = {res} 0.0082
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0076
    {txt}   Total {char |} {res}  .22820015    64  .003565627           {txt}Root MSE      = {res} .05994

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      iqrMed{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F7. {c |}{col 14}{res}{space 2}-.1139461{col 26}{space 2} .1583655{col 37}{space 1}   -0.72{col 46}{space 3}0.474{col 54}{space 4}-.4304143{col 67}{space 3} .2025221
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}  1.19234{col 26}{space 2} .0082546{col 37}{space 1}  144.45{col 46}{space 3}0.000{col 54}{space 4} 1.175845{col 67}{space 3} 1.208836
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      64
{txt}{hline 13}{char +}{hline 30}           F(  1,    62) ={res}    3.70
    {txt}   Model {char |} {res} .012817468     1  .012817468           {txt}Prob > F      = {res} 0.0592
    {txt}Residual {char |} {res} .215046729    62  .003468496           {txt}R-squared     = {res} 0.0563
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0410
    {txt}   Total {char |} {res} .227864197    63  .003616892           {txt}Root MSE      = {res} .05889

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      iqrMed{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F8. {c |}{col 14}{res}{space 2}-.3047664{col 26}{space 2} .1585391{col 37}{space 1}   -1.92{col 46}{space 3}0.059{col 54}{space 4}-.6216816{col 67}{space 3} .0121489
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.196604{col 26}{space 2} .0081143{col 37}{space 1}  147.47{col 46}{space 3}0.000{col 54}{space 4} 1.180384{col 67}{space 3} 1.212824
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      63
{txt}{hline 13}{char +}{hline 30}           F(  1,    61) ={res}    0.59
    {txt}   Model {char |} {res} .002165404     1  .002165404           {txt}Prob > F      = {res} 0.4469
    {txt}Residual {char |} {res} .225352209    61  .003694299           {txt}R-squared     = {res} 0.0095
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0067
    {txt}   Total {char |} {res} .227517614    62  .003669639           {txt}Root MSE      = {res} .06078

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      iqrMed{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F9. {c |}{col 14}{res}{space 2} -.125288{col 26}{space 2} .1636462{col 37}{space 1}   -0.77{col 46}{space 3}0.447{col 54}{space 4}-.4525188{col 67}{space 3} .2019428
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.193047{col 26}{space 2} .0084364{col 37}{space 1}  141.42{col 46}{space 3}0.000{col 54}{space 4} 1.176178{col 67}{space 3} 1.209917
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      62
{txt}{hline 13}{char +}{hline 30}           F(  1,    60) ={res}    0.04
    {txt}   Model {char |} {res} .000164627     1  .000164627           {txt}Prob > F      = {res} 0.8355
    {txt}Residual {char |} {res} .226995188    60  .003783253           {txt}R-squared     = {res} 0.0007
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0159
    {txt}   Total {char |} {res} .227159814    61  .003723931           {txt}Root MSE      = {res} .06151

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      iqrMed{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 8}F10. {c |}{col 14}{res}{space 2} .0345528{col 26}{space 2} .1656403{col 37}{space 1}    0.21{col 46}{space 3}0.835{col 54}{space 4}-.2967771{col 67}{space 3} .3658827
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.189896{col 26}{space 2} .0085857{col 37}{space 1}  138.59{col 46}{space 3}0.000{col 54}{space 4} 1.172722{col 67}{space 3}  1.20707
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      61
{txt}{hline 13}{char +}{hline 30}           F(  1,    59) ={res}    0.73
    {txt}   Model {char |} {res} .002781043     1  .002781043           {txt}Prob > F      = {res} 0.3955
    {txt}Residual {char |} {res} .224009241    59  .003796767           {txt}R-squared     = {res} 0.0123
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0045
    {txt}   Total {char |} {res} .226790284    60  .003779838           {txt}Root MSE      = {res} .06162

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      iqrMed{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 8}F11. {c |}{col 14}{res}{space 2} .1420549{col 26}{space 2} .1659813{col 37}{space 1}    0.86{col 46}{space 3}0.396{col 54}{space 4} -.190073{col 67}{space 3} .4741827
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.187876{col 26}{space 2} .0086693{col 37}{space 1}  137.02{col 46}{space 3}0.000{col 54}{space 4} 1.170529{col 67}{space 3} 1.205224
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      60
{txt}{hline 13}{char +}{hline 30}           F(  1,    58) ={res}    0.07
    {txt}   Model {char |} {res} .000285848     1  .000285848           {txt}Prob > F      = {res} 0.7875
    {txt}Residual {char |} {res} .226122625    58  .003898666           {txt}R-squared     = {res} 0.0013
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0160
    {txt}   Total {char |} {res} .226408473    59  .003837432           {txt}Root MSE      = {res} .06244

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      iqrMed{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 8}F12. {c |}{col 14}{res}{space 2} .0457342{col 26}{space 2} .1689009{col 37}{space 1}    0.27{col 46}{space 3}0.788{col 54}{space 4}-.2923576{col 67}{space 3} .3838261
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.190311{col 26}{space 2} .0088129{col 37}{space 1}  135.06{col 46}{space 3}0.000{col 54}{space 4}  1.17267{col 67}{space 3} 1.207952
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      71
{txt}{hline 13}{char +}{hline 30}           F(  1,    69) ={res}    0.38
    {txt}   Model {char |} {res} .068408773     1  .068408773           {txt}Prob > F      = {res} 0.5408
    {txt}Residual {char |} {res} 12.4916685    69  .181038674           {txt}R-squared     = {res} 0.0054
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0090
    {txt}   Total {char |} {res} 12.5600773    70  .179429676           {txt}Root MSE      = {res} .42549

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     rvarMed{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F1. {c |}{col 14}{res}{space 2}-.6722192{col 26}{space 2} 1.093555{col 37}{space 1}   -0.61{col 46}{space 3}0.541{col 54}{space 4}-2.853802{col 67}{space 3} 1.509364
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 3.314769{col 26}{space 2} .0571541{col 37}{space 1}   58.00{col 46}{space 3}0.000{col 54}{space 4} 3.200749{col 67}{space 3} 3.428788
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      70
{txt}{hline 13}{char +}{hline 30}           F(  1,    68) ={res}    0.19
    {txt}   Model {char |} {res}  .03314716     1   .03314716           {txt}Prob > F      = {res} 0.6639
    {txt}Residual {char |} {res} 11.8313973    68  .173991137           {txt}R-squared     = {res} 0.0028
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0119
    {txt}   Total {char |} {res} 11.8645445    69   .17194992           {txt}Root MSE      = {res} .41712

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     rvarMed{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F2. {c |}{col 14}{res}{space 2} .4679291{col 26}{space 2} 1.072063{col 37}{space 1}    0.44{col 46}{space 3}0.664{col 54}{space 4} -1.67134{col 67}{space 3} 2.607198
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 3.298678{col 26}{space 2} .0563502{col 37}{space 1}   58.54{col 46}{space 3}0.000{col 54}{space 4} 3.186233{col 67}{space 3} 3.411123
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      69
{txt}{hline 13}{char +}{hline 30}           F(  1,    67) ={res}    0.21
    {txt}   Model {char |} {res} .036756521     1  .036756521           {txt}Prob > F      = {res} 0.6453
    {txt}Residual {char |} {res} 11.5189367    67  .171924428           {txt}R-squared     = {res} 0.0032
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0117
    {txt}   Total {char |} {res} 11.5556932    68  .169936665           {txt}Root MSE      = {res} .41464

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     rvarMed{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F3. {c |}{col 14}{res}{space 2} .4941625{col 26}{space 2} 1.068738{col 37}{space 1}    0.46{col 46}{space 3}0.645{col 54}{space 4}-1.639048{col 67}{space 3} 2.627373
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 3.306241{col 26}{space 2} .0561574{col 37}{space 1}   58.87{col 46}{space 3}0.000{col 54}{space 4} 3.194151{col 67}{space 3} 3.418332
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      68
{txt}{hline 13}{char +}{hline 30}           F(  1,    66) ={res}    0.00
    {txt}   Model {char |} {res} .000766524     1  .000766524           {txt}Prob > F      = {res} 0.9466
    {txt}Residual {char |} {res} 11.2077659    66  .169814636           {txt}R-squared     = {res} 0.0001
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0151
    {txt}   Total {char |} {res} 11.2085325    67  .167291529           {txt}Root MSE      = {res} .41209

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     rvarMed{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F4. {c |}{col 14}{res}{space 2}-.0714861{col 26}{space 2} 1.064012{col 37}{space 1}   -0.07{col 46}{space 3}0.947{col 54}{space 4}-2.195854{col 67}{space 3} 2.052881
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 3.328485{col 26}{space 2} .0563183{col 37}{space 1}   59.10{col 46}{space 3}0.000{col 54}{space 4} 3.216041{col 67}{space 3} 3.440928
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      67
{txt}{hline 13}{char +}{hline 30}           F(  1,    65) ={res}    1.02
    {txt}   Model {char |} {res} .173872743     1  .173872743           {txt}Prob > F      = {res} 0.3152
    {txt}Residual {char |} {res} 11.0302924    65  .169696807           {txt}R-squared     = {res} 0.0155
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0004
    {txt}   Total {char |} {res} 11.2041652    66  .169760079           {txt}Root MSE      = {res} .41194

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     rvarMed{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F5. {c |}{col 14}{res}{space 2} -1.07832{col 26}{space 2} 1.065292{col 37}{space 1}   -1.01{col 46}{space 3}0.315{col 54}{space 4}-3.205855{col 67}{space 3} 1.049215
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 3.351736{col 26}{space 2} .0564918{col 37}{space 1}   59.33{col 46}{space 3}0.000{col 54}{space 4} 3.238914{col 67}{space 3} 3.464558
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      66
{txt}{hline 13}{char +}{hline 30}           F(  1,    64) ={res}    2.30
    {txt}   Model {char |} {res} .373529226     1  .373529226           {txt}Prob > F      = {res} 0.1342
    {txt}Residual {char |} {res} 10.3896484    64  .162338257           {txt}R-squared     = {res} 0.0347
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0196
    {txt}   Total {char |} {res} 10.7631777    65  .165587348           {txt}Root MSE      = {res} .40291

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     rvarMed{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F6. {c |}{col 14}{res}{space 2}-1.582062{col 26}{space 2}  1.04297{col 37}{space 1}   -1.52{col 46}{space 3}0.134{col 54}{space 4}-3.665633{col 67}{space 3} .5015093
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 3.373448{col 26}{space 2} .0554745{col 37}{space 1}   60.81{col 46}{space 3}0.000{col 54}{space 4} 3.262625{col 67}{space 3} 3.484272
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      65
{txt}{hline 13}{char +}{hline 30}           F(  1,    63) ={res}    3.91
    {txt}   Model {char |} {res} .613417517     1  .613417517           {txt}Prob > F      = {res} 0.0522
    {txt}Residual {char |} {res} 9.87223833    63  .156702196           {txt}R-squared     = {res} 0.0585
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0436
    {txt}   Total {char |} {res} 10.4856559    64  .163838373           {txt}Root MSE      = {res} .39586

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     rvarMed{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F7. {c |}{col 14}{res}{space 2}-2.069322{col 26}{space 2} 1.045894{col 37}{space 1}   -1.98{col 46}{space 3}0.052{col 54}{space 4}-4.159374{col 67}{space 3} .0207297
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 3.390659{col 26}{space 2} .0545158{col 37}{space 1}   62.20{col 46}{space 3}0.000{col 54}{space 4} 3.281718{col 67}{space 3}   3.4996
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      64
{txt}{hline 13}{char +}{hline 30}           F(  1,    62) ={res}    7.42
    {txt}   Model {char |} {res} 1.06879741     1  1.06879741           {txt}Prob > F      = {res} 0.0084
    {txt}Residual {char |} {res}  8.9321449    62  .144066853           {txt}R-squared     = {res} 0.1069
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0925
    {txt}   Total {char |} {res} 10.0009423    63  .158745116           {txt}Root MSE      = {res} .37956

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     rvarMed{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F8. {c |}{col 14}{res}{space 2}-2.783003{col 26}{space 2} 1.021758{col 37}{space 1}   -2.72{col 46}{space 3}0.008{col 54}{space 4}-4.825467{col 67}{space 3}-.7405379
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}  3.41449{col 26}{space 2} .0522951{col 37}{space 1}   65.29{col 46}{space 3}0.000{col 54}{space 4} 3.309953{col 67}{space 3} 3.519026
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      63
{txt}{hline 13}{char +}{hline 30}           F(  1,    61) ={res}    2.37
    {txt}   Model {char |} {res} .364868817     1  .364868817           {txt}Prob > F      = {res} 0.1286
    {txt}Residual {char |} {res} 9.37924648    61  .153758139           {txt}R-squared     = {res} 0.0374
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0217
    {txt}   Total {char |} {res}  9.7441153    62   .15716315           {txt}Root MSE      = {res} .39212

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     rvarMed{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F9. {c |}{col 14}{res}{space 2}-1.626329{col 26}{space 2} 1.055745{col 37}{space 1}   -1.54{col 46}{space 3}0.129{col 54}{space 4}-3.737421{col 67}{space 3} .4847638
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 3.397748{col 26}{space 2} .0544265{col 37}{space 1}   62.43{col 46}{space 3}0.000{col 54}{space 4} 3.288916{col 67}{space 3} 3.506581
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      62
{txt}{hline 13}{char +}{hline 30}           F(  1,    60) ={res}    0.02
    {txt}   Model {char |} {res} .003044711     1  .003044711           {txt}Prob > F      = {res} 0.8887
    {txt}Residual {char |} {res} 9.24898391    60  .154149732           {txt}R-squared     = {res} 0.0003
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0163
    {txt}   Total {char |} {res} 9.25202862    61    .1516726           {txt}Root MSE      = {res} .39262

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     rvarMed{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 8}F10. {c |}{col 14}{res}{space 2}-.1485957{col 26}{space 2} 1.057316{col 37}{space 1}   -0.14{col 46}{space 3}0.889{col 54}{space 4}-2.263542{col 67}{space 3}  1.96635
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 3.376986{col 26}{space 2} .0548045{col 37}{space 1}   61.62{col 46}{space 3}0.000{col 54}{space 4}  3.26736{col 67}{space 3} 3.486611
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      61
{txt}{hline 13}{char +}{hline 30}           F(  1,    59) ={res}    0.00
    {txt}   Model {char |} {res} .000055002     1  .000055002           {txt}Prob > F      = {res} 0.9849
    {txt}Residual {char |} {res} 8.97820066    59  .152172893           {txt}R-squared     = {res} 0.0000
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0169
    {txt}   Total {char |} {res} 8.97825567    60  .149637594           {txt}Root MSE      = {res} .39009

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     rvarMed{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 8}F11. {c |}{col 14}{res}{space 2} .0199775{col 26}{space 2} 1.050802{col 37}{space 1}    0.02{col 46}{space 3}0.985{col 54}{space 4}-2.082672{col 67}{space 3} 2.122627
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 3.381865{col 26}{space 2} .0548842{col 37}{space 1}   61.62{col 46}{space 3}0.000{col 54}{space 4} 3.272042{col 67}{space 3} 3.491688
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      60
{txt}{hline 13}{char +}{hline 30}           F(  1,    58) ={res}    0.06
    {txt}   Model {char |} {res} .009826863     1  .009826863           {txt}Prob > F      = {res} 0.8018
    {txt}Residual {char |} {res}   8.966673    58   .15459781           {txt}R-squared     = {res} 0.0011
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0161
    {txt}   Total {char |} {res} 8.97649986    59  .152144066           {txt}Root MSE      = {res} .39319

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     rvarMed{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 8}F12. {c |}{col 14}{res}{space 2} .2681522{col 26}{space 2} 1.063593{col 37}{space 1}    0.25{col 46}{space 3}0.802{col 54}{space 4}-1.860861{col 67}{space 3} 2.397165
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 3.377335{col 26}{space 2} .0554962{col 37}{space 1}   60.86{col 46}{space 3}0.000{col 54}{space 4} 3.266247{col 67}{space 3} 3.488422
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      71
{txt}{hline 13}{char +}{hline 30}           F(  1,    69) ={res}       .
    {txt}   Model {char |} {res}          0     1           0           {txt}Prob > F      = {res}      .
    {txt}Residual {char |} {res}          0    69           0           {txt}R-squared     = {res}      .
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}      .
    {txt}   Total {char |} {res}          0    70           0           {txt}Root MSE      = {res}      0

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     skewMed{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F1. {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}macros:
             r(label2) : "{res}(omitted){txt}"
             r(label1) : "{res}(omitted){txt}"

matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      70
{txt}{hline 13}{char +}{hline 30}           F(  1,    68) ={res}       .
    {txt}   Model {char |} {res}          0     1           0           {txt}Prob > F      = {res}      .
    {txt}Residual {char |} {res}          0    68           0           {txt}R-squared     = {res}      .
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}      .
    {txt}   Total {char |} {res}          0    69           0           {txt}Root MSE      = {res}      0

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     skewMed{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F2. {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}macros:
             r(label2) : "{res}(omitted){txt}"
             r(label1) : "{res}(omitted){txt}"

matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      69
{txt}{hline 13}{char +}{hline 30}           F(  1,    67) ={res}       .
    {txt}   Model {char |} {res}          0     1           0           {txt}Prob > F      = {res}      .
    {txt}Residual {char |} {res}          0    67           0           {txt}R-squared     = {res}      .
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}      .
    {txt}   Total {char |} {res}          0    68           0           {txt}Root MSE      = {res}      0

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     skewMed{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F3. {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}macros:
             r(label2) : "{res}(omitted){txt}"
             r(label1) : "{res}(omitted){txt}"

matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      68
{txt}{hline 13}{char +}{hline 30}           F(  1,    66) ={res}       .
    {txt}   Model {char |} {res}          0     1           0           {txt}Prob > F      = {res}      .
    {txt}Residual {char |} {res}          0    66           0           {txt}R-squared     = {res}      .
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}      .
    {txt}   Total {char |} {res}          0    67           0           {txt}Root MSE      = {res}      0

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     skewMed{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F4. {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}macros:
             r(label2) : "{res}(omitted){txt}"
             r(label1) : "{res}(omitted){txt}"

matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      67
{txt}{hline 13}{char +}{hline 30}           F(  1,    65) ={res}       .
    {txt}   Model {char |} {res}          0     1           0           {txt}Prob > F      = {res}      .
    {txt}Residual {char |} {res}          0    65           0           {txt}R-squared     = {res}      .
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}      .
    {txt}   Total {char |} {res}          0    66           0           {txt}Root MSE      = {res}      0

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     skewMed{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F5. {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}macros:
             r(label2) : "{res}(omitted){txt}"
             r(label1) : "{res}(omitted){txt}"

matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      66
{txt}{hline 13}{char +}{hline 30}           F(  1,    64) ={res}       .
    {txt}   Model {char |} {res}          0     1           0           {txt}Prob > F      = {res}      .
    {txt}Residual {char |} {res}          0    64           0           {txt}R-squared     = {res}      .
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}      .
    {txt}   Total {char |} {res}          0    65           0           {txt}Root MSE      = {res}      0

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     skewMed{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F6. {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}macros:
             r(label2) : "{res}(omitted){txt}"
             r(label1) : "{res}(omitted){txt}"

matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      65
{txt}{hline 13}{char +}{hline 30}           F(  1,    63) ={res}       .
    {txt}   Model {char |} {res}          0     1           0           {txt}Prob > F      = {res}      .
    {txt}Residual {char |} {res}          0    63           0           {txt}R-squared     = {res}      .
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}      .
    {txt}   Total {char |} {res}          0    64           0           {txt}Root MSE      = {res}      0

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     skewMed{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F7. {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}macros:
             r(label2) : "{res}(omitted){txt}"
             r(label1) : "{res}(omitted){txt}"

matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      64
{txt}{hline 13}{char +}{hline 30}           F(  1,    62) ={res}       .
    {txt}   Model {char |} {res}          0     1           0           {txt}Prob > F      = {res}      .
    {txt}Residual {char |} {res}          0    62           0           {txt}R-squared     = {res}      .
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}      .
    {txt}   Total {char |} {res}          0    63           0           {txt}Root MSE      = {res}      0

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     skewMed{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F8. {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}macros:
             r(label2) : "{res}(omitted){txt}"
             r(label1) : "{res}(omitted){txt}"

matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      63
{txt}{hline 13}{char +}{hline 30}           F(  1,    61) ={res}       .
    {txt}   Model {char |} {res}          0     1           0           {txt}Prob > F      = {res}      .
    {txt}Residual {char |} {res}          0    61           0           {txt}R-squared     = {res}      .
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}      .
    {txt}   Total {char |} {res}          0    62           0           {txt}Root MSE      = {res}      0

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     skewMed{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 9}F9. {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}macros:
             r(label2) : "{res}(omitted){txt}"
             r(label1) : "{res}(omitted){txt}"

matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      62
{txt}{hline 13}{char +}{hline 30}           F(  1,    60) ={res}       .
    {txt}   Model {char |} {res}          0     1           0           {txt}Prob > F      = {res}      .
    {txt}Residual {char |} {res}          0    60           0           {txt}R-squared     = {res}      .
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}      .
    {txt}   Total {char |} {res}          0    61           0           {txt}Root MSE      = {res}      0

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     skewMed{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 8}F10. {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}macros:
             r(label2) : "{res}(omitted){txt}"
             r(label1) : "{res}(omitted){txt}"

matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      61
{txt}{hline 13}{char +}{hline 30}           F(  1,    59) ={res}       .
    {txt}   Model {char |} {res}          0     1           0           {txt}Prob > F      = {res}      .
    {txt}Residual {char |} {res}          0    59           0           {txt}R-squared     = {res}      .
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}      .
    {txt}   Total {char |} {res}          0    60           0           {txt}Root MSE      = {res}      0

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     skewMed{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 8}F11. {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}macros:
             r(label2) : "{res}(omitted){txt}"
             r(label1) : "{res}(omitted){txt}"

matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

      Source {c |}       SS       df       MS              Number of obs ={res}      60
{txt}{hline 13}{char +}{hline 30}           F(  1,    58) ={res}       .
    {txt}   Model {char |} {res}          0     1           0           {txt}Prob > F      = {res}      .
    {txt}Residual {char |} {res}          0    58           0           {txt}R-squared     = {res}      .
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}      .
    {txt}   Total {char |} {res}          0    59           0           {txt}Root MSE      = {res}      0

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     skewMed{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}sp500 {c |}
{space 8}F12. {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}scalars:
              r(level) =  {res}95

{txt}macros:
             r(label2) : "{res}(omitted){txt}"
             r(label1) : "{res}(omitted){txt}"

matrices:
              r(table) : {res} 9 x 2
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved
{res}{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/macro_corr_stata_3m.xls saved

{com}. 
. ************************
. ***** correlation plot *******
. ***********************
. 
. foreach mom in `Moments'{c -(}
{txt}  2{com}. xcorr `mom' sp500, lag(12) title("`mom' and stock market")
{txt}  3{com}. *reg `mom'  c.l1.sp500##i.byear_gr c.l1.sp500##i.HHinc_gr c.l1.sp500##i.educ_gr c.l1.sp500##i.age_gr
. *reg `mom'  c.Stkprob##i.byear_gr c.Stkprob##i.HHinc_gr c.Stkprob##i.educ_gr c.Stkprob##i.age_gr
. graph export "${c -(}sum_graph_folder{c )-}/ts/corr_`mom'_stk_3m.png",as(png) replace 
{txt}  4{com}. {c )-}
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/corr_varMean_stk_3m.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/corr_iqrMean_stk_3m.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/corr_rvarMean_stk_3m.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/corr_skewMean_stk_3m.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/corr_varMed_stk_3m.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/corr_iqrMed_stk_3m.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/corr_rvarMed_stk_3m.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/corr_skewMed_stk_3m.png written in PNG format)

{com}. 
. log close 
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/Myworld/Dropbox/IncExpProject/WorkingFolder/indSCE_Maro_log.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}31 Mar 2020, 15:04:32
{txt}{.-}
{smcl}
{txt}{sf}{ul off}