{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/Myworld/Dropbox/IncExpProject/WorkingFolder/indSCE_Est_log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}14 Dec 2020, 13:16:37
{txt}
{com}. 
. *********************************************************
. *** before working with SCE, clean the stock market data 
. ********************************************************
. 
. use "${c -(}mainfolder{c )-}/OtherData/sp500.dta",clear 
{txt}
{com}. 
. generate new_date = dofc(DATE)
{txt}
{com}. *format new_date %tm
. gen year = year(new_date)
{txt}
{com}. gen month = month(new_date)
{txt}
{com}. gen date_str = string(year)+ "m"+string(month)
{txt}
{com}. gen date = monthly(date_str,"YM")
{txt}
{com}. format date %tm
{txt}
{com}. drop DATE date_str year month new_date 
{txt}
{com}. label var sp500 "growth rate (%) of sp500 index from last month"
{txt}
{com}. save "${c -(}mainfolder{c )-}/OtherData/sp500M.dta",replace 
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/OtherData/sp500M.dta saved

{com}. clear 
{txt}
{com}. 
. 
. ***************************
. **  Clean and Merge Data **
. ***************************
. 
. use "${c -(}folder{c )-}/SCE/IncExpSCEDstIndM",clear 
{txt}
{com}. 
. duplicates report year month userid

{p 0 4}{txt}Duplicates in terms of {res} year month userid{p_end}

{txt}{hline 10}{c TT}{hline 27}
   copies {c |} observations       surplus
{hline 10}{c +}{hline 27}
        1 {c |}        {res}95113             0
{txt}{hline 10}{c BT}{hline 27}

{com}. 
. ************************************************
. *** Merge with demographics and other moments **
. ************************************************
. 
. merge 1:1 year month userid using "${c -(}folder{c )-}/SCE/IncExpSCEProbIndM",keep(master match using) 
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}          95,113{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge hh_info_merge
{res}{txt}
{com}. 
. 
. ** format the date 
. drop date 
{txt}
{com}. gen date_str=string(year)+"m"+string(month) 
{txt}
{com}. gen date= monthly(date_str,"YM")
{txt}
{com}. format date %tm
{txt}
{com}. order userid date year month   
{txt}
{com}. 
. *************************************
. *** Merge with stock market data   **
. *************************************
. 
. merge m:1 date using "${c -(}mainfolder{c )-}/OtherData/sp500M.dta", keep(master match) 
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}          95,113{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge sp_merge
{res}{txt}
{com}. 
. *******************************
. **  Set Panel Data Structure **
. *******************************
. rename userid ID 
{res}{txt}
{com}. xtset ID date   /* this is not correct. ID is unique here.*/
{res}{txt}{col 8}panel variable:  {res}ID (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}date, 2013m6 to 2020m1, but with gaps
{txt}{col 17}delta:  {res}1 month
{txt}
{com}. sort ID year month 
{txt}
{com}. 
. *******************************
. ** Exclude extreme outliers 
. ******************************
. 
. keep if Q32 <= 65 & Q32 >= 20
{txt}(9973 observations deleted)

{com}. 
. *****************************************
. ****  Renaming so that more consistent **
. *****************************************
. 
. rename Q24_mean incmean
{res}{txt}
{com}. rename Q24_var incvar
{res}{txt}
{com}. rename Q24_iqr inciqr
{res}{txt}
{com}. rename IncSkew incskew 
{res}{txt}
{com}. rename Q24_rmean rincmean
{res}{txt}
{com}. rename Q24_rvar rincvar
{res}{txt}
{com}. 
. rename Q36 educ
{res}{txt}
{com}. rename D6 HHinc 
{res}{txt}
{com}. rename Q32 age 
{res}{txt}
{com}. rename Q33 gender 
{res}{txt}
{com}. rename Q10_1 fulltime
{res}{txt}
{com}. rename Q10_2 parttime
{res}{txt}
{com}. rename Q12new selfemp
{res}{txt}
{com}. rename Q6new Stkprob
{res}{txt}
{com}. rename Q4new UEprobAgg
{res}{txt}
{com}. rename Q13new UEprobInd
{res}{txt}
{com}. rename Q26v2 spending_dum
{res}{txt}
{com}. rename Q26v2part2 spending 
{res}{txt}
{com}. 
. 
. ************************
. ** focus on non-zero skewness
. ****************************
. 
. replace incskew = . if incskew==0
{txt}(31814 real changes made, 31814 to missing)

{com}. 
. 
. *************************
. *** Exclude outliers *****
. *************************
. 
. local Moments incmean rincmean incvar rincvar inciqr incskew 
{txt}
{com}. 
. foreach var in `Moments'{c -(}
{txt}  2{com}.       egen `var'pl=pctile(`var'),p(1)
{txt}  3{com}.           egen `var'pu=pctile(`var'),p(99)
{txt}  4{com}.           replace `var' = . if `var' <`var'pl | (`var' >`var'pu & `var'!=.)
{txt}  5{com}. {c )-}
{txt}(1136 real changes made, 1136 to missing)
(1088 real changes made, 1088 to missing)
(3040 real changes made, 3040 to missing)
(800 real changes made, 800 to missing)
(1176 real changes made, 1176 to missing)
(575 real changes made, 575 to missing)

{com}. 
. /*
> * other thresholds 
> 
> foreach var in `Moments'{c -(}
>       egen `var'l_truc=pctile(`var'),p(8)
>           egen `var'u_truc=pctile(`var'),p(92)
>           replace `var' = . if `var' <`var'l_truc | (`var' >`var'u_truc & `var'!=.)
> {c )-}
> */
. 
. *****************************
. *** generate other vars *****
. *****************************
. 
. gen age_sq = age^2
{txt}
{com}. label var age_sq "Age-squared"
{txt}
{com}. 
. encode state, gen(state_id)
{txt}
{com}. label var state_id "state id"
{txt}
{com}. 
. *****************************
. *** generate group vars *****
. *****************************
. 
. *egen byear_g = cut(byear), group(4)
. 
. gen byear_g = cond(byear>=1980,1,0)
{txt}
{com}. label define byearglb 0 "before 1980s" 1 "after 1980s"
{txt}
{com}. *label define byearglb 0 "1950s" 1 "1960s" 2 "1970s" 3 "1980s"
. label value byear_g byearlb
{txt}
{com}. 
. egen age_g = cut(age), group(3)  
{txt}
{com}. label var age_g "age group"
{txt}
{com}. label define agelb 0 "young" 1 "middle-age" 2 "old"
{txt}
{com}. label value age_g agelb
{txt}
{com}. 
. gen edu_g = . 
{txt}(85140 missing values generated)

{com}. replace edu_g = 1 if educ==1
{txt}(694 real changes made)

{com}. replace edu_g = 2 if educ==2 | educ ==3 | educ == 4
{txt}(36926 real changes made)

{com}. replace edu_g = 3 if educ <=9 & educ>4
{txt}(47520 real changes made)

{com}. 
. label var edu_g "education group"
{txt}
{com}. label define edu_glb 1 "HS dropout" 2 "HS graduate" 3 "College/above"
{txt}
{com}. label value edu_g edu_glb
{txt}
{com}. 
. label define gdlb 1 "Male" 2 "Female" 
{txt}
{com}. label value gender gdlb
{txt}
{com}. 
. egen HHinc_g = cut(HHinc), group(2)
{txt}(11858 missing values generated)

{com}. label var HHinc_g "Household income group"
{txt}
{com}. label define HHinc_glb 0 "low inc" 1 "high inc"
{txt}
{com}. label value HHinc_g HHinc_glb
{txt}
{com}. 
. label define gender_glb 1 "male" 2 "female"
{txt}
{com}. label value gender gender_glb
{txt}
{com}. 
. gen fbetter =cond(Q1>2,1,0)
{txt}
{com}. replace fbetter = . if Q1 ==3  
{txt}(37884 real changes made, 37884 to missing)

{com}. label var fbetter "finance better"
{txt}
{com}. 
. label define better_glb 0 "worse" 1 "better"
{txt}
{com}. label value fbetter better_glb
{txt}
{com}. 
. gen nlit_g = cond(nlit>=3,1,0) 
{txt}
{com}. replace nlit_g = . if nlit ==.
{txt}(30156 real changes made, 30156 to missing)

{com}. label var nlit_g "numeracy literacy score group"
{txt}
{com}. label define nlilb 0 "low" 1 "high" 
{txt}
{com}. label value nlit_g nlitlb
{txt}
{com}. 
. local group_vars byear_g age_g edu_g HHinc_g fbetter nlit_g
{txt}
{com}. 
. 
. *********************************
. *** bar charts *****
. **********************************
. 
. 
. graph bar incvar, ///
>            over(HHinc,relabel(1 "<10k" 2 "<20k" 3 "<30k" 4 "<40k" 5 "<50k" 6 "<60k" 7 "<75k" 8 "<100k" 9 "<150k" 10 "<200k" 11 ">200k")) ///
>                    bar(1, color(navy)) ///
>                    title("Perceived Risk by Household Income") ///
>                    b1title("Household income") ///
>                    ytitle("Average perceived risk") 
{res}{txt}
{com}. graph export "${c -(}sum_graph_folder{c )-}/boxplot_var_HHinc_stata.png", as(png) replace 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/boxplot_var_HHinc_stata.png written in PNG format)

{com}. 
. 
. *********************************
. *** generate group summary data file *****
. **********************************
. 
. * by age 
. 
. 
. preserve 
{txt}
{com}. collapse incvar, by(age) 
{txt}
{com}. save "${c -(}folder{c )-}/SCE/incvar_by_age.dta",replace
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/SurveyData//SCE/incvar_by_age.dta saved

{com}. restore 
{txt}
{com}. 
. * by age x education 
. preserve
{txt}
{com}. collapse incvar, by(age edu_g) 
{txt}
{com}. save "${c -(}folder{c )-}/SCE/incvar_by_age_edu.dta",replace 
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/SurveyData//SCE/incvar_by_age_edu.dta saved

{com}. restore 
{txt}
{com}. 
. 
. * by age x gender 
. preserve
{txt}
{com}. collapse incvar, by(age gender) 
{txt}
{com}. save "${c -(}folder{c )-}/SCE/incvar_by_age_gender.dta",replace 
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/SurveyData//SCE/incvar_by_age_gender.dta saved

{com}. restore 
{txt}
{com}. 
. **********************************
. *** tables and hists of Vars *****
. **********************************
. 
. /*
> local Moments incmean incvar inciqr rincmean rincvar incskew
> 
> foreach gp in `group_vars' {c -(}
> tabstat `Moments', st(p10 p50 p90) by(`gp')
> {c )-}
> 
> 
> foreach gp in `group_vars' {c -(}
> table `gp', c(median incvar mean incvar median rincvar mean rincvar) by(year)
> {c )-}
> 
> 
> ** histograms 
> 
> foreach mom in `Moments'{c -(}
> 
> twoway (hist `mom',fcolor(ltblue) lcolor(none)), ///
>            ytitle("") ///
>            title("`mom'")
> graph export "${c -(}sum_graph_folder{c )-}/hist/hist_`mom'.png",as(png) replace  
> 
> {c )-}
> 
> 
> * 4 groups 
> foreach gp in byear_g{c -(}
> foreach mom in `Moments'{c -(}
> twoway (hist `mom' if `gp'==0,fcolor(gs15) lcolor("")) /// 
>        (hist `mom' if `gp'==1,fcolor(ltblue) lcolor("")) ///
>            (hist `mom' if `gp'==2,fcolor(red) lcolor("")) ///
>            (hist `mom' if `gp'==3,fcolor(green) lcolor("")), ///
>            xtitle("") ///
>            ytitle("") ///
>            title("`mom'") ///
>            legend(label(1 `gp'=0) label(2 `gp'=1) label(3 `gp'=2) label(4 `gp'=3) col(1))
> 
> graph export "${c -(}sum_graph_folder{c )-}/hist/hist_`mom'_`gp'.png",as(png) replace  
> {c )-}
> {c )-}
> 
> * 3 groups 
> foreach gp in HHinc_g age_g{c -(}
> foreach mom in `Moments'{c -(}
> 
> twoway (hist `mom' if `gp'==0,fcolor(gs15) lcolor("")) /// 
>        (hist `mom' if `gp'==1,fcolor(ltblue) lcolor("")) ///
>            (hist `mom' if `gp'==2,fcolor(red) lcolor("")), ///
>            xtitle("") ///
>            ytitle("") ///
>            title("`mom'") ///
>            legend(label(1 `gp'=0) label(2 `gp'=1) label(3 `gp'=2) col(1))
> 
> graph export "${c -(}sum_graph_folder{c )-}/hist/hist_`mom'_`gp'.png",as(png) replace  
> 
> {c )-}
> {c )-}
> 
> * 2 groups 
> 
> 
> foreach gp in edu_g fbetter{c -(}
> foreach mom in `Moments'{c -(}
> 
> twoway (hist `mom' if `gp'==0,fcolor(gs15) lcolor("")) /// 
>        (hist `mom' if `gp'==1,fcolor(ltblue) lcolor("")), ///
>            xtitle("") ///
>            ytitle("") ///
>            title("`mom'") ///
>            legend(label(1 `gp'=0) label(2 `gp'=1) col(1))
> 
> graph export "${c -(}sum_graph_folder{c )-}/hist/hist_`mom'_`gp'.png",as(png) replace  
> 
> {c )-}
> {c )-}
> 
> */
. 
. 
. **********************************
. *** time series pltos by group *****
. **********************************
. 
. 
. ** 2 groups 
. foreach agg in mean median{c -(}
{txt}  2{com}.   foreach gp in fbetter{c -(}
{txt}  3{com}.    preserve 
{txt}  4{com}.    
.    collapse (`agg') `Moments' sp500, by(date `gp')
{txt}  5{com}.    xtset `gp' date 
{txt}  6{com}. 
. foreach mom in `Moments'{c -(}
{txt}  7{com}. keep if `mom'!=.
{txt}  8{com}. * moments only 
. 
. twoway (tsline `mom' if `gp'== 0,lp(solid) lwidth(thick)) ///
>        (tsline `mom' if `gp'== 1,lp(dash) lwidth(thick)), ///
>        xtitle("date") ///
>            ytitle("") ///
>            title("`mom' by recent household finance condition") ///
>            legend(label(1 "worse") label(2 "better") col(4))
{txt}  9{com}.  graph export "${c -(}sum_graph_folder{c )-}/ts/ts_`mom'_`gp'_`agg'.png",as(png) replace  
{txt} 10{com}.  
. {c )-}
{txt} 11{com}.   restore
{txt} 12{com}. {c )-}
{txt} 13{com}. {c )-}
{res}{txt}{col 8}panel variable:  {res}fbetter (weakly balanced)
{txt}{col 9}time variable:  {res}{col 25}date, 2013m6 to 2020m1
{txt}{col 17}delta:  {res}1 month
{txt}(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incmean_fbetter_mean.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincmean_fbetter_mean.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incvar_fbetter_mean.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincvar_fbetter_mean.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_inciqr_fbetter_mean.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incskew_fbetter_mean.png written in PNG format)
{res}{txt}{col 8}panel variable:  {res}fbetter (weakly balanced)
{txt}{col 9}time variable:  {res}{col 25}date, 2013m6 to 2020m1
{txt}{col 17}delta:  {res}1 month
{txt}(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incmean_fbetter_median.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincmean_fbetter_median.png written in PNG format)
(0 observations deleted)
{res}{err}{hline 2}Break{hline 2}
{txt}{search r(1):r(1);}

end of do-file

{err}{hline 2}Break{hline 2}
{txt}{search r(1):r(1);}

{com}. do "/Users/Myworld/Dropbox/IncExpProject/WorkingFolder/DoFile/Step05a_PSIDAnalysis.do"
{txt}
{com}. **************************************************************
. *! PSID data cleaning
. *! Last modified: May1 2020 by Tao 
. **************************************************************
. 
. global datafolder "/Users/Myworld/Dropbox/PSID/J276289/"
{txt}
{com}. global scefolder "/Users/Myworld/Dropbox/IncExpProject/WorkingFolder/SurveyData/SCE/"
{txt}
{com}. global otherdatafolder "/Users/Myworld/Dropbox/PSID/OtherData/"
{txt}
{com}. global table_folder "/Users/Myworld/Dropbox/IncExpProject/WorkingFolder/OtherData/PSID/"
{txt}
{com}. global graph_folder "/Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/psid/"
{txt}
{com}. 
. cd ${c -(}datafolder{c )-}
{res}/Users/Myworld/Dropbox/PSID/J276289
{txt}
{com}. 
. capture log close
{smcl}
{com}{sf}{ul off}