{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/Myworld/Dropbox/IncExpProject/WorkingFolder/indSCE_Est_log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 7 Nov 2019, 14:24:33
{txt}
{com}. 
. 
. ***************************
. **  Clean and Merge Data **
. ***************************
. 
. use "${c -(}folder{c )-}/SCE/IncExpSCEDstIndM",clear 
{txt}
{com}. 
. duplicates report year month userid

{p 0 4}{txt}Duplicates in terms of {res} year month userid{p_end}

{txt}{hline 10}{c TT}{hline 27}
   copies {c |} observations       surplus
{hline 10}{c +}{hline 27}
        1 {c |}        {res}79064             0
{txt}{hline 10}{c BT}{hline 27}

{com}. 
. ******************************
. *** Merge with demographics **
. *****************************
. 
. merge 1:1 year month userid using "${c -(}folder{c )-}/SCE/IncExpSCEProbIndM",keep(master match) 
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}          79,064{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge hh_info_merge
{res}{txt}
{com}. 
. *******************************
. **  Set Panel Data Structure **
. *******************************
. rename userid ID 
{res}{txt}
{com}. xtset ID date   /* this is not correct. ID is unique here.*/
{res}{txt}{col 8}panel variable:  {res}ID (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}date, 01jun2013 00:00:00 to 01may2018 00:00:00
{col 25}but with gaps
{txt}{col 17}delta:  {res}.001 seconds
{txt}
{com}. sort ID year month 
{txt}
{com}. 
. *******************************
. ** Exclude extreme outliers 
. ******************************
. 
. *keep if Q32 < 100 & Q32 >= 10
. 
. drop if IncVar < 0
{txt}(0 observations deleted)

{com}. 
. 
. *************************
. *** Exclude outliers *****
. *************************
. 
. local Moments IncMean IncVar IncSkew IncKurt
{txt}
{com}. 
. foreach var in `Moments'{c -(}
{txt}  2{com}.       egen `var'pl=pctile(`var'),p(1)
{txt}  3{com}.           egen `var'pu=pctile(`var'),p(99)
{txt}  4{com}.           replace `var' = . if `var' <`var'pl | (`var' >`var'pu & `var'!=.)
{txt}  5{com}. {c )-}
{txt}(440 real changes made, 440 to missing)
(474 real changes made, 474 to missing)
(988 real changes made, 988 to missing)
(856 real changes made, 856 to missing)

{com}. 
. 
. *****************************
. *** generate other vars *****
. *****************************
. 
. gen age_sq = (Q32-30)^2
{txt}(67434 missing values generated)

{com}. label var age_sq "Age-squared"
{txt}
{com}. 
. encode _STATE, gen(state_id)
{txt}
{com}. label var state_id "state id"
{txt}
{com}. 
. *****************************
. *** generate group vars *****
. *****************************
. 
. gen cohort = year-Q32
{txt}(67434 missing values generated)

{com}. label var cohort "cohort by year of birth"
{txt}
{com}. egen cohort_g = cut(cohort), group(3)
{txt}(67434 missing values generated)

{com}. label define cohortlb 0 "1915-1956" 1 "1957-1972" 2 "1973-2000"
{txt}
{com}. label value cohort_g cohortlb
{txt}
{com}. 
. egen age_g = cut(Q32), group(3)  
{txt}(67434 missing values generated)

{com}. label var age_g "age group"
{txt}
{com}. label define agelb 0 "Young" 1 "Middle-age" 2 "Old"
{txt}
{com}. label value age_g agelb
{txt}
{com}. 
. egen edu_g = cut(Q36), group(3) 
{txt}(67406 missing values generated)

{com}. label var edu_g "education group"
{txt}
{com}. label define edulb 0 "Low Education" 1 "Medium Education" 2 "High Education"
{txt}
{com}. label value edu_g edulb
{txt}
{com}. 
. gen gender_g = Q33 
{txt}(67408 missing values generated)

{com}. label var gender_g "gender_grou"
{txt}
{com}. label define gdlb 0 "Male" 1 "Female" 
{txt}
{com}. label value gender_g gdlb
{txt}
{com}. 
. egen inc_g = cut(Q47), group(3)
{txt}(67541 missing values generated)

{com}. label var inc_g "income_g"
{txt}
{com}. label define inclb 0 "Low income" 1 "Middle Income" 2 "High Income"
{txt}
{com}. label value inc_g inclb
{txt}
{com}. 
. local group_vars age_g edu_g inc_g cohort_g
{txt}
{com}. 
. 
. **********************************
. *** tables and hists of Vars *****
. **********************************
. 
. 
. foreach gp in `group_vars' {c -(}
{txt}  2{com}. tabstat Q24_mean Q24_var Q24_iqr IncMean IncVar, st(p10 p50 p90) by(`gp')
{txt}  3{com}. {c )-}

{txt}Summary statistics: p10, p50, p90
  by categories of: age_g (age group)

{ralign 10:age_g} {...}
{c |}{...}
  Q24_mean   Q24_var   Q24_iqr   IncMean
{hline 11}{c +}{hline 40}
{ralign 10:Young} {...}
{c |}{...}
 {res} .7777428  .3333333  .9061641  .2389598
{txt}{space 10} {...}
{c |}{...}
 {res}  2.96196   1.64812         2  .6666667
{txt}{space 10} {...}
{c |}{...}
 {res} 6.809876  21.20652  10.19136         4
{txt}{hline 11}{c +}{hline 40}
{ralign 10:Middle-age} {...}
{c |}{...}
 {res} .4221108  .3333333  .8810234  .2389598
{txt}{space 10} {...}
{c |}{...}
 {res} 2.367884  1.056389  1.437962  .7127152
{txt}{space 10} {...}
{c |}{...}
 {res} 6.025575  17.71149  8.342402         3
{txt}{hline 11}{c +}{hline 40}
{ralign 10:Old} {...}
{c |}{...}
 {res} .7080645  .3333333  .9061639  .2577601
{txt}{space 10} {...}
{c |}{...}
 {res}        2  1.044458  1.391605         1
{txt}{space 10} {...}
{c |}{...}
 {res} 6.008746  22.44984    9.5219  4.381966
{txt}{hline 11}{c +}{hline 40}
{ralign 10:Total} {...}
{c |}{...}
 {res} .6104578  .3333333  .9061639   .242359
{txt}{space 10} {...}
{c |}{...}
 {res} 2.537525  1.333333  1.713396  .6666667
{txt}{space 10} {...}
{c |}{...}
 {res}  6.47924  20.05368  9.336226  3.632116
{txt}{hline 11}{c BT}{hline 40}

{ralign 10:age_g} {...}
{c |}{...}
    IncVar
{hline 11}{c +}{hline 10}
{ralign 10:Young} {...}
{c |}{...}
 {res} .0137465
{txt}{space 10} {...}
{c |}{...}
 {res} .0693832
{txt}{space 10} {...}
{c |}{...}
 {res} 1.333333
{txt}{hline 11}{c +}{hline 10}
{ralign 10:Middle-age} {...}
{c |}{...}
 {res} .0164512
{txt}{space 10} {...}
{c |}{...}
 {res} .3333333
{txt}{space 10} {...}
{c |}{...}
 {res} .8147773
{txt}{hline 11}{c +}{hline 10}
{ralign 10:Old} {...}
{c |}{...}
 {res}  .018795
{txt}{space 10} {...}
{c |}{...}
 {res} .3333333
{txt}{space 10} {...}
{c |}{...}
 {res} 1.333333
{txt}{hline 11}{c +}{hline 10}
{ralign 10:Total} {...}
{c |}{...}
 {res} .0161982
{txt}{space 10} {...}
{c |}{...}
 {res} .2764937
{txt}{space 10} {...}
{c |}{...}
 {res} 1.233755
{txt}{hline 11}{c BT}{hline 10}

Summary statistics: p10, p50, p90
  by categories of: edu_g (education group)

{ralign 16:edu_g} {...}
{c |}{...}
  Q24_mean   Q24_var   Q24_iqr
{hline 17}{c +}{hline 30}
{ralign 16:Low Education} {...}
{c |}{...}
 {res} 2.08e-08  .3333333         1
{txt}{space 16} {...}
{c |}{...}
 {res}        2  1.333333         2
{txt}{space 16} {...}
{c |}{...}
 {res} 6.558024    30.028        13
{txt}{hline 17}{c +}{hline 30}
{ralign 16:Medium Education} {...}
{c |}{...}
 {res} .1782963  .3333333  .9061641
{txt}{space 16} {...}
{c |}{...}
 {res} 2.453082  1.105975   1.57045
{txt}{space 16} {...}
{c |}{...}
 {res} 6.316294  20.84629  12.18417
{txt}{hline 17}{c +}{hline 30}
{ralign 16:High Education} {...}
{c |}{...}
 {res} .8121909  .3333333  .8566982
{txt}{space 16} {...}
{c |}{...}
 {res} 2.704531  1.333333  1.713398
{txt}{space 16} {...}
{c |}{...}
 {res} 6.486081  18.49858  7.423146
{txt}{hline 17}{c +}{hline 30}
{ralign 16:Total} {...}
{c |}{...}
 {res} .6069536  .3333333  .9061639
{txt}{space 16} {...}
{c |}{...}
 {res} 2.537525  1.333333  1.713396
{txt}{space 16} {...}
{c |}{...}
 {res}  6.47924  20.02004   9.36533
{txt}{hline 17}{c BT}{hline 30}

{ralign 16:edu_g} {...}
{c |}{...}
   IncMean    IncVar
{hline 17}{c +}{hline 20}
{ralign 16:Low Education} {...}
{c |}{...}
 {res} .2484386  .0257353
{txt}{space 16} {...}
{c |}{...}
 {res} .6943991  .3333333
{txt}{space 16} {...}
{c |}{...}
 {res} 4.381966  1.333333
{txt}{hline 17}{c +}{hline 20}
{ralign 16:Medium Education} {...}
{c |}{...}
 {res} .2506294  .0179772
{txt}{space 16} {...}
{c |}{...}
 {res} .8888889  .3333333
{txt}{space 16} {...}
{c |}{...}
 {res} 4.720759  1.333333
{txt}{hline 17}{c +}{hline 20}
{ralign 16:High Education} {...}
{c |}{...}
 {res} .2338288   .013815
{txt}{space 16} {...}
{c |}{...}
 {res} .6666667  .0940311
{txt}{space 16} {...}
{c |}{...}
 {res}        3  .8147773
{txt}{hline 17}{c +}{hline 20}
{ralign 16:Total} {...}
{c |}{...}
 {res} .2417595  .0161982
{txt}{space 16} {...}
{c |}{...}
 {res} .6666667  .2764937
{txt}{space 16} {...}
{c |}{...}
 {res} 3.632116  1.233755
{txt}{hline 17}{c BT}{hline 20}

Summary statistics: p10, p50, p90
  by categories of: inc_g (income_g)

{ralign 13:inc_g} {...}
{c |}{...}
  Q24_mean   Q24_var   Q24_iqr   IncMean
{hline 14}{c +}{hline 40}
{ralign 13:Low income} {...}
{c |}{...}
 {res} 2.08e-08  .3333333         1  .2506294
{txt}{space 13} {...}
{c |}{...}
 {res}        2  1.333333         2  .6666667
{txt}{space 13} {...}
{c |}{...}
 {res} 6.924951   31.6453        13         5
{txt}{hline 14}{c +}{hline 40}
{ralign 13:Middle Income} {...}
{c |}{...}
 {res} .5375247  .3333333  .9061639  .2308554
{txt}{space 13} {...}
{c |}{...}
 {res} 2.192116  1.127061  1.508995  .7127152
{txt}{space 13} {...}
{c |}{...}
 {res}        6  18.76865  8.725375         3
{txt}{hline 14}{c +}{hline 40}
{ralign 13:High Income} {...}
{c |}{...}
 {res}        1  .3333333   .856698  .2461167
{txt}{space 13} {...}
{c |}{...}
 {res} 2.793575  1.333333   1.64027  .6666667
{txt}{space 13} {...}
{c |}{...}
 {res} 6.599971  17.20418  7.173429  3.462475
{txt}{hline 14}{c +}{hline 40}
{ralign 13:Total} {...}
{c |}{...}
 {res} .6069536  .3333333  .9061639  .2413554
{txt}{space 13} {...}
{c |}{...}
 {res} 2.537525  1.333333  1.713396  .6666667
{txt}{space 13} {...}
{c |}{...}
 {res} 6.481738  20.21747   9.39088  3.577936
{txt}{hline 14}{c BT}{hline 40}

{ralign 13:inc_g} {...}
{c |}{...}
    IncVar
{hline 14}{c +}{hline 10}
{ralign 13:Low income} {...}
{c |}{...}
 {res} .0230559
{txt}{space 13} {...}
{c |}{...}
 {res} .3333333
{txt}{space 13} {...}
{c |}{...}
 {res} 1.333333
{txt}{hline 14}{c +}{hline 10}
{ralign 13:Middle Income} {...}
{c |}{...}
 {res} .0159816
{txt}{space 13} {...}
{c |}{...}
 {res} .3333333
{txt}{space 13} {...}
{c |}{...}
 {res} 1.233755
{txt}{hline 14}{c +}{hline 10}
{ralign 13:High Income} {...}
{c |}{...}
 {res} .0146505
{txt}{space 13} {...}
{c |}{...}
 {res} .1274406
{txt}{space 13} {...}
{c |}{...}
 {res} .8147773
{txt}{hline 14}{c +}{hline 10}
{ralign 13:Total} {...}
{c |}{...}
 {res} .0161982
{txt}{space 13} {...}
{c |}{...}
 {res} .2764937
{txt}{space 13} {...}
{c |}{...}
 {res} 1.233755
{txt}{hline 14}{c BT}{hline 10}

Summary statistics: p10, p50, p90
  by categories of: cohort_g 

{ralign 9:cohort_g} {...}
{c |}{...}
  Q24_mean   Q24_var   Q24_iqr   IncMean
{hline 10}{c +}{hline 40}
{ralign 9:1915-1956} {...}
{c |}{...}
 {res} .6228527  .3333333  .9061639  .2389598
{txt}{space 9} {...}
{c |}{...}
 {res}        2  .9753268  1.324268         1
{txt}{space 9} {...}
{c |}{...}
 {res}        6  21.60151   8.90799         4
{txt}{hline 10}{c +}{hline 40}
{ralign 9:1957-1972} {...}
{c |}{...}
 {res} .4477587  .3333333  .8566982  .2505147
{txt}{space 9} {...}
{c |}{...}
 {res} 2.280812  1.044458  1.435542   .725921
{txt}{space 9} {...}
{c |}{...}
 {res}        6  16.78715  8.509292         3
{txt}{hline 10}{c +}{hline 40}
{ralign 9:1973-2000} {...}
{c |}{...}
 {res} .7586042  .3333333  .9061641  .2396565
{txt}{space 9} {...}
{c |}{...}
 {res} 2.959499  1.632472         2  .6666667
{txt}{space 9} {...}
{c |}{...}
 {res} 6.868142  21.45051   10.2934  4.211032
{txt}{hline 10}{c +}{hline 40}
{ralign 9:Total} {...}
{c |}{...}
 {res} .6104578  .3333333  .9061639   .242359
{txt}{space 9} {...}
{c |}{...}
 {res} 2.537525  1.333333  1.713396  .6666667
{txt}{space 9} {...}
{c |}{...}
 {res}  6.47924  20.05368  9.336226  3.632116
{txt}{hline 10}{c BT}{hline 40}

{ralign 9:cohort_g} {...}
{c |}{...}
    IncVar
{hline 10}{c +}{hline 10}
{ralign 9:1915-1956} {...}
{c |}{...}
 {res} .0188465
{txt}{space 9} {...}
{c |}{...}
 {res} .3333333
{txt}{space 9} {...}
{c |}{...}
 {res} 1.333333
{txt}{hline 10}{c +}{hline 10}
{ralign 9:1957-1972} {...}
{c |}{...}
 {res}  .016755
{txt}{space 9} {...}
{c |}{...}
 {res} .3333333
{txt}{space 9} {...}
{c |}{...}
 {res} .8147773
{txt}{hline 10}{c +}{hline 10}
{ralign 9:1973-2000} {...}
{c |}{...}
 {res}  .013815
{txt}{space 9} {...}
{c |}{...}
 {res} .0708662
{txt}{space 9} {...}
{c |}{...}
 {res} 1.333333
{txt}{hline 10}{c +}{hline 10}
{ralign 9:Total} {...}
{c |}{...}
 {res} .0161982
{txt}{space 9} {...}
{c |}{...}
 {res} .2764937
{txt}{space 9} {...}
{c |}{...}
 {res} 1.233755
{txt}{hline 10}{c BT}{hline 10}

{com}. 
. 
. foreach gp in `group_vars' {c -(}
{txt}  2{com}. table `gp', c(median Q24_var) by(year)
{txt}  3{com}. {c )-}

{txt}{hline 11}{c TT}{hline 13}
year and   {c |}
age group  {c |} med(Q24_var)
{hline 11}{c +}{hline 13}
2013       {c |}
     Young {c |}    {res}1.4706578
{txt}Middle-age {c |}    {res}1.0504482
       {txt}Old {c |}    {res}.87410492
{txt}{hline 11}{c +}{hline 13}
2014       {c |}
     Young {c |}     {res}1.642285
{txt}Middle-age {c |}     {res}1.333333
       {txt}Old {c |}    {res}.87410492
{txt}{hline 11}{c +}{hline 13}
2015       {c |}
     Young {c |}    {res}1.7716688
{txt}Middle-age {c |}    {res}.87410492
       {txt}Old {c |}     {res}1.333333
{txt}{hline 11}{c +}{hline 13}
2016       {c |}
     Young {c |}    {res}1.6922234
{txt}Middle-age {c |}    {res}.86692697
       {txt}Old {c |}    {res}1.1862721
{txt}{hline 11}{c +}{hline 13}
2017       {c |}
     Young {c |}    {res}1.7856894
{txt}Middle-age {c |}    {res}.93161613
       {txt}Old {c |}    {res}.66666669
{txt}{hline 11}{c +}{hline 13}
2018       {c |}
     Young {c |}    {res}1.4911855
{txt}Middle-age {c |}    {res}.94059372
       {txt}Old {c |}    {res}1.0095498
{txt}{hline 11}{c BT}{hline 13}

{hline 17}{c TT}{hline 13}
year and         {c |}
education group  {c |} med(Q24_var)
{hline 17}{c +}{hline 13}
2013             {c |}
   Low Education {c |}     {res}1.105975
{txt}Medium Education {c |}    {res}.89902848
  {txt}High Education {c |}     {res}1.333333
{txt}{hline 17}{c +}{hline 13}
2014             {c |}
   Low Education {c |}     {res}1.425889
{txt}Medium Education {c |}     {res}1.333333
  {txt}High Education {c |}    {res}1.4992648
{txt}{hline 17}{c +}{hline 13}
2015             {c |}
   Low Education {c |}    {res}1.8824012
{txt}Medium Education {c |}    {res}.66863903
  {txt}High Education {c |}    {res}1.5146742
{txt}{hline 17}{c +}{hline 13}
2016             {c |}
   Low Education {c |}     {res}1.333333
{txt}Medium Education {c |}     {res}1.105975
  {txt}High Education {c |}     {res}1.333333
{txt}{hline 17}{c +}{hline 13}
2017             {c |}
   Low Education {c |}     {res}1.105975
{txt}Medium Education {c |}    {res}1.1185131
  {txt}High Education {c |}    {res}1.3586999
{txt}{hline 17}{c +}{hline 13}
2018             {c |}
   Low Education {c |}     {res}1.536028
{txt}Medium Education {c |}    {res}1.0006096
  {txt}High Education {c |}     {res}1.333333
{txt}{hline 17}{c BT}{hline 13}

{hline 14}{c TT}{hline 13}
year and      {c |}
income_g      {c |} med(Q24_var)
{hline 14}{c +}{hline 13}
2013          {c |}
   Low income {c |}    {res}1.9040942
{txt}Middle Income {c |}    {res}.66666669
  {txt}High Income {c |}     {res}1.333333
{txt}{hline 14}{c +}{hline 13}
2014          {c |}
   Low income {c |}    {res}1.6237009
{txt}Middle Income {c |}     {res}1.333333
  {txt}High Income {c |}    {res}1.3432762
{txt}{hline 14}{c +}{hline 13}
2015          {c |}
   Low income {c |}     {res}1.333333
{txt}Middle Income {c |}    {res}.99126315
  {txt}High Income {c |}    {res}1.4270498
{txt}{hline 14}{c +}{hline 13}
2016          {c |}
   Low income {c |}     {res}1.333333
{txt}Middle Income {c |}    {res}1.3262935
  {txt}High Income {c |}    {res}1.2031537
{txt}{hline 14}{c +}{hline 13}
2017          {c |}
   Low income {c |}     {res}1.333333
{txt}Middle Income {c |}     {res}1.333333
  {txt}High Income {c |}     {res}1.333333
{txt}{hline 14}{c +}{hline 13}
2018          {c |}
   Low income {c |}     {res}1.333333
{txt}Middle Income {c |}     {res}1.333333
  {txt}High Income {c |}    {res}1.3093832
{txt}{hline 14}{c BT}{hline 13}

{hline 10}{c TT}{hline 13}
year and  {c |}
cohort_g  {c |} med(Q24_var)
{hline 10}{c +}{hline 13}
2013      {c |}
1915-1956 {c |}    {res}.72505316
{txt}1957-1972 {c |}     {res}1.166442
{txt}1973-2000 {c |}     {res}1.646167
{txt}{hline 10}{c +}{hline 13}
2014      {c |}
1915-1956 {c |}    {res}.87410492
{txt}1957-1972 {c |}     {res}1.333333
{txt}1973-2000 {c |}     {res}1.642285
{txt}{hline 10}{c +}{hline 13}
2015      {c |}
1915-1956 {c |}     {res}1.333333
{txt}1957-1972 {c |}    {res}.84719852
{txt}1973-2000 {c |}    {res}1.7716688
{txt}{hline 10}{c +}{hline 13}
2016      {c |}
1915-1956 {c |}    {res}1.1651365
{txt}1957-1972 {c |}    {res}.93051246
{txt}1973-2000 {c |}    {res}1.5051229
{txt}{hline 10}{c +}{hline 13}
2017      {c |}
1915-1956 {c |}    {res}1.0609467
{txt}1957-1972 {c |}    {res}.81034333
{txt}1973-2000 {c |}    {res}1.7099483
{txt}{hline 10}{c +}{hline 13}
2018      {c |}
1915-1956 {c |}    {res}1.1888956
{txt}1957-1972 {c |}    {res}.66666669
{txt}1973-2000 {c |}    {res}1.4706577
{txt}{hline 10}{c BT}{hline 13}

{com}. 
. 
. /*
> 
> foreach mom in iqr var mean {c -(}
> 
> twoway (hist Q24_`mom',fcolor(ltblue) lcolor(none)), ///
>            ytitle("") ///
>            title("`mom'")
> graph export "${c -(}sum_graph_folder{c )-}/hist/hist_`mom'.png",as(png) replace  
> 
> {c )-}
> 
> foreach gp in `group_vars' {c -(}
> foreach mom in iqr var mean {c -(}
> 
> twoway (hist Q24_`mom' if `gp'==0,fcolor(gs15) lcolor("")) /// 
>        (hist Q24_`mom' if `gp'==1,fcolor(ltblue) lcolor("")) ///
>            (hist Q24_`mom' if `gp'==2,fcolor(red) lcolor("")), ///
>            xtitle("") ///
>            ytitle("") ///
>            title("`mom'") ///
>            legend(label(1 `gp'=0) label(2 `gp'=1) label(3 `gp'=2) col(1))
> 
> graph export "${c -(}sum_graph_folder{c )-}/hist/hist_`mom'_`gp'.png",as(png) replace  
> 
> {c )-}
> {c )-}
> 
> 
> */
. 
. foreach mom in Mean Var Skew Kurt{c -(}
{txt}  2{com}. 
. twoway (hist Inc`mom',fcolor(ltblue) lcolor(none)), ///
>            ytitle("") ///
>            title("`mom'")
{txt}  3{com}. graph export "${c -(}sum_graph_folder{c )-}/hist/hist_Inc`mom'.png",as(png) replace  
{txt}  4{com}. 
. {c )-}
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_IncMean.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_IncVar.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_IncSkew.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_IncKurt.png written in PNG format)

{com}. 
. foreach gp in `group_vars' {c -(}
{txt}  2{com}. foreach mom in Mean Var Skew Kurt{c -(}
{txt}  3{com}. 
. twoway (hist Inc`mom' if `gp'==0,fcolor(gs15) lcolor("")) /// 
>        (hist Inc`mom' if `gp'==1,fcolor(ltblue) lcolor("")) ///
>            (hist Inc`mom' if `gp'==2,fcolor(red) lcolor("")), ///
>            xtitle("") ///
>            ytitle("") ///
>            title("`mom'") ///
>            legend(label(1 `gp'=0) label(2 `gp'=1) label(3 `gp'=2) col(1))
{txt}  4{com}. 
. graph export "${c -(}sum_graph_folder{c )-}/hist/hist_Inc_`mom'_`gp'.png",as(png) replace  
{txt}  5{com}. 
. {c )-}
{txt}  6{com}. {c )-}
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_Inc_Mean_age_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_Inc_Var_age_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_Inc_Skew_age_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_Inc_Kurt_age_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_Inc_Mean_edu_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_Inc_Var_edu_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_Inc_Skew_edu_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_Inc_Kurt_edu_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_Inc_Mean_inc_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_Inc_Var_inc_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_Inc_Skew_inc_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_Inc_Kurt_inc_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_Inc_Mean_cohort_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_Inc_Var_cohort_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_Inc_Skew_cohort_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_Inc_Kurt_cohort_g.png written in PNG format)

{com}. 
. *******************
. *** Seasonal ******
. *******************
. 
. 
. eststo clear
{txt}
{com}. 
. foreach mom in var iqr mean{c -(}
{txt}  2{com}. eststo: reg Q24_`mom' i.month, robust 
{txt}  3{com}. {c )-}

{txt}Linear regression                                      Number of obs ={res}   47501
                                                       {txt}F( 11, 47489) ={res}    1.02
                                                       {txt}Prob > F      = {res} 0.4223
                                                       {txt}R-squared     = {res} 0.0002
                                                       {txt}Root MSE      = {res} 11.118

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     Q24_var{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}month {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .0541052{col 26}{space 2} .2548222{col 37}{space 1}    0.21{col 46}{space 3}0.832{col 54}{space 4}-.4453499{col 67}{space 3} .5535602
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .0631657{col 26}{space 2} .2515347{col 37}{space 1}    0.25{col 46}{space 3}0.802{col 54}{space 4}-.4298457{col 67}{space 3} .5561772
{txt}{space 10}4  {c |}{col 14}{res}{space 2} .1688123{col 26}{space 2} .2578388{col 37}{space 1}    0.65{col 46}{space 3}0.513{col 54}{space 4}-.3365554{col 67}{space 3} .6741799
{txt}{space 10}5  {c |}{col 14}{res}{space 2}-.1807193{col 26}{space 2} .2500219{col 37}{space 1}   -0.72{col 46}{space 3}0.470{col 54}{space 4}-.6707658{col 67}{space 3} .3093271
{txt}{space 10}6  {c |}{col 14}{res}{space 2}-.1081118{col 26}{space 2} .2497753{col 37}{space 1}   -0.43{col 46}{space 3}0.665{col 54}{space 4}-.5976748{col 67}{space 3} .3814513
{txt}{space 10}7  {c |}{col 14}{res}{space 2}-.3477118{col 26}{space 2} .2472103{col 37}{space 1}   -1.41{col 46}{space 3}0.160{col 54}{space 4}-.8322474{col 67}{space 3} .1368238
{txt}{space 10}8  {c |}{col 14}{res}{space 2} .2108318{col 26}{space 2}  .252835{col 37}{space 1}    0.83{col 46}{space 3}0.404{col 54}{space 4}-.2847283{col 67}{space 3} .7063919
{txt}{space 10}9  {c |}{col 14}{res}{space 2}-.2455929{col 26}{space 2} .2465275{col 37}{space 1}   -1.00{col 46}{space 3}0.319{col 54}{space 4}-.7287903{col 67}{space 3} .2376045
{txt}{space 9}10  {c |}{col 14}{res}{space 2}-.1770716{col 26}{space 2} .2469786{col 37}{space 1}   -0.72{col 46}{space 3}0.473{col 54}{space 4}-.6611532{col 67}{space 3} .3070099
{txt}{space 9}11  {c |}{col 14}{res}{space 2} .0916983{col 26}{space 2} .2521741{col 37}{space 1}    0.36{col 46}{space 3}0.716{col 54}{space 4}-.4025665{col 67}{space 3} .5859631
{txt}{space 9}12  {c |}{col 14}{res}{space 2} .1043148{col 26}{space 2} .2556782{col 37}{space 1}    0.41{col 46}{space 3}0.683{col 54}{space 4}-.3968179{col 67}{space 3} .6054476
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 5.590227{col 26}{space 2} .1790048{col 37}{space 1}   31.23{col 46}{space 3}0.000{col 54}{space 4} 5.239376{col 67}{space 3} 5.941079
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est1{txt} stored)

Linear regression                                      Number of obs ={res}   52569
                                                       {txt}F( 11, 52557) ={res}    0.58
                                                       {txt}Prob > F      = {res} 0.8440
                                                       {txt}R-squared     = {res} 0.0001
                                                       {txt}Root MSE      = {res}    3.9

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     Q24_iqr{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}month {c |}
{space 10}2  {c |}{col 14}{res}{space 2} -.016683{col 26}{space 2} .0871452{col 37}{space 1}   -0.19{col 46}{space 3}0.848{col 54}{space 4}-.1874884{col 67}{space 3} .1541224
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.0787296{col 26}{space 2}  .084967{col 37}{space 1}   -0.93{col 46}{space 3}0.354{col 54}{space 4}-.2452658{col 67}{space 3} .0878065
{txt}{space 10}4  {c |}{col 14}{res}{space 2}-.0541054{col 26}{space 2} .0860021{col 37}{space 1}   -0.63{col 46}{space 3}0.529{col 54}{space 4}-.2226702{col 67}{space 3} .1144594
{txt}{space 10}5  {c |}{col 14}{res}{space 2}-.0786933{col 26}{space 2} .0859022{col 37}{space 1}   -0.92{col 46}{space 3}0.360{col 54}{space 4}-.2470623{col 67}{space 3} .0896757
{txt}{space 10}6  {c |}{col 14}{res}{space 2}  -.11343{col 26}{space 2}  .085336{col 37}{space 1}   -1.33{col 46}{space 3}0.184{col 54}{space 4}-.2806893{col 67}{space 3} .0538293
{txt}{space 10}7  {c |}{col 14}{res}{space 2}-.1473242{col 26}{space 2} .0837892{col 37}{space 1}   -1.76{col 46}{space 3}0.079{col 54}{space 4}-.3115518{col 67}{space 3} .0169035
{txt}{space 10}8  {c |}{col 14}{res}{space 2}-.0996542{col 26}{space 2}  .082795{col 37}{space 1}   -1.20{col 46}{space 3}0.229{col 54}{space 4}-.2619331{col 67}{space 3} .0626248
{txt}{space 10}9  {c |}{col 14}{res}{space 2}-.0706108{col 26}{space 2} .0853167{col 37}{space 1}   -0.83{col 46}{space 3}0.408{col 54}{space 4}-.2378324{col 67}{space 3} .0966107
{txt}{space 9}10  {c |}{col 14}{res}{space 2}-.0641469{col 26}{space 2} .0857242{col 37}{space 1}   -0.75{col 46}{space 3}0.454{col 54}{space 4}-.2321671{col 67}{space 3} .1038732
{txt}{space 9}11  {c |}{col 14}{res}{space 2}-.0009014{col 26}{space 2} .0862862{col 37}{space 1}   -0.01{col 46}{space 3}0.992{col 54}{space 4}-.1700231{col 67}{space 3} .1682203
{txt}{space 9}12  {c |}{col 14}{res}{space 2}-.0400201{col 26}{space 2} .0866532{col 37}{space 1}   -0.46{col 46}{space 3}0.644{col 54}{space 4}-.2098612{col 67}{space 3}  .129821
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 3.160602{col 26}{space 2} .0621499{col 37}{space 1}   50.85{col 46}{space 3}0.000{col 54}{space 4} 3.038788{col 67}{space 3} 3.282417
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est2{txt} stored)

Linear regression                                      Number of obs ={res}   47392
                                                       {txt}F( 11, 47380) ={res}    0.62
                                                       {txt}Prob > F      = {res} 0.8171
                                                       {txt}R-squared     = {res} 0.0001
                                                       {txt}Root MSE      = {res} 2.3709

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}    Q24_mean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}month {c |}
{space 10}2  {c |}{col 14}{res}{space 2}-.0225998{col 26}{space 2} .0539474{col 37}{space 1}   -0.42{col 46}{space 3}0.675{col 54}{space 4}-.1283375{col 67}{space 3} .0831379
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .0308342{col 26}{space 2} .0531849{col 37}{space 1}    0.58{col 46}{space 3}0.562{col 54}{space 4} -.073409{col 67}{space 3} .1350773
{txt}{space 10}4  {c |}{col 14}{res}{space 2} .0280295{col 26}{space 2} .0537367{col 37}{space 1}    0.52{col 46}{space 3}0.602{col 54}{space 4}-.0772951{col 67}{space 3} .1333542
{txt}{space 10}5  {c |}{col 14}{res}{space 2}  .034608{col 26}{space 2} .0538474{col 37}{space 1}    0.64{col 46}{space 3}0.520{col 54}{space 4}-.0709335{col 67}{space 3} .1401496
{txt}{space 10}6  {c |}{col 14}{res}{space 2} .0358406{col 26}{space 2} .0541765{col 37}{space 1}    0.66{col 46}{space 3}0.508{col 54}{space 4}-.0703462{col 67}{space 3} .1420274
{txt}{space 10}7  {c |}{col 14}{res}{space 2} .0005032{col 26}{space 2} .0537699{col 37}{space 1}    0.01{col 46}{space 3}0.993{col 54}{space 4}-.1048865{col 67}{space 3} .1058929
{txt}{space 10}8  {c |}{col 14}{res}{space 2} .0484067{col 26}{space 2} .0534085{col 37}{space 1}    0.91{col 46}{space 3}0.365{col 54}{space 4}-.0562746{col 67}{space 3} .1530881
{txt}{space 10}9  {c |}{col 14}{res}{space 2} -.037706{col 26}{space 2} .0532127{col 37}{space 1}   -0.71{col 46}{space 3}0.479{col 54}{space 4}-.1420037{col 67}{space 3} .0665916
{txt}{space 9}10  {c |}{col 14}{res}{space 2}-.0256974{col 26}{space 2} .0536616{col 37}{space 1}   -0.48{col 46}{space 3}0.632{col 54}{space 4}-.1308749{col 67}{space 3} .0794802
{txt}{space 9}11  {c |}{col 14}{res}{space 2} .0203468{col 26}{space 2} .0540194{col 37}{space 1}    0.38{col 46}{space 3}0.706{col 54}{space 4}-.0855319{col 67}{space 3} .1262256
{txt}{space 9}12  {c |}{col 14}{res}{space 2}-.0247437{col 26}{space 2} .0539266{col 37}{space 1}   -0.46{col 46}{space 3}0.646{col 54}{space 4}-.1304406{col 67}{space 3} .0809532
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.810089{col 26}{space 2} .0382903{col 37}{space 1}   73.39{col 46}{space 3}0.000{col 54}{space 4} 2.735039{col 67}{space 3} 2.885138
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est3{txt} stored)

{com}. foreach mom in Mean Var Skew Kurt{c -(}
{txt}  2{com}. eststo: reg Inc`mom' i.month, robust 
{txt}  3{com}. {c )-}

{txt}Linear regression                                      Number of obs ={res}   46572
                                                       {txt}F( 11, 46560) ={res}    0.34
                                                       {txt}Prob > F      = {res} 0.9765
                                                       {txt}R-squared     = {res} 0.0001
                                                       {txt}Root MSE      = {res} 2.5747

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     IncMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}month {c |}
{space 10}2  {c |}{col 14}{res}{space 2}-.0310395{col 26}{space 2} .0597297{col 37}{space 1}   -0.52{col 46}{space 3}0.603{col 54}{space 4}-.1481106{col 67}{space 3} .0860317
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.0121935{col 26}{space 2} .0592194{col 37}{space 1}   -0.21{col 46}{space 3}0.837{col 54}{space 4}-.1282644{col 67}{space 3} .1038775
{txt}{space 10}4  {c |}{col 14}{res}{space 2} .0003112{col 26}{space 2}  .059644{col 37}{space 1}    0.01{col 46}{space 3}0.996{col 54}{space 4} -.116592{col 67}{space 3} .1172144
{txt}{space 10}5  {c |}{col 14}{res}{space 2}-.0351295{col 26}{space 2}   .05851{col 37}{space 1}   -0.60{col 46}{space 3}0.548{col 54}{space 4}-.1498101{col 67}{space 3}  .079551
{txt}{space 10}6  {c |}{col 14}{res}{space 2}-.0390617{col 26}{space 2} .0589319{col 37}{space 1}   -0.66{col 46}{space 3}0.507{col 54}{space 4} -.154569{col 67}{space 3} .0764457
{txt}{space 10}7  {c |}{col 14}{res}{space 2}-.0295745{col 26}{space 2} .0588616{col 37}{space 1}   -0.50{col 46}{space 3}0.615{col 54}{space 4}-.1449441{col 67}{space 3} .0857951
{txt}{space 10}8  {c |}{col 14}{res}{space 2} .0184592{col 26}{space 2} .0591448{col 37}{space 1}    0.31{col 46}{space 3}0.755{col 54}{space 4}-.0974654{col 67}{space 3} .1343838
{txt}{space 10}9  {c |}{col 14}{res}{space 2}-.0277396{col 26}{space 2} .0587556{col 37}{space 1}   -0.47{col 46}{space 3}0.637{col 54}{space 4}-.1429015{col 67}{space 3} .0874223
{txt}{space 9}10  {c |}{col 14}{res}{space 2}-.0747392{col 26}{space 2} .0577124{col 37}{space 1}   -1.30{col 46}{space 3}0.195{col 54}{space 4}-.1878565{col 67}{space 3}  .038378
{txt}{space 9}11  {c |}{col 14}{res}{space 2}-.0211712{col 26}{space 2} .0592354{col 37}{space 1}   -0.36{col 46}{space 3}0.721{col 54}{space 4}-.1372734{col 67}{space 3} .0949311
{txt}{space 9}12  {c |}{col 14}{res}{space 2}-.0317183{col 26}{space 2}  .059791{col 37}{space 1}   -0.53{col 46}{space 3}0.596{col 54}{space 4}-.1489095{col 67}{space 3} .0854729
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.663898{col 26}{space 2} .0422519{col 37}{space 1}   39.38{col 46}{space 3}0.000{col 54}{space 4} 1.581084{col 67}{space 3} 1.746712
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est4{txt} stored)

Linear regression                                      Number of obs ={res}   46538
                                                       {txt}F( 11, 46526) ={res}    0.50
                                                       {txt}Prob > F      = {res} 0.9050
                                                       {txt}R-squared     = {res} 0.0001
                                                       {txt}Root MSE      = {res} .81375

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}      IncVar{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}month {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .0079095{col 26}{space 2} .0191188{col 37}{space 1}    0.41{col 46}{space 3}0.679{col 54}{space 4}-.0295635{col 67}{space 3} .0453826
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .0004169{col 26}{space 2} .0187879{col 37}{space 1}    0.02{col 46}{space 3}0.982{col 54}{space 4}-.0364076{col 67}{space 3} .0372414
{txt}{space 10}4  {c |}{col 14}{res}{space 2} .0039786{col 26}{space 2} .0188599{col 37}{space 1}    0.21{col 46}{space 3}0.833{col 54}{space 4} -.032987{col 67}{space 3} .0409442
{txt}{space 10}5  {c |}{col 14}{res}{space 2}-.0085621{col 26}{space 2} .0184235{col 37}{space 1}   -0.46{col 46}{space 3}0.642{col 54}{space 4}-.0446725{col 67}{space 3} .0275482
{txt}{space 10}6  {c |}{col 14}{res}{space 2}-.0119058{col 26}{space 2} .0184645{col 37}{space 1}   -0.64{col 46}{space 3}0.519{col 54}{space 4}-.0480965{col 67}{space 3} .0242849
{txt}{space 10}7  {c |}{col 14}{res}{space 2}-.0094779{col 26}{space 2} .0184952{col 37}{space 1}   -0.51{col 46}{space 3}0.608{col 54}{space 4}-.0457288{col 67}{space 3}  .026773
{txt}{space 10}8  {c |}{col 14}{res}{space 2}  .009227{col 26}{space 2} .0186302{col 37}{space 1}    0.50{col 46}{space 3}0.620{col 54}{space 4}-.0272884{col 67}{space 3} .0457425
{txt}{space 10}9  {c |}{col 14}{res}{space 2} .0011956{col 26}{space 2}  .018427{col 37}{space 1}    0.06{col 46}{space 3}0.948{col 54}{space 4}-.0349217{col 67}{space 3} .0373129
{txt}{space 9}10  {c |}{col 14}{res}{space 2}-.0219492{col 26}{space 2} .0178878{col 37}{space 1}   -1.23{col 46}{space 3}0.220{col 54}{space 4}-.0570096{col 67}{space 3} .0131113
{txt}{space 9}11  {c |}{col 14}{res}{space 2} .0012205{col 26}{space 2} .0185897{col 37}{space 1}    0.07{col 46}{space 3}0.948{col 54}{space 4}-.0352156{col 67}{space 3} .0376566
{txt}{space 9}12  {c |}{col 14}{res}{space 2}-.0050676{col 26}{space 2} .0186458{col 37}{space 1}   -0.27{col 46}{space 3}0.786{col 54}{space 4}-.0416137{col 67}{space 3} .0314785
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .4459873{col 26}{space 2}  .013212{col 37}{space 1}   33.76{col 46}{space 3}0.000{col 54}{space 4} .4200916{col 67}{space 3}  .471883
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est5{txt} stored)

Linear regression                                      Number of obs ={res}   46024
                                                       {txt}F( 11, 46012) ={res}    0.53
                                                       {txt}Prob > F      = {res} 0.8816
                                                       {txt}R-squared     = {res} 0.0001
                                                       {txt}Root MSE      = {res} .31295

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     IncSkew{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}month {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .0037286{col 26}{space 2} .0070983{col 37}{space 1}    0.53{col 46}{space 3}0.599{col 54}{space 4}-.0101842{col 67}{space 3} .0176414
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .0070666{col 26}{space 2} .0072673{col 37}{space 1}    0.97{col 46}{space 3}0.331{col 54}{space 4}-.0071773{col 67}{space 3} .0213106
{txt}{space 10}4  {c |}{col 14}{res}{space 2} .0083522{col 26}{space 2} .0072381{col 37}{space 1}    1.15{col 46}{space 3}0.249{col 54}{space 4}-.0058346{col 67}{space 3} .0225391
{txt}{space 10}5  {c |}{col 14}{res}{space 2} .0141913{col 26}{space 2} .0071614{col 37}{space 1}    1.98{col 46}{space 3}0.048{col 54}{space 4} .0001549{col 67}{space 3} .0282278
{txt}{space 10}6  {c |}{col 14}{res}{space 2} .0064853{col 26}{space 2} .0071093{col 37}{space 1}    0.91{col 46}{space 3}0.362{col 54}{space 4}-.0074491{col 67}{space 3} .0204197
{txt}{space 10}7  {c |}{col 14}{res}{space 2} .0088074{col 26}{space 2} .0072012{col 37}{space 1}    1.22{col 46}{space 3}0.221{col 54}{space 4}-.0053071{col 67}{space 3} .0229218
{txt}{space 10}8  {c |}{col 14}{res}{space 2} .0044659{col 26}{space 2} .0070928{col 37}{space 1}    0.63{col 46}{space 3}0.529{col 54}{space 4}-.0094361{col 67}{space 3} .0183679
{txt}{space 10}9  {c |}{col 14}{res}{space 2} .0064962{col 26}{space 2} .0070925{col 37}{space 1}    0.92{col 46}{space 3}0.360{col 54}{space 4}-.0074051{col 67}{space 3} .0203975
{txt}{space 9}10  {c |}{col 14}{res}{space 2} .0023387{col 26}{space 2} .0071409{col 37}{space 1}    0.33{col 46}{space 3}0.743{col 54}{space 4}-.0116576{col 67}{space 3}  .016335
{txt}{space 9}11  {c |}{col 14}{res}{space 2} .0057563{col 26}{space 2} .0071201{col 37}{space 1}    0.81{col 46}{space 3}0.419{col 54}{space 4}-.0081991{col 67}{space 3} .0197118
{txt}{space 9}12  {c |}{col 14}{res}{space 2} .0025432{col 26}{space 2} .0071683{col 37}{space 1}    0.35{col 46}{space 3}0.723{col 54}{space 4}-.0115068{col 67}{space 3} .0165932
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0425737{col 26}{space 2} .0050643{col 37}{space 1}    8.41{col 46}{space 3}0.000{col 54}{space 4} .0326477{col 67}{space 3} .0524998
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est6{txt} stored)

Linear regression                                      Number of obs ={res}   46156
                                                       {txt}F( 11, 46144) ={res}    0.57
                                                       {txt}Prob > F      = {res} 0.8537
                                                       {txt}R-squared     = {res} 0.0001
                                                       {txt}Root MSE      = {res} .42743

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     IncKurt{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}month {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .0111045{col 26}{space 2}  .009867{col 37}{space 1}    1.13{col 46}{space 3}0.260{col 54}{space 4} -.008235{col 67}{space 3}  .030444
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .0036461{col 26}{space 2} .0096797{col 37}{space 1}    0.38{col 46}{space 3}0.706{col 54}{space 4}-.0153264{col 67}{space 3} .0226185
{txt}{space 10}4  {c |}{col 14}{res}{space 2} .0116356{col 26}{space 2} .0099662{col 37}{space 1}    1.17{col 46}{space 3}0.243{col 54}{space 4}-.0078983{col 67}{space 3} .0311694
{txt}{space 10}5  {c |}{col 14}{res}{space 2} .0038004{col 26}{space 2} .0095214{col 37}{space 1}    0.40{col 46}{space 3}0.690{col 54}{space 4}-.0148618{col 67}{space 3} .0224625
{txt}{space 10}6  {c |}{col 14}{res}{space 2}-.0000716{col 26}{space 2} .0096657{col 37}{space 1}   -0.01{col 46}{space 3}0.994{col 54}{space 4}-.0190166{col 67}{space 3} .0188733
{txt}{space 10}7  {c |}{col 14}{res}{space 2} .0158854{col 26}{space 2} .0097531{col 37}{space 1}    1.63{col 46}{space 3}0.103{col 54}{space 4}-.0032307{col 67}{space 3} .0350016
{txt}{space 10}8  {c |}{col 14}{res}{space 2} .0031928{col 26}{space 2} .0094842{col 37}{space 1}    0.34{col 46}{space 3}0.736{col 54}{space 4}-.0153963{col 67}{space 3} .0217819
{txt}{space 10}9  {c |}{col 14}{res}{space 2} .0063116{col 26}{space 2} .0095239{col 37}{space 1}    0.66{col 46}{space 3}0.508{col 54}{space 4}-.0123554{col 67}{space 3} .0249786
{txt}{space 9}10  {c |}{col 14}{res}{space 2}  .009106{col 26}{space 2} .0096544{col 37}{space 1}    0.94{col 46}{space 3}0.346{col 54}{space 4}-.0098167{col 67}{space 3} .0280288
{txt}{space 9}11  {c |}{col 14}{res}{space 2} .0113857{col 26}{space 2} .0096852{col 37}{space 1}    1.18{col 46}{space 3}0.240{col 54}{space 4}-.0075975{col 67}{space 3} .0303689
{txt}{space 9}12  {c |}{col 14}{res}{space 2} .0014633{col 26}{space 2} .0095508{col 37}{space 1}    0.15{col 46}{space 3}0.878{col 54}{space 4}-.0172564{col 67}{space 3} .0201829
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.5523731{col 26}{space 2} .0067664{col 37}{space 1}  -81.63{col 46}{space 3}0.000{col 54}{space 4}-.5656353{col 67}{space 3}-.5391109
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est7{txt} stored)

{com}. 
. esttab using "${c -(}sum_table_folder{c )-}/month_fe.csv", ///
>              se r2 drop(_cons) ///
>                          label replace
{res}{txt}(note: file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/month_fe.csv not found)
(output written to {browse  `"/Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/month_fe.csv"'})

{com}. 
. ddd
{err}unrecognized command:  ddd
{txt}{search r(199):r(199);}

end of do-file

{search r(199):r(199);}

{com}. clear

. 