{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/Myworld/Dropbox/IncExpProject/WorkingFolder/indSCE_Est_log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 7 Nov 2019, 12:17:08
{txt}
{com}. 
. 
. ***************************
. **  Clean and Merge Data **
. ***************************
. 
. use "${c -(}folder{c )-}/SCE/IncExpSCEDstIndM",clear 
{txt}
{com}. 
. duplicates report year month userid

{p 0 4}{txt}Duplicates in terms of {res} year month userid{p_end}

{txt}{hline 10}{c TT}{hline 27}
   copies {c |} observations       surplus
{hline 10}{c +}{hline 27}
        1 {c |}        {res}79064             0
{txt}{hline 10}{c BT}{hline 27}

{com}. 
. ******************************
. *** Merge with demographics **
. *****************************
. 
. merge 1:1 year month userid using "${c -(}folder{c )-}/SCE/IncExpSCEProbIndM",keep(master match) 
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}          79,064{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge hh_info_merge
{res}{txt}
{com}. 
. *******************************
. **  Set Panel Data Structure **
. *******************************
. rename userid ID 
{res}{txt}
{com}. xtset ID date   /* this is not correct. ID is unique here.*/
{res}{txt}{col 8}panel variable:  {res}ID (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}date, 01jun2013 00:00:00 to 01may2018 00:00:00
{col 25}but with gaps
{txt}{col 17}delta:  {res}.001 seconds
{txt}
{com}. sort ID year month 
{txt}
{com}. 
. *******************************
. ** Exclude extreme outliers 
. ******************************
. 
. keep if Q32 < 100 & Q32 >= 10
{txt}(67437 observations deleted)

{com}. 
. drop if IncVar < 0
{txt}(0 observations deleted)

{com}. 
. *****************************
. *** generate other vars *****
. *****************************
. 
. gen age_sq = (Q32-30)^2
{txt}
{com}. label var age_sq "Age-squared"
{txt}
{com}. 
. encode _STATE, gen(state_id)
{txt}
{com}. label var state_id "state id"
{txt}
{com}. 
. *****************************
. *** generate group vars *****
. *****************************
. 
. gen cohort = year-Q32
{txt}
{com}. label var cohort "cohort by year of birth"
{txt}
{com}. egen cohort_g = cut(cohort), group(3)
{txt}
{com}. label define cohortlb 0 "1915-1956" 1 "1957-1972" 2 "1973-2000"
{txt}
{com}. label value cohort_g cohortlb
{txt}
{com}. 
. egen age_g = cut(Q32), group(3)  
{txt}
{com}. label var age_g "age group"
{txt}
{com}. label define agelb 0 "Young" 1 "Middle-age" 2 "Old"
{txt}
{com}. label value age_g agelb
{txt}
{com}. 
. egen edu_g = cut(Q36), group(3) 
{txt}(1 missing value generated)

{com}. label var edu_g "education group"
{txt}
{com}. label define edulb 0 "Low Education" 1 "Medium Education" 2 "High Education"
{txt}
{com}. label value edu_g edulb
{txt}
{com}. 
. gen gender_g = Q33 
{txt}(2 missing values generated)

{com}. label var gender_g "gender_grou"
{txt}
{com}. label define gdlb 0 "Male" 1 "Female" 
{txt}
{com}. label value gender_g gdlb
{txt}
{com}. 
. egen inc_g = cut(Q47), group(3)
{txt}(126 missing values generated)

{com}. label var inc_g "income_g"
{txt}
{com}. label define inclb 0 "Low income" 1 "Middle Income" 2 "High Income"
{txt}
{com}. label value inc_g inclb
{txt}
{com}. 
. local group_vars age_g edu_g inc_g cohort_g
{txt}
{com}. 
. 
. **********************************
. *** tables and hists of Vars *****
. **********************************
. 
. 
. foreach gp in `group_vars' {c -(}
{txt}  2{com}. tabstat Q24_mean Q24_var Q24_iqr IncMean IncVar, st(p10 p50 p90) by(`gp')
{txt}  3{com}. {c )-}

{txt}Summary statistics: p10, p50, p90
  by categories of: age_g (age group)

{ralign 10:age_g} {...}
{c |}{...}
  Q24_mean   Q24_var   Q24_iqr   IncMean    IncVar
{hline 11}{c +}{hline 50}
{ralign 10:Young} {...}
{c |}{...}
 {res} .7777428  .3333333  .9061641  .2324811  .0123229
{txt}{space 10} {...}
{c |}{...}
 {res}  2.96073  1.650073         2  .6666667  .0688264
{txt}{space 10} {...}
{c |}{...}
 {res} 6.809876  21.20652  10.22087         4  1.333333
{txt}{hline 11}{c +}{hline 50}
{ralign 10:Middle-age} {...}
{c |}{...}
 {res} .4221108  .3333333  .8810234  .2142335  .0150681
{txt}{space 10} {...}
{c |}{...}
 {res} 2.367884  1.056389  1.437962  .6848858  .3333333
{txt}{space 10} {...}
{c |}{...}
 {res} 6.025575  17.71149  8.342402         3  .8147773
{txt}{hline 11}{c +}{hline 50}
{ralign 10:Old} {...}
{c |}{...}
 {res} .7119929  .3333333  .9061639  .2062253  .0165931
{txt}{space 10} {...}
{c |}{...}
 {res}        2  1.044458  1.391605         1  .3333333
{txt}{space 10} {...}
{c |}{...}
 {res} 6.017493  22.44984  9.520319         4  1.333333
{txt}{hline 11}{c +}{hline 50}
{ralign 10:Total} {...}
{c |}{...}
 {res} .6104578  .3333333  .9061639  .2248443  .0144461
{txt}{space 10} {...}
{c |}{...}
 {res} 2.537525  1.333333  1.713396  .6666667  .2764937
{txt}{space 10} {...}
{c |}{...}
 {res}  6.47924  20.05368  9.314573  3.577936  1.233755
{txt}{hline 11}{c BT}{hline 50}

Summary statistics: p10, p50, p90
  by categories of: edu_g (education group)

{ralign 16:edu_g} {...}
{c |}{...}
  Q24_mean   Q24_var   Q24_iqr   IncMean    IncVar
{hline 17}{c +}{hline 50}
{ralign 16:Low Education} {...}
{c |}{...}
 {res} 2.08e-08  .3333333         1  .2396565  .0225437
{txt}{space 16} {...}
{c |}{...}
 {res}        2  1.333333         2  .6666667  .3333333
{txt}{space 16} {...}
{c |}{...}
 {res} 6.558024    30.028        13  4.381966  1.333333
{txt}{hline 17}{c +}{hline 50}
{ralign 16:Medium Education} {...}
{c |}{...}
 {res} .1782963  .3333333  .9061641  .2215784  .0161982
{txt}{space 16} {...}
{c |}{...}
 {res} 2.453082  1.105975  1.570626  .8289807  .3333333
{txt}{space 16} {...}
{c |}{...}
 {res} 6.318821  20.84629  12.18417  4.720759  1.333333
{txt}{hline 17}{c +}{hline 50}
{ralign 16:High Education} {...}
{c |}{...}
 {res} .8352844  .3333333  .8566982  .2238747  .0126881
{txt}{space 16} {...}
{c |}{...}
 {res} 2.708411   1.34117    1.7134  .6666667  .0864103
{txt}{space 16} {...}
{c |}{...}
 {res}  6.49011  18.49858  7.409681         3  .8147773
{txt}{hline 17}{c +}{hline 50}
{ralign 16:Total} {...}
{c |}{...}
 {res} .6104578  .3333333  .9061639  .2248443  .0144461
{txt}{space 16} {...}
{c |}{...}
 {res} 2.537525  1.333333  1.713396  .6666667  .2764937
{txt}{space 16} {...}
{c |}{...}
 {res}  6.47924  20.05368  9.314573  3.577936  1.233755
{txt}{hline 17}{c BT}{hline 50}

Summary statistics: p10, p50, p90
  by categories of: inc_g (income_g)

{ralign 13:inc_g} {...}
{c |}{...}
  Q24_mean   Q24_var   Q24_iqr   IncMean    IncVar
{hline 14}{c +}{hline 50}
{ralign 13:Low income} {...}
{c |}{...}
 {res} 2.08e-08  .3333333         1  .2205265   .020885
{txt}{space 13} {...}
{c |}{...}
 {res} 2.000654  1.333333         2  .6666667  .3333333
{txt}{space 13} {...}
{c |}{...}
 {res} 6.924951   31.6453        13         5  1.333333
{txt}{hline 14}{c +}{hline 50}
{ralign 13:Middle Income} {...}
{c |}{...}
 {res} .5375247  .3333333  .9061639  .2069548   .013815
{txt}{space 13} {...}
{c |}{...}
 {res} 2.192116  1.132435  1.514932  .6978815  .3333333
{txt}{space 13} {...}
{c |}{...}
 {res}        6  18.82199  8.680031         3  1.233755
{txt}{hline 14}{c +}{hline 50}
{ralign 13:High Income} {...}
{c |}{...}
 {res}        1  .3333333   .856698  .2329144  .0132882
{txt}{space 13} {...}
{c |}{...}
 {res} 2.793575  1.333333   1.64027  .6666667  .0947234
{txt}{space 13} {...}
{c |}{...}
 {res} 6.599971  17.20418  7.156532  3.288007  .8147773
{txt}{hline 14}{c +}{hline 50}
{ralign 13:Total} {...}
{c |}{...}
 {res} .6104578  .3333333  .9061639  .2248443  .0144461
{txt}{space 13} {...}
{c |}{...}
 {res} 2.537525  1.333333  1.713396  .6666667  .2764937
{txt}{space 13} {...}
{c |}{...}
 {res} 6.486081  20.26763  9.346632  3.462475  1.233755
{txt}{hline 14}{c BT}{hline 50}

Summary statistics: p10, p50, p90
  by categories of: cohort_g 

{ralign 9:cohort_g} {...}
{c |}{...}
  Q24_mean   Q24_var   Q24_iqr   IncMean    IncVar
{hline 10}{c +}{hline 50}
{ralign 9:1915-1956} {...}
{c |}{...}
 {res} .6228527  .3333333  .9061639   .190983  .0167938
{txt}{space 9} {...}
{c |}{...}
 {res}        2  .9760123  1.324268         1  .3333333
{txt}{space 9} {...}
{c |}{...}
 {res}        6  21.60151  8.832264         4  1.333333
{txt}{hline 10}{c +}{hline 50}
{ralign 9:1957-1972} {...}
{c |}{...}
 {res} .4477587  .3333333  .8566982  .2231962  .0151018
{txt}{space 9} {...}
{c |}{...}
 {res} 2.280812  1.044458  1.435542  .7039238  .3333333
{txt}{space 9} {...}
{c |}{...}
 {res}        6  16.78715  8.509292         3  .8147773
{txt}{hline 10}{c +}{hline 50}
{ralign 9:1973-2000} {...}
{c |}{...}
 {res} .7586042  .3333333  .9061641  .2329144  .0123964
{txt}{space 9} {...}
{c |}{...}
 {res} 2.955731  1.632472         2  .6666667  .0689623
{txt}{space 9} {...}
{c |}{...}
 {res} 6.868142  21.45051   10.2934  4.211032  1.333333
{txt}{hline 10}{c +}{hline 50}
{ralign 9:Total} {...}
{c |}{...}
 {res} .6104578  .3333333  .9061639  .2248443  .0144461
{txt}{space 9} {...}
{c |}{...}
 {res} 2.537525  1.333333  1.713396  .6666667  .2764937
{txt}{space 9} {...}
{c |}{...}
 {res}  6.47924  20.05368  9.314573  3.577936  1.233755
{txt}{hline 10}{c BT}{hline 50}

{com}. 
. 
. foreach gp in `group_vars' {c -(}
{txt}  2{com}. table `gp', c(median Q24_var) by(year)
{txt}  3{com}. {c )-}

{txt}{hline 11}{c TT}{hline 13}
year and   {c |}
age group  {c |} med(Q24_var)
{hline 11}{c +}{hline 13}
2013       {c |}
     Young {c |}    {res}1.4706578
{txt}Middle-age {c |}    {res}1.0504482
       {txt}Old {c |}    {res}.87410492
{txt}{hline 11}{c +}{hline 13}
2014       {c |}
     Young {c |}     {res}1.642285
{txt}Middle-age {c |}     {res}1.333333
       {txt}Old {c |}    {res}.87410492
{txt}{hline 11}{c +}{hline 13}
2015       {c |}
     Young {c |}    {res}1.7716688
{txt}Middle-age {c |}    {res}.87410492
       {txt}Old {c |}     {res}1.333333
{txt}{hline 11}{c +}{hline 13}
2016       {c |}
     Young {c |}    {res}1.6922234
{txt}Middle-age {c |}    {res}.86692697
       {txt}Old {c |}    {res}1.1862721
{txt}{hline 11}{c +}{hline 13}
2017       {c |}
     Young {c |}    {res}1.7856894
{txt}Middle-age {c |}    {res}.93161613
       {txt}Old {c |}    {res}.66666669
{txt}{hline 11}{c +}{hline 13}
2018       {c |}
     Young {c |}    {res}1.5146742
{txt}Middle-age {c |}    {res}.94059372
       {txt}Old {c |}    {res}1.0095498
{txt}{hline 11}{c BT}{hline 13}

{hline 17}{c TT}{hline 13}
year and         {c |}
education group  {c |} med(Q24_var)
{hline 17}{c +}{hline 13}
2013             {c |}
   Low Education {c |}     {res}1.105975
{txt}Medium Education {c |}    {res}.89902848
  {txt}High Education {c |}     {res}1.333333
{txt}{hline 17}{c +}{hline 13}
2014             {c |}
   Low Education {c |}     {res}1.425889
{txt}Medium Education {c |}     {res}1.333333
  {txt}High Education {c |}    {res}1.4992648
{txt}{hline 17}{c +}{hline 13}
2015             {c |}
   Low Education {c |}    {res}1.8824012
{txt}Medium Education {c |}    {res}.66863903
  {txt}High Education {c |}    {res}1.5399913
{txt}{hline 17}{c +}{hline 13}
2016             {c |}
   Low Education {c |}     {res}1.333333
{txt}Medium Education {c |}     {res}1.105975
  {txt}High Education {c |}     {res}1.333333
{txt}{hline 17}{c +}{hline 13}
2017             {c |}
   Low Education {c |}     {res}1.105975
{txt}Medium Education {c |}    {res}1.1379284
  {txt}High Education {c |}    {res}1.3586999
{txt}{hline 17}{c +}{hline 13}
2018             {c |}
   Low Education {c |}     {res}1.536028
{txt}Medium Education {c |}    {res}1.0006096
  {txt}High Education {c |}     {res}1.333333
{txt}{hline 17}{c BT}{hline 13}

{hline 14}{c TT}{hline 13}
year and      {c |}
income_g      {c |} med(Q24_var)
{hline 14}{c +}{hline 13}
2013          {c |}
   Low income {c |}    {res}1.9040942
{txt}Middle Income {c |}    {res}.66666669
  {txt}High Income {c |}     {res}1.333333
{txt}{hline 14}{c +}{hline 13}
2014          {c |}
   Low income {c |}    {res}1.6520977
{txt}Middle Income {c |}     {res}1.333333
  {txt}High Income {c |}    {res}1.3432762
{txt}{hline 14}{c +}{hline 13}
2015          {c |}
   Low income {c |}     {res}1.333333
{txt}Middle Income {c |}    {res}.99126315
  {txt}High Income {c |}    {res}1.4270498
{txt}{hline 14}{c +}{hline 13}
2016          {c |}
   Low income {c |}     {res}1.333333
{txt}Middle Income {c |}    {res}1.3262935
  {txt}High Income {c |}    {res}1.2031537
{txt}{hline 14}{c +}{hline 13}
2017          {c |}
   Low income {c |}     {res}1.333333
{txt}Middle Income {c |}     {res}1.333333
  {txt}High Income {c |}     {res}1.333333
{txt}{hline 14}{c +}{hline 13}
2018          {c |}
   Low income {c |}     {res}1.333333
{txt}Middle Income {c |}     {res}1.333333
  {txt}High Income {c |}    {res}1.3093832
{txt}{hline 14}{c BT}{hline 13}

{hline 10}{c TT}{hline 13}
year and  {c |}
cohort_g  {c |} med(Q24_var)
{hline 10}{c +}{hline 13}
2013      {c |}
1915-1956 {c |}    {res}.72505316
{txt}1957-1972 {c |}     {res}1.166442
{txt}1973-2000 {c |}     {res}1.646167
{txt}{hline 10}{c +}{hline 13}
2014      {c |}
1915-1956 {c |}    {res}.87410492
{txt}1957-1972 {c |}     {res}1.333333
{txt}1973-2000 {c |}     {res}1.642285
{txt}{hline 10}{c +}{hline 13}
2015      {c |}
1915-1956 {c |}     {res}1.333333
{txt}1957-1972 {c |}    {res}.84719852
{txt}1973-2000 {c |}    {res}1.7716688
{txt}{hline 10}{c +}{hline 13}
2016      {c |}
1915-1956 {c |}    {res}1.1651365
{txt}1957-1972 {c |}    {res}.93051246
{txt}1973-2000 {c |}    {res}1.5051229
{txt}{hline 10}{c +}{hline 13}
2017      {c |}
1915-1956 {c |}    {res}1.0897299
{txt}1957-1972 {c |}    {res}.81034333
{txt}1973-2000 {c |}    {res}1.7099483
{txt}{hline 10}{c +}{hline 13}
2018      {c |}
1915-1956 {c |}    {res}1.1888956
{txt}1957-1972 {c |}    {res}.66666669
{txt}1973-2000 {c |}    {res}1.4926659
{txt}{hline 10}{c BT}{hline 13}

{com}. 
. 
. /*
> 
> foreach mom in iqr var mean {c -(}
> 
> twoway (hist Q24_`mom',fcolor(ltblue) lcolor(none)), ///
>            ytitle("") ///
>            title("`mom'")
> graph export "${c -(}sum_graph_folder{c )-}/hist/hist_`mom'.png",as(png) replace  
> 
> {c )-}
> 
> foreach gp in `group_vars' {c -(}
> foreach mom in iqr var mean {c -(}
> 
> twoway (hist Q24_`mom' if `gp'==0,fcolor(gs15) lcolor("")) /// 
>        (hist Q24_`mom' if `gp'==1,fcolor(ltblue) lcolor("")) ///
>            (hist Q24_`mom' if `gp'==2,fcolor(red) lcolor("")), ///
>            xtitle("") ///
>            ytitle("") ///
>            title("`mom'") ///
>            legend(label(1 `gp'=0) label(2 `gp'=1) label(3 `gp'=2) col(1))
> 
> graph export "${c -(}sum_graph_folder{c )-}/hist/hist_`mom'_`gp'.png",as(png) replace  
> 
> {c )-}
> {c )-}
> 
> 
> */
. 
. foreach mom in Mean Var Skew Kurt{c -(}
{txt}  2{com}. 
. twoway (hist Inc`mom',fcolor(ltblue) lcolor(none)), ///
>            ytitle("") ///
>            title("`mom'")
{txt}  3{com}. graph export "${c -(}sum_graph_folder{c )-}/hist/hist_Inc`mom'.png",as(png) replace  
{txt}  4{com}. 
. {c )-}
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_IncMean.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_IncVar.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_IncSkew.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_IncKurt.png written in PNG format)

{com}. 
. foreach gp in `group_vars' {c -(}
{txt}  2{com}. foreach mom in Mean Var Skew Kurt{c -(}
{txt}  3{com}. 
. twoway (hist Inc`mom' if `gp'==0,fcolor(gs15) lcolor("")) /// 
>        (hist Inc`mom' if `gp'==1,fcolor(ltblue) lcolor("")) ///
>            (hist Inc`mom' if `gp'==2,fcolor(red) lcolor("")), ///
>            xtitle("") ///
>            ytitle("") ///
>            title("`mom'") ///
>            legend(label(1 `gp'=0) label(2 `gp'=1) label(3 `gp'=2) col(1))
{txt}  4{com}. 
. graph export "${c -(}sum_graph_folder{c )-}/hist/hist_Inc_`mom'_`gp'.png",as(png) replace  
{txt}  5{com}. 
. {c )-}
{txt}  6{com}. {c )-}
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_Inc_Mean_age_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_Inc_Var_age_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_Inc_Skew_age_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_Inc_Kurt_age_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_Inc_Mean_edu_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_Inc_Var_edu_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_Inc_Skew_edu_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_Inc_Kurt_edu_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_Inc_Mean_inc_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_Inc_Var_inc_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_Inc_Skew_inc_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_Inc_Kurt_inc_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_Inc_Mean_cohort_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_Inc_Var_cohort_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_Inc_Skew_cohort_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_Inc_Kurt_cohort_g.png written in PNG format)

{com}. 
. ********************
. ** Regression ******
. ********************
. 
. global other_control i.Q33 i.Q34 Q35_1 Q35_2 Q35_3 Q35_4 Q35_5 Q35_6 
{txt}
{com}. global macro_ex_var Q4new Q6new Q9_mean Q13new
{txt}
{com}. 
. eststo clear
{txt}
{com}. 
. foreach mom in var iqr mean{c -(}
{txt}  2{com}. eststo: reg Q24_`mom' i.age_g i.edu_g i.inc_g i.cohort_g i.year i.state_id, robust 
{txt}  3{com}. eststo: reg Q24_`mom' i.age_g i.edu_g i.inc_g i.cohort_g i.year i.state_id ${c -(}other_control{c )-}, robust 
{txt}  4{com}. eststo: reg Q24_`mom' i.age_g i.edu_g i.inc_g i.cohort_g i.year i.state_id ${c -(}other_control{c )-} ${c -(}macro_ex_var{c )-}, robust 
{txt}  5{com}. {c )-}

{txt}Linear regression                                      Number of obs ={res}    6800
                                                       {txt}F( 63,  6736) ={res}    3.14
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0234
                                                       {txt}Root MSE      = {res} 12.079

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     Q24_var{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2} .4952253{col 26}{space 2} .8934697{col 37}{space 1}    0.55{col 46}{space 3}0.579{col 54}{space 4}-1.256258{col 67}{space 3} 2.246709
{txt}{space 8}Old  {c |}{col 14}{res}{space 2} 1.059205{col 26}{space 2} 1.252666{col 37}{space 1}    0.85{col 46}{space 3}0.398{col 54}{space 4}-1.396417{col 67}{space 3} 3.514827
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2}-1.335359{col 26}{space 2} .6262923{col 37}{space 1}   -2.13{col 46}{space 3}0.033{col 54}{space 4} -2.56309{col 67}{space 3}-.1076283
{txt}High Educ..  {c |}{col 14}{res}{space 2}-1.405861{col 26}{space 2} .6071683{col 37}{space 1}   -2.32{col 46}{space 3}0.021{col 54}{space 4}-2.596103{col 67}{space 3}-.2156195
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2}-2.611224{col 26}{space 2} .4902867{col 37}{space 1}   -5.33{col 46}{space 3}0.000{col 54}{space 4}-3.572341{col 67}{space 3}-1.650107
{txt}High Income  {c |}{col 14}{res}{space 2}-2.478488{col 26}{space 2} .4825041{col 37}{space 1}   -5.14{col 46}{space 3}0.000{col 54}{space 4}-3.424349{col 67}{space 3}-1.532628
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2}-.2523947{col 26}{space 2} .8958756{col 37}{space 1}   -0.28{col 46}{space 3}0.778{col 54}{space 4}-2.008594{col 67}{space 3} 1.503805
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} 1.634512{col 26}{space 2} 1.286322{col 37}{space 1}    1.27{col 46}{space 3}0.204{col 54}{space 4}-.8870867{col 67}{space 3} 4.156111
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2}-.1616278{col 26}{space 2} .4586555{col 37}{space 1}   -0.35{col 46}{space 3}0.725{col 54}{space 4}-1.060738{col 67}{space 3}  .737482
{txt}{space 7}2015  {c |}{col 14}{res}{space 2}-.0639467{col 26}{space 2} .4636915{col 37}{space 1}   -0.14{col 46}{space 3}0.890{col 54}{space 4}-.9729286{col 67}{space 3} .8450352
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0575611{col 26}{space 2} .4714433{col 37}{space 1}   -0.12{col 46}{space 3}0.903{col 54}{space 4}-.9817389{col 67}{space 3} .8666168
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .6391514{col 26}{space 2} .4989287{col 37}{space 1}    1.28{col 46}{space 3}0.200{col 54}{space 4}-.3389067{col 67}{space 3}  1.61721
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0008389{col 26}{space 2} .6312083{col 37}{space 1}   -0.00{col 46}{space 3}0.999{col 54}{space 4}-1.238207{col 67}{space 3} 1.236529
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2}-7.737582{col 26}{space 2} 9.903951{col 37}{space 1}   -0.78{col 46}{space 3}0.435{col 54}{space 4}-27.15246{col 67}{space 3} 11.67729
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-8.732422{col 26}{space 2} 9.971084{col 37}{space 1}   -0.88{col 46}{space 3}0.381{col 54}{space 4} -28.2789{col 67}{space 3} 10.81405
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-8.378287{col 26}{space 2} 9.849352{col 37}{space 1}   -0.85{col 46}{space 3}0.395{col 54}{space 4}-27.68613{col 67}{space 3} 10.92956
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-6.703303{col 26}{space 2} 9.815345{col 37}{space 1}   -0.68{col 46}{space 3}0.495{col 54}{space 4}-25.94448{col 67}{space 3} 12.53788
{txt}{space 9}CO  {c |}{col 14}{res}{space 2}-8.170134{col 26}{space 2} 9.851791{col 37}{space 1}   -0.83{col 46}{space 3}0.407{col 54}{space 4}-27.48276{col 67}{space 3} 11.14249
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-9.803401{col 26}{space 2} 9.845029{col 37}{space 1}   -1.00{col 46}{space 3}0.319{col 54}{space 4}-29.10277{col 67}{space 3} 9.495969
{txt}{space 9}DC  {c |}{col 14}{res}{space 2} -8.54098{col 26}{space 2} 9.901575{col 37}{space 1}   -0.86{col 46}{space 3}0.388{col 54}{space 4} -27.9512{col 67}{space 3} 10.86924
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-9.232345{col 26}{space 2} 10.20352{col 37}{space 1}   -0.90{col 46}{space 3}0.366{col 54}{space 4}-29.23448{col 67}{space 3} 10.76979
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-7.628211{col 26}{space 2} 9.824893{col 37}{space 1}   -0.78{col 46}{space 3}0.438{col 54}{space 4}-26.88811{col 67}{space 3} 11.63169
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-8.373963{col 26}{space 2} 9.834718{col 37}{space 1}   -0.85{col 46}{space 3}0.395{col 54}{space 4}-27.65312{col 67}{space 3} 10.90519
{txt}{space 9}HI  {c |}{col 14}{res}{space 2}-6.840401{col 26}{space 2} 10.15523{col 37}{space 1}   -0.67{col 46}{space 3}0.501{col 54}{space 4}-26.74786{col 67}{space 3} 13.06706
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-12.50229{col 26}{space 2} 9.820412{col 37}{space 1}   -1.27{col 46}{space 3}0.203{col 54}{space 4} -31.7534{col 67}{space 3} 6.748824
{txt}{space 9}ID  {c |}{col 14}{res}{space 2}-9.806564{col 26}{space 2} 9.923616{col 37}{space 1}   -0.99{col 46}{space 3}0.323{col 54}{space 4}-29.25999{col 67}{space 3} 9.646862
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-9.626046{col 26}{space 2} 9.817733{col 37}{space 1}   -0.98{col 46}{space 3}0.327{col 54}{space 4}-28.87191{col 67}{space 3} 9.619814
{txt}{space 9}IN  {c |}{col 14}{res}{space 2} -8.01171{col 26}{space 2} 9.860205{col 37}{space 1}   -0.81{col 46}{space 3}0.417{col 54}{space 4}-27.34083{col 67}{space 3} 11.31741
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-9.257441{col 26}{space 2}  9.91548{col 37}{space 1}   -0.93{col 46}{space 3}0.351{col 54}{space 4}-28.69492{col 67}{space 3} 10.18003
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-9.452172{col 26}{space 2} 9.897714{col 37}{space 1}   -0.95{col 46}{space 3}0.340{col 54}{space 4}-28.85482{col 67}{space 3} 9.950478
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-7.740776{col 26}{space 2} 9.920677{col 37}{space 1}   -0.78{col 46}{space 3}0.435{col 54}{space 4}-27.18844{col 67}{space 3} 11.70689
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-7.700153{col 26}{space 2} 9.852873{col 37}{space 1}   -0.78{col 46}{space 3}0.435{col 54}{space 4} -27.0149{col 67}{space 3} 11.61459
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-7.503972{col 26}{space 2} 9.859962{col 37}{space 1}   -0.76{col 46}{space 3}0.447{col 54}{space 4}-26.83262{col 67}{space 3} 11.82467
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-10.83478{col 26}{space 2} 9.865638{col 37}{space 1}   -1.10{col 46}{space 3}0.272{col 54}{space 4}-30.17455{col 67}{space 3} 8.504994
{txt}{space 9}MI  {c |}{col 14}{res}{space 2}-8.945916{col 26}{space 2} 9.820563{col 37}{space 1}   -0.91{col 46}{space 3}0.362{col 54}{space 4}-28.19733{col 67}{space 3} 10.30549
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-9.662644{col 26}{space 2} 9.828366{col 37}{space 1}   -0.98{col 46}{space 3}0.326{col 54}{space 4}-28.92935{col 67}{space 3} 9.604061
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-8.762597{col 26}{space 2} 9.842609{col 37}{space 1}   -0.89{col 46}{space 3}0.373{col 54}{space 4}-28.05722{col 67}{space 3} 10.53203
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-6.339086{col 26}{space 2} 10.01869{col 37}{space 1}   -0.63{col 46}{space 3}0.527{col 54}{space 4}-25.97888{col 67}{space 3} 13.30071
{txt}{space 9}MT  {c |}{col 14}{res}{space 2}-11.12067{col 26}{space 2} 9.893866{col 37}{space 1}   -1.12{col 46}{space 3}0.261{col 54}{space 4}-30.51577{col 67}{space 3} 8.274439
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-8.102817{col 26}{space 2}  9.83303{col 37}{space 1}   -0.82{col 46}{space 3}0.410{col 54}{space 4}-27.37867{col 67}{space 3} 11.17303
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-8.538537{col 26}{space 2} 10.04036{col 37}{space 1}   -0.85{col 46}{space 3}0.395{col 54}{space 4}-28.22081{col 67}{space 3} 11.14374
{txt}{space 9}NE  {c |}{col 14}{res}{space 2}-11.03412{col 26}{space 2} 9.841873{col 37}{space 1}   -1.12{col 46}{space 3}0.262{col 54}{space 4}-30.32731{col 67}{space 3} 8.259061
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-11.34931{col 26}{space 2} 9.882219{col 37}{space 1}   -1.15{col 46}{space 3}0.251{col 54}{space 4}-30.72158{col 67}{space 3} 8.022964
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-7.891234{col 26}{space 2} 9.829045{col 37}{space 1}   -0.80{col 46}{space 3}0.422{col 54}{space 4}-27.15927{col 67}{space 3}  11.3768
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-9.642005{col 26}{space 2} 9.970404{col 37}{space 1}   -0.97{col 46}{space 3}0.334{col 54}{space 4}-29.18715{col 67}{space 3} 9.903139
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}-6.720784{col 26}{space 2} 9.963809{col 37}{space 1}   -0.67{col 46}{space 3}0.500{col 54}{space 4}  -26.253{col 67}{space 3} 12.81143
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-8.521212{col 26}{space 2} 9.814041{col 37}{space 1}   -0.87{col 46}{space 3}0.385{col 54}{space 4}-27.75984{col 67}{space 3} 10.71741
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-9.311328{col 26}{space 2} 9.822619{col 37}{space 1}   -0.95{col 46}{space 3}0.343{col 54}{space 4}-28.56677{col 67}{space 3} 9.944112
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-5.170427{col 26}{space 2} 10.01645{col 37}{space 1}   -0.52{col 46}{space 3}0.606{col 54}{space 4}-24.80583{col 67}{space 3} 14.46498
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-10.70051{col 26}{space 2} 9.834161{col 37}{space 1}   -1.09{col 46}{space 3}0.277{col 54}{space 4}-29.97857{col 67}{space 3} 8.577559
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-9.499212{col 26}{space 2} 9.814116{col 37}{space 1}   -0.97{col 46}{space 3}0.333{col 54}{space 4}-28.73798{col 67}{space 3} 9.739559
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-5.925778{col 26}{space 2} 10.46951{col 37}{space 1}   -0.57{col 46}{space 3}0.571{col 54}{space 4}-26.44932{col 67}{space 3} 14.59777
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-6.621785{col 26}{space 2} 9.908899{col 37}{space 1}   -0.67{col 46}{space 3}0.504{col 54}{space 4}-26.04636{col 67}{space 3} 12.80279
{txt}{space 9}SD  {c |}{col 14}{res}{space 2}-9.744625{col 26}{space 2} 9.922096{col 37}{space 1}   -0.98{col 46}{space 3}0.326{col 54}{space 4}-29.19507{col 67}{space 3} 9.705821
{txt}{space 9}TN  {c |}{col 14}{res}{space 2} -6.85767{col 26}{space 2}  9.86566{col 37}{space 1}   -0.70{col 46}{space 3}0.487{col 54}{space 4}-26.19748{col 67}{space 3} 12.48214
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-6.543691{col 26}{space 2} 9.823192{col 37}{space 1}   -0.67{col 46}{space 3}0.505{col 54}{space 4}-25.80025{col 67}{space 3} 12.71287
{txt}{space 9}UT  {c |}{col 14}{res}{space 2} -9.77409{col 26}{space 2} 9.854717{col 37}{space 1}   -0.99{col 46}{space 3}0.321{col 54}{space 4}-29.09245{col 67}{space 3} 9.544272
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}-8.496405{col 26}{space 2} 9.838186{col 37}{space 1}   -0.86{col 46}{space 3}0.388{col 54}{space 4}-27.78236{col 67}{space 3} 10.78955
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}-12.89732{col 26}{space 2} 9.829277{col 37}{space 1}   -1.31{col 46}{space 3}0.190{col 54}{space 4}-32.16581{col 67}{space 3} 6.371174
{txt}{space 9}WA  {c |}{col 14}{res}{space 2}-9.119802{col 26}{space 2} 9.838495{col 37}{space 1}   -0.93{col 46}{space 3}0.354{col 54}{space 4}-28.40636{col 67}{space 3} 10.16676
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-8.859677{col 26}{space 2} 9.839373{col 37}{space 1}   -0.90{col 46}{space 3}0.368{col 54}{space 4}-28.14796{col 67}{space 3}  10.4286
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-10.01521{col 26}{space 2} 9.941099{col 37}{space 1}   -1.01{col 46}{space 3}0.314{col 54}{space 4}-29.50291{col 67}{space 3} 9.472489
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-10.24189{col 26}{space 2} 10.06249{col 37}{space 1}   -1.02{col 46}{space 3}0.309{col 54}{space 4}-29.96755{col 67}{space 3} 9.483779
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}  17.0843{col 26}{space 2} 9.880633{col 37}{space 1}    1.73{col 46}{space 3}0.084{col 54}{space 4}-2.284862{col 67}{space 3} 36.45347
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est1{txt} stored)

Linear regression                                      Number of obs ={res}    6798
                                                       {txt}F( 71,  6726) ={res}    3.27
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0299
                                                       {txt}Root MSE      = {res} 12.047

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     Q24_var{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2} .3592309{col 26}{space 2}  .892704{col 37}{space 1}    0.40{col 46}{space 3}0.687{col 54}{space 4}-1.390752{col 67}{space 3} 2.109214
{txt}{space 8}Old  {c |}{col 14}{res}{space 2} .7270772{col 26}{space 2} 1.256826{col 37}{space 1}    0.58{col 46}{space 3}0.563{col 54}{space 4}  -1.7367{col 67}{space 3} 3.190855
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2}-1.223393{col 26}{space 2} .6248622{col 37}{space 1}   -1.96{col 46}{space 3}0.050{col 54}{space 4}-2.448321{col 67}{space 3} .0015345
{txt}High Educ..  {c |}{col 14}{res}{space 2}-1.288137{col 26}{space 2}  .606666{col 37}{space 1}   -2.12{col 46}{space 3}0.034{col 54}{space 4}-2.477394{col 67}{space 3}-.0988792
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2} -2.64698{col 26}{space 2} .4891713{col 37}{space 1}   -5.41{col 46}{space 3}0.000{col 54}{space 4}-3.605911{col 67}{space 3} -1.68805
{txt}High Income  {c |}{col 14}{res}{space 2}-2.601688{col 26}{space 2} .4891428{col 37}{space 1}   -5.32{col 46}{space 3}0.000{col 54}{space 4}-3.560563{col 67}{space 3}-1.642813
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2}-.4639449{col 26}{space 2} .8990045{col 37}{space 1}   -0.52{col 46}{space 3}0.606{col 54}{space 4}-2.226279{col 67}{space 3} 1.298389
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} 1.290158{col 26}{space 2} 1.289169{col 37}{space 1}    1.00{col 46}{space 3}0.317{col 54}{space 4}-1.237022{col 67}{space 3} 3.817338
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2}-.2121842{col 26}{space 2} .4568393{col 37}{space 1}   -0.46{col 46}{space 3}0.642{col 54}{space 4}-1.107734{col 67}{space 3} .6833655
{txt}{space 7}2015  {c |}{col 14}{res}{space 2}-.1012201{col 26}{space 2} .4621714{col 37}{space 1}   -0.22{col 46}{space 3}0.827{col 54}{space 4}-1.007222{col 67}{space 3} .8047823
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}  -.04862{col 26}{space 2} .4708703{col 37}{space 1}   -0.10{col 46}{space 3}0.918{col 54}{space 4} -.971675{col 67}{space 3}  .874435
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}   .64652{col 26}{space 2} .4974012{col 37}{space 1}    1.30{col 46}{space 3}0.194{col 54}{space 4}-.3285439{col 67}{space 3} 1.621584
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0324454{col 26}{space 2} .6304819{col 37}{space 1}    0.05{col 46}{space 3}0.959{col 54}{space 4}-1.203499{col 67}{space 3}  1.26839
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2}-7.852946{col 26}{space 2} 10.09467{col 37}{space 1}   -0.78{col 46}{space 3}0.437{col 54}{space 4} -27.6417{col 67}{space 3} 11.93581
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-8.695222{col 26}{space 2} 10.15671{col 37}{space 1}   -0.86{col 46}{space 3}0.392{col 54}{space 4} -28.6056{col 67}{space 3} 11.21516
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-8.362068{col 26}{space 2} 10.04099{col 37}{space 1}   -0.83{col 46}{space 3}0.405{col 54}{space 4}-28.04559{col 67}{space 3} 11.32145
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-6.796236{col 26}{space 2} 10.01966{col 37}{space 1}   -0.68{col 46}{space 3}0.498{col 54}{space 4}-26.43795{col 67}{space 3} 12.84548
{txt}{space 9}CO  {c |}{col 14}{res}{space 2}-8.031783{col 26}{space 2} 10.04564{col 37}{space 1}   -0.80{col 46}{space 3}0.424{col 54}{space 4}-27.72443{col 67}{space 3} 11.66086
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-9.664956{col 26}{space 2} 10.03984{col 37}{space 1}   -0.96{col 46}{space 3}0.336{col 54}{space 4}-29.34621{col 67}{space 3}  10.0163
{txt}{space 9}DC  {c |}{col 14}{res}{space 2} -8.57148{col 26}{space 2}  10.0979{col 37}{space 1}   -0.85{col 46}{space 3}0.396{col 54}{space 4}-28.36657{col 67}{space 3} 11.22361
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-9.395929{col 26}{space 2} 10.39357{col 37}{space 1}   -0.90{col 46}{space 3}0.366{col 54}{space 4}-29.77062{col 67}{space 3} 10.97877
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-7.614598{col 26}{space 2} 10.02031{col 37}{space 1}   -0.76{col 46}{space 3}0.447{col 54}{space 4}-27.25758{col 67}{space 3} 12.02838
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-8.771736{col 26}{space 2} 10.03237{col 37}{space 1}   -0.87{col 46}{space 3}0.382{col 54}{space 4}-28.43835{col 67}{space 3} 10.89488
{txt}{space 9}HI  {c |}{col 14}{res}{space 2}-7.904582{col 26}{space 2}  10.3825{col 37}{space 1}   -0.76{col 46}{space 3}0.446{col 54}{space 4}-28.25756{col 67}{space 3}  12.4484
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-12.21135{col 26}{space 2} 10.01283{col 37}{space 1}   -1.22{col 46}{space 3}0.223{col 54}{space 4}-31.83967{col 67}{space 3} 7.416965
{txt}{space 9}ID  {c |}{col 14}{res}{space 2}-9.604543{col 26}{space 2} 10.11505{col 37}{space 1}   -0.95{col 46}{space 3}0.342{col 54}{space 4}-29.43325{col 67}{space 3} 10.22416
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-9.450607{col 26}{space 2} 10.01681{col 37}{space 1}   -0.94{col 46}{space 3}0.345{col 54}{space 4}-29.08672{col 67}{space 3} 10.18551
{txt}{space 9}IN  {c |}{col 14}{res}{space 2}-7.906304{col 26}{space 2} 10.05074{col 37}{space 1}   -0.79{col 46}{space 3}0.432{col 54}{space 4}-27.60895{col 67}{space 3} 11.79634
{txt}{space 9}KS  {c |}{col 14}{res}{space 2} -8.85611{col 26}{space 2} 10.10954{col 37}{space 1}   -0.88{col 46}{space 3}0.381{col 54}{space 4}-28.67402{col 67}{space 3}  10.9618
{txt}{space 9}KY  {c |}{col 14}{res}{space 2} -9.23388{col 26}{space 2} 10.08897{col 37}{space 1}   -0.92{col 46}{space 3}0.360{col 54}{space 4}-29.01146{col 67}{space 3}  10.5437
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-7.781039{col 26}{space 2} 10.11346{col 37}{space 1}   -0.77{col 46}{space 3}0.442{col 54}{space 4}-27.60662{col 67}{space 3} 12.04454
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-7.413947{col 26}{space 2} 10.04813{col 37}{space 1}   -0.74{col 46}{space 3}0.461{col 54}{space 4}-27.11146{col 67}{space 3} 12.28356
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-7.608758{col 26}{space 2} 10.05588{col 37}{space 1}   -0.76{col 46}{space 3}0.449{col 54}{space 4}-27.32148{col 67}{space 3} 12.10396
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-10.27634{col 26}{space 2} 10.06231{col 37}{space 1}   -1.02{col 46}{space 3}0.307{col 54}{space 4}-30.00166{col 67}{space 3} 9.448985
{txt}{space 9}MI  {c |}{col 14}{res}{space 2} -8.82681{col 26}{space 2} 10.01224{col 37}{space 1}   -0.88{col 46}{space 3}0.378{col 54}{space 4}-28.45398{col 67}{space 3} 10.80036
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-9.347333{col 26}{space 2} 10.02334{col 37}{space 1}   -0.93{col 46}{space 3}0.351{col 54}{space 4}-28.99625{col 67}{space 3} 10.30159
{txt}{space 9}MO  {c |}{col 14}{res}{space 2} -8.38479{col 26}{space 2} 10.03681{col 37}{space 1}   -0.84{col 46}{space 3}0.404{col 54}{space 4}-28.06011{col 67}{space 3} 11.29053
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-6.734073{col 26}{space 2} 10.20249{col 37}{space 1}   -0.66{col 46}{space 3}0.509{col 54}{space 4}-26.73419{col 67}{space 3} 13.26604
{txt}{space 9}MT  {c |}{col 14}{res}{space 2}  -10.615{col 26}{space 2} 10.08461{col 37}{space 1}   -1.05{col 46}{space 3}0.293{col 54}{space 4}-30.38403{col 67}{space 3} 9.154031
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-8.228393{col 26}{space 2} 10.02685{col 37}{space 1}   -0.82{col 46}{space 3}0.412{col 54}{space 4} -27.8842{col 67}{space 3} 11.42741
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-8.018633{col 26}{space 2} 10.23306{col 37}{space 1}   -0.78{col 46}{space 3}0.433{col 54}{space 4}-28.07867{col 67}{space 3}  12.0414
{txt}{space 9}NE  {c |}{col 14}{res}{space 2} -10.7986{col 26}{space 2} 10.03233{col 37}{space 1}   -1.08{col 46}{space 3}0.282{col 54}{space 4}-30.46514{col 67}{space 3} 8.867951
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-10.86377{col 26}{space 2} 10.07634{col 37}{space 1}   -1.08{col 46}{space 3}0.281{col 54}{space 4}-30.61658{col 67}{space 3} 8.889043
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-7.892562{col 26}{space 2} 10.02659{col 37}{space 1}   -0.79{col 46}{space 3}0.431{col 54}{space 4}-27.54785{col 67}{space 3} 11.76273
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-9.526978{col 26}{space 2} 10.16131{col 37}{space 1}   -0.94{col 46}{space 3}0.348{col 54}{space 4}-29.44636{col 67}{space 3} 10.39241
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}-6.495131{col 26}{space 2} 10.15701{col 37}{space 1}   -0.64{col 46}{space 3}0.523{col 54}{space 4}-26.40609{col 67}{space 3} 13.41583
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-8.421329{col 26}{space 2} 10.01334{col 37}{space 1}   -0.84{col 46}{space 3}0.400{col 54}{space 4}-28.05065{col 67}{space 3} 11.20799
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-9.200212{col 26}{space 2} 10.01483{col 37}{space 1}   -0.92{col 46}{space 3}0.358{col 54}{space 4}-28.83245{col 67}{space 3} 10.43202
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-4.839546{col 26}{space 2}  10.2043{col 37}{space 1}   -0.47{col 46}{space 3}0.635{col 54}{space 4} -24.8432{col 67}{space 3} 15.16411
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-10.32496{col 26}{space 2} 10.02873{col 37}{space 1}   -1.03{col 46}{space 3}0.303{col 54}{space 4}-29.98444{col 67}{space 3} 9.334522
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-9.274486{col 26}{space 2} 10.00858{col 37}{space 1}   -0.93{col 46}{space 3}0.354{col 54}{space 4}-28.89447{col 67}{space 3}  10.3455
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-5.972917{col 26}{space 2} 10.65428{col 37}{space 1}   -0.56{col 46}{space 3}0.575{col 54}{space 4}-26.85869{col 67}{space 3} 14.91285
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-6.674167{col 26}{space 2} 10.10778{col 37}{space 1}   -0.66{col 46}{space 3}0.509{col 54}{space 4}-26.48862{col 67}{space 3} 13.14028
{txt}{space 9}SD  {c |}{col 14}{res}{space 2}-9.630455{col 26}{space 2} 10.10928{col 37}{space 1}   -0.95{col 46}{space 3}0.341{col 54}{space 4}-29.44785{col 67}{space 3} 10.18694
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-6.754593{col 26}{space 2} 10.05724{col 37}{space 1}   -0.67{col 46}{space 3}0.502{col 54}{space 4}-26.46997{col 67}{space 3} 12.96078
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-6.524449{col 26}{space 2} 10.02091{col 37}{space 1}   -0.65{col 46}{space 3}0.515{col 54}{space 4} -26.1686{col 67}{space 3}  13.1197
{txt}{space 9}UT  {c |}{col 14}{res}{space 2}-9.623167{col 26}{space 2} 10.04822{col 37}{space 1}   -0.96{col 46}{space 3}0.338{col 54}{space 4}-29.32085{col 67}{space 3} 10.07452
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}  -8.5213{col 26}{space 2} 10.03824{col 37}{space 1}   -0.85{col 46}{space 3}0.396{col 54}{space 4}-28.19943{col 67}{space 3} 11.15683
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}-12.56621{col 26}{space 2} 10.01747{col 37}{space 1}   -1.25{col 46}{space 3}0.210{col 54}{space 4}-32.20362{col 67}{space 3} 7.071209
{txt}{space 9}WA  {c |}{col 14}{res}{space 2}-8.806921{col 26}{space 2} 10.03792{col 37}{space 1}   -0.88{col 46}{space 3}0.380{col 54}{space 4}-28.48442{col 67}{space 3} 10.87057
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-8.539886{col 26}{space 2} 10.02989{col 37}{space 1}   -0.85{col 46}{space 3}0.395{col 54}{space 4}-28.20165{col 67}{space 3} 11.12187
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-9.916149{col 26}{space 2} 10.11988{col 37}{space 1}   -0.98{col 46}{space 3}0.327{col 54}{space 4}-29.75432{col 67}{space 3} 9.922018
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-9.892878{col 26}{space 2} 10.25753{col 37}{space 1}   -0.96{col 46}{space 3}0.335{col 54}{space 4}-30.00089{col 67}{space 3} 10.21514
{txt}{space 12} {c |}
{space 7}2.Q33 {c |}{col 14}{res}{space 2} 1.420842{col 26}{space 2} .3042936{col 37}{space 1}    4.67{col 46}{space 3}0.000{col 54}{space 4} .8243305{col 67}{space 3} 2.017354
{txt}{space 7}2.Q34 {c |}{col 14}{res}{space 2}-.9510031{col 26}{space 2} .6544824{col 37}{space 1}   -1.45{col 46}{space 3}0.146{col 54}{space 4}-2.233996{col 67}{space 3} .3319898
{txt}{space 7}Q35_1 {c |}{col 14}{res}{space 2} -1.37273{col 26}{space 2} .9918923{col 37}{space 1}   -1.38{col 46}{space 3}0.166{col 54}{space 4}-3.317153{col 67}{space 3} .5716935
{txt}{space 7}Q35_2 {c |}{col 14}{res}{space 2} 1.044601{col 26}{space 2}  1.06694{col 37}{space 1}    0.98{col 46}{space 3}0.328{col 54}{space 4}-1.046938{col 67}{space 3} 3.136141
{txt}{space 7}Q35_3 {c |}{col 14}{res}{space 2}-.6221737{col 26}{space 2} 1.095289{col 37}{space 1}   -0.57{col 46}{space 3}0.570{col 54}{space 4}-2.769287{col 67}{space 3}  1.52494
{txt}{space 7}Q35_4 {c |}{col 14}{res}{space 2}-1.004402{col 26}{space 2} 1.090281{col 37}{space 1}   -0.92{col 46}{space 3}0.357{col 54}{space 4}-3.141698{col 67}{space 3} 1.132894
{txt}{space 7}Q35_5 {c |}{col 14}{res}{space 2} 2.467031{col 26}{space 2} 3.368456{col 37}{space 1}    0.73{col 46}{space 3}0.464{col 54}{space 4}-4.136209{col 67}{space 3} 9.070272
{txt}{space 7}Q35_6 {c |}{col 14}{res}{space 2} .0150307{col 26}{space 2}  1.07484{col 37}{space 1}    0.01{col 46}{space 3}0.989{col 54}{space 4}-2.091996{col 67}{space 3} 2.122057
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 18.55086{col 26}{space 2} 10.18381{col 37}{space 1}    1.82{col 46}{space 3}0.069{col 54}{space 4}-1.412637{col 67}{space 3} 38.51436
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est2{txt} stored)

Linear regression                                      Number of obs ={res}    5665
                                                       {txt}F( 75,  5589) ={res}    3.21
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0375
                                                       {txt}Root MSE      = {res} 10.375

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     Q24_var{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2}-.1054056{col 26}{space 2} .8594882{col 37}{space 1}   -0.12{col 46}{space 3}0.902{col 54}{space 4}-1.790336{col 67}{space 3} 1.579525
{txt}{space 8}Old  {c |}{col 14}{res}{space 2} .1895205{col 26}{space 2} 1.226745{col 37}{space 1}    0.15{col 46}{space 3}0.877{col 54}{space 4}-2.215377{col 67}{space 3} 2.594418
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2}-1.364748{col 26}{space 2} .6319194{col 37}{space 1}   -2.16{col 46}{space 3}0.031{col 54}{space 4}-2.603555{col 67}{space 3}-.1259401
{txt}High Educ..  {c |}{col 14}{res}{space 2}-1.931618{col 26}{space 2} .6015325{col 37}{space 1}   -3.21{col 46}{space 3}0.001{col 54}{space 4}-3.110855{col 67}{space 3}-.7523808
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2}-1.950286{col 26}{space 2} .4737717{col 37}{space 1}   -4.12{col 46}{space 3}0.000{col 54}{space 4}-2.879063{col 67}{space 3} -1.02151
{txt}High Income  {c |}{col 14}{res}{space 2}-1.938553{col 26}{space 2} .4657796{col 37}{space 1}   -4.16{col 46}{space 3}0.000{col 54}{space 4}-2.851662{col 67}{space 3}-1.025444
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2} .4906024{col 26}{space 2} .8867402{col 37}{space 1}    0.55{col 46}{space 3}0.580{col 54}{space 4}-1.247753{col 67}{space 3} 2.228958
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} 2.134853{col 26}{space 2} 1.258631{col 37}{space 1}    1.70{col 46}{space 3}0.090{col 54}{space 4}-.3325533{col 67}{space 3}  4.60226
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2}-.6392191{col 26}{space 2} .4355635{col 37}{space 1}   -1.47{col 46}{space 3}0.142{col 54}{space 4}-1.493093{col 67}{space 3} .2146546
{txt}{space 7}2015  {c |}{col 14}{res}{space 2}-.5107385{col 26}{space 2} .4481572{col 37}{space 1}   -1.14{col 46}{space 3}0.254{col 54}{space 4}-1.389301{col 67}{space 3} .3678238
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.6439751{col 26}{space 2} .4488051{col 37}{space 1}   -1.43{col 46}{space 3}0.151{col 54}{space 4}-1.523807{col 67}{space 3} .2358573
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .2797221{col 26}{space 2} .4825875{col 37}{space 1}    0.58{col 46}{space 3}0.562{col 54}{space 4}-.6663368{col 67}{space 3} 1.225781
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.7124337{col 26}{space 2} .5882322{col 37}{space 1}   -1.21{col 46}{space 3}0.226{col 54}{space 4}-1.865597{col 67}{space 3}   .44073
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2}-11.02429{col 26}{space 2} 12.12978{col 37}{space 1}   -0.91{col 46}{space 3}0.363{col 54}{space 4}-34.80336{col 67}{space 3} 12.75479
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-13.03983{col 26}{space 2} 12.18058{col 37}{space 1}   -1.07{col 46}{space 3}0.284{col 54}{space 4} -36.9185{col 67}{space 3} 10.83883
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-12.85217{col 26}{space 2}  12.0628{col 37}{space 1}   -1.07{col 46}{space 3}0.287{col 54}{space 4}-36.49995{col 67}{space 3} 10.79561
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-12.00949{col 26}{space 2} 12.05882{col 37}{space 1}   -1.00{col 46}{space 3}0.319{col 54}{space 4}-35.64945{col 67}{space 3} 11.63048
{txt}{space 9}CO  {c |}{col 14}{res}{space 2}-13.16273{col 26}{space 2} 12.06343{col 37}{space 1}   -1.09{col 46}{space 3}0.275{col 54}{space 4}-36.81174{col 67}{space 3} 10.48627
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-13.55773{col 26}{space 2} 12.06808{col 37}{space 1}   -1.12{col 46}{space 3}0.261{col 54}{space 4}-37.21585{col 67}{space 3} 10.10039
{txt}{space 9}DC  {c |}{col 14}{res}{space 2}-12.68855{col 26}{space 2} 12.09762{col 37}{space 1}   -1.05{col 46}{space 3}0.294{col 54}{space 4}-36.40458{col 67}{space 3} 11.02748
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-12.95132{col 26}{space 2} 12.44737{col 37}{space 1}   -1.04{col 46}{space 3}0.298{col 54}{space 4}-37.35301{col 67}{space 3} 11.45036
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-12.12167{col 26}{space 2} 12.05768{col 37}{space 1}   -1.01{col 46}{space 3}0.315{col 54}{space 4}-35.75941{col 67}{space 3} 11.51606
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-12.61102{col 26}{space 2} 12.06164{col 37}{space 1}   -1.05{col 46}{space 3}0.296{col 54}{space 4}-36.25653{col 67}{space 3} 11.03449
{txt}{space 9}HI  {c |}{col 14}{res}{space 2}-14.16339{col 26}{space 2} 12.23855{col 37}{space 1}   -1.16{col 46}{space 3}0.247{col 54}{space 4}-38.15571{col 67}{space 3} 9.828932
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-15.22199{col 26}{space 2} 12.05094{col 37}{space 1}   -1.26{col 46}{space 3}0.207{col 54}{space 4}-38.84652{col 67}{space 3} 8.402548
{txt}{space 9}ID  {c |}{col 14}{res}{space 2}-14.05511{col 26}{space 2} 12.14719{col 37}{space 1}   -1.16{col 46}{space 3}0.247{col 54}{space 4}-37.86832{col 67}{space 3} 9.758095
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-13.81383{col 26}{space 2} 12.04829{col 37}{space 1}   -1.15{col 46}{space 3}0.252{col 54}{space 4}-37.43316{col 67}{space 3} 9.805497
{txt}{space 9}IN  {c |}{col 14}{res}{space 2}-12.55392{col 26}{space 2} 12.07991{col 37}{space 1}   -1.04{col 46}{space 3}0.299{col 54}{space 4}-36.23523{col 67}{space 3} 11.12739
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-13.24168{col 26}{space 2} 12.11128{col 37}{space 1}   -1.09{col 46}{space 3}0.274{col 54}{space 4}-36.98449{col 67}{space 3} 10.50114
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-12.88287{col 26}{space 2} 12.11323{col 37}{space 1}   -1.06{col 46}{space 3}0.288{col 54}{space 4} -36.6295{col 67}{space 3} 10.86377
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-12.03419{col 26}{space 2} 12.14424{col 37}{space 1}   -0.99{col 46}{space 3}0.322{col 54}{space 4}-35.84162{col 67}{space 3} 11.77323
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-10.70091{col 26}{space 2} 12.08991{col 37}{space 1}   -0.89{col 46}{space 3}0.376{col 54}{space 4}-34.40182{col 67}{space 3} 13.00001
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-12.25343{col 26}{space 2} 12.07856{col 37}{space 1}   -1.01{col 46}{space 3}0.310{col 54}{space 4} -35.9321{col 67}{space 3} 11.42524
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-13.64556{col 26}{space 2} 12.10072{col 37}{space 1}   -1.13{col 46}{space 3}0.260{col 54}{space 4}-37.36767{col 67}{space 3} 10.07656
{txt}{space 9}MI  {c |}{col 14}{res}{space 2} -12.9403{col 26}{space 2} 12.05077{col 37}{space 1}   -1.07{col 46}{space 3}0.283{col 54}{space 4}-36.56448{col 67}{space 3} 10.68389
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-13.62219{col 26}{space 2} 12.05679{col 37}{space 1}   -1.13{col 46}{space 3}0.259{col 54}{space 4}-37.25818{col 67}{space 3} 10.01379
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-13.11393{col 26}{space 2} 12.06481{col 37}{space 1}   -1.09{col 46}{space 3}0.277{col 54}{space 4}-36.76565{col 67}{space 3} 10.53779
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-12.86376{col 26}{space 2} 12.13212{col 37}{space 1}   -1.06{col 46}{space 3}0.289{col 54}{space 4}-36.64743{col 67}{space 3} 10.91991
{txt}{space 9}MT  {c |}{col 14}{res}{space 2}-13.99752{col 26}{space 2} 12.12919{col 37}{space 1}   -1.15{col 46}{space 3}0.249{col 54}{space 4}-37.77545{col 67}{space 3} 9.780409
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-13.16449{col 26}{space 2} 12.05262{col 37}{space 1}   -1.09{col 46}{space 3}0.275{col 54}{space 4}-36.79231{col 67}{space 3} 10.46334
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-11.61312{col 26}{space 2} 12.26587{col 37}{space 1}   -0.95{col 46}{space 3}0.344{col 54}{space 4}  -35.659{col 67}{space 3} 12.43275
{txt}{space 9}NE  {c |}{col 14}{res}{space 2}-14.40636{col 26}{space 2} 12.05604{col 37}{space 1}   -1.19{col 46}{space 3}0.232{col 54}{space 4}-38.04088{col 67}{space 3}  9.22816
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-15.90463{col 26}{space 2}  12.0474{col 37}{space 1}   -1.32{col 46}{space 3}0.187{col 54}{space 4}-39.52221{col 67}{space 3} 7.712944
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-12.25812{col 26}{space 2} 12.06543{col 37}{space 1}   -1.02{col 46}{space 3}0.310{col 54}{space 4}-35.91104{col 67}{space 3}  11.3948
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-14.01991{col 26}{space 2} 12.14549{col 37}{space 1}   -1.15{col 46}{space 3}0.248{col 54}{space 4}-37.82978{col 67}{space 3} 9.789959
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}-10.62785{col 26}{space 2} 12.16913{col 37}{space 1}   -0.87{col 46}{space 3}0.383{col 54}{space 4}-34.48408{col 67}{space 3} 13.22838
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-13.16649{col 26}{space 2} 12.04819{col 37}{space 1}   -1.09{col 46}{space 3}0.275{col 54}{space 4}-36.78563{col 67}{space 3} 10.45265
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-12.83635{col 26}{space 2} 12.05212{col 37}{space 1}   -1.07{col 46}{space 3}0.287{col 54}{space 4}-36.46319{col 67}{space 3} 10.79049
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-10.46267{col 26}{space 2} 12.19881{col 37}{space 1}   -0.86{col 46}{space 3}0.391{col 54}{space 4}-34.37708{col 67}{space 3} 13.45175
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-14.44735{col 26}{space 2} 12.05369{col 37}{space 1}   -1.20{col 46}{space 3}0.231{col 54}{space 4}-38.07726{col 67}{space 3} 9.182558
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-13.33753{col 26}{space 2} 12.04466{col 37}{space 1}   -1.11{col 46}{space 3}0.268{col 54}{space 4}-36.94975{col 67}{space 3} 10.27468
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-8.704132{col 26}{space 2} 12.62517{col 37}{space 1}   -0.69{col 46}{space 3}0.491{col 54}{space 4}-33.45437{col 67}{space 3}  16.0461
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-11.17165{col 26}{space 2} 12.14099{col 37}{space 1}   -0.92{col 46}{space 3}0.358{col 54}{space 4} -34.9727{col 67}{space 3}  12.6294
{txt}{space 9}SD  {c |}{col 14}{res}{space 2}-14.43704{col 26}{space 2}  12.0948{col 37}{space 1}   -1.19{col 46}{space 3}0.233{col 54}{space 4}-38.14755{col 67}{space 3} 9.273467
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-10.31785{col 26}{space 2} 12.09564{col 37}{space 1}   -0.85{col 46}{space 3}0.394{col 54}{space 4}-34.02999{col 67}{space 3}  13.3943
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-11.48645{col 26}{space 2} 12.05236{col 37}{space 1}   -0.95{col 46}{space 3}0.341{col 54}{space 4}-35.11375{col 67}{space 3} 12.14085
{txt}{space 9}UT  {c |}{col 14}{res}{space 2} -12.6544{col 26}{space 2} 12.08787{col 37}{space 1}   -1.05{col 46}{space 3}0.295{col 54}{space 4}-36.35132{col 67}{space 3} 11.04253
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}-12.85884{col 26}{space 2} 12.06515{col 37}{space 1}   -1.07{col 46}{space 3}0.287{col 54}{space 4}-36.51123{col 67}{space 3} 10.79354
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}-15.49729{col 26}{space 2}  12.0521{col 37}{space 1}   -1.29{col 46}{space 3}0.199{col 54}{space 4}-39.12408{col 67}{space 3} 8.129501
{txt}{space 9}WA  {c |}{col 14}{res}{space 2} -13.5601{col 26}{space 2} 12.06295{col 37}{space 1}   -1.12{col 46}{space 3}0.261{col 54}{space 4}-37.20817{col 67}{space 3} 10.08798
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-12.51215{col 26}{space 2} 12.06337{col 37}{space 1}   -1.04{col 46}{space 3}0.300{col 54}{space 4}-36.16104{col 67}{space 3} 11.13674
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-12.85267{col 26}{space 2} 12.17792{col 37}{space 1}   -1.06{col 46}{space 3}0.291{col 54}{space 4}-36.72612{col 67}{space 3} 11.02078
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-13.66012{col 26}{space 2} 12.31577{col 37}{space 1}   -1.11{col 46}{space 3}0.267{col 54}{space 4}-37.80381{col 67}{space 3} 10.48357
{txt}{space 12} {c |}
{space 7}2.Q33 {c |}{col 14}{res}{space 2} 1.073591{col 26}{space 2} .2861611{col 37}{space 1}    3.75{col 46}{space 3}0.000{col 54}{space 4} .5126036{col 67}{space 3} 1.634577
{txt}{space 7}2.Q34 {c |}{col 14}{res}{space 2}-1.305474{col 26}{space 2} .6007165{col 37}{space 1}   -2.17{col 46}{space 3}0.030{col 54}{space 4}-2.483111{col 67}{space 3}-.1278358
{txt}{space 7}Q35_1 {c |}{col 14}{res}{space 2}-1.692421{col 26}{space 2} .8887177{col 37}{space 1}   -1.90{col 46}{space 3}0.057{col 54}{space 4}-3.434653{col 67}{space 3} .0498111
{txt}{space 7}Q35_2 {c |}{col 14}{res}{space 2} .8076704{col 26}{space 2} .9726622{col 37}{space 1}    0.83{col 46}{space 3}0.406{col 54}{space 4}-1.099125{col 67}{space 3} 2.714466
{txt}{space 7}Q35_3 {c |}{col 14}{res}{space 2} .2493535{col 26}{space 2}  1.10445{col 37}{space 1}    0.23{col 46}{space 3}0.821{col 54}{space 4}-1.915797{col 67}{space 3} 2.414504
{txt}{space 7}Q35_4 {c |}{col 14}{res}{space 2}-.7313094{col 26}{space 2} .9713145{col 37}{space 1}   -0.75{col 46}{space 3}0.452{col 54}{space 4}-2.635463{col 67}{space 3} 1.172844
{txt}{space 7}Q35_5 {c |}{col 14}{res}{space 2} 1.884613{col 26}{space 2}  2.99801{col 37}{space 1}    0.63{col 46}{space 3}0.530{col 54}{space 4}-3.992652{col 67}{space 3} 7.761877
{txt}{space 7}Q35_6 {c |}{col 14}{res}{space 2}-1.540859{col 26}{space 2} .9579022{col 37}{space 1}   -1.61{col 46}{space 3}0.108{col 54}{space 4} -3.41872{col 67}{space 3}  .337001
{txt}{space 7}Q4new {c |}{col 14}{res}{space 2} .0000807{col 26}{space 2} .0066093{col 37}{space 1}    0.01{col 46}{space 3}0.990{col 54}{space 4} -.012876{col 67}{space 3} .0130375
{txt}{space 7}Q6new {c |}{col 14}{res}{space 2}  .007698{col 26}{space 2} .0067034{col 37}{space 1}    1.15{col 46}{space 3}0.251{col 54}{space 4}-.0054433{col 67}{space 3} .0208393
{txt}{space 5}Q9_mean {c |}{col 14}{res}{space 2}-.0548656{col 26}{space 2} .0393045{col 37}{space 1}   -1.40{col 46}{space 3}0.163{col 54}{space 4}-.1319177{col 67}{space 3} .0221866
{txt}{space 6}Q13new {c |}{col 14}{res}{space 2} .0046324{col 26}{space 2} .0072328{col 37}{space 1}    0.64{col 46}{space 3}0.522{col 54}{space 4}-.0095467{col 67}{space 3} .0188116
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 22.10539{col 26}{space 2} 12.17257{col 37}{space 1}    1.82{col 46}{space 3}0.069{col 54}{space 4}-1.757588{col 67}{space 3} 45.96836
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est3{txt} stored)

Linear regression                                      Number of obs ={res}    7676
                                                       {txt}F( 63,  7612) ={res}    4.74
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0533
                                                       {txt}Root MSE      = {res} 4.3217

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     Q24_iqr{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2} .0418547{col 26}{space 2}   .27419{col 37}{space 1}    0.15{col 46}{space 3}0.879{col 54}{space 4}-.4956333{col 67}{space 3} .5793426
{txt}{space 8}Old  {c |}{col 14}{res}{space 2} .6214972{col 26}{space 2}  .435384{col 37}{space 1}    1.43{col 46}{space 3}0.153{col 54}{space 4}-.2319755{col 67}{space 3}  1.47497
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2}-.9751023{col 26}{space 2} .2452878{col 37}{space 1}   -3.98{col 46}{space 3}0.000{col 54}{space 4}-1.455934{col 67}{space 3}-.4942706
{txt}High Educ..  {c |}{col 14}{res}{space 2}-1.506208{col 26}{space 2} .2331371{col 37}{space 1}   -6.46{col 46}{space 3}0.000{col 54}{space 4}-1.963221{col 67}{space 3}-1.049195
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2}-1.354581{col 26}{space 2}  .171404{col 37}{space 1}   -7.90{col 46}{space 3}0.000{col 54}{space 4}-1.690581{col 67}{space 3}-1.018582
{txt}High Income  {c |}{col 14}{res}{space 2}-1.452886{col 26}{space 2} .1603275{col 37}{space 1}   -9.06{col 46}{space 3}0.000{col 54}{space 4}-1.767172{col 67}{space 3}  -1.1386
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2} .5903669{col 26}{space 2} .3413786{col 37}{space 1}    1.73{col 46}{space 3}0.084{col 54}{space 4}-.0788292{col 67}{space 3} 1.259563
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} 1.159584{col 26}{space 2} .4409936{col 37}{space 1}    2.63{col 46}{space 3}0.009{col 54}{space 4} .2951151{col 67}{space 3} 2.024053
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2} .1555295{col 26}{space 2} .1585767{col 37}{space 1}    0.98{col 46}{space 3}0.327{col 54}{space 4}-.1553245{col 67}{space 3} .4663834
{txt}{space 7}2015  {c |}{col 14}{res}{space 2} .1005103{col 26}{space 2} .1553929{col 37}{space 1}    0.65{col 46}{space 3}0.518{col 54}{space 4}-.2041026{col 67}{space 3} .4051232
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1656062{col 26}{space 2} .1590983{col 37}{space 1}    1.04{col 46}{space 3}0.298{col 54}{space 4}-.1462703{col 67}{space 3} .4774826
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1899739{col 26}{space 2} .1537993{col 37}{space 1}    1.24{col 46}{space 3}0.217{col 54}{space 4}-.1115151{col 67}{space 3}  .491463
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .2433266{col 26}{space 2} .2295629{col 37}{space 1}    1.06{col 46}{space 3}0.289{col 54}{space 4}  -.20668{col 67}{space 3} .6933332
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2}-2.617619{col 26}{space 2} 2.331048{col 37}{space 1}   -1.12{col 46}{space 3}0.261{col 54}{space 4}-7.187115{col 67}{space 3} 1.951877
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-3.962548{col 26}{space 2} 2.313392{col 37}{space 1}   -1.71{col 46}{space 3}0.087{col 54}{space 4}-8.497434{col 67}{space 3} .5723378
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-2.639787{col 26}{space 2} 2.312142{col 37}{space 1}   -1.14{col 46}{space 3}0.254{col 54}{space 4}-7.172222{col 67}{space 3} 1.892649
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-2.538352{col 26}{space 2} 2.286526{col 37}{space 1}   -1.11{col 46}{space 3}0.267{col 54}{space 4}-7.020573{col 67}{space 3} 1.943869
{txt}{space 9}CO  {c |}{col 14}{res}{space 2}-2.877524{col 26}{space 2} 2.301372{col 37}{space 1}   -1.25{col 46}{space 3}0.211{col 54}{space 4}-7.388847{col 67}{space 3} 1.633799
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-3.471518{col 26}{space 2} 2.297769{col 37}{space 1}   -1.51{col 46}{space 3}0.131{col 54}{space 4} -7.97578{col 67}{space 3} 1.032744
{txt}{space 9}DC  {c |}{col 14}{res}{space 2}-2.446572{col 26}{space 2}  2.44139{col 37}{space 1}   -1.00{col 46}{space 3}0.316{col 54}{space 4} -7.23237{col 67}{space 3} 2.339225
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-2.949246{col 26}{space 2}  2.54253{col 37}{space 1}   -1.16{col 46}{space 3}0.246{col 54}{space 4}-7.933305{col 67}{space 3} 2.034814
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-2.474203{col 26}{space 2} 2.295791{col 37}{space 1}   -1.08{col 46}{space 3}0.281{col 54}{space 4}-6.974587{col 67}{space 3}  2.02618
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-2.685096{col 26}{space 2} 2.300571{col 37}{space 1}   -1.17{col 46}{space 3}0.243{col 54}{space 4}-7.194849{col 67}{space 3} 1.824656
{txt}{space 9}HI  {c |}{col 14}{res}{space 2}-2.810514{col 26}{space 2}  2.42974{col 37}{space 1}   -1.16{col 46}{space 3}0.247{col 54}{space 4}-7.573475{col 67}{space 3} 1.952447
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-3.870406{col 26}{space 2} 2.317046{col 37}{space 1}   -1.67{col 46}{space 3}0.095{col 54}{space 4}-8.412454{col 67}{space 3} .6716423
{txt}{space 9}ID  {c |}{col 14}{res}{space 2}-3.992915{col 26}{space 2} 2.312412{col 37}{space 1}   -1.73{col 46}{space 3}0.084{col 54}{space 4}-8.525879{col 67}{space 3} .5400493
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-3.133954{col 26}{space 2} 2.292204{col 37}{space 1}   -1.37{col 46}{space 3}0.172{col 54}{space 4}-7.627306{col 67}{space 3} 1.359398
{txt}{space 9}IN  {c |}{col 14}{res}{space 2}-3.060119{col 26}{space 2} 2.303788{col 37}{space 1}   -1.33{col 46}{space 3}0.184{col 54}{space 4}-7.576178{col 67}{space 3}  1.45594
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-3.231724{col 26}{space 2} 2.321098{col 37}{space 1}   -1.39{col 46}{space 3}0.164{col 54}{space 4}-7.781716{col 67}{space 3} 1.318268
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-3.606478{col 26}{space 2} 2.313662{col 37}{space 1}   -1.56{col 46}{space 3}0.119{col 54}{space 4}-8.141893{col 67}{space 3} .9289381
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}  -1.0014{col 26}{space 2} 2.420876{col 37}{space 1}   -0.41{col 46}{space 3}0.679{col 54}{space 4}-5.746983{col 67}{space 3} 3.744184
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-2.855993{col 26}{space 2} 2.304263{col 37}{space 1}   -1.24{col 46}{space 3}0.215{col 54}{space 4}-7.372984{col 67}{space 3} 1.660998
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-2.849781{col 26}{space 2} 2.302598{col 37}{space 1}   -1.24{col 46}{space 3}0.216{col 54}{space 4}-7.363508{col 67}{space 3} 1.663945
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-3.255023{col 26}{space 2} 2.352479{col 37}{space 1}   -1.38{col 46}{space 3}0.167{col 54}{space 4} -7.86653{col 67}{space 3} 1.356484
{txt}{space 9}MI  {c |}{col 14}{res}{space 2}-3.321335{col 26}{space 2} 2.292518{col 37}{space 1}   -1.45{col 46}{space 3}0.147{col 54}{space 4}-7.815302{col 67}{space 3} 1.172633
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-3.323918{col 26}{space 2} 2.300648{col 37}{space 1}   -1.44{col 46}{space 3}0.149{col 54}{space 4}-7.833823{col 67}{space 3} 1.185986
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-3.244089{col 26}{space 2}  2.30145{col 37}{space 1}   -1.41{col 46}{space 3}0.159{col 54}{space 4}-7.755566{col 67}{space 3} 1.267388
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-1.906992{col 26}{space 2} 2.435163{col 37}{space 1}   -0.78{col 46}{space 3}0.434{col 54}{space 4}-6.680582{col 67}{space 3} 2.866598
{txt}{space 9}MT  {c |}{col 14}{res}{space 2}-3.784392{col 26}{space 2} 2.380195{col 37}{space 1}   -1.59{col 46}{space 3}0.112{col 54}{space 4}-8.450231{col 67}{space 3} .8814467
{txt}{space 9}NC  {c |}{col 14}{res}{space 2} -2.47083{col 26}{space 2} 2.301539{col 37}{space 1}   -1.07{col 46}{space 3}0.283{col 54}{space 4}-6.982481{col 67}{space 3} 2.040821
{txt}{space 9}ND  {c |}{col 14}{res}{space 2} -2.79443{col 26}{space 2} 2.398667{col 37}{space 1}   -1.16{col 46}{space 3}0.244{col 54}{space 4}-7.496477{col 67}{space 3} 1.907618
{txt}{space 9}NE  {c |}{col 14}{res}{space 2}-3.647841{col 26}{space 2} 2.308223{col 37}{space 1}   -1.58{col 46}{space 3}0.114{col 54}{space 4}-8.172594{col 67}{space 3} .8769121
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-4.051765{col 26}{space 2} 2.325548{col 37}{space 1}   -1.74{col 46}{space 3}0.081{col 54}{space 4} -8.61048{col 67}{space 3} .5069488
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-2.463381{col 26}{space 2}   2.2992{col 37}{space 1}   -1.07{col 46}{space 3}0.284{col 54}{space 4}-6.970446{col 67}{space 3} 2.043685
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-3.203441{col 26}{space 2} 2.386936{col 37}{space 1}   -1.34{col 46}{space 3}0.180{col 54}{space 4}-7.882493{col 67}{space 3}  1.47561
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}-2.813473{col 26}{space 2} 2.338632{col 37}{space 1}   -1.20{col 46}{space 3}0.229{col 54}{space 4}-7.397835{col 67}{space 3}  1.77089
{txt}{space 9}NY  {c |}{col 14}{res}{space 2} -2.76637{col 26}{space 2} 2.290152{col 37}{space 1}   -1.21{col 46}{space 3}0.227{col 54}{space 4}-7.255699{col 67}{space 3} 1.722959
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-3.415544{col 26}{space 2} 2.291741{col 37}{space 1}   -1.49{col 46}{space 3}0.136{col 54}{space 4}-7.907989{col 67}{space 3} 1.076901
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-1.068565{col 26}{space 2} 2.375255{col 37}{space 1}   -0.45{col 46}{space 3}0.653{col 54}{space 4}-5.724719{col 67}{space 3}  3.58759
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-3.702242{col 26}{space 2} 2.313176{col 37}{space 1}   -1.60{col 46}{space 3}0.110{col 54}{space 4}-8.236704{col 67}{space 3} .8322195
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-3.325726{col 26}{space 2} 2.289696{col 37}{space 1}   -1.45{col 46}{space 3}0.146{col 54}{space 4}-7.814161{col 67}{space 3}  1.16271
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-2.178777{col 26}{space 2} 2.437221{col 37}{space 1}   -0.89{col 46}{space 3}0.371{col 54}{space 4}-6.956403{col 67}{space 3} 2.598848
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-2.806591{col 26}{space 2} 2.313901{col 37}{space 1}   -1.21{col 46}{space 3}0.225{col 54}{space 4}-7.342475{col 67}{space 3} 1.729292
{txt}{space 9}SD  {c |}{col 14}{res}{space 2} -3.74922{col 26}{space 2} 2.332312{col 37}{space 1}   -1.61{col 46}{space 3}0.108{col 54}{space 4}-8.321194{col 67}{space 3} .8227539
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-3.089759{col 26}{space 2} 2.298297{col 37}{space 1}   -1.34{col 46}{space 3}0.179{col 54}{space 4}-7.595054{col 67}{space 3} 1.415537
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-2.226971{col 26}{space 2} 2.291721{col 37}{space 1}   -0.97{col 46}{space 3}0.331{col 54}{space 4}-6.719376{col 67}{space 3} 2.265434
{txt}{space 9}UT  {c |}{col 14}{res}{space 2}-3.033507{col 26}{space 2} 2.346582{col 37}{space 1}   -1.29{col 46}{space 3}0.196{col 54}{space 4}-7.633455{col 67}{space 3}  1.56644
{txt}{space 9}VA  {c |}{col 14}{res}{space 2} -2.59238{col 26}{space 2} 2.307709{col 37}{space 1}   -1.12{col 46}{space 3}0.261{col 54}{space 4}-7.116126{col 67}{space 3} 1.931365
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}-4.658418{col 26}{space 2} 2.308291{col 37}{space 1}   -2.02{col 46}{space 3}0.044{col 54}{space 4}-9.183306{col 67}{space 3}-.1335311
{txt}{space 9}WA  {c |}{col 14}{res}{space 2}-3.461829{col 26}{space 2} 2.296039{col 37}{space 1}   -1.51{col 46}{space 3}0.132{col 54}{space 4}-7.962699{col 67}{space 3} 1.039041
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-3.790329{col 26}{space 2}  2.29211{col 37}{space 1}   -1.65{col 46}{space 3}0.098{col 54}{space 4}-8.283497{col 67}{space 3} .7028393
{txt}{space 9}WV  {c |}{col 14}{res}{space 2} -3.50928{col 26}{space 2} 2.351932{col 37}{space 1}   -1.49{col 46}{space 3}0.136{col 54}{space 4}-8.119715{col 67}{space 3} 1.101154
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-4.308895{col 26}{space 2} 2.347614{col 37}{space 1}   -1.84{col 46}{space 3}0.066{col 54}{space 4}-8.910866{col 67}{space 3} .2930748
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 7.759787{col 26}{space 2} 2.333804{col 37}{space 1}    3.32{col 46}{space 3}0.001{col 54}{space 4} 3.184889{col 67}{space 3} 12.33469
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est4{txt} stored)

Linear regression                                      Number of obs ={res}    7674
                                                       {txt}F( 71,  7602) ={res}    5.21
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0756
                                                       {txt}Root MSE      = {res} 4.2731

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     Q24_iqr{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2} .0043212{col 26}{space 2}  .276152{col 37}{space 1}    0.02{col 46}{space 3}0.988{col 54}{space 4}-.5370129{col 67}{space 3} .5456554
{txt}{space 8}Old  {c |}{col 14}{res}{space 2} .5549264{col 26}{space 2} .4374053{col 37}{space 1}    1.27{col 46}{space 3}0.205{col 54}{space 4}-.3025087{col 67}{space 3} 1.412362
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2}-.9481414{col 26}{space 2} .2411354{col 37}{space 1}   -3.93{col 46}{space 3}0.000{col 54}{space 4}-1.420833{col 67}{space 3}-.4754494
{txt}High Educ..  {c |}{col 14}{res}{space 2}-1.421623{col 26}{space 2} .2286565{col 37}{space 1}   -6.22{col 46}{space 3}0.000{col 54}{space 4}-1.869853{col 67}{space 3}-.9733929
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2}-1.272953{col 26}{space 2} .1697025{col 37}{space 1}   -7.50{col 46}{space 3}0.000{col 54}{space 4}-1.605617{col 67}{space 3}-.9402891
{txt}High Income  {c |}{col 14}{res}{space 2}-1.297554{col 26}{space 2} .1605746{col 37}{space 1}   -8.08{col 46}{space 3}0.000{col 54}{space 4}-1.612324{col 67}{space 3}-.9827832
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2}  .456844{col 26}{space 2} .3404658{col 37}{space 1}    1.34{col 46}{space 3}0.180{col 54}{space 4}-.2105629{col 67}{space 3} 1.124251
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2}  .971089{col 26}{space 2}   .44142{col 37}{space 1}    2.20{col 46}{space 3}0.028{col 54}{space 4} .1057841{col 67}{space 3} 1.836394
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2} .0834141{col 26}{space 2} .1567741{col 37}{space 1}    0.53{col 46}{space 3}0.595{col 54}{space 4}-.2239064{col 67}{space 3} .3907345
{txt}{space 7}2015  {c |}{col 14}{res}{space 2} .0340535{col 26}{space 2} .1533108{col 37}{space 1}    0.22{col 46}{space 3}0.824{col 54}{space 4} -.266478{col 67}{space 3} .3345849
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0893062{col 26}{space 2} .1574213{col 37}{space 1}    0.57{col 46}{space 3}0.571{col 54}{space 4}-.2192829{col 67}{space 3} .3978953
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}  .124737{col 26}{space 2} .1524244{col 37}{space 1}    0.82{col 46}{space 3}0.413{col 54}{space 4} -.174057{col 67}{space 3} .4235309
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .2005657{col 26}{space 2} .2263955{col 37}{space 1}    0.89{col 46}{space 3}0.376{col 54}{space 4} -.243232{col 67}{space 3} .6443634
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2}-2.689313{col 26}{space 2} 2.223633{col 37}{space 1}   -1.21{col 46}{space 3}0.227{col 54}{space 4}-7.048249{col 67}{space 3} 1.669622
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-3.765458{col 26}{space 2} 2.208337{col 37}{space 1}   -1.71{col 46}{space 3}0.088{col 54}{space 4}-8.094409{col 67}{space 3} .5634927
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-2.496414{col 26}{space 2} 2.209214{col 37}{space 1}   -1.13{col 46}{space 3}0.259{col 54}{space 4}-6.827083{col 67}{space 3} 1.834256
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-2.498502{col 26}{space 2} 2.183284{col 37}{space 1}   -1.14{col 46}{space 3}0.253{col 54}{space 4}-6.778342{col 67}{space 3} 1.781338
{txt}{space 9}CO  {c |}{col 14}{res}{space 2} -2.58712{col 26}{space 2} 2.198695{col 37}{space 1}   -1.18{col 46}{space 3}0.239{col 54}{space 4}-6.897169{col 67}{space 3} 1.722928
{txt}{space 9}CT  {c |}{col 14}{res}{space 2} -3.30388{col 26}{space 2} 2.195171{col 37}{space 1}   -1.51{col 46}{space 3}0.132{col 54}{space 4}-7.607022{col 67}{space 3} .9992614
{txt}{space 9}DC  {c |}{col 14}{res}{space 2}-2.482628{col 26}{space 2} 2.331549{col 37}{space 1}   -1.06{col 46}{space 3}0.287{col 54}{space 4}-7.053107{col 67}{space 3} 2.087851
{txt}{space 9}DE  {c |}{col 14}{res}{space 2} -3.05593{col 26}{space 2} 2.424303{col 37}{space 1}   -1.26{col 46}{space 3}0.208{col 54}{space 4}-7.808234{col 67}{space 3} 1.696374
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-2.374984{col 26}{space 2} 2.191561{col 37}{space 1}   -1.08{col 46}{space 3}0.279{col 54}{space 4}-6.671048{col 67}{space 3} 1.921081
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-2.905375{col 26}{space 2} 2.197655{col 37}{space 1}   -1.32{col 46}{space 3}0.186{col 54}{space 4}-7.213386{col 67}{space 3} 1.402636
{txt}{space 9}HI  {c |}{col 14}{res}{space 2}-2.712205{col 26}{space 2} 2.337323{col 37}{space 1}   -1.16{col 46}{space 3}0.246{col 54}{space 4}-7.294003{col 67}{space 3} 1.869594
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-3.433431{col 26}{space 2} 2.213055{col 37}{space 1}   -1.55{col 46}{space 3}0.121{col 54}{space 4}-7.771629{col 67}{space 3} .9047674
{txt}{space 9}ID  {c |}{col 14}{res}{space 2}-3.546858{col 26}{space 2} 2.210308{col 37}{space 1}   -1.60{col 46}{space 3}0.109{col 54}{space 4}-7.879672{col 67}{space 3} .7859551
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-2.911328{col 26}{space 2} 2.189178{col 37}{space 1}   -1.33{col 46}{space 3}0.184{col 54}{space 4}-7.202721{col 67}{space 3} 1.380065
{txt}{space 9}IN  {c |}{col 14}{res}{space 2}-2.755115{col 26}{space 2} 2.201285{col 37}{space 1}   -1.25{col 46}{space 3}0.211{col 54}{space 4}-7.070241{col 67}{space 3} 1.560011
{txt}{space 9}KS  {c |}{col 14}{res}{space 2} -2.85617{col 26}{space 2} 2.217092{col 37}{space 1}   -1.29{col 46}{space 3}0.198{col 54}{space 4}-7.202283{col 67}{space 3} 1.489943
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-3.268736{col 26}{space 2}   2.2125{col 37}{space 1}   -1.48{col 46}{space 3}0.140{col 54}{space 4}-7.605848{col 67}{space 3} 1.068376
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-1.064165{col 26}{space 2} 2.312535{col 37}{space 1}   -0.46{col 46}{space 3}0.645{col 54}{space 4}-5.597372{col 67}{space 3} 3.469043
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-2.556276{col 26}{space 2} 2.200383{col 37}{space 1}   -1.16{col 46}{space 3}0.245{col 54}{space 4}-6.869633{col 67}{space 3} 1.757082
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-2.895625{col 26}{space 2} 2.200247{col 37}{space 1}   -1.32{col 46}{space 3}0.188{col 54}{space 4}-7.208718{col 67}{space 3} 1.417467
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-2.729371{col 26}{space 2} 2.253408{col 37}{space 1}   -1.21{col 46}{space 3}0.226{col 54}{space 4}-7.146672{col 67}{space 3}  1.68793
{txt}{space 9}MI  {c |}{col 14}{res}{space 2}-3.039488{col 26}{space 2} 2.188396{col 37}{space 1}   -1.39{col 46}{space 3}0.165{col 54}{space 4}-7.329348{col 67}{space 3} 1.250373
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-2.923382{col 26}{space 2} 2.196852{col 37}{space 1}   -1.33{col 46}{space 3}0.183{col 54}{space 4}-7.229819{col 67}{space 3} 1.383055
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-2.870448{col 26}{space 2} 2.198339{col 37}{space 1}   -1.31{col 46}{space 3}0.192{col 54}{space 4}-7.179799{col 67}{space 3} 1.438903
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-2.172236{col 26}{space 2} 2.330258{col 37}{space 1}   -0.93{col 46}{space 3}0.351{col 54}{space 4}-6.740185{col 67}{space 3} 2.395712
{txt}{space 9}MT  {c |}{col 14}{res}{space 2}-3.253091{col 26}{space 2} 2.278875{col 37}{space 1}   -1.43{col 46}{space 3}0.153{col 54}{space 4}-7.720315{col 67}{space 3} 1.214132
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-2.429564{col 26}{space 2} 2.197654{col 37}{space 1}   -1.11{col 46}{space 3}0.269{col 54}{space 4}-6.737574{col 67}{space 3} 1.878445
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-2.292694{col 26}{space 2} 2.293591{col 37}{space 1}   -1.00{col 46}{space 3}0.318{col 54}{space 4}-6.788766{col 67}{space 3} 2.203378
{txt}{space 9}NE  {c |}{col 14}{res}{space 2}-3.229157{col 26}{space 2} 2.207981{col 37}{space 1}   -1.46{col 46}{space 3}0.144{col 54}{space 4}-7.557409{col 67}{space 3} 1.099095
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-3.537255{col 26}{space 2} 2.224108{col 37}{space 1}   -1.59{col 46}{space 3}0.112{col 54}{space 4}-7.897122{col 67}{space 3} .8226106
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-2.387782{col 26}{space 2} 2.195987{col 37}{space 1}   -1.09{col 46}{space 3}0.277{col 54}{space 4}-6.692522{col 67}{space 3} 1.916958
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-2.948377{col 26}{space 2} 2.289547{col 37}{space 1}   -1.29{col 46}{space 3}0.198{col 54}{space 4}-7.436521{col 67}{space 3} 1.539766
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}-2.611126{col 26}{space 2} 2.229297{col 37}{space 1}   -1.17{col 46}{space 3}0.242{col 54}{space 4}-6.981165{col 67}{space 3} 1.758912
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-2.582449{col 26}{space 2} 2.186292{col 37}{space 1}   -1.18{col 46}{space 3}0.238{col 54}{space 4}-6.868186{col 67}{space 3} 1.703288
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-3.135361{col 26}{space 2} 2.187579{col 37}{space 1}   -1.43{col 46}{space 3}0.152{col 54}{space 4}-7.423621{col 67}{space 3} 1.152898
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-.7258315{col 26}{space 2} 2.270991{col 37}{space 1}   -0.32{col 46}{space 3}0.749{col 54}{space 4}-5.177601{col 67}{space 3} 3.725937
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-3.282295{col 26}{space 2}  2.21042{col 37}{space 1}   -1.48{col 46}{space 3}0.138{col 54}{space 4}-7.615329{col 67}{space 3} 1.050738
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-3.030133{col 26}{space 2} 2.186186{col 37}{space 1}   -1.39{col 46}{space 3}0.166{col 54}{space 4}-7.315661{col 67}{space 3} 1.255394
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-2.062888{col 26}{space 2} 2.333544{col 37}{space 1}   -0.88{col 46}{space 3}0.377{col 54}{space 4}-6.637279{col 67}{space 3} 2.511504
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-2.799968{col 26}{space 2} 2.213824{col 37}{space 1}   -1.26{col 46}{space 3}0.206{col 54}{space 4}-7.139673{col 67}{space 3} 1.539738
{txt}{space 9}SD  {c |}{col 14}{res}{space 2}-3.378714{col 26}{space 2} 2.229434{col 37}{space 1}   -1.52{col 46}{space 3}0.130{col 54}{space 4}-7.749019{col 67}{space 3} .9915917
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-2.869754{col 26}{space 2} 2.195502{col 37}{space 1}   -1.31{col 46}{space 3}0.191{col 54}{space 4}-7.173543{col 67}{space 3} 1.434036
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-2.153483{col 26}{space 2} 2.187964{col 37}{space 1}   -0.98{col 46}{space 3}0.325{col 54}{space 4}-6.442497{col 67}{space 3} 2.135531
{txt}{space 9}UT  {c |}{col 14}{res}{space 2} -2.59046{col 26}{space 2} 2.247117{col 37}{space 1}   -1.15{col 46}{space 3}0.249{col 54}{space 4}-6.995429{col 67}{space 3} 1.814509
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}-2.505418{col 26}{space 2} 2.204575{col 37}{space 1}   -1.14{col 46}{space 3}0.256{col 54}{space 4}-6.826993{col 67}{space 3} 1.816157
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}-4.194487{col 26}{space 2} 2.201504{col 37}{space 1}   -1.91{col 46}{space 3}0.057{col 54}{space 4}-8.510042{col 67}{space 3} .1210689
{txt}{space 9}WA  {c |}{col 14}{res}{space 2}-3.081375{col 26}{space 2} 2.192303{col 37}{space 1}   -1.41{col 46}{space 3}0.160{col 54}{space 4}-7.378895{col 67}{space 3} 1.216146
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-3.368993{col 26}{space 2} 2.187993{col 37}{space 1}   -1.54{col 46}{space 3}0.124{col 54}{space 4}-7.658063{col 67}{space 3} .9200768
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-3.118574{col 26}{space 2} 2.247856{col 37}{space 1}   -1.39{col 46}{space 3}0.165{col 54}{space 4}-7.524993{col 67}{space 3} 1.287844
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-3.791227{col 26}{space 2} 2.247059{col 37}{space 1}   -1.69{col 46}{space 3}0.092{col 54}{space 4}-8.196083{col 67}{space 3} .6136296
{txt}{space 12} {c |}
{space 7}2.Q33 {c |}{col 14}{res}{space 2} .3142341{col 26}{space 2} .0999621{col 37}{space 1}    3.14{col 46}{space 3}0.002{col 54}{space 4} .1182808{col 67}{space 3} .5101874
{txt}{space 7}2.Q34 {c |}{col 14}{res}{space 2}-.9698677{col 26}{space 2}   .23712{col 37}{space 1}   -4.09{col 46}{space 3}0.000{col 54}{space 4}-1.434688{col 67}{space 3}-.5050469
{txt}{space 7}Q35_1 {c |}{col 14}{res}{space 2}-.9489161{col 26}{space 2} .3333594{col 37}{space 1}   -2.85{col 46}{space 3}0.004{col 54}{space 4}-1.602392{col 67}{space 3}-.2954397
{txt}{space 7}Q35_2 {c |}{col 14}{res}{space 2}  1.16003{col 26}{space 2} .3624073{col 37}{space 1}    3.20{col 46}{space 3}0.001{col 54}{space 4} .4496119{col 67}{space 3} 1.870449
{txt}{space 7}Q35_3 {c |}{col 14}{res}{space 2} -.348914{col 26}{space 2} .3527972{col 37}{space 1}   -0.99{col 46}{space 3}0.323{col 54}{space 4}-1.040494{col 67}{space 3}  .342666
{txt}{space 7}Q35_4 {c |}{col 14}{res}{space 2}-.6732797{col 26}{space 2} .3647534{col 37}{space 1}   -1.85{col 46}{space 3}0.065{col 54}{space 4}-1.388297{col 67}{space 3} .0417376
{txt}{space 7}Q35_5 {c |}{col 14}{res}{space 2} .2906089{col 26}{space 2} .8314675{col 37}{space 1}    0.35{col 46}{space 3}0.727{col 54}{space 4}-1.339297{col 67}{space 3} 1.920515
{txt}{space 7}Q35_6 {c |}{col 14}{res}{space 2} -.221144{col 26}{space 2} .3825476{col 37}{space 1}   -0.58{col 46}{space 3}0.563{col 54}{space 4}-.9710429{col 67}{space 3}  .528755
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  9.06356{col 26}{space 2} 2.276258{col 37}{space 1}    3.98{col 46}{space 3}0.000{col 54}{space 4} 4.601466{col 67}{space 3} 13.52565
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est5{txt} stored)

Linear regression                                      Number of obs ={res}    6368
                                                       {txt}F( 75,  6292) ={res}    5.05
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.1031
                                                       {txt}Root MSE      = {res} 3.8527

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     Q24_iqr{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2} .1259737{col 26}{space 2} .2940027{col 37}{space 1}    0.43{col 46}{space 3}0.668{col 54}{space 4}-.4503718{col 67}{space 3} .7023193
{txt}{space 8}Old  {c |}{col 14}{res}{space 2}  .441371{col 26}{space 2} .4414236{col 37}{space 1}    1.00{col 46}{space 3}0.317{col 54}{space 4}-.4239698{col 67}{space 3} 1.306712
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2}-.9125616{col 26}{space 2} .2496098{col 37}{space 1}   -3.66{col 46}{space 3}0.000{col 54}{space 4}-1.401882{col 67}{space 3}-.4232413
{txt}High Educ..  {c |}{col 14}{res}{space 2}-1.578612{col 26}{space 2} .2375576{col 37}{space 1}   -6.65{col 46}{space 3}0.000{col 54}{space 4}-2.044306{col 67}{space 3}-1.112918
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2}-1.072035{col 26}{space 2} .1768905{col 37}{space 1}   -6.06{col 46}{space 3}0.000{col 54}{space 4}  -1.4188{col 67}{space 3}-.7252691
{txt}High Income  {c |}{col 14}{res}{space 2}-1.122256{col 26}{space 2} .1684865{col 37}{space 1}   -6.66{col 46}{space 3}0.000{col 54}{space 4}-1.452547{col 67}{space 3}-.7919647
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2} .5221492{col 26}{space 2} .3316759{col 37}{space 1}    1.57{col 46}{space 3}0.115{col 54}{space 4}-.1280486{col 67}{space 3} 1.172347
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2}  1.27218{col 26}{space 2} .4449697{col 37}{space 1}    2.86{col 46}{space 3}0.004{col 54}{space 4}  .399888{col 67}{space 3} 2.144473
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2}-.0375969{col 26}{space 2} .1552153{col 37}{space 1}   -0.24{col 46}{space 3}0.809{col 54}{space 4}-.3418719{col 67}{space 3} .2666781
{txt}{space 7}2015  {c |}{col 14}{res}{space 2}-.0603083{col 26}{space 2} .1561535{col 37}{space 1}   -0.39{col 46}{space 3}0.699{col 54}{space 4}-.3664225{col 67}{space 3} .2458059
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.1925543{col 26}{space 2} .1543864{col 37}{space 1}   -1.25{col 46}{space 3}0.212{col 54}{space 4}-.4952044{col 67}{space 3} .1100957
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0130855{col 26}{space 2} .1497876{col 37}{space 1}   -0.09{col 46}{space 3}0.930{col 54}{space 4}-.3067202{col 67}{space 3} .2805492
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0114944{col 26}{space 2} .2259087{col 37}{space 1}   -0.05{col 46}{space 3}0.959{col 54}{space 4}-.4543524{col 67}{space 3} .4313636
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2}-2.664953{col 26}{space 2} 2.877615{col 37}{space 1}   -0.93{col 46}{space 3}0.354{col 54}{space 4}-8.306061{col 67}{space 3} 2.976154
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-3.940939{col 26}{space 2}  2.86457{col 37}{space 1}   -1.38{col 46}{space 3}0.169{col 54}{space 4}-9.556472{col 67}{space 3} 1.674594
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-2.738638{col 26}{space 2} 2.862409{col 37}{space 1}   -0.96{col 46}{space 3}0.339{col 54}{space 4}-8.349935{col 67}{space 3} 2.872659
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-2.663485{col 26}{space 2} 2.847194{col 37}{space 1}   -0.94{col 46}{space 3}0.350{col 54}{space 4}-8.244957{col 67}{space 3} 2.917988
{txt}{space 9}CO  {c |}{col 14}{res}{space 2}-3.072632{col 26}{space 2} 2.852706{col 37}{space 1}   -1.08{col 46}{space 3}0.281{col 54}{space 4}-8.664909{col 67}{space 3} 2.519646
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-3.351683{col 26}{space 2} 2.852085{col 37}{space 1}   -1.18{col 46}{space 3}0.240{col 54}{space 4}-8.942742{col 67}{space 3} 2.239377
{txt}{space 9}DC  {c |}{col 14}{res}{space 2}-2.269971{col 26}{space 2}  2.96709{col 37}{space 1}   -0.77{col 46}{space 3}0.444{col 54}{space 4}-8.086481{col 67}{space 3} 3.546538
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-2.798987{col 26}{space 2} 3.055657{col 37}{space 1}   -0.92{col 46}{space 3}0.360{col 54}{space 4}-8.789117{col 67}{space 3} 3.191142
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-2.652676{col 26}{space 2} 2.851638{col 37}{space 1}   -0.93{col 46}{space 3}0.352{col 54}{space 4} -8.24286{col 67}{space 3} 2.937508
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-3.027641{col 26}{space 2} 2.855072{col 37}{space 1}   -1.06{col 46}{space 3}0.289{col 54}{space 4}-8.624556{col 67}{space 3} 2.569274
{txt}{space 9}HI  {c |}{col 14}{res}{space 2}-3.761531{col 26}{space 2} 2.909692{col 37}{space 1}   -1.29{col 46}{space 3}0.196{col 54}{space 4} -9.46552{col 67}{space 3} 1.942458
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-3.209204{col 26}{space 2} 2.868245{col 37}{space 1}   -1.12{col 46}{space 3}0.263{col 54}{space 4}-8.831943{col 67}{space 3} 2.413535
{txt}{space 9}ID  {c |}{col 14}{res}{space 2}-3.482727{col 26}{space 2} 2.869264{col 37}{space 1}   -1.21{col 46}{space 3}0.225{col 54}{space 4}-9.107463{col 67}{space 3} 2.142009
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-3.157084{col 26}{space 2} 2.849129{col 37}{space 1}   -1.11{col 46}{space 3}0.268{col 54}{space 4}-8.742349{col 67}{space 3} 2.428181
{txt}{space 9}IN  {c |}{col 14}{res}{space 2}-2.716726{col 26}{space 2} 2.863232{col 37}{space 1}   -0.95{col 46}{space 3}0.343{col 54}{space 4}-8.329638{col 67}{space 3} 2.896186
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-2.651564{col 26}{space 2} 2.876248{col 37}{space 1}   -0.92{col 46}{space 3}0.357{col 54}{space 4}-8.289992{col 67}{space 3} 2.986864
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-3.272427{col 26}{space 2} 2.870609{col 37}{space 1}   -1.14{col 46}{space 3}0.254{col 54}{space 4}  -8.8998{col 67}{space 3} 2.354946
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-1.608469{col 26}{space 2} 2.948433{col 37}{space 1}   -0.55{col 46}{space 3}0.585{col 54}{space 4}-7.388403{col 67}{space 3} 4.171465
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-2.594539{col 26}{space 2}  2.85802{col 37}{space 1}   -0.91{col 46}{space 3}0.364{col 54}{space 4}-8.197232{col 67}{space 3} 3.008154
{txt}{space 9}MD  {c |}{col 14}{res}{space 2} -2.97612{col 26}{space 2} 2.859844{col 37}{space 1}   -1.04{col 46}{space 3}0.298{col 54}{space 4} -8.58239{col 67}{space 3}  2.63015
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-3.000277{col 26}{space 2} 2.877524{col 37}{space 1}   -1.04{col 46}{space 3}0.297{col 54}{space 4}-8.641205{col 67}{space 3} 2.640652
{txt}{space 9}MI  {c |}{col 14}{res}{space 2}-2.995027{col 26}{space 2} 2.849476{col 37}{space 1}   -1.05{col 46}{space 3}0.293{col 54}{space 4}-8.580972{col 67}{space 3} 2.590917
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-3.237076{col 26}{space 2} 2.852938{col 37}{space 1}   -1.13{col 46}{space 3}0.257{col 54}{space 4}-8.829808{col 67}{space 3} 2.355655
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-3.180204{col 26}{space 2}  2.85715{col 37}{space 1}   -1.11{col 46}{space 3}0.266{col 54}{space 4}-8.781193{col 67}{space 3} 2.420784
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-2.332504{col 26}{space 2} 2.972724{col 37}{space 1}   -0.78{col 46}{space 3}0.433{col 54}{space 4}-8.160056{col 67}{space 3} 3.495049
{txt}{space 9}MT  {c |}{col 14}{res}{space 2}-3.241038{col 26}{space 2} 2.924778{col 37}{space 1}   -1.11{col 46}{space 3}0.268{col 54}{space 4}  -8.9746{col 67}{space 3} 2.492523
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-2.778322{col 26}{space 2} 2.855538{col 37}{space 1}   -0.97{col 46}{space 3}0.331{col 54}{space 4} -8.37615{col 67}{space 3} 2.819507
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-2.179484{col 26}{space 2} 2.945782{col 37}{space 1}   -0.74{col 46}{space 3}0.459{col 54}{space 4}-7.954221{col 67}{space 3} 3.595253
{txt}{space 9}NE  {c |}{col 14}{res}{space 2}-2.882155{col 26}{space 2} 2.866632{col 37}{space 1}   -1.01{col 46}{space 3}0.315{col 54}{space 4}-8.501732{col 67}{space 3} 2.737423
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-3.660872{col 26}{space 2} 2.876818{col 37}{space 1}   -1.27{col 46}{space 3}0.203{col 54}{space 4}-9.300417{col 67}{space 3} 1.978673
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-2.542546{col 26}{space 2} 2.857902{col 37}{space 1}   -0.89{col 46}{space 3}0.374{col 54}{space 4}-8.145008{col 67}{space 3} 3.059917
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-3.667885{col 26}{space 2} 2.905914{col 37}{space 1}   -1.26{col 46}{space 3}0.207{col 54}{space 4}-9.364467{col 67}{space 3} 2.028698
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}-2.492781{col 26}{space 2} 2.883429{col 37}{space 1}   -0.86{col 46}{space 3}0.387{col 54}{space 4}-8.145284{col 67}{space 3} 3.159723
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-2.900514{col 26}{space 2} 2.847241{col 37}{space 1}   -1.02{col 46}{space 3}0.308{col 54}{space 4}-8.482079{col 67}{space 3}  2.68105
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-3.199167{col 26}{space 2} 2.848071{col 37}{space 1}   -1.12{col 46}{space 3}0.261{col 54}{space 4}-8.782358{col 67}{space 3} 2.384025
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-1.172589{col 26}{space 2} 2.925607{col 37}{space 1}   -0.40{col 46}{space 3}0.689{col 54}{space 4}-6.907776{col 67}{space 3} 4.562598
{txt}{space 9}OR  {c |}{col 14}{res}{space 2} -3.80609{col 26}{space 2} 2.846226{col 37}{space 1}   -1.34{col 46}{space 3}0.181{col 54}{space 4}-9.385664{col 67}{space 3} 1.773484
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-3.092715{col 26}{space 2} 2.847766{col 37}{space 1}   -1.09{col 46}{space 3}0.278{col 54}{space 4}-8.675307{col 67}{space 3} 2.489878
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-1.917637{col 26}{space 2} 2.957594{col 37}{space 1}   -0.65{col 46}{space 3}0.517{col 54}{space 4} -7.71553{col 67}{space 3} 3.880256
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-3.281171{col 26}{space 2} 2.862979{col 37}{space 1}   -1.15{col 46}{space 3}0.252{col 54}{space 4}-8.893587{col 67}{space 3} 2.331244
{txt}{space 9}SD  {c |}{col 14}{res}{space 2}-3.668928{col 26}{space 2} 2.895526{col 37}{space 1}   -1.27{col 46}{space 3}0.205{col 54}{space 4}-9.345146{col 67}{space 3}  2.00729
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-2.901466{col 26}{space 2} 2.856193{col 37}{space 1}   -1.02{col 46}{space 3}0.310{col 54}{space 4}-8.500579{col 67}{space 3} 2.697647
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-2.480184{col 26}{space 2} 2.850159{col 37}{space 1}   -0.87{col 46}{space 3}0.384{col 54}{space 4}-8.067468{col 67}{space 3} 3.107101
{txt}{space 9}UT  {c |}{col 14}{res}{space 2}-2.605009{col 26}{space 2} 2.891518{col 37}{space 1}   -0.90{col 46}{space 3}0.368{col 54}{space 4}-8.273371{col 67}{space 3} 3.063352
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}-2.656504{col 26}{space 2} 2.859329{col 37}{space 1}   -0.93{col 46}{space 3}0.353{col 54}{space 4}-8.261765{col 67}{space 3} 2.948757
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}-3.824272{col 26}{space 2} 2.870566{col 37}{space 1}   -1.33{col 46}{space 3}0.183{col 54}{space 4}-9.451561{col 67}{space 3} 1.803017
{txt}{space 9}WA  {c |}{col 14}{res}{space 2}-3.252372{col 26}{space 2}  2.85209{col 37}{space 1}   -1.14{col 46}{space 3}0.254{col 54}{space 4}-8.843441{col 67}{space 3} 2.338696
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-3.254458{col 26}{space 2} 2.850333{col 37}{space 1}   -1.14{col 46}{space 3}0.254{col 54}{space 4}-8.842084{col 67}{space 3} 2.333167
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-2.842631{col 26}{space 2} 2.907248{col 37}{space 1}   -0.98{col 46}{space 3}0.328{col 54}{space 4}-8.541828{col 67}{space 3} 2.856565
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-3.898596{col 26}{space 2} 2.887835{col 37}{space 1}   -1.35{col 46}{space 3}0.177{col 54}{space 4}-9.559738{col 67}{space 3} 1.762546
{txt}{space 12} {c |}
{space 7}2.Q33 {c |}{col 14}{res}{space 2} .0967342{col 26}{space 2} .1015137{col 37}{space 1}    0.95{col 46}{space 3}0.341{col 54}{space 4}-.1022673{col 67}{space 3} .2957357
{txt}{space 7}2.Q34 {c |}{col 14}{res}{space 2}-.9704714{col 26}{space 2} .2356923{col 37}{space 1}   -4.12{col 46}{space 3}0.000{col 54}{space 4}-1.432509{col 67}{space 3}-.5084341
{txt}{space 7}Q35_1 {c |}{col 14}{res}{space 2}-1.318306{col 26}{space 2} .3132276{col 37}{space 1}   -4.21{col 46}{space 3}0.000{col 54}{space 4}-1.932339{col 67}{space 3}-.7042731
{txt}{space 7}Q35_2 {c |}{col 14}{res}{space 2} .8278985{col 26}{space 2} .3420822{col 37}{space 1}    2.42{col 46}{space 3}0.016{col 54}{space 4} .1573007{col 67}{space 3} 1.498496
{txt}{space 7}Q35_3 {c |}{col 14}{res}{space 2}  .057313{col 26}{space 2} .3753388{col 37}{space 1}    0.15{col 46}{space 3}0.879{col 54}{space 4}-.6784791{col 67}{space 3} .7931051
{txt}{space 7}Q35_4 {c |}{col 14}{res}{space 2}-.7401132{col 26}{space 2} .3574213{col 37}{space 1}   -2.07{col 46}{space 3}0.038{col 54}{space 4}-1.440781{col 67}{space 3}-.0394454
{txt}{space 7}Q35_5 {c |}{col 14}{res}{space 2}-.1015534{col 26}{space 2} .8161237{col 37}{space 1}   -0.12{col 46}{space 3}0.901{col 54}{space 4}-1.701434{col 67}{space 3} 1.498327
{txt}{space 7}Q35_6 {c |}{col 14}{res}{space 2}-.7464063{col 26}{space 2}  .350406{col 37}{space 1}   -2.13{col 46}{space 3}0.033{col 54}{space 4}-1.433322{col 67}{space 3}-.0594909
{txt}{space 7}Q4new {c |}{col 14}{res}{space 2} .0072716{col 26}{space 2} .0024977{col 37}{space 1}    2.91{col 46}{space 3}0.004{col 54}{space 4} .0023752{col 67}{space 3} .0121679
{txt}{space 7}Q6new {c |}{col 14}{res}{space 2} .0058291{col 26}{space 2} .0024458{col 37}{space 1}    2.38{col 46}{space 3}0.017{col 54}{space 4} .0010345{col 67}{space 3} .0106238
{txt}{space 5}Q9_mean {c |}{col 14}{res}{space 2}-.0889166{col 26}{space 2} .0133782{col 37}{space 1}   -6.65{col 46}{space 3}0.000{col 54}{space 4}-.1151425{col 67}{space 3}-.0626907
{txt}{space 6}Q13new {c |}{col 14}{res}{space 2} .0039636{col 26}{space 2} .0028167{col 37}{space 1}    1.41{col 46}{space 3}0.159{col 54}{space 4}-.0015582{col 67}{space 3} .0094854
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  8.85898{col 26}{space 2} 2.914592{col 37}{space 1}    3.04{col 46}{space 3}0.002{col 54}{space 4} 3.145386{col 67}{space 3} 14.57257
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est6{txt} stored)

Linear regression                                      Number of obs ={res}    6727
                                                       {txt}F( 63,  6663) ={res}    3.83
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0328
                                                       {txt}Root MSE      = {res} 2.4221

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}    Q24_mean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2}-.1732919{col 26}{space 2}  .158976{col 37}{space 1}   -1.09{col 46}{space 3}0.276{col 54}{space 4}-.4849358{col 67}{space 3} .1383521
{txt}{space 8}Old  {c |}{col 14}{res}{space 2}-.1382941{col 26}{space 2} .2331645{col 37}{space 1}   -0.59{col 46}{space 3}0.553{col 54}{space 4}-.5953712{col 67}{space 3}  .318783
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2} -.008656{col 26}{space 2} .1134372{col 37}{space 1}   -0.08{col 46}{space 3}0.939{col 54}{space 4}-.2310293{col 67}{space 3} .2137173
{txt}High Educ..  {c |}{col 14}{res}{space 2} .0778607{col 26}{space 2} .1105584{col 37}{space 1}    0.70{col 46}{space 3}0.481{col 54}{space 4}-.1388692{col 67}{space 3} .2945906
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2}-.1048402{col 26}{space 2} .0930626{col 37}{space 1}   -1.13{col 46}{space 3}0.260{col 54}{space 4}-.2872728{col 67}{space 3} .0775923
{txt}High Income  {c |}{col 14}{res}{space 2} .2494415{col 26}{space 2} .0919545{col 37}{space 1}    2.71{col 46}{space 3}0.007{col 54}{space 4} .0691812{col 67}{space 3} .4297018
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2} .0427292{col 26}{space 2} .1739954{col 37}{space 1}    0.25{col 46}{space 3}0.806{col 54}{space 4}-.2983574{col 67}{space 3} .3838159
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} .3955818{col 26}{space 2} .2400285{col 37}{space 1}    1.65{col 46}{space 3}0.099{col 54}{space 4}-.0749508{col 67}{space 3} .8661144
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2} .2742519{col 26}{space 2} .0974923{col 37}{space 1}    2.81{col 46}{space 3}0.005{col 54}{space 4} .0831357{col 67}{space 3}  .465368
{txt}{space 7}2015  {c |}{col 14}{res}{space 2} .2262488{col 26}{space 2} .0948994{col 37}{space 1}    2.38{col 46}{space 3}0.017{col 54}{space 4} .0402155{col 67}{space 3}  .412282
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1296128{col 26}{space 2}  .094269{col 37}{space 1}    1.37{col 46}{space 3}0.169{col 54}{space 4}-.0551846{col 67}{space 3} .3144102
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}  .313134{col 26}{space 2} .0950431{col 37}{space 1}    3.29{col 46}{space 3}0.001{col 54}{space 4} .1268191{col 67}{space 3} .4994488
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .2851835{col 26}{space 2} .1284879{col 37}{space 1}    2.22{col 46}{space 3}0.026{col 54}{space 4} .0333061{col 67}{space 3}  .537061
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2} .0501806{col 26}{space 2} 1.254591{col 37}{space 1}    0.04{col 46}{space 3}0.968{col 54}{space 4} -2.40922{col 67}{space 3} 2.509581
{txt}{space 9}AR  {c |}{col 14}{res}{space 2} .0150297{col 26}{space 2} 1.277871{col 37}{space 1}    0.01{col 46}{space 3}0.991{col 54}{space 4}-2.490006{col 67}{space 3} 2.520066
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}  .223147{col 26}{space 2}  1.24636{col 37}{space 1}    0.18{col 46}{space 3}0.858{col 54}{space 4}-2.220118{col 67}{space 3} 2.666412
{txt}{space 9}CA  {c |}{col 14}{res}{space 2} .3288438{col 26}{space 2} 1.229732{col 37}{space 1}    0.27{col 46}{space 3}0.789{col 54}{space 4}-2.081824{col 67}{space 3} 2.739512
{txt}{space 9}CO  {c |}{col 14}{res}{space 2} .1818542{col 26}{space 2} 1.242711{col 37}{space 1}    0.15{col 46}{space 3}0.884{col 54}{space 4}-2.254257{col 67}{space 3} 2.617965
{txt}{space 9}CT  {c |}{col 14}{res}{space 2} -.024447{col 26}{space 2} 1.253113{col 37}{space 1}   -0.02{col 46}{space 3}0.984{col 54}{space 4}-2.480949{col 67}{space 3} 2.432055
{txt}{space 9}DC  {c |}{col 14}{res}{space 2} .4879277{col 26}{space 2} 1.312798{col 37}{space 1}    0.37{col 46}{space 3}0.710{col 54}{space 4}-2.085577{col 67}{space 3} 3.061432
{txt}{space 9}DE  {c |}{col 14}{res}{space 2} .7799998{col 26}{space 2} 1.367939{col 37}{space 1}    0.57{col 46}{space 3}0.569{col 54}{space 4}-1.901599{col 67}{space 3} 3.461599
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-.0931065{col 26}{space 2} 1.231883{col 37}{space 1}   -0.08{col 46}{space 3}0.940{col 54}{space 4}-2.507991{col 67}{space 3} 2.321778
{txt}{space 9}GA  {c |}{col 14}{res}{space 2} .0178891{col 26}{space 2} 1.237838{col 37}{space 1}    0.01{col 46}{space 3}0.988{col 54}{space 4} -2.40867{col 67}{space 3} 2.444448
{txt}{space 9}HI  {c |}{col 14}{res}{space 2} .5864005{col 26}{space 2} 1.381671{col 37}{space 1}    0.42{col 46}{space 3}0.671{col 54}{space 4}-2.122116{col 67}{space 3} 3.294917
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-.3020508{col 26}{space 2} 1.244807{col 37}{space 1}   -0.24{col 46}{space 3}0.808{col 54}{space 4}-2.742272{col 67}{space 3}  2.13817
{txt}{space 9}ID  {c |}{col 14}{res}{space 2} .3755184{col 26}{space 2} 1.283952{col 37}{space 1}    0.29{col 46}{space 3}0.770{col 54}{space 4}-2.141439{col 67}{space 3} 2.892476
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-.0798297{col 26}{space 2} 1.231553{col 37}{space 1}   -0.06{col 46}{space 3}0.948{col 54}{space 4}-2.494068{col 67}{space 3} 2.334409
{txt}{space 9}IN  {c |}{col 14}{res}{space 2} .0383315{col 26}{space 2} 1.240535{col 37}{space 1}    0.03{col 46}{space 3}0.975{col 54}{space 4}-2.393513{col 67}{space 3} 2.470176
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-.4752033{col 26}{space 2} 1.254386{col 37}{space 1}   -0.38{col 46}{space 3}0.705{col 54}{space 4}-2.934201{col 67}{space 3} 1.983795
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-.5998899{col 26}{space 2} 1.247174{col 37}{space 1}   -0.48{col 46}{space 3}0.631{col 54}{space 4} -3.04475{col 67}{space 3} 1.844971
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-.0470097{col 26}{space 2} 1.263765{col 37}{space 1}   -0.04{col 46}{space 3}0.970{col 54}{space 4}-2.524394{col 67}{space 3} 2.430375
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}   .19756{col 26}{space 2} 1.236288{col 37}{space 1}    0.16{col 46}{space 3}0.873{col 54}{space 4} -2.22596{col 67}{space 3}  2.62108
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-.2293241{col 26}{space 2} 1.239364{col 37}{space 1}   -0.19{col 46}{space 3}0.853{col 54}{space 4}-2.658874{col 67}{space 3} 2.200226
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-.0967853{col 26}{space 2} 1.279908{col 37}{space 1}   -0.08{col 46}{space 3}0.940{col 54}{space 4}-2.605815{col 67}{space 3} 2.412244
{txt}{space 9}MI  {c |}{col 14}{res}{space 2} .0011522{col 26}{space 2} 1.235113{col 37}{space 1}    0.00{col 46}{space 3}0.999{col 54}{space 4}-2.420065{col 67}{space 3} 2.422369
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-.1082272{col 26}{space 2} 1.239298{col 37}{space 1}   -0.09{col 46}{space 3}0.930{col 54}{space 4}-2.537649{col 67}{space 3} 2.321194
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-.0422425{col 26}{space 2} 1.241532{col 37}{space 1}   -0.03{col 46}{space 3}0.973{col 54}{space 4}-2.476043{col 67}{space 3} 2.391558
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-.2652936{col 26}{space 2} 1.275568{col 37}{space 1}   -0.21{col 46}{space 3}0.835{col 54}{space 4}-2.765815{col 67}{space 3} 2.235228
{txt}{space 9}MT  {c |}{col 14}{res}{space 2} .1120563{col 26}{space 2}  1.35832{col 37}{space 1}    0.08{col 46}{space 3}0.934{col 54}{space 4}-2.550685{col 67}{space 3} 2.774798
{txt}{space 9}NC  {c |}{col 14}{res}{space 2} .2958365{col 26}{space 2} 1.238269{col 37}{space 1}    0.24{col 46}{space 3}0.811{col 54}{space 4}-2.131567{col 67}{space 3}  2.72324
{txt}{space 9}ND  {c |}{col 14}{res}{space 2} .2216058{col 26}{space 2} 1.384609{col 37}{space 1}    0.16{col 46}{space 3}0.873{col 54}{space 4}-2.492671{col 67}{space 3} 2.935882
{txt}{space 9}NE  {c |}{col 14}{res}{space 2} .1427132{col 26}{space 2} 1.257184{col 37}{space 1}    0.11{col 46}{space 3}0.910{col 54}{space 4}-2.321771{col 67}{space 3} 2.607197
{txt}{space 9}NH  {c |}{col 14}{res}{space 2} -.314905{col 26}{space 2} 1.276542{col 37}{space 1}   -0.25{col 46}{space 3}0.805{col 54}{space 4}-2.817336{col 67}{space 3} 2.187526
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-.2580835{col 26}{space 2} 1.234331{col 37}{space 1}   -0.21{col 46}{space 3}0.834{col 54}{space 4}-2.677767{col 67}{space 3}   2.1616
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-1.058516{col 26}{space 2} 1.286225{col 37}{space 1}   -0.82{col 46}{space 3}0.411{col 54}{space 4}-3.579927{col 67}{space 3} 1.462896
{txt}{space 9}NV  {c |}{col 14}{res}{space 2} .9253142{col 26}{space 2} 1.290755{col 37}{space 1}    0.72{col 46}{space 3}0.473{col 54}{space 4}-1.604978{col 67}{space 3} 3.455606
{txt}{space 9}NY  {c |}{col 14}{res}{space 2} .0047239{col 26}{space 2} 1.230947{col 37}{space 1}    0.00{col 46}{space 3}0.997{col 54}{space 4}-2.408326{col 67}{space 3} 2.417774
{txt}{space 9}OH  {c |}{col 14}{res}{space 2} .0511413{col 26}{space 2} 1.232648{col 37}{space 1}    0.04{col 46}{space 3}0.967{col 54}{space 4}-2.365244{col 67}{space 3} 2.467526
{txt}{space 9}OK  {c |}{col 14}{res}{space 2} .3044028{col 26}{space 2}   1.2735{col 37}{space 1}    0.24{col 46}{space 3}0.811{col 54}{space 4}-2.192065{col 67}{space 3} 2.800871
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-.1489258{col 26}{space 2} 1.242398{col 37}{space 1}   -0.12{col 46}{space 3}0.905{col 54}{space 4}-2.584424{col 67}{space 3} 2.286572
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-.3145928{col 26}{space 2}   1.2299{col 37}{space 1}   -0.26{col 46}{space 3}0.798{col 54}{space 4} -2.72559{col 67}{space 3} 2.096405
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-.1399922{col 26}{space 2} 1.303268{col 37}{space 1}   -0.11{col 46}{space 3}0.914{col 54}{space 4}-2.694815{col 67}{space 3} 2.414831
{txt}{space 9}SC  {c |}{col 14}{res}{space 2} .5020682{col 26}{space 2} 1.266574{col 37}{space 1}    0.40{col 46}{space 3}0.692{col 54}{space 4}-1.980822{col 67}{space 3} 2.984959
{txt}{space 9}SD  {c |}{col 14}{res}{space 2} 2.069557{col 26}{space 2} 1.441316{col 37}{space 1}    1.44{col 46}{space 3}0.151{col 54}{space 4}-.7558842{col 67}{space 3} 4.894999
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-.0406702{col 26}{space 2} 1.243926{col 37}{space 1}   -0.03{col 46}{space 3}0.974{col 54}{space 4}-2.479163{col 67}{space 3} 2.397823
{txt}{space 9}TX  {c |}{col 14}{res}{space 2} .3798952{col 26}{space 2} 1.230485{col 37}{space 1}    0.31{col 46}{space 3}0.758{col 54}{space 4} -2.03225{col 67}{space 3}  2.79204
{txt}{space 9}UT  {c |}{col 14}{res}{space 2} .2403412{col 26}{space 2} 1.270383{col 37}{space 1}    0.19{col 46}{space 3}0.850{col 54}{space 4}-2.250016{col 67}{space 3} 2.730698
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}-.0000995{col 26}{space 2}  1.23816{col 37}{space 1}   -0.00{col 46}{space 3}1.000{col 54}{space 4}-2.427289{col 67}{space 3}  2.42709
{txt}{space 9}VT  {c |}{col 14}{res}{space 2} .7902767{col 26}{space 2} 1.310396{col 37}{space 1}    0.60{col 46}{space 3}0.546{col 54}{space 4}-1.778518{col 67}{space 3} 3.359072
{txt}{space 9}WA  {c |}{col 14}{res}{space 2} .2185384{col 26}{space 2} 1.239908{col 37}{space 1}    0.18{col 46}{space 3}0.860{col 54}{space 4}-2.212078{col 67}{space 3} 2.649155
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-.0310408{col 26}{space 2} 1.240808{col 37}{space 1}   -0.03{col 46}{space 3}0.980{col 54}{space 4}-2.463422{col 67}{space 3}  2.40134
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-.0152829{col 26}{space 2} 1.320699{col 37}{space 1}   -0.01{col 46}{space 3}0.991{col 54}{space 4}-2.604275{col 67}{space 3} 2.573709
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-1.044332{col 26}{space 2} 1.269332{col 37}{space 1}   -0.82{col 46}{space 3}0.411{col 54}{space 4}-3.532629{col 67}{space 3} 1.443965
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.498446{col 26}{space 2} 1.252194{col 37}{space 1}    2.00{col 46}{space 3}0.046{col 54}{space 4} .0437441{col 67}{space 3} 4.953148
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est7{txt} stored)

Linear regression                                      Number of obs ={res}    6725
                                                       {txt}F( 71,  6653) ={res}    3.77
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0373
                                                       {txt}Root MSE      = {res} 2.4181

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}    Q24_mean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2}-.1925971{col 26}{space 2} .1580524{col 37}{space 1}   -1.22{col 46}{space 3}0.223{col 54}{space 4}-.5024304{col 67}{space 3} .1172362
{txt}{space 8}Old  {c |}{col 14}{res}{space 2}-.1936899{col 26}{space 2} .2335646{col 37}{space 1}   -0.83{col 46}{space 3}0.407{col 54}{space 4}-.6515514{col 67}{space 3} .2641716
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2} .0112103{col 26}{space 2} .1138366{col 37}{space 1}    0.10{col 46}{space 3}0.922{col 54}{space 4} -.211946{col 67}{space 3} .2343666
{txt}High Educ..  {c |}{col 14}{res}{space 2} .0870215{col 26}{space 2} .1108398{col 37}{space 1}    0.79{col 46}{space 3}0.432{col 54}{space 4}  -.13026{col 67}{space 3} .3043031
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2}-.1272627{col 26}{space 2} .0931253{col 37}{space 1}   -1.37{col 46}{space 3}0.172{col 54}{space 4}-.3098182{col 67}{space 3} .0552928
{txt}High Income  {c |}{col 14}{res}{space 2} .1853048{col 26}{space 2} .0935315{col 37}{space 1}    1.98{col 46}{space 3}0.048{col 54}{space 4}  .001953{col 67}{space 3} .3686566
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2} .0334006{col 26}{space 2} .1749366{col 37}{space 1}    0.19{col 46}{space 3}0.849{col 54}{space 4}-.3095313{col 67}{space 3} .3763325
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} .3697166{col 26}{space 2} .2399965{col 37}{space 1}    1.54{col 46}{space 3}0.123{col 54}{space 4}-.1007536{col 67}{space 3} .8401867
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2}  .267166{col 26}{space 2} .0973894{col 37}{space 1}    2.74{col 46}{space 3}0.006{col 54}{space 4} .0762515{col 67}{space 3} .4580805
{txt}{space 7}2015  {c |}{col 14}{res}{space 2} .2324746{col 26}{space 2} .0947657{col 37}{space 1}    2.45{col 46}{space 3}0.014{col 54}{space 4} .0467034{col 67}{space 3} .4182459
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}  .138707{col 26}{space 2} .0942626{col 37}{space 1}    1.47{col 46}{space 3}0.141{col 54}{space 4}-.0460778{col 67}{space 3} .3234918
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .3183792{col 26}{space 2} .0951692{col 37}{space 1}    3.35{col 46}{space 3}0.001{col 54}{space 4} .1318171{col 67}{space 3} .5049412
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .2929416{col 26}{space 2}  .128001{col 37}{space 1}    2.29{col 46}{space 3}0.022{col 54}{space 4} .0420187{col 67}{space 3} .5438645
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2}  .136778{col 26}{space 2} 1.225665{col 37}{space 1}    0.11{col 46}{space 3}0.911{col 54}{space 4}-2.265919{col 67}{space 3} 2.539475
{txt}{space 9}AR  {c |}{col 14}{res}{space 2} .0908924{col 26}{space 2} 1.249031{col 37}{space 1}    0.07{col 46}{space 3}0.942{col 54}{space 4}-2.357608{col 67}{space 3} 2.539393
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2} .3325091{col 26}{space 2} 1.217103{col 37}{space 1}    0.27{col 46}{space 3}0.785{col 54}{space 4}-2.053402{col 67}{space 3}  2.71842
{txt}{space 9}CA  {c |}{col 14}{res}{space 2} .4025268{col 26}{space 2}  1.19974{col 37}{space 1}    0.34{col 46}{space 3}0.737{col 54}{space 4}-1.949348{col 67}{space 3} 2.754402
{txt}{space 9}CO  {c |}{col 14}{res}{space 2} .2568945{col 26}{space 2}  1.21277{col 37}{space 1}    0.21{col 46}{space 3}0.832{col 54}{space 4}-2.120523{col 67}{space 3} 2.634312
{txt}{space 9}CT  {c |}{col 14}{res}{space 2} .0783872{col 26}{space 2} 1.223338{col 37}{space 1}    0.06{col 46}{space 3}0.949{col 54}{space 4}-2.319748{col 67}{space 3} 2.476523
{txt}{space 9}DC  {c |}{col 14}{res}{space 2} .5813034{col 26}{space 2}   1.2862{col 37}{space 1}    0.45{col 46}{space 3}0.651{col 54}{space 4}-1.940061{col 67}{space 3} 3.102668
{txt}{space 9}DE  {c |}{col 14}{res}{space 2} .8518658{col 26}{space 2} 1.340333{col 37}{space 1}    0.64{col 46}{space 3}0.525{col 54}{space 4}-1.775616{col 67}{space 3} 3.479348
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-.0069966{col 26}{space 2} 1.201809{col 37}{space 1}   -0.01{col 46}{space 3}0.995{col 54}{space 4}-2.362927{col 67}{space 3} 2.348934
{txt}{space 9}GA  {c |}{col 14}{res}{space 2} .0786888{col 26}{space 2} 1.208888{col 37}{space 1}    0.07{col 46}{space 3}0.948{col 54}{space 4} -2.29112{col 67}{space 3} 2.448497
{txt}{space 9}HI  {c |}{col 14}{res}{space 2} .8366549{col 26}{space 2} 1.383964{col 37}{space 1}    0.60{col 46}{space 3}0.546{col 54}{space 4}-1.876357{col 67}{space 3} 3.549667
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-.2316091{col 26}{space 2} 1.214978{col 37}{space 1}   -0.19{col 46}{space 3}0.849{col 54}{space 4}-2.613355{col 67}{space 3} 2.150137
{txt}{space 9}ID  {c |}{col 14}{res}{space 2} .4460494{col 26}{space 2} 1.256162{col 37}{space 1}    0.36{col 46}{space 3}0.723{col 54}{space 4}-2.016431{col 67}{space 3}  2.90853
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-.0023361{col 26}{space 2} 1.201668{col 37}{space 1}   -0.00{col 46}{space 3}0.998{col 54}{space 4} -2.35799{col 67}{space 3} 2.353318
{txt}{space 9}IN  {c |}{col 14}{res}{space 2} .0949004{col 26}{space 2} 1.210947{col 37}{space 1}    0.08{col 46}{space 3}0.938{col 54}{space 4}-2.278943{col 67}{space 3} 2.468744
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-.3836898{col 26}{space 2} 1.225768{col 37}{space 1}   -0.31{col 46}{space 3}0.754{col 54}{space 4}-2.786587{col 67}{space 3} 2.019208
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-.5158963{col 26}{space 2} 1.217892{col 37}{space 1}   -0.42{col 46}{space 3}0.672{col 54}{space 4}-2.903355{col 67}{space 3} 1.871562
{txt}{space 9}LA  {c |}{col 14}{res}{space 2} .0162811{col 26}{space 2} 1.234812{col 37}{space 1}    0.01{col 46}{space 3}0.989{col 54}{space 4}-2.404347{col 67}{space 3} 2.436909
{txt}{space 9}MA  {c |}{col 14}{res}{space 2} .2928118{col 26}{space 2}  1.20644{col 37}{space 1}    0.24{col 46}{space 3}0.808{col 54}{space 4}-2.072198{col 67}{space 3} 2.657822
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-.1277201{col 26}{space 2} 1.209902{col 37}{space 1}   -0.11{col 46}{space 3}0.916{col 54}{space 4}-2.499516{col 67}{space 3} 2.244075
{txt}{space 9}ME  {c |}{col 14}{res}{space 2} .0000509{col 26}{space 2} 1.250357{col 37}{space 1}    0.00{col 46}{space 3}1.000{col 54}{space 4}-2.451049{col 67}{space 3} 2.451151
{txt}{space 9}MI  {c |}{col 14}{res}{space 2} .0631351{col 26}{space 2} 1.205308{col 37}{space 1}    0.05{col 46}{space 3}0.958{col 54}{space 4}-2.299654{col 67}{space 3} 2.425924
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-.0298036{col 26}{space 2} 1.209565{col 37}{space 1}   -0.02{col 46}{space 3}0.980{col 54}{space 4}-2.400939{col 67}{space 3} 2.341332
{txt}{space 9}MO  {c |}{col 14}{res}{space 2} .0522161{col 26}{space 2} 1.212043{col 37}{space 1}    0.04{col 46}{space 3}0.966{col 54}{space 4}-2.323777{col 67}{space 3} 2.428209
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-.1834209{col 26}{space 2} 1.246756{col 37}{space 1}   -0.15{col 46}{space 3}0.883{col 54}{space 4}-2.627463{col 67}{space 3} 2.260621
{txt}{space 9}MT  {c |}{col 14}{res}{space 2} .2156082{col 26}{space 2} 1.334611{col 37}{space 1}    0.16{col 46}{space 3}0.872{col 54}{space 4}-2.400657{col 67}{space 3} 2.831873
{txt}{space 9}NC  {c |}{col 14}{res}{space 2} .3725655{col 26}{space 2} 1.208543{col 37}{space 1}    0.31{col 46}{space 3}0.758{col 54}{space 4}-1.996567{col 67}{space 3} 2.741698
{txt}{space 9}ND  {c |}{col 14}{res}{space 2} .3198594{col 26}{space 2} 1.358191{col 37}{space 1}    0.24{col 46}{space 3}0.814{col 54}{space 4} -2.34263{col 67}{space 3} 2.982349
{txt}{space 9}NE  {c |}{col 14}{res}{space 2} .2319332{col 26}{space 2} 1.228083{col 37}{space 1}    0.19{col 46}{space 3}0.850{col 54}{space 4}-2.175504{col 67}{space 3}  2.63937
{txt}{space 9}NH  {c |}{col 14}{res}{space 2} -.202663{col 26}{space 2} 1.246714{col 37}{space 1}   -0.16{col 46}{space 3}0.871{col 54}{space 4}-2.646623{col 67}{space 3} 2.241297
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-.1880933{col 26}{space 2} 1.204567{col 37}{space 1}   -0.16{col 46}{space 3}0.876{col 54}{space 4} -2.54943{col 67}{space 3} 2.173244
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-.9722344{col 26}{space 2} 1.259195{col 37}{space 1}   -0.77{col 46}{space 3}0.440{col 54}{space 4} -3.44066{col 67}{space 3} 1.496191
{txt}{space 9}NV  {c |}{col 14}{res}{space 2} .9986827{col 26}{space 2} 1.261392{col 37}{space 1}    0.79{col 46}{space 3}0.429{col 54}{space 4} -1.47405{col 67}{space 3} 3.471415
{txt}{space 9}NY  {c |}{col 14}{res}{space 2} .0754594{col 26}{space 2} 1.200877{col 37}{space 1}    0.06{col 46}{space 3}0.950{col 54}{space 4}-2.278645{col 67}{space 3} 2.429564
{txt}{space 9}OH  {c |}{col 14}{res}{space 2} .1094225{col 26}{space 2} 1.202754{col 37}{space 1}    0.09{col 46}{space 3}0.928{col 54}{space 4} -2.24836{col 67}{space 3} 2.467205
{txt}{space 9}OK  {c |}{col 14}{res}{space 2} .3969591{col 26}{space 2} 1.244747{col 37}{space 1}    0.32{col 46}{space 3}0.750{col 54}{space 4}-2.043144{col 67}{space 3} 2.837062
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-.0533051{col 26}{space 2} 1.212546{col 37}{space 1}   -0.04{col 46}{space 3}0.965{col 54}{space 4}-2.430284{col 67}{space 3} 2.323674
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-.2260057{col 26}{space 2} 1.200091{col 37}{space 1}   -0.19{col 46}{space 3}0.851{col 54}{space 4}-2.578569{col 67}{space 3} 2.126558
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-.1078854{col 26}{space 2} 1.273976{col 37}{space 1}   -0.08{col 46}{space 3}0.933{col 54}{space 4}-2.605286{col 67}{space 3} 2.389515
{txt}{space 9}SC  {c |}{col 14}{res}{space 2} .5872445{col 26}{space 2} 1.237335{col 37}{space 1}    0.47{col 46}{space 3}0.635{col 54}{space 4}-1.838329{col 67}{space 3} 3.012818
{txt}{space 9}SD  {c |}{col 14}{res}{space 2} 2.123739{col 26}{space 2} 1.415764{col 37}{space 1}    1.50{col 46}{space 3}0.134{col 54}{space 4}-.6516127{col 67}{space 3} 4.899091
{txt}{space 9}TN  {c |}{col 14}{res}{space 2} .0302125{col 26}{space 2} 1.214386{col 37}{space 1}    0.02{col 46}{space 3}0.980{col 54}{space 4}-2.350374{col 67}{space 3} 2.410799
{txt}{space 9}TX  {c |}{col 14}{res}{space 2} .4770147{col 26}{space 2} 1.200858{col 37}{space 1}    0.40{col 46}{space 3}0.691{col 54}{space 4}-1.877052{col 67}{space 3} 2.831082
{txt}{space 9}UT  {c |}{col 14}{res}{space 2} .2950242{col 26}{space 2}  1.24138{col 37}{space 1}    0.24{col 46}{space 3}0.812{col 54}{space 4}-2.138478{col 67}{space 3} 2.728527
{txt}{space 9}VA  {c |}{col 14}{res}{space 2} .0640562{col 26}{space 2} 1.208375{col 37}{space 1}    0.05{col 46}{space 3}0.958{col 54}{space 4}-2.304745{col 67}{space 3} 2.432858
{txt}{space 9}VT  {c |}{col 14}{res}{space 2} .8703951{col 26}{space 2} 1.278258{col 37}{space 1}    0.68{col 46}{space 3}0.496{col 54}{space 4}-1.635401{col 67}{space 3} 3.376191
{txt}{space 9}WA  {c |}{col 14}{res}{space 2}  .292428{col 26}{space 2} 1.209398{col 37}{space 1}    0.24{col 46}{space 3}0.809{col 54}{space 4} -2.07838{col 67}{space 3} 2.663236
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}  .067276{col 26}{space 2} 1.210929{col 37}{space 1}    0.06{col 46}{space 3}0.956{col 54}{space 4}-2.306533{col 67}{space 3} 2.441085
{txt}{space 9}WV  {c |}{col 14}{res}{space 2} .0314211{col 26}{space 2} 1.289978{col 37}{space 1}    0.02{col 46}{space 3}0.981{col 54}{space 4} -2.49735{col 67}{space 3} 2.560192
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-.9748605{col 26}{space 2} 1.244843{col 37}{space 1}   -0.78{col 46}{space 3}0.434{col 54}{space 4}-3.415152{col 67}{space 3} 1.465431
{txt}{space 12} {c |}
{space 7}2.Q33 {c |}{col 14}{res}{space 2} .2987796{col 26}{space 2} .0607707{col 37}{space 1}    4.92{col 46}{space 3}0.000{col 54}{space 4} .1796496{col 67}{space 3} .4179097
{txt}{space 7}2.Q34 {c |}{col 14}{res}{space 2} .0223987{col 26}{space 2} .1223595{col 37}{space 1}    0.18{col 46}{space 3}0.855{col 54}{space 4}-.2174651{col 67}{space 3} .2622625
{txt}{space 7}Q35_1 {c |}{col 14}{res}{space 2} .2682735{col 26}{space 2} .1939087{col 37}{space 1}    1.38{col 46}{space 3}0.167{col 54}{space 4}-.1118496{col 67}{space 3} .6483967
{txt}{space 7}Q35_2 {c |}{col 14}{res}{space 2} .3266623{col 26}{space 2} .2018188{col 37}{space 1}    1.62{col 46}{space 3}0.106{col 54}{space 4}-.0689672{col 67}{space 3} .7222918
{txt}{space 7}Q35_3 {c |}{col 14}{res}{space 2} .1025192{col 26}{space 2} .2165831{col 37}{space 1}    0.47{col 46}{space 3}0.636{col 54}{space 4}-.3220531{col 67}{space 3} .5270914
{txt}{space 7}Q35_4 {c |}{col 14}{res}{space 2} .4714031{col 26}{space 2} .2269249{col 37}{space 1}    2.08{col 46}{space 3}0.038{col 54}{space 4} .0265576{col 67}{space 3} .9162486
{txt}{space 7}Q35_5 {c |}{col 14}{res}{space 2}-.6069856{col 26}{space 2} .3830848{col 37}{space 1}   -1.58{col 46}{space 3}0.113{col 54}{space 4}-1.357955{col 67}{space 3} .1439834
{txt}{space 7}Q35_6 {c |}{col 14}{res}{space 2} .3266098{col 26}{space 2} .2159059{col 37}{space 1}    1.51{col 46}{space 3}0.130{col 54}{space 4}-.0966349{col 67}{space 3} .7498545
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.008369{col 26}{space 2} 1.254243{col 37}{space 1}    1.60{col 46}{space 3}0.109{col 54}{space 4}-.4503496{col 67}{space 3} 4.467088
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est8{txt} stored)

Linear regression                                      Number of obs ={res}    5802
                                                       {txt}F( 75,  5726) ={res}    5.83
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0688
                                                       {txt}Root MSE      = {res} 2.2528

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}    Q24_mean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2}-.2508556{col 26}{space 2} .1628595{col 37}{space 1}   -1.54{col 46}{space 3}0.124{col 54}{space 4}-.5701218{col 67}{space 3} .0684106
{txt}{space 8}Old  {c |}{col 14}{res}{space 2}-.2514671{col 26}{space 2} .2447101{col 37}{space 1}   -1.03{col 46}{space 3}0.304{col 54}{space 4}-.7311915{col 67}{space 3} .2282573
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2} .0563441{col 26}{space 2} .1135453{col 37}{space 1}    0.50{col 46}{space 3}0.620{col 54}{space 4}-.1662476{col 67}{space 3} .2789358
{txt}High Educ..  {c |}{col 14}{res}{space 2} .0869557{col 26}{space 2} .1098009{col 37}{space 1}    0.79{col 46}{space 3}0.428{col 54}{space 4}-.1282956{col 67}{space 3} .3022071
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2}-.1644347{col 26}{space 2} .0959849{col 37}{space 1}   -1.71{col 46}{space 3}0.087{col 54}{space 4}-.3526014{col 67}{space 3} .0237319
{txt}High Income  {c |}{col 14}{res}{space 2} .0929756{col 26}{space 2}   .09636{col 37}{space 1}    0.96{col 46}{space 3}0.335{col 54}{space 4}-.0959265{col 67}{space 3} .2818777
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2} .2069941{col 26}{space 2} .1834137{col 37}{space 1}    1.13{col 46}{space 3}0.259{col 54}{space 4}-.1525662{col 67}{space 3} .5665543
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} .5005948{col 26}{space 2} .2496897{col 37}{space 1}    2.00{col 46}{space 3}0.045{col 54}{space 4} .0111085{col 67}{space 3} .9900811
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2} .1437994{col 26}{space 2} .0979765{col 37}{space 1}    1.47{col 46}{space 3}0.142{col 54}{space 4}-.0482716{col 67}{space 3} .3358704
{txt}{space 7}2015  {c |}{col 14}{res}{space 2}   .16742{col 26}{space 2} .0951259{col 37}{space 1}    1.76{col 46}{space 3}0.078{col 54}{space 4}-.0190627{col 67}{space 3} .3539026
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1293388{col 26}{space 2} .0948759{col 37}{space 1}    1.36{col 46}{space 3}0.173{col 54}{space 4}-.0566539{col 67}{space 3} .3153314
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .2837798{col 26}{space 2} .0971389{col 37}{space 1}    2.92{col 46}{space 3}0.003{col 54}{space 4} .0933508{col 67}{space 3} .4742088
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1944466{col 26}{space 2} .1284194{col 37}{space 1}    1.51{col 46}{space 3}0.130{col 54}{space 4}-.0573041{col 67}{space 3} .4461973
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2} -2.38711{col 26}{space 2} .9833995{col 37}{space 1}   -2.43{col 46}{space 3}0.015{col 54}{space 4}-4.314945{col 67}{space 3}-.4592747
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-2.682333{col 26}{space 2} 1.019021{col 37}{space 1}   -2.63{col 46}{space 3}0.009{col 54}{space 4}    -4.68{col 67}{space 3}-.6846652
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-2.493827{col 26}{space 2} .9703438{col 37}{space 1}   -2.57{col 46}{space 3}0.010{col 54}{space 4}-4.396068{col 67}{space 3}-.5915862
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-2.386329{col 26}{space 2} .9503965{col 37}{space 1}   -2.51{col 46}{space 3}0.012{col 54}{space 4}-4.249466{col 67}{space 3}-.5231923
{txt}{space 9}CO  {c |}{col 14}{res}{space 2}-2.550826{col 26}{space 2} .9658457{col 37}{space 1}   -2.64{col 46}{space 3}0.008{col 54}{space 4}-4.444249{col 67}{space 3}-.6574031
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-2.638174{col 26}{space 2} .9726528{col 37}{space 1}   -2.71{col 46}{space 3}0.007{col 54}{space 4}-4.544942{col 67}{space 3} -.731407
{txt}{space 9}DC  {c |}{col 14}{res}{space 2}-2.174866{col 26}{space 2}  1.06489{col 37}{space 1}   -2.04{col 46}{space 3}0.041{col 54}{space 4}-4.262452{col 67}{space 3}-.0872796
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-2.112893{col 26}{space 2} 1.142331{col 37}{space 1}   -1.85{col 46}{space 3}0.064{col 54}{space 4}-4.352294{col 67}{space 3} .1265074
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-2.869865{col 26}{space 2} .9519157{col 37}{space 1}   -3.01{col 46}{space 3}0.003{col 54}{space 4} -4.73598{col 67}{space 3} -1.00375
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-2.647445{col 26}{space 2} .9589193{col 37}{space 1}   -2.76{col 46}{space 3}0.006{col 54}{space 4} -4.52729{col 67}{space 3}-.7676003
{txt}{space 9}HI  {c |}{col 14}{res}{space 2}-2.688202{col 26}{space 2} 1.113866{col 37}{space 1}   -2.41{col 46}{space 3}0.016{col 54}{space 4}  -4.8718{col 67}{space 3}-.5046035
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-2.860449{col 26}{space 2} .9701607{col 37}{space 1}   -2.95{col 46}{space 3}0.003{col 54}{space 4}-4.762331{col 67}{space 3}-.9585673
{txt}{space 9}ID  {c |}{col 14}{res}{space 2}-2.150598{col 26}{space 2} 1.017958{col 37}{space 1}   -2.11{col 46}{space 3}0.035{col 54}{space 4} -4.14618{col 67}{space 3} -.155016
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-2.735802{col 26}{space 2}  .950608{col 37}{space 1}   -2.88{col 46}{space 3}0.004{col 54}{space 4}-4.599354{col 67}{space 3}-.8722508
{txt}{space 9}IN  {c |}{col 14}{res}{space 2}-2.704784{col 26}{space 2} .9633635{col 37}{space 1}   -2.81{col 46}{space 3}0.005{col 54}{space 4}-4.593341{col 67}{space 3}-.8162268
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-2.924193{col 26}{space 2} .9844071{col 37}{space 1}   -2.97{col 46}{space 3}0.003{col 54}{space 4}-4.854004{col 67}{space 3}-.9943831
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-3.138541{col 26}{space 2} .9721023{col 37}{space 1}   -3.23{col 46}{space 3}0.001{col 54}{space 4}-5.044229{col 67}{space 3}-1.232853
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-2.853547{col 26}{space 2} .9903551{col 37}{space 1}   -2.88{col 46}{space 3}0.004{col 54}{space 4}-4.795018{col 67}{space 3}-.9120762
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-2.495796{col 26}{space 2}  .954361{col 37}{space 1}   -2.62{col 46}{space 3}0.009{col 54}{space 4}-4.366705{col 67}{space 3}-.6248875
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-2.895376{col 26}{space 2} .9619241{col 37}{space 1}   -3.01{col 46}{space 3}0.003{col 54}{space 4}-4.781111{col 67}{space 3}-1.009641
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-2.791904{col 26}{space 2} 1.004568{col 37}{space 1}   -2.78{col 46}{space 3}0.005{col 54}{space 4}-4.761238{col 67}{space 3}-.8225714
{txt}{space 9}MI  {c |}{col 14}{res}{space 2} -2.70864{col 26}{space 2} .9553158{col 37}{space 1}   -2.84{col 46}{space 3}0.005{col 54}{space 4}-4.581421{col 67}{space 3}-.8358599
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-2.841396{col 26}{space 2} .9624705{col 37}{space 1}   -2.95{col 46}{space 3}0.003{col 54}{space 4}-4.728203{col 67}{space 3}  -.95459
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-2.753039{col 26}{space 2} .9646866{col 37}{space 1}   -2.85{col 46}{space 3}0.004{col 54}{space 4} -4.64419{col 67}{space 3}-.8618886
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-3.152568{col 26}{space 2} .9810207{col 37}{space 1}   -3.21{col 46}{space 3}0.001{col 54}{space 4}-5.075739{col 67}{space 3}-1.229396
{txt}{space 9}MT  {c |}{col 14}{res}{space 2}-2.415259{col 26}{space 2} 1.145046{col 37}{space 1}   -2.11{col 46}{space 3}0.035{col 54}{space 4}-4.659983{col 67}{space 3}-.1705357
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-2.405903{col 26}{space 2} .9574765{col 37}{space 1}   -2.51{col 46}{space 3}0.012{col 54}{space 4}-4.282919{col 67}{space 3}-.5288864
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-2.459739{col 26}{space 2} 1.160003{col 37}{space 1}   -2.12{col 46}{space 3}0.034{col 54}{space 4}-4.733784{col 67}{space 3}-.1856947
{txt}{space 9}NE  {c |}{col 14}{res}{space 2}-2.640153{col 26}{space 2} .9843361{col 37}{space 1}   -2.68{col 46}{space 3}0.007{col 54}{space 4}-4.569825{col 67}{space 3}-.7104821
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-3.009846{col 26}{space 2} .9844932{col 37}{space 1}   -3.06{col 46}{space 3}0.002{col 54}{space 4}-4.939825{col 67}{space 3}-1.079867
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-2.900217{col 26}{space 2} .9563807{col 37}{space 1}   -3.03{col 46}{space 3}0.002{col 54}{space 4}-4.775085{col 67}{space 3}-1.025349
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-3.899273{col 26}{space 2} .9883274{col 37}{space 1}   -3.95{col 46}{space 3}0.000{col 54}{space 4}-5.836768{col 67}{space 3}-1.961777
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}-1.711431{col 26}{space 2} 1.031997{col 37}{space 1}   -1.66{col 46}{space 3}0.097{col 54}{space 4}-3.734535{col 67}{space 3} .3116725
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-2.692842{col 26}{space 2} .9504973{col 37}{space 1}   -2.83{col 46}{space 3}0.005{col 54}{space 4}-4.556176{col 67}{space 3}-.8295073
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-2.601746{col 26}{space 2} .9515324{col 37}{space 1}   -2.73{col 46}{space 3}0.006{col 54}{space 4} -4.46711{col 67}{space 3}-.7363827
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-2.426063{col 26}{space 2} 1.023897{col 37}{space 1}   -2.37{col 46}{space 3}0.018{col 54}{space 4}-4.433288{col 67}{space 3}-.4188372
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-2.863914{col 26}{space 2} .9639684{col 37}{space 1}   -2.97{col 46}{space 3}0.003{col 54}{space 4}-4.753657{col 67}{space 3}-.9741713
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-2.805298{col 26}{space 2} .9492874{col 37}{space 1}   -2.96{col 46}{space 3}0.003{col 54}{space 4}-4.666261{col 67}{space 3}-.9443358
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-2.657895{col 26}{space 2} 1.056693{col 37}{space 1}   -2.52{col 46}{space 3}0.012{col 54}{space 4}-4.729412{col 67}{space 3}-.5863777
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-2.394374{col 26}{space 2} .9967608{col 37}{space 1}   -2.40{col 46}{space 3}0.016{col 54}{space 4}-4.348403{col 67}{space 3}-.4403461
{txt}{space 9}SD  {c |}{col 14}{res}{space 2}-2.068812{col 26}{space 2} 1.177439{col 37}{space 1}   -1.76{col 46}{space 3}0.079{col 54}{space 4}-4.377037{col 67}{space 3} .2394137
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-2.654734{col 26}{space 2} .9680213{col 37}{space 1}   -2.74{col 46}{space 3}0.006{col 54}{space 4}-4.552422{col 67}{space 3}-.7570458
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-2.309094{col 26}{space 2}  .949727{col 37}{space 1}   -2.43{col 46}{space 3}0.015{col 54}{space 4}-4.170919{col 67}{space 3}  -.44727
{txt}{space 9}UT  {c |}{col 14}{res}{space 2}-2.477358{col 26}{space 2} .9955082{col 37}{space 1}   -2.49{col 46}{space 3}0.013{col 54}{space 4}-4.428931{col 67}{space 3}-.5257852
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}-2.601026{col 26}{space 2} .9629646{col 37}{space 1}   -2.70{col 46}{space 3}0.007{col 54}{space 4}-4.488801{col 67}{space 3}-.7132514
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}-1.662759{col 26}{space 2}  1.03901{col 37}{space 1}   -1.60{col 46}{space 3}0.110{col 54}{space 4}-3.699612{col 67}{space 3} .3740947
{txt}{space 9}WA  {c |}{col 14}{res}{space 2}-2.471644{col 26}{space 2} .9603011{col 37}{space 1}   -2.57{col 46}{space 3}0.010{col 54}{space 4}-4.354198{col 67}{space 3}-.5890909
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-2.528937{col 26}{space 2} .9639174{col 37}{space 1}   -2.62{col 46}{space 3}0.009{col 54}{space 4} -4.41858{col 67}{space 3}-.6392944
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-3.132252{col 26}{space 2}  .994423{col 37}{space 1}   -3.15{col 46}{space 3}0.002{col 54}{space 4}-5.081697{col 67}{space 3}-1.182807
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-3.750468{col 26}{space 2}  .992825{col 37}{space 1}   -3.78{col 46}{space 3}0.000{col 54}{space 4}-5.696781{col 67}{space 3}-1.804155
{txt}{space 12} {c |}
{space 7}2.Q33 {c |}{col 14}{res}{space 2} .2756245{col 26}{space 2} .0617577{col 37}{space 1}    4.46{col 46}{space 3}0.000{col 54}{space 4} .1545559{col 67}{space 3}  .396693
{txt}{space 7}2.Q34 {c |}{col 14}{res}{space 2} -.067354{col 26}{space 2}  .125406{col 37}{space 1}   -0.54{col 46}{space 3}0.591{col 54}{space 4}-.3131971{col 67}{space 3} .1784892
{txt}{space 7}Q35_1 {c |}{col 14}{res}{space 2} .2473375{col 26}{space 2} .2016486{col 37}{space 1}    1.23{col 46}{space 3}0.220{col 54}{space 4}  -.14797{col 67}{space 3} .6426451
{txt}{space 7}Q35_2 {c |}{col 14}{res}{space 2} .3000132{col 26}{space 2} .2073648{col 37}{space 1}    1.45{col 46}{space 3}0.148{col 54}{space 4}-.1065003{col 67}{space 3} .7065267
{txt}{space 7}Q35_3 {c |}{col 14}{res}{space 2} .2828287{col 26}{space 2}  .228513{col 37}{space 1}    1.24{col 46}{space 3}0.216{col 54}{space 4}-.1651433{col 67}{space 3} .7308008
{txt}{space 7}Q35_4 {c |}{col 14}{res}{space 2} .5573005{col 26}{space 2} .2346795{col 37}{space 1}    2.37{col 46}{space 3}0.018{col 54}{space 4} .0972399{col 67}{space 3} 1.017361
{txt}{space 7}Q35_5 {c |}{col 14}{res}{space 2}-.4639202{col 26}{space 2} .4363774{col 37}{space 1}   -1.06{col 46}{space 3}0.288{col 54}{space 4}-1.319385{col 67}{space 3} .3915446
{txt}{space 7}Q35_6 {c |}{col 14}{res}{space 2} .2137356{col 26}{space 2} .2217991{col 37}{space 1}    0.96{col 46}{space 3}0.335{col 54}{space 4}-.2210746{col 67}{space 3} .6485457
{txt}{space 7}Q4new {c |}{col 14}{res}{space 2}-.0050425{col 26}{space 2}  .001398{col 37}{space 1}   -3.61{col 46}{space 3}0.000{col 54}{space 4}-.0077832{col 67}{space 3}-.0023018
{txt}{space 7}Q6new {c |}{col 14}{res}{space 2} .0089841{col 26}{space 2} .0014363{col 37}{space 1}    6.26{col 46}{space 3}0.000{col 54}{space 4} .0061685{col 67}{space 3} .0117998
{txt}{space 5}Q9_mean {c |}{col 14}{res}{space 2} .0446554{col 26}{space 2} .0071006{col 37}{space 1}    6.29{col 46}{space 3}0.000{col 54}{space 4} .0307355{col 67}{space 3} .0585753
{txt}{space 6}Q13new {c |}{col 14}{res}{space 2}-.0118054{col 26}{space 2} .0015005{col 37}{space 1}   -7.87{col 46}{space 3}0.000{col 54}{space 4}-.0147469{col 67}{space 3}-.0088638
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 4.547331{col 26}{space 2} 1.015019{col 37}{space 1}    4.48{col 46}{space 3}0.000{col 54}{space 4} 2.557509{col 67}{space 3} 6.537153
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est9{txt} stored)

{com}. foreach mom in Mean Var Skew Kurt{c -(}
{txt}  2{com}. eststo: reg Inc`mom' i.age_g i.edu_g i.inc_g i.cohort_g i.year i.state_id, robust 
{txt}  3{com}. eststo: reg Inc`mom' i.age_g i.edu_g i.inc_g i.cohort_g i.year i.state_id ${c -(}other_control{c )-}, robust 
{txt}  4{com}. eststo: reg Inc`mom' i.age_g i.edu_g i.inc_g i.cohort_g i.year i.state_id ${c -(}other_control{c )-} ${c -(}macro_ex_var{c )-}, robust 
{txt}  5{com}. 
. {c )-}

{txt}Linear regression                                      Number of obs ={res}    6734
                                                       {txt}F( 63,  6670) ={res}    1.55
                                                       {txt}Prob > F      = {res} 0.0037
                                                       {txt}R-squared     = {res} 0.0143
                                                       {txt}Root MSE      = {res} 2.8498

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     IncMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2} .0368507{col 26}{space 2} .1903326{col 37}{space 1}    0.19{col 46}{space 3}0.846{col 54}{space 4}-.3362621{col 67}{space 3} .4099636
{txt}{space 8}Old  {c |}{col 14}{res}{space 2} .1088845{col 26}{space 2} .2726496{col 37}{space 1}    0.40{col 46}{space 3}0.690{col 54}{space 4}-.4255959{col 67}{space 3} .6433648
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2} .0614642{col 26}{space 2} .1358746{col 37}{space 1}    0.45{col 46}{space 3}0.651{col 54}{space 4}-.2048935{col 67}{space 3} .3278219
{txt}High Educ..  {c |}{col 14}{res}{space 2} -.179466{col 26}{space 2}  .131019{col 37}{space 1}   -1.37{col 46}{space 3}0.171{col 54}{space 4} -.436305{col 67}{space 3} .0773731
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2}-.2883223{col 26}{space 2} .1134864{col 37}{space 1}   -2.54{col 46}{space 3}0.011{col 54}{space 4}-.5107919{col 67}{space 3}-.0658528
{txt}High Income  {c |}{col 14}{res}{space 2}-.1735792{col 26}{space 2} .1150413{col 37}{space 1}   -1.51{col 46}{space 3}0.131{col 54}{space 4} -.399097{col 67}{space 3} .0519386
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2}-.1098634{col 26}{space 2} .2021647{col 37}{space 1}   -0.54{col 46}{space 3}0.587{col 54}{space 4}-.5061708{col 67}{space 3}  .286444
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} .0908863{col 26}{space 2} .2821068{col 37}{space 1}    0.32{col 46}{space 3}0.747{col 54}{space 4}-.4621331{col 67}{space 3} .6439058
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2} .1064975{col 26}{space 2} .1076466{col 37}{space 1}    0.99{col 46}{space 3}0.323{col 54}{space 4}-.1045243{col 67}{space 3} .3175193
{txt}{space 7}2015  {c |}{col 14}{res}{space 2} .2599857{col 26}{space 2} .1078723{col 37}{space 1}    2.41{col 46}{space 3}0.016{col 54}{space 4} .0485215{col 67}{space 3}   .47145
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1744786{col 26}{space 2} .1090003{col 37}{space 1}    1.60{col 46}{space 3}0.109{col 54}{space 4}-.0391968{col 67}{space 3} .3881541
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .4378399{col 26}{space 2} .1175293{col 37}{space 1}    3.73{col 46}{space 3}0.000{col 54}{space 4} .2074449{col 67}{space 3} .6682349
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}  .538504{col 26}{space 2} .1641834{col 37}{space 1}    3.28{col 46}{space 3}0.001{col 54}{space 4}  .216652{col 67}{space 3}  .860356
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2}-.3867662{col 26}{space 2} 2.935544{col 37}{space 1}   -0.13{col 46}{space 3}0.895{col 54}{space 4} -6.14137{col 67}{space 3} 5.367838
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-.2437216{col 26}{space 2} 2.963653{col 37}{space 1}   -0.08{col 46}{space 3}0.934{col 54}{space 4} -6.05343{col 67}{space 3} 5.565987
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-.5839455{col 26}{space 2} 2.925004{col 37}{space 1}   -0.20{col 46}{space 3}0.842{col 54}{space 4}-6.317888{col 67}{space 3} 5.149997
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-.2837463{col 26}{space 2} 2.920247{col 37}{space 1}   -0.10{col 46}{space 3}0.923{col 54}{space 4}-6.008365{col 67}{space 3} 5.440872
{txt}{space 9}CO  {c |}{col 14}{res}{space 2}-.6444697{col 26}{space 2} 2.922708{col 37}{space 1}   -0.22{col 46}{space 3}0.825{col 54}{space 4}-6.373912{col 67}{space 3} 5.084972
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-.6780225{col 26}{space 2} 2.922878{col 37}{space 1}   -0.23{col 46}{space 3}0.817{col 54}{space 4}-6.407799{col 67}{space 3} 5.051754
{txt}{space 9}DC  {c |}{col 14}{res}{space 2} -.894242{col 26}{space 2} 2.957152{col 37}{space 1}   -0.30{col 46}{space 3}0.762{col 54}{space 4}-6.691205{col 67}{space 3} 4.902721
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-.4904558{col 26}{space 2} 2.953153{col 37}{space 1}   -0.17{col 46}{space 3}0.868{col 54}{space 4}-6.279581{col 67}{space 3} 5.298669
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-.2579328{col 26}{space 2} 2.922305{col 37}{space 1}   -0.09{col 46}{space 3}0.930{col 54}{space 4}-5.986584{col 67}{space 3} 5.470719
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-.3595684{col 26}{space 2} 2.925254{col 37}{space 1}   -0.12{col 46}{space 3}0.902{col 54}{space 4}-6.094001{col 67}{space 3} 5.374865
{txt}{space 9}HI  {c |}{col 14}{res}{space 2} .0073556{col 26}{space 2} 2.984025{col 37}{space 1}    0.00{col 46}{space 3}0.998{col 54}{space 4}-5.842288{col 67}{space 3} 5.856999
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-.9094691{col 26}{space 2} 2.923854{col 37}{space 1}   -0.31{col 46}{space 3}0.756{col 54}{space 4}-6.641158{col 67}{space 3}  4.82222
{txt}{space 9}ID  {c |}{col 14}{res}{space 2}-.0056403{col 26}{space 2} 2.958638{col 37}{space 1}   -0.00{col 46}{space 3}0.998{col 54}{space 4}-5.805516{col 67}{space 3} 5.794236
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-.6771915{col 26}{space 2} 2.919828{col 37}{space 1}   -0.23{col 46}{space 3}0.817{col 54}{space 4}-6.400987{col 67}{space 3} 5.046604
{txt}{space 9}IN  {c |}{col 14}{res}{space 2}-.3171196{col 26}{space 2}   2.9275{col 37}{space 1}   -0.11{col 46}{space 3}0.914{col 54}{space 4}-6.055955{col 67}{space 3} 5.421715
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-.1963764{col 26}{space 2} 2.942305{col 37}{space 1}   -0.07{col 46}{space 3}0.947{col 54}{space 4}-5.964234{col 67}{space 3} 5.571481
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-.4872892{col 26}{space 2} 2.931004{col 37}{space 1}   -0.17{col 46}{space 3}0.868{col 54}{space 4}-6.232994{col 67}{space 3} 5.258415
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-1.156637{col 26}{space 2} 2.933003{col 37}{space 1}   -0.39{col 46}{space 3}0.693{col 54}{space 4} -6.90626{col 67}{space 3} 4.592986
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-.2691401{col 26}{space 2} 2.926245{col 37}{space 1}   -0.09{col 46}{space 3}0.927{col 54}{space 4}-6.005516{col 67}{space 3} 5.467236
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-.5855075{col 26}{space 2} 2.928731{col 37}{space 1}   -0.20{col 46}{space 3}0.842{col 54}{space 4}-6.326756{col 67}{space 3} 5.155741
{txt}{space 9}ME  {c |}{col 14}{res}{space 2} -1.14411{col 26}{space 2}  2.94036{col 37}{space 1}   -0.39{col 46}{space 3}0.697{col 54}{space 4}-6.908155{col 67}{space 3} 4.619935
{txt}{space 9}MI  {c |}{col 14}{res}{space 2}-.8430762{col 26}{space 2} 2.919234{col 37}{space 1}   -0.29{col 46}{space 3}0.773{col 54}{space 4}-6.565709{col 67}{space 3} 4.879557
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-.7040229{col 26}{space 2}  2.92326{col 37}{space 1}   -0.24{col 46}{space 3}0.810{col 54}{space 4}-6.434547{col 67}{space 3} 5.026501
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-.3795237{col 26}{space 2} 2.926195{col 37}{space 1}   -0.13{col 46}{space 3}0.897{col 54}{space 4}-6.115802{col 67}{space 3} 5.356755
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-.6259356{col 26}{space 2} 2.939701{col 37}{space 1}   -0.21{col 46}{space 3}0.831{col 54}{space 4}-6.388689{col 67}{space 3} 5.136818
{txt}{space 9}MT  {c |}{col 14}{res}{space 2}-.0808938{col 26}{space 2} 2.974635{col 37}{space 1}   -0.03{col 46}{space 3}0.978{col 54}{space 4}-5.912128{col 67}{space 3} 5.750341
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-.3831228{col 26}{space 2}  2.92286{col 37}{space 1}   -0.13{col 46}{space 3}0.896{col 54}{space 4}-6.112862{col 67}{space 3} 5.346616
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-.5197371{col 26}{space 2} 2.961927{col 37}{space 1}   -0.18{col 46}{space 3}0.861{col 54}{space 4}-6.326061{col 67}{space 3} 5.286586
{txt}{space 9}NE  {c |}{col 14}{res}{space 2}-.7936272{col 26}{space 2} 2.930266{col 37}{space 1}   -0.27{col 46}{space 3}0.787{col 54}{space 4}-6.537885{col 67}{space 3} 4.950631
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-.2796767{col 26}{space 2} 2.942745{col 37}{space 1}   -0.10{col 46}{space 3}0.924{col 54}{space 4}-6.048397{col 67}{space 3} 5.489043
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-.6673091{col 26}{space 2} 2.921647{col 37}{space 1}   -0.23{col 46}{space 3}0.819{col 54}{space 4}-6.394671{col 67}{space 3} 5.060053
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-.8433931{col 26}{space 2}  2.93749{col 37}{space 1}   -0.29{col 46}{space 3}0.774{col 54}{space 4}-6.601813{col 67}{space 3} 4.915027
{txt}{space 9}NV  {c |}{col 14}{res}{space 2} .1816601{col 26}{space 2} 2.958196{col 37}{space 1}    0.06{col 46}{space 3}0.951{col 54}{space 4} -5.61735{col 67}{space 3} 5.980671
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-.3041029{col 26}{space 2} 2.920127{col 37}{space 1}   -0.10{col 46}{space 3}0.917{col 54}{space 4}-6.028486{col 67}{space 3} 5.420281
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-.3346966{col 26}{space 2} 2.920777{col 37}{space 1}   -0.11{col 46}{space 3}0.909{col 54}{space 4}-6.060354{col 67}{space 3}  5.39096
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-.3778111{col 26}{space 2} 2.948534{col 37}{space 1}   -0.13{col 46}{space 3}0.898{col 54}{space 4} -6.15788{col 67}{space 3} 5.402257
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-.7823441{col 26}{space 2} 2.926601{col 37}{space 1}   -0.27{col 46}{space 3}0.789{col 54}{space 4}-6.519418{col 67}{space 3}  4.95473
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-.4915984{col 26}{space 2} 2.919791{col 37}{space 1}   -0.17{col 46}{space 3}0.866{col 54}{space 4}-6.215321{col 67}{space 3} 5.232125
{txt}{space 9}RI  {c |}{col 14}{res}{space 2} .1627667{col 26}{space 2} 3.003426{col 37}{space 1}    0.05{col 46}{space 3}0.957{col 54}{space 4}-5.724909{col 67}{space 3} 6.050442
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-.4019914{col 26}{space 2} 2.937287{col 37}{space 1}   -0.14{col 46}{space 3}0.891{col 54}{space 4}-6.160012{col 67}{space 3}  5.35603
{txt}{space 9}SD  {c |}{col 14}{res}{space 2} .4725071{col 26}{space 2} 3.005235{col 37}{space 1}    0.16{col 46}{space 3}0.875{col 54}{space 4}-5.418713{col 67}{space 3} 6.363728
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-.3504799{col 26}{space 2}  2.93276{col 37}{space 1}   -0.12{col 46}{space 3}0.905{col 54}{space 4}-6.099627{col 67}{space 3} 5.398668
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-.3139227{col 26}{space 2} 2.921353{col 37}{space 1}   -0.11{col 46}{space 3}0.914{col 54}{space 4}-6.040708{col 67}{space 3} 5.412863
{txt}{space 9}UT  {c |}{col 14}{res}{space 2}-.5381255{col 26}{space 2} 2.934607{col 37}{space 1}   -0.18{col 46}{space 3}0.855{col 54}{space 4}-6.290893{col 67}{space 3} 5.214642
{txt}{space 9}VA  {c |}{col 14}{res}{space 2} -.386247{col 26}{space 2} 2.923765{col 37}{space 1}   -0.13{col 46}{space 3}0.895{col 54}{space 4} -6.11776{col 67}{space 3} 5.345266
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}  .959091{col 26}{space 2}  2.98052{col 37}{space 1}    0.32{col 46}{space 3}0.748{col 54}{space 4}-4.883681{col 67}{space 3} 6.801863
{txt}{space 9}WA  {c |}{col 14}{res}{space 2}-.4716616{col 26}{space 2} 2.928787{col 37}{space 1}   -0.16{col 46}{space 3}0.872{col 54}{space 4} -6.21302{col 67}{space 3} 5.269696
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-.4410812{col 26}{space 2} 2.925535{col 37}{space 1}   -0.15{col 46}{space 3}0.880{col 54}{space 4}-6.176065{col 67}{space 3} 5.293902
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-.7833177{col 26}{space 2} 2.943742{col 37}{space 1}   -0.27{col 46}{space 3}0.790{col 54}{space 4}-6.553994{col 67}{space 3} 4.987358
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-.8595338{col 26}{space 2} 2.937853{col 37}{space 1}   -0.29{col 46}{space 3}0.770{col 54}{space 4}-6.618666{col 67}{space 3} 4.899598
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.089741{col 26}{space 2} 2.930419{col 37}{space 1}    0.71{col 46}{space 3}0.476{col 54}{space 4}-3.654817{col 67}{space 3} 7.834298
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est10{txt} stored)

Linear regression                                      Number of obs ={res}    6732
                                                       {txt}F( 71,  6660) ={res}    1.74
                                                       {txt}Prob > F      = {res} 0.0001
                                                       {txt}R-squared     = {res} 0.0177
                                                       {txt}Root MSE      = {res}  2.847

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     IncMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2} .0343647{col 26}{space 2} .1908292{col 37}{space 1}    0.18{col 46}{space 3}0.857{col 54}{space 4}-.3397216{col 67}{space 3}  .408451
{txt}{space 8}Old  {c |}{col 14}{res}{space 2}  .120454{col 26}{space 2} .2733991{col 37}{space 1}    0.44{col 46}{space 3}0.660{col 54}{space 4}-.4154957{col 67}{space 3} .6564038
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2} .0414644{col 26}{space 2} .1363447{col 37}{space 1}    0.30{col 46}{space 3}0.761{col 54}{space 4}-.2258148{col 67}{space 3} .3087437
{txt}High Educ..  {c |}{col 14}{res}{space 2}-.1781104{col 26}{space 2} .1309787{col 37}{space 1}   -1.36{col 46}{space 3}0.174{col 54}{space 4}-.4348705{col 67}{space 3} .0786497
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2} -.257501{col 26}{space 2} .1137459{col 37}{space 1}   -2.26{col 46}{space 3}0.024{col 54}{space 4}-.4804794{col 67}{space 3}-.0345227
{txt}High Income  {c |}{col 14}{res}{space 2}-.0877457{col 26}{space 2} .1167888{col 37}{space 1}   -0.75{col 46}{space 3}0.452{col 54}{space 4}-.3166891{col 67}{space 3} .1411977
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2}-.1278992{col 26}{space 2} .2026478{col 37}{space 1}   -0.63{col 46}{space 3}0.528{col 54}{space 4}-.5251537{col 67}{space 3} .2693554
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} .0661977{col 26}{space 2} .2836569{col 37}{space 1}    0.23{col 46}{space 3}0.815{col 54}{space 4}-.4898606{col 67}{space 3} .6222561
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2} .0998502{col 26}{space 2} .1068565{col 37}{space 1}    0.93{col 46}{space 3}0.350{col 54}{space 4}-.1096228{col 67}{space 3} .3093231
{txt}{space 7}2015  {c |}{col 14}{res}{space 2} .2505949{col 26}{space 2} .1075943{col 37}{space 1}    2.33{col 46}{space 3}0.020{col 54}{space 4} .0396756{col 67}{space 3} .4615142
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1537715{col 26}{space 2} .1093123{col 37}{space 1}    1.41{col 46}{space 3}0.160{col 54}{space 4}-.0605156{col 67}{space 3} .3680586
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}  .425673{col 26}{space 2} .1174512{col 37}{space 1}    3.62{col 46}{space 3}0.000{col 54}{space 4}  .195431{col 67}{space 3}  .655915
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .5292221{col 26}{space 2} .1641552{col 37}{space 1}    3.22{col 46}{space 3}0.001{col 54}{space 4} .2074254{col 67}{space 3} .8510188
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2} -.399638{col 26}{space 2} 2.950779{col 37}{space 1}   -0.14{col 46}{space 3}0.892{col 54}{space 4} -6.18411{col 67}{space 3} 5.384833
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-.2062472{col 26}{space 2} 2.978769{col 37}{space 1}   -0.07{col 46}{space 3}0.945{col 54}{space 4}-6.045589{col 67}{space 3} 5.633095
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-.5391187{col 26}{space 2}  2.94113{col 37}{space 1}   -0.18{col 46}{space 3}0.855{col 54}{space 4}-6.304675{col 67}{space 3} 5.226438
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-.2400646{col 26}{space 2} 2.940238{col 37}{space 1}   -0.08{col 46}{space 3}0.935{col 54}{space 4}-6.003872{col 67}{space 3} 5.523743
{txt}{space 9}CO  {c |}{col 14}{res}{space 2}-.5864461{col 26}{space 2}  2.93958{col 37}{space 1}   -0.20{col 46}{space 3}0.842{col 54}{space 4}-6.348964{col 67}{space 3} 5.176072
{txt}{space 9}CT  {c |}{col 14}{res}{space 2} -.651975{col 26}{space 2} 2.938593{col 37}{space 1}   -0.22{col 46}{space 3}0.824{col 54}{space 4}-6.412559{col 67}{space 3} 5.108609
{txt}{space 9}DC  {c |}{col 14}{res}{space 2}-.9104431{col 26}{space 2} 2.973277{col 37}{space 1}   -0.31{col 46}{space 3}0.759{col 54}{space 4}-6.739019{col 67}{space 3} 4.918133
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-.4914253{col 26}{space 2}  2.96782{col 37}{space 1}   -0.17{col 46}{space 3}0.868{col 54}{space 4}-6.309303{col 67}{space 3} 5.326452
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-.2128382{col 26}{space 2} 2.938614{col 37}{space 1}   -0.07{col 46}{space 3}0.942{col 54}{space 4}-5.973463{col 67}{space 3} 5.547787
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-.3574923{col 26}{space 2} 2.941604{col 37}{space 1}   -0.12{col 46}{space 3}0.903{col 54}{space 4}-6.123978{col 67}{space 3} 5.408994
{txt}{space 9}HI  {c |}{col 14}{res}{space 2}  .443806{col 26}{space 2} 3.024931{col 37}{space 1}    0.15{col 46}{space 3}0.883{col 54}{space 4}-5.486028{col 67}{space 3}  6.37364
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-.8040248{col 26}{space 2} 2.939708{col 37}{space 1}   -0.27{col 46}{space 3}0.784{col 54}{space 4}-6.566793{col 67}{space 3} 4.958744
{txt}{space 9}ID  {c |}{col 14}{res}{space 2}  .112126{col 26}{space 2} 2.975347{col 37}{space 1}    0.04{col 46}{space 3}0.970{col 54}{space 4}-5.720507{col 67}{space 3} 5.944759
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-.6231419{col 26}{space 2} 2.937145{col 37}{space 1}   -0.21{col 46}{space 3}0.832{col 54}{space 4}-6.380887{col 67}{space 3} 5.134603
{txt}{space 9}IN  {c |}{col 14}{res}{space 2}-.2355803{col 26}{space 2} 2.943141{col 37}{space 1}   -0.08{col 46}{space 3}0.936{col 54}{space 4} -6.00508{col 67}{space 3} 5.533919
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-.1185526{col 26}{space 2} 2.958174{col 37}{space 1}   -0.04{col 46}{space 3}0.968{col 54}{space 4}-5.917522{col 67}{space 3} 5.680417
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-.4204995{col 26}{space 2} 2.946518{col 37}{space 1}   -0.14{col 46}{space 3}0.887{col 54}{space 4}-6.196617{col 67}{space 3} 5.355618
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-1.170437{col 26}{space 2} 2.948208{col 37}{space 1}   -0.40{col 46}{space 3}0.691{col 54}{space 4}-6.949868{col 67}{space 3} 4.608994
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-.2194616{col 26}{space 2} 2.942944{col 37}{space 1}   -0.07{col 46}{space 3}0.941{col 54}{space 4}-5.988574{col 67}{space 3} 5.549651
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-.5812702{col 26}{space 2} 2.945083{col 37}{space 1}   -0.20{col 46}{space 3}0.844{col 54}{space 4}-6.354576{col 67}{space 3} 5.192036
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-1.072754{col 26}{space 2} 2.956697{col 37}{space 1}   -0.36{col 46}{space 3}0.717{col 54}{space 4}-6.868826{col 67}{space 3} 4.723318
{txt}{space 9}MI  {c |}{col 14}{res}{space 2}-.7608508{col 26}{space 2} 2.935083{col 37}{space 1}   -0.26{col 46}{space 3}0.795{col 54}{space 4}-6.514554{col 67}{space 3} 4.992852
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-.6144672{col 26}{space 2} 2.940676{col 37}{space 1}   -0.21{col 46}{space 3}0.834{col 54}{space 4}-6.379134{col 67}{space 3} 5.150199
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-.2989121{col 26}{space 2} 2.942527{col 37}{space 1}   -0.10{col 46}{space 3}0.919{col 54}{space 4}-6.067208{col 67}{space 3} 5.469383
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-.6624857{col 26}{space 2}  2.95545{col 37}{space 1}   -0.22{col 46}{space 3}0.823{col 54}{space 4}-6.456114{col 67}{space 3} 5.131143
{txt}{space 9}MT  {c |}{col 14}{res}{space 2}  -.00086{col 26}{space 2} 2.987461{col 37}{space 1}   -0.00{col 46}{space 3}1.000{col 54}{space 4} -5.85724{col 67}{space 3}  5.85552
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-.3287095{col 26}{space 2} 2.938879{col 37}{space 1}   -0.11{col 46}{space 3}0.911{col 54}{space 4}-6.089854{col 67}{space 3} 5.432435
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-.4236777{col 26}{space 2} 2.979105{col 37}{space 1}   -0.14{col 46}{space 3}0.887{col 54}{space 4}-6.263678{col 67}{space 3} 5.416322
{txt}{space 9}NE  {c |}{col 14}{res}{space 2}-.7065205{col 26}{space 2} 2.946111{col 37}{space 1}   -0.24{col 46}{space 3}0.810{col 54}{space 4}-6.481842{col 67}{space 3} 5.068801
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-.1936189{col 26}{space 2} 2.958933{col 37}{space 1}   -0.07{col 46}{space 3}0.948{col 54}{space 4}-5.994076{col 67}{space 3} 5.606838
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-.6173517{col 26}{space 2}  2.93828{col 37}{space 1}   -0.21{col 46}{space 3}0.834{col 54}{space 4}-6.377321{col 67}{space 3} 5.142618
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-.8067514{col 26}{space 2} 2.953646{col 37}{space 1}   -0.27{col 46}{space 3}0.785{col 54}{space 4}-6.596844{col 67}{space 3} 4.983341
{txt}{space 9}NV  {c |}{col 14}{res}{space 2} .2410248{col 26}{space 2} 2.973545{col 37}{space 1}    0.08{col 46}{space 3}0.935{col 54}{space 4}-5.588076{col 67}{space 3} 6.070126
{txt}{space 9}NY  {c |}{col 14}{res}{space 2} -.241835{col 26}{space 2} 2.937805{col 37}{space 1}   -0.08{col 46}{space 3}0.934{col 54}{space 4}-6.000873{col 67}{space 3} 5.517204
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-.2484464{col 26}{space 2} 2.936785{col 37}{space 1}   -0.08{col 46}{space 3}0.933{col 54}{space 4}-6.005485{col 67}{space 3} 5.508592
{txt}{space 9}OK  {c |}{col 14}{res}{space 2} -.311468{col 26}{space 2} 2.965058{col 37}{space 1}   -0.11{col 46}{space 3}0.916{col 54}{space 4}-6.123931{col 67}{space 3} 5.500995
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-.7103276{col 26}{space 2} 2.943311{col 37}{space 1}   -0.24{col 46}{space 3}0.809{col 54}{space 4} -6.48016{col 67}{space 3} 5.059505
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-.4236235{col 26}{space 2} 2.936132{col 37}{space 1}   -0.14{col 46}{space 3}0.885{col 54}{space 4}-6.179382{col 67}{space 3} 5.332135
{txt}{space 9}RI  {c |}{col 14}{res}{space 2} .2369912{col 26}{space 2} 3.019954{col 37}{space 1}    0.08{col 46}{space 3}0.937{col 54}{space 4}-5.683086{col 67}{space 3} 6.157069
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-.3817763{col 26}{space 2} 2.953868{col 37}{space 1}   -0.13{col 46}{space 3}0.897{col 54}{space 4}-6.172304{col 67}{space 3} 5.408751
{txt}{space 9}SD  {c |}{col 14}{res}{space 2} .5842079{col 26}{space 2} 3.020854{col 37}{space 1}    0.19{col 46}{space 3}0.847{col 54}{space 4}-5.337633{col 67}{space 3} 6.506049
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-.2899631{col 26}{space 2}  2.94787{col 37}{space 1}   -0.10{col 46}{space 3}0.922{col 54}{space 4}-6.068733{col 67}{space 3} 5.488806
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-.2720348{col 26}{space 2} 2.938368{col 37}{space 1}   -0.09{col 46}{space 3}0.926{col 54}{space 4}-6.032177{col 67}{space 3} 5.488107
{txt}{space 9}UT  {c |}{col 14}{res}{space 2}-.3926161{col 26}{space 2} 2.950852{col 37}{space 1}   -0.13{col 46}{space 3}0.894{col 54}{space 4} -6.17723{col 67}{space 3} 5.391998
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}-.3445113{col 26}{space 2} 2.940359{col 37}{space 1}   -0.12{col 46}{space 3}0.907{col 54}{space 4}-6.108556{col 67}{space 3} 5.419533
{txt}{space 9}VT  {c |}{col 14}{res}{space 2} 1.068175{col 26}{space 2} 2.997237{col 37}{space 1}    0.36{col 46}{space 3}0.722{col 54}{space 4}-4.807371{col 67}{space 3}  6.94372
{txt}{space 9}WA  {c |}{col 14}{res}{space 2}-.3897364{col 26}{space 2} 2.947218{col 37}{space 1}   -0.13{col 46}{space 3}0.895{col 54}{space 4}-6.167228{col 67}{space 3} 5.387755
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-.3560557{col 26}{space 2} 2.940875{col 37}{space 1}   -0.12{col 46}{space 3}0.904{col 54}{space 4}-6.121112{col 67}{space 3} 5.409001
{txt}{space 9}WV  {c |}{col 14}{res}{space 2} -.667903{col 26}{space 2} 2.958629{col 37}{space 1}   -0.23{col 46}{space 3}0.821{col 54}{space 4}-6.467763{col 67}{space 3} 5.131957
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-.7359552{col 26}{space 2} 2.952046{col 37}{space 1}   -0.25{col 46}{space 3}0.803{col 54}{space 4} -6.52291{col 67}{space 3}    5.051
{txt}{space 12} {c |}
{space 7}2.Q33 {c |}{col 14}{res}{space 2}-.2182977{col 26}{space 2} .0719859{col 37}{space 1}   -3.03{col 46}{space 3}0.002{col 54}{space 4}-.3594131{col 67}{space 3}-.0771824
{txt}{space 7}2.Q34 {c |}{col 14}{res}{space 2} .0106788{col 26}{space 2} .1431002{col 37}{space 1}    0.07{col 46}{space 3}0.941{col 54}{space 4}-.2698435{col 67}{space 3} .2912011
{txt}{space 7}Q35_1 {c |}{col 14}{res}{space 2}-.2105176{col 26}{space 2} .1940967{col 37}{space 1}   -1.08{col 46}{space 3}0.278{col 54}{space 4}-.5910093{col 67}{space 3} .1699741
{txt}{space 7}Q35_2 {c |}{col 14}{res}{space 2}  .127849{col 26}{space 2} .2107234{col 37}{space 1}    0.61{col 46}{space 3}0.544{col 54}{space 4}-.2852363{col 67}{space 3} .5409342
{txt}{space 7}Q35_3 {c |}{col 14}{res}{space 2}  -.11671{col 26}{space 2} .2359468{col 37}{space 1}   -0.49{col 46}{space 3}0.621{col 54}{space 4}-.5792413{col 67}{space 3} .3458213
{txt}{space 7}Q35_4 {c |}{col 14}{res}{space 2}-.3541533{col 26}{space 2} .2154347{col 37}{space 1}   -1.64{col 46}{space 3}0.100{col 54}{space 4}-.7764744{col 67}{space 3} .0681677
{txt}{space 7}Q35_5 {c |}{col 14}{res}{space 2}-.5137777{col 26}{space 2} .3365378{col 37}{space 1}   -1.53{col 46}{space 3}0.127{col 54}{space 4}  -1.1735{col 67}{space 3}  .145944
{txt}{space 7}Q35_6 {c |}{col 14}{res}{space 2} .1384307{col 26}{space 2} .2305913{col 37}{space 1}    0.60{col 46}{space 3}0.548{col 54}{space 4}-.3136021{col 67}{space 3} .5904634
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.292447{col 26}{space 2}  2.98993{col 37}{space 1}    0.77{col 46}{space 3}0.443{col 54}{space 4}-3.568772{col 67}{space 3} 8.153667
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est11{txt} stored)

Linear regression                                      Number of obs ={res}    5636
                                                       {txt}F( 75,  5560) ={res}    2.17
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0357
                                                       {txt}Root MSE      = {res}  2.409

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     IncMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2}  .084553{col 26}{space 2} .1911542{col 37}{space 1}    0.44{col 46}{space 3}0.658{col 54}{space 4} -.290184{col 67}{space 3}   .45929
{txt}{space 8}Old  {c |}{col 14}{res}{space 2} .1259041{col 26}{space 2} .2633028{col 37}{space 1}    0.48{col 46}{space 3}0.633{col 54}{space 4}-.3902722{col 67}{space 3} .6420804
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2} .0112221{col 26}{space 2} .1335446{col 37}{space 1}    0.08{col 46}{space 3}0.933{col 54}{space 4}-.2505775{col 67}{space 3} .2730217
{txt}High Educ..  {c |}{col 14}{res}{space 2}-.2030006{col 26}{space 2} .1257056{col 37}{space 1}   -1.61{col 46}{space 3}0.106{col 54}{space 4}-.4494326{col 67}{space 3} .0434314
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2}-.1896475{col 26}{space 2} .1084121{col 37}{space 1}   -1.75{col 46}{space 3}0.080{col 54}{space 4}-.4021776{col 67}{space 3} .0228827
{txt}High Income  {c |}{col 14}{res}{space 2}-.1001414{col 26}{space 2} .1102067{col 37}{space 1}   -0.91{col 46}{space 3}0.364{col 54}{space 4}-.3161896{col 67}{space 3} .1159069
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2} -.045329{col 26}{space 2} .1857903{col 37}{space 1}   -0.24{col 46}{space 3}0.807{col 54}{space 4}-.4095506{col 67}{space 3} .3188926
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} .1716604{col 26}{space 2} .2728823{col 37}{space 1}    0.63{col 46}{space 3}0.529{col 54}{space 4}-.3632955{col 67}{space 3} .7066163
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2} .0145432{col 26}{space 2} .0985859{col 37}{space 1}    0.15{col 46}{space 3}0.883{col 54}{space 4}-.1787236{col 67}{space 3} .2078101
{txt}{space 7}2015  {c |}{col 14}{res}{space 2} .2371347{col 26}{space 2} .1033951{col 37}{space 1}    2.29{col 46}{space 3}0.022{col 54}{space 4}   .03444{col 67}{space 3} .4398294
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1385829{col 26}{space 2} .1003918{col 37}{space 1}    1.38{col 46}{space 3}0.168{col 54}{space 4}-.0582242{col 67}{space 3} .3353901
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .3248156{col 26}{space 2} .1081933{col 37}{space 1}    3.00{col 46}{space 3}0.003{col 54}{space 4} .1127144{col 67}{space 3} .5369167
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .3710213{col 26}{space 2} .1510139{col 37}{space 1}    2.46{col 46}{space 3}0.014{col 54}{space 4}  .074975{col 67}{space 3} .6670676
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2}-.9905595{col 26}{space 2} 4.238157{col 37}{space 1}   -0.23{col 46}{space 3}0.815{col 54}{space 4}-9.299003{col 67}{space 3} 7.317884
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-.8843823{col 26}{space 2} 4.250482{col 37}{space 1}   -0.21{col 46}{space 3}0.835{col 54}{space 4}-9.216987{col 67}{space 3} 7.448223
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-1.436429{col 26}{space 2} 4.230788{col 37}{space 1}   -0.34{col 46}{space 3}0.734{col 54}{space 4}-9.730426{col 67}{space 3} 6.857568
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-1.265035{col 26}{space 2} 4.228539{col 37}{space 1}   -0.30{col 46}{space 3}0.765{col 54}{space 4}-9.554624{col 67}{space 3} 7.024554
{txt}{space 9}CO  {c |}{col 14}{res}{space 2} -1.48086{col 26}{space 2} 4.225732{col 37}{space 1}   -0.35{col 46}{space 3}0.726{col 54}{space 4}-9.764946{col 67}{space 3} 6.803226
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-1.403396{col 26}{space 2} 4.225811{col 37}{space 1}   -0.33{col 46}{space 3}0.740{col 54}{space 4}-9.687636{col 67}{space 3} 6.880844
{txt}{space 9}DC  {c |}{col 14}{res}{space 2} -1.63295{col 26}{space 2} 4.259139{col 37}{space 1}   -0.38{col 46}{space 3}0.701{col 54}{space 4}-9.982526{col 67}{space 3} 6.716626
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-1.187062{col 26}{space 2} 4.252822{col 37}{space 1}   -0.28{col 46}{space 3}0.780{col 54}{space 4}-9.524255{col 67}{space 3} 7.150131
{txt}{space 9}FL  {c |}{col 14}{res}{space 2} -1.21477{col 26}{space 2}  4.22781{col 37}{space 1}   -0.29{col 46}{space 3}0.774{col 54}{space 4} -9.50293{col 67}{space 3}  7.07339
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-1.303625{col 26}{space 2} 4.228974{col 37}{space 1}   -0.31{col 46}{space 3}0.758{col 54}{space 4}-9.594066{col 67}{space 3} 6.986817
{txt}{space 9}HI  {c |}{col 14}{res}{space 2}-1.173294{col 26}{space 2} 4.253166{col 37}{space 1}   -0.28{col 46}{space 3}0.783{col 54}{space 4} -9.51116{col 67}{space 3} 7.164573
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-1.500232{col 26}{space 2} 4.226349{col 37}{space 1}   -0.35{col 46}{space 3}0.723{col 54}{space 4}-9.785527{col 67}{space 3} 6.785063
{txt}{space 9}ID  {c |}{col 14}{res}{space 2}-.4641302{col 26}{space 2} 4.263958{col 37}{space 1}   -0.11{col 46}{space 3}0.913{col 54}{space 4}-8.823154{col 67}{space 3} 7.894894
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-1.315684{col 26}{space 2} 4.225348{col 37}{space 1}   -0.31{col 46}{space 3}0.756{col 54}{space 4}-9.599018{col 67}{space 3}  6.96765
{txt}{space 9}IN  {c |}{col 14}{res}{space 2}-1.159597{col 26}{space 2} 4.230959{col 37}{space 1}   -0.27{col 46}{space 3}0.784{col 54}{space 4} -9.45393{col 67}{space 3} 7.134736
{txt}{space 9}KS  {c |}{col 14}{res}{space 2} -1.33993{col 26}{space 2} 4.234395{col 37}{space 1}   -0.32{col 46}{space 3}0.752{col 54}{space 4}-9.640999{col 67}{space 3} 6.961139
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-1.205048{col 26}{space 2} 4.235186{col 37}{space 1}   -0.28{col 46}{space 3}0.776{col 54}{space 4}-9.507668{col 67}{space 3} 7.097572
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-1.848802{col 26}{space 2}  4.24199{col 37}{space 1}   -0.44{col 46}{space 3}0.663{col 54}{space 4}-10.16476{col 67}{space 3} 6.467157
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-1.087398{col 26}{space 2} 4.229237{col 37}{space 1}   -0.26{col 46}{space 3}0.797{col 54}{space 4}-9.378354{col 67}{space 3} 7.203559
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-1.504698{col 26}{space 2} 4.230894{col 37}{space 1}   -0.36{col 46}{space 3}0.722{col 54}{space 4}-9.798903{col 67}{space 3} 6.789508
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-1.899068{col 26}{space 2} 4.241358{col 37}{space 1}   -0.45{col 46}{space 3}0.654{col 54}{space 4}-10.21379{col 67}{space 3} 6.415651
{txt}{space 9}MI  {c |}{col 14}{res}{space 2} -1.60074{col 26}{space 2} 4.224311{col 37}{space 1}   -0.38{col 46}{space 3}0.705{col 54}{space 4} -9.88204{col 67}{space 3} 6.680561
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-1.399009{col 26}{space 2} 4.226992{col 37}{space 1}   -0.33{col 46}{space 3}0.741{col 54}{space 4}-9.685565{col 67}{space 3} 6.887548
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-1.211276{col 26}{space 2} 4.229237{col 37}{space 1}   -0.29{col 46}{space 3}0.775{col 54}{space 4}-9.502234{col 67}{space 3} 7.079681
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-1.644601{col 26}{space 2} 4.227306{col 37}{space 1}   -0.39{col 46}{space 3}0.697{col 54}{space 4}-9.931772{col 67}{space 3} 6.642571
{txt}{space 9}MT  {c |}{col 14}{res}{space 2} -.546548{col 26}{space 2} 4.278908{col 37}{space 1}   -0.13{col 46}{space 3}0.898{col 54}{space 4} -8.93488{col 67}{space 3} 7.841784
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-1.286288{col 26}{space 2}  4.22713{col 37}{space 1}   -0.30{col 46}{space 3}0.761{col 54}{space 4}-9.573114{col 67}{space 3} 7.000538
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-1.228417{col 26}{space 2} 4.261649{col 37}{space 1}   -0.29{col 46}{space 3}0.773{col 54}{space 4}-9.582913{col 67}{space 3}  7.12608
{txt}{space 9}NE  {c |}{col 14}{res}{space 2}-1.462458{col 26}{space 2} 4.235158{col 37}{space 1}   -0.35{col 46}{space 3}0.730{col 54}{space 4}-9.765022{col 67}{space 3} 6.840107
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-1.188262{col 26}{space 2} 4.231848{col 37}{space 1}   -0.28{col 46}{space 3}0.779{col 54}{space 4}-9.484338{col 67}{space 3} 7.107814
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-1.400264{col 26}{space 2} 4.226075{col 37}{space 1}   -0.33{col 46}{space 3}0.740{col 54}{space 4}-9.685022{col 67}{space 3} 6.884495
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-1.755153{col 26}{space 2} 4.229722{col 37}{space 1}   -0.41{col 46}{space 3}0.678{col 54}{space 4}-10.04706{col 67}{space 3} 6.536755
{txt}{space 9}NV  {c |}{col 14}{res}{space 2} -.818904{col 26}{space 2} 4.251014{col 37}{space 1}   -0.19{col 46}{space 3}0.847{col 54}{space 4}-9.152553{col 67}{space 3} 7.514745
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-1.220296{col 26}{space 2} 4.224582{col 37}{space 1}   -0.29{col 46}{space 3}0.773{col 54}{space 4}-9.502127{col 67}{space 3} 7.061536
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-1.015032{col 26}{space 2} 4.225997{col 37}{space 1}   -0.24{col 46}{space 3}0.810{col 54}{space 4}-9.299638{col 67}{space 3} 7.269573
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-1.662516{col 26}{space 2}  4.24257{col 37}{space 1}   -0.39{col 46}{space 3}0.695{col 54}{space 4}-9.979611{col 67}{space 3} 6.654579
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-1.486177{col 26}{space 2} 4.230399{col 37}{space 1}   -0.35{col 46}{space 3}0.725{col 54}{space 4}-9.779413{col 67}{space 3} 6.807059
{txt}{space 9}PA  {c |}{col 14}{res}{space 2} -1.24816{col 26}{space 2} 4.224678{col 37}{space 1}   -0.30{col 46}{space 3}0.768{col 54}{space 4}-9.530179{col 67}{space 3} 7.033859
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-.4625294{col 26}{space 2} 4.294295{col 37}{space 1}   -0.11{col 46}{space 3}0.914{col 54}{space 4}-8.881026{col 67}{space 3} 7.955967
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-1.045454{col 26}{space 2}  4.24365{col 37}{space 1}   -0.25{col 46}{space 3}0.805{col 54}{space 4}-9.364666{col 67}{space 3} 7.273757
{txt}{space 9}SD  {c |}{col 14}{res}{space 2}-.5246649{col 26}{space 2} 4.298442{col 37}{space 1}   -0.12{col 46}{space 3}0.903{col 54}{space 4} -8.95129{col 67}{space 3}  7.90196
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-1.339813{col 26}{space 2}  4.23237{col 37}{space 1}   -0.32{col 46}{space 3}0.752{col 54}{space 4}-9.636913{col 67}{space 3} 6.957286
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-1.251795{col 26}{space 2} 4.226084{col 37}{space 1}   -0.30{col 46}{space 3}0.767{col 54}{space 4} -9.53657{col 67}{space 3}  7.03298
{txt}{space 9}UT  {c |}{col 14}{res}{space 2}-1.429183{col 26}{space 2} 4.235384{col 37}{space 1}   -0.34{col 46}{space 3}0.736{col 54}{space 4} -9.73219{col 67}{space 3} 6.873824
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}-1.331841{col 26}{space 2} 4.227564{col 37}{space 1}   -0.32{col 46}{space 3}0.753{col 54}{space 4}-9.619519{col 67}{space 3} 6.955836
{txt}{space 9}VT  {c |}{col 14}{res}{space 2} .3653065{col 26}{space 2} 4.263875{col 37}{space 1}    0.09{col 46}{space 3}0.932{col 54}{space 4}-7.993555{col 67}{space 3} 8.724168
{txt}{space 9}WA  {c |}{col 14}{res}{space 2}-1.373737{col 26}{space 2}  4.22942{col 37}{space 1}   -0.32{col 46}{space 3}0.745{col 54}{space 4}-9.665053{col 67}{space 3}  6.91758
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-1.329717{col 26}{space 2} 4.227849{col 37}{space 1}   -0.31{col 46}{space 3}0.753{col 54}{space 4}-9.617954{col 67}{space 3}  6.95852
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-1.729243{col 26}{space 2} 4.228133{col 37}{space 1}   -0.41{col 46}{space 3}0.683{col 54}{space 4}-10.01804{col 67}{space 3}  6.55955
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-1.555273{col 26}{space 2} 4.232859{col 37}{space 1}   -0.37{col 46}{space 3}0.713{col 54}{space 4} -9.85333{col 67}{space 3} 6.742785
{txt}{space 12} {c |}
{space 7}2.Q33 {c |}{col 14}{res}{space 2}-.1202269{col 26}{space 2} .0664433{col 37}{space 1}   -1.81{col 46}{space 3}0.070{col 54}{space 4}-.2504818{col 67}{space 3} .0100279
{txt}{space 7}2.Q34 {c |}{col 14}{res}{space 2} .0794781{col 26}{space 2}  .125778{col 37}{space 1}    0.63{col 46}{space 3}0.527{col 54}{space 4}-.1670959{col 67}{space 3}  .326052
{txt}{space 7}Q35_1 {c |}{col 14}{res}{space 2} .0329452{col 26}{space 2} .1879645{col 37}{space 1}    0.18{col 46}{space 3}0.861{col 54}{space 4}-.3355385{col 67}{space 3}  .401429
{txt}{space 7}Q35_2 {c |}{col 14}{res}{space 2} .1980281{col 26}{space 2} .2029184{col 37}{space 1}    0.98{col 46}{space 3}0.329{col 54}{space 4}-.1997713{col 67}{space 3} .5958276
{txt}{space 7}Q35_3 {c |}{col 14}{res}{space 2}  .092662{col 26}{space 2} .2791982{col 37}{space 1}    0.33{col 46}{space 3}0.740{col 54}{space 4}-.4546755{col 67}{space 3} .6399995
{txt}{space 7}Q35_4 {c |}{col 14}{res}{space 2}-.1234669{col 26}{space 2} .1991447{col 37}{space 1}   -0.62{col 46}{space 3}0.535{col 54}{space 4}-.5138683{col 67}{space 3} .2669346
{txt}{space 7}Q35_5 {c |}{col 14}{res}{space 2}-.5835956{col 26}{space 2} .2346952{col 37}{space 1}   -2.49{col 46}{space 3}0.013{col 54}{space 4} -1.04369{col 67}{space 3}-.1235013
{txt}{space 7}Q35_6 {c |}{col 14}{res}{space 2} .1737363{col 26}{space 2} .2142678{col 37}{space 1}    0.81{col 46}{space 3}0.417{col 54}{space 4}-.2463123{col 67}{space 3} .5937848
{txt}{space 7}Q4new {c |}{col 14}{res}{space 2} -.004557{col 26}{space 2} .0015738{col 37}{space 1}   -2.90{col 46}{space 3}0.004{col 54}{space 4}-.0076423{col 67}{space 3}-.0014718
{txt}{space 7}Q6new {c |}{col 14}{res}{space 2} .0009154{col 26}{space 2} .0016571{col 37}{space 1}    0.55{col 46}{space 3}0.581{col 54}{space 4}-.0023332{col 67}{space 3} .0041639
{txt}{space 5}Q9_mean {c |}{col 14}{res}{space 2} .0468747{col 26}{space 2} .0096695{col 37}{space 1}    4.85{col 46}{space 3}0.000{col 54}{space 4} .0279187{col 67}{space 3} .0658307
{txt}{space 6}Q13new {c |}{col 14}{res}{space 2}-.0110395{col 26}{space 2} .0017097{col 37}{space 1}   -6.46{col 46}{space 3}0.000{col 54}{space 4}-.0143911{col 67}{space 3}-.0076878
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.835774{col 26}{space 2} 4.276724{col 37}{space 1}    0.66{col 46}{space 3}0.507{col 54}{space 4}-5.548276{col 67}{space 3} 11.21982
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est12{txt} stored)

Linear regression                                      Number of obs ={res}    6734
                                                       {txt}F( 63,  6670) ={res}    1.43
                                                       {txt}Prob > F      = {res} 0.0139
                                                       {txt}R-squared     = {res} 0.0128
                                                       {txt}Root MSE      = {res} .86602

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}      IncVar{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2}  .025356{col 26}{space 2} .0575121{col 37}{space 1}    0.44{col 46}{space 3}0.659{col 54}{space 4}-.0873861{col 67}{space 3} .1380981
{txt}{space 8}Old  {c |}{col 14}{res}{space 2} .0834433{col 26}{space 2} .0812167{col 37}{space 1}    1.03{col 46}{space 3}0.304{col 54}{space 4}-.0757673{col 67}{space 3}  .242654
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2} .0394972{col 26}{space 2} .0393305{col 37}{space 1}    1.00{col 46}{space 3}0.315{col 54}{space 4}-.0376032{col 67}{space 3} .1165976
{txt}High Educ..  {c |}{col 14}{res}{space 2}-.0223689{col 26}{space 2} .0379303{col 37}{space 1}   -0.59{col 46}{space 3}0.555{col 54}{space 4}-.0967243{col 67}{space 3} .0519865
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2}-.1053985{col 26}{space 2} .0341999{col 37}{space 1}   -3.08{col 46}{space 3}0.002{col 54}{space 4}-.1724414{col 67}{space 3}-.0383557
{txt}High Income  {c |}{col 14}{res}{space 2}-.0911693{col 26}{space 2} .0350563{col 37}{space 1}   -2.60{col 46}{space 3}0.009{col 54}{space 4}-.1598908{col 67}{space 3}-.0224477
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2}-.0313579{col 26}{space 2} .0590068{col 37}{space 1}   -0.53{col 46}{space 3}0.595{col 54}{space 4}-.1470302{col 67}{space 3} .0843144
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} .0114216{col 26}{space 2} .0837043{col 37}{space 1}    0.14{col 46}{space 3}0.891{col 54}{space 4}-.1526656{col 67}{space 3} .1755089
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2}-.0031635{col 26}{space 2} .0317199{col 37}{space 1}   -0.10{col 46}{space 3}0.921{col 54}{space 4}-.0653447{col 67}{space 3} .0590177
{txt}{space 7}2015  {c |}{col 14}{res}{space 2} .0102392{col 26}{space 2} .0328651{col 37}{space 1}    0.31{col 46}{space 3}0.755{col 54}{space 4}-.0541868{col 67}{space 3} .0746653
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0156851{col 26}{space 2} .0330693{col 37}{space 1}    0.47{col 46}{space 3}0.635{col 54}{space 4}-.0491412{col 67}{space 3} .0805114
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0710537{col 26}{space 2} .0359019{col 37}{space 1}    1.98{col 46}{space 3}0.048{col 54}{space 4} .0006745{col 67}{space 3} .1414328
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1048134{col 26}{space 2} .0502915{col 37}{space 1}    2.08{col 46}{space 3}0.037{col 54}{space 4} .0062258{col 67}{space 3} .2034009
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2}-.9296282{col 26}{space 2} .8051628{col 37}{space 1}   -1.15{col 46}{space 3}0.248{col 54}{space 4}-2.508005{col 67}{space 3} .6487484
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-.7648046{col 26}{space 2} .8145431{col 37}{space 1}   -0.94{col 46}{space 3}0.348{col 54}{space 4}-2.361569{col 67}{space 3} .8319603
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-.9398363{col 26}{space 2} .8022264{col 37}{space 1}   -1.17{col 46}{space 3}0.241{col 54}{space 4}-2.512456{col 67}{space 3} .6327839
{txt}{space 9}CA  {c |}{col 14}{res}{space 2} -.856291{col 26}{space 2} .8018046{col 37}{space 1}   -1.07{col 46}{space 3}0.286{col 54}{space 4}-2.428084{col 67}{space 3} .7155023
{txt}{space 9}CO  {c |}{col 14}{res}{space 2}-1.039865{col 26}{space 2} .8020135{col 37}{space 1}   -1.30{col 46}{space 3}0.195{col 54}{space 4}-2.612068{col 67}{space 3} .5323381
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-1.017389{col 26}{space 2} .8020853{col 37}{space 1}   -1.27{col 46}{space 3}0.205{col 54}{space 4}-2.589733{col 67}{space 3} .5549549
{txt}{space 9}DC  {c |}{col 14}{res}{space 2}-1.004029{col 26}{space 2}  .813235{col 37}{space 1}   -1.23{col 46}{space 3}0.217{col 54}{space 4} -2.59823{col 67}{space 3} .5901717
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-1.094946{col 26}{space 2} .8041693{col 37}{space 1}   -1.36{col 46}{space 3}0.173{col 54}{space 4}-2.671375{col 67}{space 3}  .481483
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-.8425708{col 26}{space 2} .8022738{col 37}{space 1}   -1.05{col 46}{space 3}0.294{col 54}{space 4}-2.415284{col 67}{space 3} .7301424
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-.8674455{col 26}{space 2} .8033101{col 37}{space 1}   -1.08{col 46}{space 3}0.280{col 54}{space 4} -2.44219{col 67}{space 3} .7072991
{txt}{space 9}HI  {c |}{col 14}{res}{space 2}-.9533776{col 26}{space 2} .8087293{col 37}{space 1}   -1.18{col 46}{space 3}0.238{col 54}{space 4}-2.538746{col 67}{space 3} .6319904
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-1.005566{col 26}{space 2} .8018134{col 37}{space 1}   -1.25{col 46}{space 3}0.210{col 54}{space 4}-2.577377{col 67}{space 3} .5662443
{txt}{space 9}ID  {c |}{col 14}{res}{space 2}-.7810513{col 26}{space 2} .8150133{col 37}{space 1}   -0.96{col 46}{space 3}0.338{col 54}{space 4}-2.378738{col 67}{space 3} .8166353
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-.9841026{col 26}{space 2} .8014046{col 37}{space 1}   -1.23{col 46}{space 3}0.220{col 54}{space 4}-2.555112{col 67}{space 3} .5869067
{txt}{space 9}IN  {c |}{col 14}{res}{space 2}-.8753823{col 26}{space 2} .8047813{col 37}{space 1}   -1.09{col 46}{space 3}0.277{col 54}{space 4}-2.453011{col 67}{space 3} .7022463
{txt}{space 9}KS  {c |}{col 14}{res}{space 2} -.826807{col 26}{space 2} .8101804{col 37}{space 1}   -1.02{col 46}{space 3}0.308{col 54}{space 4} -2.41502{col 67}{space 3} .7614056
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-.8804784{col 26}{space 2} .8075754{col 37}{space 1}   -1.09{col 46}{space 3}0.276{col 54}{space 4}-2.463584{col 67}{space 3} .7026276
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-1.009014{col 26}{space 2} .8052837{col 37}{space 1}   -1.25{col 46}{space 3}0.210{col 54}{space 4}-2.587627{col 67}{space 3} .5695999
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-.8575999{col 26}{space 2} .8039981{col 37}{space 1}   -1.07{col 46}{space 3}0.286{col 54}{space 4}-2.433693{col 67}{space 3} .7184935
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-.9103047{col 26}{space 2} .8045104{col 37}{space 1}   -1.13{col 46}{space 3}0.258{col 54}{space 4}-2.487402{col 67}{space 3} .6667929
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-.8736017{col 26}{space 2} .8059153{col 37}{space 1}   -1.08{col 46}{space 3}0.278{col 54}{space 4}-2.453453{col 67}{space 3} .7062499
{txt}{space 9}MI  {c |}{col 14}{res}{space 2}-.9985261{col 26}{space 2} .8013081{col 37}{space 1}   -1.25{col 46}{space 3}0.213{col 54}{space 4}-2.569346{col 67}{space 3}  .572294
{txt}{space 9}MN  {c |}{col 14}{res}{space 2} -1.00189{col 26}{space 2} .8025784{col 37}{space 1}   -1.25{col 46}{space 3}0.212{col 54}{space 4}  -2.5752{col 67}{space 3} .5714208
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-.9488117{col 26}{space 2} .8031401{col 37}{space 1}   -1.18{col 46}{space 3}0.237{col 54}{space 4}-2.523223{col 67}{space 3} .6255996
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-.9751857{col 26}{space 2} .8096144{col 37}{space 1}   -1.20{col 46}{space 3}0.228{col 54}{space 4}-2.562289{col 67}{space 3} .6119173
{txt}{space 9}MT  {c |}{col 14}{res}{space 2}-.8888909{col 26}{space 2} .8091573{col 37}{space 1}   -1.10{col 46}{space 3}0.272{col 54}{space 4}-2.475098{col 67}{space 3} .6973162
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-.8778235{col 26}{space 2} .8030456{col 37}{space 1}   -1.09{col 46}{space 3}0.274{col 54}{space 4} -2.45205{col 67}{space 3} .6964026
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-.9136347{col 26}{space 2} .8183734{col 37}{space 1}   -1.12{col 46}{space 3}0.264{col 54}{space 4}-2.517908{col 67}{space 3} .6906388
{txt}{space 9}NE  {c |}{col 14}{res}{space 2}-.9693258{col 26}{space 2}  .808011{col 37}{space 1}   -1.20{col 46}{space 3}0.230{col 54}{space 4}-2.553286{col 67}{space 3} .6146341
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-.8443262{col 26}{space 2} .8099467{col 37}{space 1}   -1.04{col 46}{space 3}0.297{col 54}{space 4}-2.432081{col 67}{space 3} .7434283
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2} -.967205{col 26}{space 2} .8026655{col 37}{space 1}   -1.20{col 46}{space 3}0.228{col 54}{space 4}-2.540686{col 67}{space 3}  .606276
{txt}{space 9}NM  {c |}{col 14}{res}{space 2} -1.08775{col 26}{space 2} .8027704{col 37}{space 1}   -1.35{col 46}{space 3}0.175{col 54}{space 4}-2.661437{col 67}{space 3} .4859362
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}-.8148055{col 26}{space 2} .8138179{col 37}{space 1}   -1.00{col 46}{space 3}0.317{col 54}{space 4}-2.410149{col 67}{space 3} .7805377
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-.8867519{col 26}{space 2} .8017445{col 37}{space 1}   -1.11{col 46}{space 3}0.269{col 54}{space 4}-2.458427{col 67}{space 3} .6849235
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-.8995119{col 26}{space 2}   .80222{col 37}{space 1}   -1.12{col 46}{space 3}0.262{col 54}{space 4} -2.47212{col 67}{space 3} .6730958
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-.8780955{col 26}{space 2} .8114918{col 37}{space 1}   -1.08{col 46}{space 3}0.279{col 54}{space 4}-2.468879{col 67}{space 3} .7126878
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-.9798947{col 26}{space 2} .8020355{col 37}{space 1}   -1.22{col 46}{space 3}0.222{col 54}{space 4}-2.552141{col 67}{space 3} .5923514
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-.9215311{col 26}{space 2} .8015679{col 37}{space 1}   -1.15{col 46}{space 3}0.250{col 54}{space 4} -2.49286{col 67}{space 3} .6497981
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-.8291986{col 26}{space 2} .8348224{col 37}{space 1}   -0.99{col 46}{space 3}0.321{col 54}{space 4}-2.465718{col 67}{space 3} .8073203
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-.9019096{col 26}{space 2}  .806632{col 37}{space 1}   -1.12{col 46}{space 3}0.264{col 54}{space 4}-2.483166{col 67}{space 3} .6793471
{txt}{space 9}SD  {c |}{col 14}{res}{space 2} -.857605{col 26}{space 2} .8164315{col 37}{space 1}   -1.05{col 46}{space 3}0.294{col 54}{space 4}-2.458072{col 67}{space 3} .7428618
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-.8218227{col 26}{space 2} .8064411{col 37}{space 1}   -1.02{col 46}{space 3}0.308{col 54}{space 4}-2.402705{col 67}{space 3} .7590598
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-.8859405{col 26}{space 2} .8020506{col 37}{space 1}   -1.10{col 46}{space 3}0.269{col 54}{space 4}-2.458216{col 67}{space 3} .6863351
{txt}{space 9}UT  {c |}{col 14}{res}{space 2}-.9316364{col 26}{space 2} .8053245{col 37}{space 1}   -1.16{col 46}{space 3}0.247{col 54}{space 4} -2.51033{col 67}{space 3} .6470572
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}-.8795059{col 26}{space 2} .8034717{col 37}{space 1}   -1.09{col 46}{space 3}0.274{col 54}{space 4}-2.454567{col 67}{space 3} .6955554
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}-.5215228{col 26}{space 2} .8302632{col 37}{space 1}   -0.63{col 46}{space 3}0.530{col 54}{space 4}-2.149104{col 67}{space 3} 1.106059
{txt}{space 9}WA  {c |}{col 14}{res}{space 2}-.8856758{col 26}{space 2} .8037822{col 37}{space 1}   -1.10{col 46}{space 3}0.271{col 54}{space 4}-2.461346{col 67}{space 3} .6899943
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-.9644225{col 26}{space 2} .8031905{col 37}{space 1}   -1.20{col 46}{space 3}0.230{col 54}{space 4}-2.538933{col 67}{space 3} .6100877
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-1.073345{col 26}{space 2} .8030065{col 37}{space 1}   -1.34{col 46}{space 3}0.181{col 54}{space 4}-2.647495{col 67}{space 3} .5008042
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-.9981045{col 26}{space 2} .8039697{col 37}{space 1}   -1.24{col 46}{space 3}0.214{col 54}{space 4}-2.574142{col 67}{space 3} .5779331
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.385991{col 26}{space 2}  .803685{col 37}{space 1}    1.72{col 46}{space 3}0.085{col 54}{space 4}-.1894883{col 67}{space 3} 2.961471
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est13{txt} stored)

Linear regression                                      Number of obs ={res}    6732
                                                       {txt}F( 71,  6660) ={res}    1.49
                                                       {txt}Prob > F      = {res} 0.0051
                                                       {txt}R-squared     = {res} 0.0153
                                                       {txt}Root MSE      = {res} .86558

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}      IncVar{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2} .0253393{col 26}{space 2}  .057632{col 37}{space 1}    0.44{col 46}{space 3}0.660{col 54}{space 4}-.0876378{col 67}{space 3} .1383164
{txt}{space 8}Old  {c |}{col 14}{res}{space 2} .0884144{col 26}{space 2} .0815228{col 37}{space 1}    1.08{col 46}{space 3}0.278{col 54}{space 4}-.0713964{col 67}{space 3} .2482252
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2} .0348646{col 26}{space 2} .0395319{col 37}{space 1}    0.88{col 46}{space 3}0.378{col 54}{space 4}-.0426306{col 67}{space 3} .1123598
{txt}High Educ..  {c |}{col 14}{res}{space 2}-.0215523{col 26}{space 2} .0380823{col 37}{space 1}   -0.57{col 46}{space 3}0.571{col 54}{space 4}-.0962058{col 67}{space 3} .0531013
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2} -.098905{col 26}{space 2} .0341627{col 37}{space 1}   -2.90{col 46}{space 3}0.004{col 54}{space 4}-.1658748{col 67}{space 3}-.0319352
{txt}High Income  {c |}{col 14}{res}{space 2}-.0710011{col 26}{space 2} .0354766{col 37}{space 1}   -2.00{col 46}{space 3}0.045{col 54}{space 4}-.1405465{col 67}{space 3}-.0014557
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2}-.0333633{col 26}{space 2} .0594357{col 37}{space 1}   -0.56{col 46}{space 3}0.575{col 54}{space 4}-.1498764{col 67}{space 3} .0831498
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} .0092308{col 26}{space 2} .0844613{col 37}{space 1}    0.11{col 46}{space 3}0.913{col 54}{space 4}-.1563404{col 67}{space 3}  .174802
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2}-.0031653{col 26}{space 2} .0314818{col 37}{space 1}   -0.10{col 46}{space 3}0.920{col 54}{space 4}-.0648797{col 67}{space 3}  .058549
{txt}{space 7}2015  {c |}{col 14}{res}{space 2} .0085467{col 26}{space 2} .0327967{col 37}{space 1}    0.26{col 46}{space 3}0.794{col 54}{space 4}-.0557453{col 67}{space 3} .0728387
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0111658{col 26}{space 2} .0331979{col 37}{space 1}    0.34{col 46}{space 3}0.737{col 54}{space 4}-.0539128{col 67}{space 3} .0762444
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}  .069512{col 26}{space 2} .0358821{col 37}{space 1}    1.94{col 46}{space 3}0.053{col 54}{space 4}-.0008284{col 67}{space 3} .1398524
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1034133{col 26}{space 2} .0501999{col 37}{space 1}    2.06{col 46}{space 3}0.039{col 54}{space 4} .0050054{col 67}{space 3} .2018213
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2}-.9265389{col 26}{space 2} .8057367{col 37}{space 1}   -1.15{col 46}{space 3}0.250{col 54}{space 4}-2.506041{col 67}{space 3}  .652963
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-.7546428{col 26}{space 2} .8151109{col 37}{space 1}   -0.93{col 46}{space 3}0.355{col 54}{space 4}-2.352521{col 67}{space 3} .8432356
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-.9284968{col 26}{space 2}  .802874{col 37}{space 1}   -1.16{col 46}{space 3}0.248{col 54}{space 4}-2.502387{col 67}{space 3} .6453933
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-.8435141{col 26}{space 2} .8036355{col 37}{space 1}   -1.05{col 46}{space 3}0.294{col 54}{space 4}-2.418897{col 67}{space 3} .7318689
{txt}{space 9}CO  {c |}{col 14}{res}{space 2}-1.026164{col 26}{space 2} .8031789{col 37}{space 1}   -1.28{col 46}{space 3}0.201{col 54}{space 4}-2.600652{col 67}{space 3} .5483241
{txt}{space 9}CT  {c |}{col 14}{res}{space 2} -1.00876{col 26}{space 2} .8028317{col 37}{space 1}   -1.26{col 46}{space 3}0.209{col 54}{space 4}-2.582567{col 67}{space 3} .5650477
{txt}{space 9}DC  {c |}{col 14}{res}{space 2}-1.003335{col 26}{space 2} .8142056{col 37}{space 1}   -1.23{col 46}{space 3}0.218{col 54}{space 4}-2.599439{col 67}{space 3} .5927685
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-1.086294{col 26}{space 2} .8051353{col 37}{space 1}   -1.35{col 46}{space 3}0.177{col 54}{space 4}-2.664617{col 67}{space 3} .4920294
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-.8278898{col 26}{space 2} .8032617{col 37}{space 1}   -1.03{col 46}{space 3}0.303{col 54}{space 4} -2.40254{col 67}{space 3} .7467603
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-.8598401{col 26}{space 2}  .803917{col 37}{space 1}   -1.07{col 46}{space 3}0.285{col 54}{space 4}-2.435775{col 67}{space 3} .7160946
{txt}{space 9}HI  {c |}{col 14}{res}{space 2}-.8406677{col 26}{space 2}  .813963{col 37}{space 1}   -1.03{col 46}{space 3}0.302{col 54}{space 4}-2.436296{col 67}{space 3} .7549604
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-.9801978{col 26}{space 2} .8025705{col 37}{space 1}   -1.22{col 46}{space 3}0.222{col 54}{space 4}-2.553493{col 67}{space 3} .5930974
{txt}{space 9}ID  {c |}{col 14}{res}{space 2}-.7540807{col 26}{space 2}  .815862{col 37}{space 1}   -0.92{col 46}{space 3}0.355{col 54}{space 4}-2.353432{col 67}{space 3} .8452701
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-.9686929{col 26}{space 2} .8026017{col 37}{space 1}   -1.21{col 46}{space 3}0.227{col 54}{space 4}-2.542049{col 67}{space 3} .6046635
{txt}{space 9}IN  {c |}{col 14}{res}{space 2}-.8551605{col 26}{space 2} .8053425{col 37}{space 1}   -1.06{col 46}{space 3}0.288{col 54}{space 4} -2.43389{col 67}{space 3} .7235687
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-.8079535{col 26}{space 2} .8110482{col 37}{space 1}   -1.00{col 46}{space 3}0.319{col 54}{space 4}-2.397868{col 67}{space 3} .7819607
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-.8641615{col 26}{space 2} .8081781{col 37}{space 1}   -1.07{col 46}{space 3}0.285{col 54}{space 4}-2.448449{col 67}{space 3} .7201264
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-1.004936{col 26}{space 2} .8060261{col 37}{space 1}   -1.25{col 46}{space 3}0.213{col 54}{space 4}-2.585006{col 67}{space 3} .5751331
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-.8450094{col 26}{space 2} .8050274{col 37}{space 1}   -1.05{col 46}{space 3}0.294{col 54}{space 4}-2.423121{col 67}{space 3}  .733102
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-.9038648{col 26}{space 2} .8054445{col 37}{space 1}   -1.12{col 46}{space 3}0.262{col 54}{space 4}-2.482794{col 67}{space 3} .6750643
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-.8575726{col 26}{space 2} .8071879{col 37}{space 1}   -1.06{col 46}{space 3}0.288{col 54}{space 4}-2.439919{col 67}{space 3} .7247741
{txt}{space 9}MI  {c |}{col 14}{res}{space 2}-.9772419{col 26}{space 2} .8019909{col 37}{space 1}   -1.22{col 46}{space 3}0.223{col 54}{space 4}-2.549401{col 67}{space 3} .5949171
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-.9806919{col 26}{space 2}  .803676{col 37}{space 1}   -1.22{col 46}{space 3}0.222{col 54}{space 4}-2.556154{col 67}{space 3} .5947703
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-.9294534{col 26}{space 2} .8039533{col 37}{space 1}   -1.16{col 46}{space 3}0.248{col 54}{space 4}-2.505459{col 67}{space 3} .6465525
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-.9749887{col 26}{space 2} .8103226{col 37}{space 1}   -1.20{col 46}{space 3}0.229{col 54}{space 4} -2.56348{col 67}{space 3}  .613503
{txt}{space 9}MT  {c |}{col 14}{res}{space 2}-.8693112{col 26}{space 2}  .809476{col 37}{space 1}   -1.07{col 46}{space 3}0.283{col 54}{space 4}-2.456143{col 67}{space 3}  .717521
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-.8602146{col 26}{space 2} .8037074{col 37}{space 1}   -1.07{col 46}{space 3}0.285{col 54}{space 4}-2.435738{col 67}{space 3} .7153092
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-.8926353{col 26}{space 2} .8195413{col 37}{space 1}   -1.09{col 46}{space 3}0.276{col 54}{space 4}-2.499199{col 67}{space 3} .7139282
{txt}{space 9}NE  {c |}{col 14}{res}{space 2}-.9494667{col 26}{space 2} .8086267{col 37}{space 1}   -1.17{col 46}{space 3}0.240{col 54}{space 4}-2.534634{col 67}{space 3} .6357006
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-.8264132{col 26}{space 2} .8105825{col 37}{space 1}   -1.02{col 46}{space 3}0.308{col 54}{space 4}-2.415414{col 67}{space 3} .7625881
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-.9505423{col 26}{space 2} .8038063{col 37}{space 1}   -1.18{col 46}{space 3}0.237{col 54}{space 4} -2.52626{col 67}{space 3} .6251755
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-1.083406{col 26}{space 2} .8036304{col 37}{space 1}   -1.35{col 46}{space 3}0.178{col 54}{space 4}-2.658779{col 67}{space 3} .4919669
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}-.7956327{col 26}{space 2}  .814945{col 37}{space 1}   -0.98{col 46}{space 3}0.329{col 54}{space 4}-2.393186{col 67}{space 3} .8019205
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-.8697144{col 26}{space 2}  .803018{col 37}{space 1}   -1.08{col 46}{space 3}0.279{col 54}{space 4}-2.443887{col 67}{space 3} .7044581
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-.8764335{col 26}{space 2} .8030371{col 37}{space 1}   -1.09{col 46}{space 3}0.275{col 54}{space 4}-2.450643{col 67}{space 3} .6977764
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-.8631965{col 26}{space 2} .8121753{col 37}{space 1}   -1.06{col 46}{space 3}0.288{col 54}{space 4} -2.45532{col 67}{space 3} .7289273
{txt}{space 9}OR  {c |}{col 14}{res}{space 2} -.965294{col 26}{space 2} .8029117{col 37}{space 1}   -1.20{col 46}{space 3}0.229{col 54}{space 4}-2.539258{col 67}{space 3}   .60867
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-.9057784{col 26}{space 2} .8023679{col 37}{space 1}   -1.13{col 46}{space 3}0.259{col 54}{space 4}-2.478676{col 67}{space 3} .6671196
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-.8093309{col 26}{space 2} .8355864{col 37}{space 1}   -0.97{col 46}{space 3}0.333{col 54}{space 4}-2.447348{col 67}{space 3}  .828686
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-.8933134{col 26}{space 2} .8075558{col 37}{space 1}   -1.11{col 46}{space 3}0.269{col 54}{space 4}-2.476381{col 67}{space 3} .6897545
{txt}{space 9}SD  {c |}{col 14}{res}{space 2}-.8339195{col 26}{space 2} .8171306{col 37}{space 1}   -1.02{col 46}{space 3}0.308{col 54}{space 4}-2.435757{col 67}{space 3} .7679182
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-.8040237{col 26}{space 2} .8069445{col 37}{space 1}   -1.00{col 46}{space 3}0.319{col 54}{space 4}-2.385893{col 67}{space 3}  .777846
{txt}{space 9}TX  {c |}{col 14}{res}{space 2} -.872841{col 26}{space 2} .8031081{col 37}{space 1}   -1.09{col 46}{space 3}0.277{col 54}{space 4} -2.44719{col 67}{space 3} .7015081
{txt}{space 9}UT  {c |}{col 14}{res}{space 2}-.8959183{col 26}{space 2} .8062308{col 37}{space 1}   -1.11{col 46}{space 3}0.267{col 54}{space 4}-2.476389{col 67}{space 3} .6845521
{txt}{space 9}VA  {c |}{col 14}{res}{space 2} -.863019{col 26}{space 2} .8046899{col 37}{space 1}   -1.07{col 46}{space 3}0.284{col 54}{space 4}-2.440469{col 67}{space 3} .7144309
{txt}{space 9}VT  {c |}{col 14}{res}{space 2} -.496767{col 26}{space 2} .8310998{col 37}{space 1}   -0.60{col 46}{space 3}0.550{col 54}{space 4}-2.125989{col 67}{space 3} 1.132455
{txt}{space 9}WA  {c |}{col 14}{res}{space 2}-.8671086{col 26}{space 2}  .805255{col 37}{space 1}   -1.08{col 46}{space 3}0.282{col 54}{space 4}-2.445666{col 67}{space 3}  .711449
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-.9441878{col 26}{space 2} .8038305{col 37}{space 1}   -1.17{col 46}{space 3}0.240{col 54}{space 4}-2.519953{col 67}{space 3} .6315773
{txt}{space 9}WV  {c |}{col 14}{res}{space 2} -1.04221{col 26}{space 2} .8035815{col 37}{space 1}   -1.30{col 46}{space 3}0.195{col 54}{space 4}-2.617487{col 67}{space 3} .5330672
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-.9698483{col 26}{space 2} .8044301{col 37}{space 1}   -1.21{col 46}{space 3}0.228{col 54}{space 4}-2.546789{col 67}{space 3} .6070923
{txt}{space 12} {c |}
{space 7}2.Q33 {c |}{col 14}{res}{space 2}-.0647488{col 26}{space 2}  .021673{col 37}{space 1}   -2.99{col 46}{space 3}0.003{col 54}{space 4}-.1072348{col 67}{space 3}-.0222629
{txt}{space 7}2.Q34 {c |}{col 14}{res}{space 2} .0195783{col 26}{space 2} .0436133{col 37}{space 1}    0.45{col 46}{space 3}0.654{col 54}{space 4}-.0659177{col 67}{space 3} .1050742
{txt}{space 7}Q35_1 {c |}{col 14}{res}{space 2}-.1027992{col 26}{space 2} .0543383{col 37}{space 1}   -1.89{col 46}{space 3}0.059{col 54}{space 4}-.2093197{col 67}{space 3} .0037214
{txt}{space 7}Q35_2 {c |}{col 14}{res}{space 2}-.0517569{col 26}{space 2} .0592737{col 37}{space 1}   -0.87{col 46}{space 3}0.383{col 54}{space 4}-.1679523{col 67}{space 3} .0644385
{txt}{space 7}Q35_3 {c |}{col 14}{res}{space 2} -.032733{col 26}{space 2}  .077662{col 37}{space 1}   -0.42{col 46}{space 3}0.673{col 54}{space 4}-.1849753{col 67}{space 3} .1195094
{txt}{space 7}Q35_4 {c |}{col 14}{res}{space 2}-.1448934{col 26}{space 2} .0612192{col 37}{space 1}   -2.37{col 46}{space 3}0.018{col 54}{space 4}-.2649027{col 67}{space 3}-.0248841
{txt}{space 7}Q35_5 {c |}{col 14}{res}{space 2}-.1311436{col 26}{space 2} .0910874{col 37}{space 1}   -1.44{col 46}{space 3}0.150{col 54}{space 4}-.3097041{col 67}{space 3} .0474169
{txt}{space 7}Q35_6 {c |}{col 14}{res}{space 2} .0039378{col 26}{space 2} .0660478{col 37}{space 1}    0.06{col 46}{space 3}0.952{col 54}{space 4}-.1255371{col 67}{space 3} .1334126
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.475231{col 26}{space 2} .8087745{col 37}{space 1}    1.82{col 46}{space 3}0.068{col 54}{space 4}-.1102257{col 67}{space 3} 3.060689
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est14{txt} stored)

Linear regression                                      Number of obs ={res}    5636
                                                       {txt}F( 75,  5560) ={res}    1.79
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0252
                                                       {txt}Root MSE      = {res} .72721

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}      IncVar{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2} .0305133{col 26}{space 2} .0561681{col 37}{space 1}    0.54{col 46}{space 3}0.587{col 54}{space 4}-.0795982{col 67}{space 3} .1406248
{txt}{space 8}Old  {c |}{col 14}{res}{space 2} .0681362{col 26}{space 2} .0762406{col 37}{space 1}    0.89{col 46}{space 3}0.372{col 54}{space 4}-.0813251{col 67}{space 3} .2175976
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2} .0273969{col 26}{space 2} .0391799{col 37}{space 1}    0.70{col 46}{space 3}0.484{col 54}{space 4} -.049411{col 67}{space 3} .1042047
{txt}High Educ..  {c |}{col 14}{res}{space 2}-.0251425{col 26}{space 2} .0366182{col 37}{space 1}   -0.69{col 46}{space 3}0.492{col 54}{space 4}-.0969284{col 67}{space 3} .0466433
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2} -.089468{col 26}{space 2} .0321213{col 37}{space 1}   -2.79{col 46}{space 3}0.005{col 54}{space 4}-.1524382{col 67}{space 3}-.0264977
{txt}High Income  {c |}{col 14}{res}{space 2}-.0722829{col 26}{space 2} .0326687{col 37}{space 1}   -2.21{col 46}{space 3}0.027{col 54}{space 4}-.1363264{col 67}{space 3}-.0082395
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2}-.0087331{col 26}{space 2}  .053061{col 37}{space 1}   -0.16{col 46}{space 3}0.869{col 54}{space 4}-.1127534{col 67}{space 3} .0952871
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} .0383935{col 26}{space 2} .0790875{col 37}{space 1}    0.49{col 46}{space 3}0.627{col 54}{space 4} -.116649{col 67}{space 3}  .193436
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2}-.0040477{col 26}{space 2}   .02953{col 37}{space 1}   -0.14{col 46}{space 3}0.891{col 54}{space 4} -.061938{col 67}{space 3} .0538427
{txt}{space 7}2015  {c |}{col 14}{res}{space 2} .0237889{col 26}{space 2} .0314814{col 37}{space 1}    0.76{col 46}{space 3}0.450{col 54}{space 4}-.0379269{col 67}{space 3} .0855047
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0133882{col 26}{space 2} .0301928{col 37}{space 1}    0.44{col 46}{space 3}0.657{col 54}{space 4}-.0458015{col 67}{space 3} .0725778
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0435168{col 26}{space 2} .0326012{col 37}{space 1}    1.33{col 46}{space 3}0.182{col 54}{space 4}-.0203944{col 67}{space 3} .1074279
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0777589{col 26}{space 2} .0439229{col 37}{space 1}    1.77{col 46}{space 3}0.077{col 54}{space 4}-.0083472{col 67}{space 3}  .163865
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2}-1.541023{col 26}{space 2} .9715988{col 37}{space 1}   -1.59{col 46}{space 3}0.113{col 54}{space 4}-3.445736{col 67}{space 3} .3636906
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-1.446606{col 26}{space 2} .9774319{col 37}{space 1}   -1.48{col 46}{space 3}0.139{col 54}{space 4}-3.362755{col 67}{space 3} .4695423
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-1.602641{col 26}{space 2} .9683351{col 37}{space 1}   -1.66{col 46}{space 3}0.098{col 54}{space 4}-3.500956{col 67}{space 3} .2956743
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-1.567878{col 26}{space 2} .9687473{col 37}{space 1}   -1.62{col 46}{space 3}0.106{col 54}{space 4}-3.467001{col 67}{space 3} .3312454
{txt}{space 9}CO  {c |}{col 14}{res}{space 2}-1.685881{col 26}{space 2} .9675712{col 37}{space 1}   -1.74{col 46}{space 3}0.081{col 54}{space 4}-3.582698{col 67}{space 3} .2109368
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-1.635806{col 26}{space 2} .9682587{col 37}{space 1}   -1.69{col 46}{space 3}0.091{col 54}{space 4}-3.533971{col 67}{space 3} .2623597
{txt}{space 9}DC  {c |}{col 14}{res}{space 2}-1.607775{col 26}{space 2} .9801801{col 37}{space 1}   -1.64{col 46}{space 3}0.101{col 54}{space 4}-3.529311{col 67}{space 3} .3137609
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-1.705279{col 26}{space 2} .9713705{col 37}{space 1}   -1.76{col 46}{space 3}0.079{col 54}{space 4}-3.609545{col 67}{space 3} .1989863
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-1.511129{col 26}{space 2} .9684903{col 37}{space 1}   -1.56{col 46}{space 3}0.119{col 54}{space 4}-3.409748{col 67}{space 3} .3874905
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-1.530831{col 26}{space 2} .9690146{col 37}{space 1}   -1.58{col 46}{space 3}0.114{col 54}{space 4}-3.430478{col 67}{space 3} .3688163
{txt}{space 9}HI  {c |}{col 14}{res}{space 2}-1.576136{col 26}{space 2} .9730674{col 37}{space 1}   -1.62{col 46}{space 3}0.105{col 54}{space 4}-3.483729{col 67}{space 3}  .331456
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-1.639205{col 26}{space 2} .9683205{col 37}{space 1}   -1.69{col 46}{space 3}0.091{col 54}{space 4}-3.537491{col 67}{space 3}  .259082
{txt}{space 9}ID  {c |}{col 14}{res}{space 2}-1.334549{col 26}{space 2} .9852957{col 37}{space 1}   -1.35{col 46}{space 3}0.176{col 54}{space 4}-3.266113{col 67}{space 3} .5970158
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-1.596322{col 26}{space 2} .9679931{col 37}{space 1}   -1.65{col 46}{space 3}0.099{col 54}{space 4}-3.493967{col 67}{space 3} .3013227
{txt}{space 9}IN  {c |}{col 14}{res}{space 2}-1.560415{col 26}{space 2}  .969545{col 37}{space 1}   -1.61{col 46}{space 3}0.108{col 54}{space 4}-3.461102{col 67}{space 3} .3402715
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-1.593594{col 26}{space 2} .9719958{col 37}{space 1}   -1.64{col 46}{space 3}0.101{col 54}{space 4}-3.499086{col 67}{space 3} .3118975
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-1.483626{col 26}{space 2} .9747167{col 37}{space 1}   -1.52{col 46}{space 3}0.128{col 54}{space 4}-3.394452{col 67}{space 3} .4271991
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-1.575631{col 26}{space 2} .9725348{col 37}{space 1}   -1.62{col 46}{space 3}0.105{col 54}{space 4} -3.48218{col 67}{space 3} .3309169
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-1.499152{col 26}{space 2} .9702083{col 37}{space 1}   -1.55{col 46}{space 3}0.122{col 54}{space 4}-3.401139{col 67}{space 3} .4028357
{txt}{space 9}MD  {c |}{col 14}{res}{space 2} -1.57228{col 26}{space 2} .9697862{col 37}{space 1}   -1.62{col 46}{space 3}0.105{col 54}{space 4} -3.47344{col 67}{space 3}   .32888
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-1.465545{col 26}{space 2} .9734245{col 37}{space 1}   -1.51{col 46}{space 3}0.132{col 54}{space 4}-3.373837{col 67}{space 3} .4427477
{txt}{space 9}MI  {c |}{col 14}{res}{space 2} -1.63834{col 26}{space 2}  .967703{col 37}{space 1}   -1.69{col 46}{space 3}0.091{col 54}{space 4}-3.535416{col 67}{space 3} .2587364
{txt}{space 9}MN  {c |}{col 14}{res}{space 2} -1.61391{col 26}{space 2} .9689689{col 37}{space 1}   -1.67{col 46}{space 3}0.096{col 54}{space 4}-3.513468{col 67}{space 3} .2856477
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-1.585746{col 26}{space 2} .9688761{col 37}{space 1}   -1.64{col 46}{space 3}0.102{col 54}{space 4}-3.485122{col 67}{space 3} .3136295
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-1.689969{col 26}{space 2}  .968421{col 37}{space 1}   -1.75{col 46}{space 3}0.081{col 54}{space 4}-3.588452{col 67}{space 3} .2085148
{txt}{space 9}MT  {c |}{col 14}{res}{space 2}-1.441276{col 26}{space 2} .9768542{col 37}{space 1}   -1.48{col 46}{space 3}0.140{col 54}{space 4}-3.356292{col 67}{space 3} .4737397
{txt}{space 9}NC  {c |}{col 14}{res}{space 2} -1.54452{col 26}{space 2} .9688832{col 37}{space 1}   -1.59{col 46}{space 3}0.111{col 54}{space 4} -3.44391{col 67}{space 3} .3548694
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-1.512646{col 26}{space 2} .9843262{col 37}{space 1}   -1.54{col 46}{space 3}0.124{col 54}{space 4} -3.44231{col 67}{space 3} .4170181
{txt}{space 9}NE  {c |}{col 14}{res}{space 2}-1.583474{col 26}{space 2} .9749213{col 37}{space 1}   -1.62{col 46}{space 3}0.104{col 54}{space 4}-3.494701{col 67}{space 3} .3277528
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-1.550586{col 26}{space 2}  .969455{col 37}{space 1}   -1.60{col 46}{space 3}0.110{col 54}{space 4}-3.451097{col 67}{space 3} .3499247
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-1.571717{col 26}{space 2} .9695537{col 37}{space 1}   -1.62{col 46}{space 3}0.105{col 54}{space 4}-3.472421{col 67}{space 3}  .328987
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-1.685563{col 26}{space 2} .9687513{col 37}{space 1}   -1.74{col 46}{space 3}0.082{col 54}{space 4}-3.584695{col 67}{space 3} .2135678
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}-1.525811{col 26}{space 2} .9764935{col 37}{space 1}   -1.56{col 46}{space 3}0.118{col 54}{space 4} -3.44012{col 67}{space 3} .3884978
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-1.582157{col 26}{space 2} .9679207{col 37}{space 1}   -1.63{col 46}{space 3}0.102{col 54}{space 4} -3.47966{col 67}{space 3} .3153459
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-1.510919{col 26}{space 2}  .968664{col 37}{space 1}   -1.56{col 46}{space 3}0.119{col 54}{space 4}-3.409879{col 67}{space 3}  .388041
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-1.641643{col 26}{space 2} .9732661{col 37}{space 1}   -1.69{col 46}{space 3}0.092{col 54}{space 4}-3.549625{col 67}{space 3} .2663384
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-1.613069{col 26}{space 2} .9686763{col 37}{space 1}   -1.67{col 46}{space 3}0.096{col 54}{space 4}-3.512053{col 67}{space 3} .2859151
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-1.553717{col 26}{space 2} .9678932{col 37}{space 1}   -1.61{col 46}{space 3}0.108{col 54}{space 4}-3.451166{col 67}{space 3} .3437321
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-1.434441{col 26}{space 2} 1.000453{col 37}{space 1}   -1.43{col 46}{space 3}0.152{col 54}{space 4}-3.395719{col 67}{space 3} .5268372
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-1.510623{col 26}{space 2} .9738382{col 37}{space 1}   -1.55{col 46}{space 3}0.121{col 54}{space 4}-3.419727{col 67}{space 3} .3984801
{txt}{space 9}SD  {c |}{col 14}{res}{space 2}-1.442853{col 26}{space 2} .9902063{col 37}{space 1}   -1.46{col 46}{space 3}0.145{col 54}{space 4}-3.384044{col 67}{space 3}  .498338
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-1.533908{col 26}{space 2} .9716374{col 37}{space 1}   -1.58{col 46}{space 3}0.114{col 54}{space 4}-3.438697{col 67}{space 3} .3708806
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-1.570199{col 26}{space 2} .9680281{col 37}{space 1}   -1.62{col 46}{space 3}0.105{col 54}{space 4}-3.467912{col 67}{space 3} .3275149
{txt}{space 9}UT  {c |}{col 14}{res}{space 2}-1.558453{col 26}{space 2} .9715861{col 37}{space 1}   -1.60{col 46}{space 3}0.109{col 54}{space 4}-3.463141{col 67}{space 3} .3462354
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}-1.558886{col 26}{space 2} .9696956{col 37}{space 1}   -1.61{col 46}{space 3}0.108{col 54}{space 4}-3.459869{col 67}{space 3} .3420959
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}-1.115068{col 26}{space 2} .9931204{col 37}{space 1}   -1.12{col 46}{space 3}0.262{col 54}{space 4}-3.061972{col 67}{space 3} .8318362
{txt}{space 9}WA  {c |}{col 14}{res}{space 2}-1.603454{col 26}{space 2} .9692432{col 37}{space 1}   -1.65{col 46}{space 3}0.098{col 54}{space 4}-3.503549{col 67}{space 3} .2966418
{txt}{space 9}WI  {c |}{col 14}{res}{space 2} -1.64742{col 26}{space 2} .9686298{col 37}{space 1}   -1.70{col 46}{space 3}0.089{col 54}{space 4}-3.546313{col 67}{space 3} .2514729
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-1.749674{col 26}{space 2} .9687252{col 37}{space 1}   -1.81{col 46}{space 3}0.071{col 54}{space 4}-3.648754{col 67}{space 3} .1494058
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-1.612254{col 26}{space 2} .9702987{col 37}{space 1}   -1.66{col 46}{space 3}0.097{col 54}{space 4}-3.514419{col 67}{space 3} .2899103
{txt}{space 12} {c |}
{space 7}2.Q33 {c |}{col 14}{res}{space 2}-.0365166{col 26}{space 2} .0197047{col 37}{space 1}   -1.85{col 46}{space 3}0.064{col 54}{space 4}-.0751455{col 67}{space 3} .0021122
{txt}{space 7}2.Q34 {c |}{col 14}{res}{space 2} .0509383{col 26}{space 2} .0357784{col 37}{space 1}    1.42{col 46}{space 3}0.155{col 54}{space 4}-.0192012{col 67}{space 3} .1210779
{txt}{space 7}Q35_1 {c |}{col 14}{res}{space 2}-.0285795{col 26}{space 2} .0487571{col 37}{space 1}   -0.59{col 46}{space 3}0.558{col 54}{space 4}-.1241625{col 67}{space 3} .0670036
{txt}{space 7}Q35_2 {c |}{col 14}{res}{space 2}-.0238738{col 26}{space 2} .0534412{col 37}{space 1}   -0.45{col 46}{space 3}0.655{col 54}{space 4}-.1286394{col 67}{space 3} .0808918
{txt}{space 7}Q35_3 {c |}{col 14}{res}{space 2} .0628451{col 26}{space 2} .0924023{col 37}{space 1}    0.68{col 46}{space 3}0.496{col 54}{space 4}-.1182994{col 67}{space 3} .2439897
{txt}{space 7}Q35_4 {c |}{col 14}{res}{space 2}  -.09497{col 26}{space 2} .0525082{col 37}{space 1}   -1.81{col 46}{space 3}0.071{col 54}{space 4}-.1979065{col 67}{space 3} .0079665
{txt}{space 7}Q35_5 {c |}{col 14}{res}{space 2}-.1844046{col 26}{space 2} .0638694{col 37}{space 1}   -2.89{col 46}{space 3}0.004{col 54}{space 4}-.3096135{col 67}{space 3}-.0591957
{txt}{space 7}Q35_6 {c |}{col 14}{res}{space 2}  .029668{col 26}{space 2} .0557506{col 37}{space 1}    0.53{col 46}{space 3}0.595{col 54}{space 4}-.0796249{col 67}{space 3} .1389609
{txt}{space 7}Q4new {c |}{col 14}{res}{space 2}-.0010777{col 26}{space 2} .0004644{col 37}{space 1}   -2.32{col 46}{space 3}0.020{col 54}{space 4}-.0019881{col 67}{space 3}-.0001674
{txt}{space 7}Q6new {c |}{col 14}{res}{space 2}-.0003625{col 26}{space 2}  .000488{col 37}{space 1}   -0.74{col 46}{space 3}0.458{col 54}{space 4}-.0013192{col 67}{space 3} .0005942
{txt}{space 5}Q9_mean {c |}{col 14}{res}{space 2} .0103454{col 26}{space 2} .0028921{col 37}{space 1}    3.58{col 46}{space 3}0.000{col 54}{space 4} .0046757{col 67}{space 3}  .016015
{txt}{space 6}Q13new {c |}{col 14}{res}{space 2}-.0018331{col 26}{space 2} .0004614{col 37}{space 1}   -3.97{col 46}{space 3}0.000{col 54}{space 4}-.0027376{col 67}{space 3}-.0009286
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.032821{col 26}{space 2} .9705924{col 37}{space 1}    2.09{col 46}{space 3}0.036{col 54}{space 4} .1300805{col 67}{space 3} 3.935561
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est15{txt} stored)

Linear regression                                      Number of obs ={res}    6734
                                                       {txt}F( 63,  6670) ={res}    2.48
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0195
                                                       {txt}Root MSE      = {res} .49959

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     IncSkew{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2} .0128855{col 26}{space 2} .0269226{col 37}{space 1}    0.48{col 46}{space 3}0.632{col 54}{space 4}-.0398913{col 67}{space 3} .0656623
{txt}{space 8}Old  {c |}{col 14}{res}{space 2} .0113506{col 26}{space 2} .0399019{col 37}{space 1}    0.28{col 46}{space 3}0.776{col 54}{space 4}-.0668699{col 67}{space 3} .0895712
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2} .0036636{col 26}{space 2} .0198737{col 37}{space 1}    0.18{col 46}{space 3}0.854{col 54}{space 4}-.0352952{col 67}{space 3} .0426224
{txt}High Educ..  {c |}{col 14}{res}{space 2} .0569354{col 26}{space 2} .0192599{col 37}{space 1}    2.96{col 46}{space 3}0.003{col 54}{space 4} .0191798{col 67}{space 3} .0946909
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2} .0774318{col 26}{space 2} .0175322{col 37}{space 1}    4.42{col 46}{space 3}0.000{col 54}{space 4}  .043063{col 67}{space 3} .1118006
{txt}High Income  {c |}{col 14}{res}{space 2} .0904193{col 26}{space 2} .0164473{col 37}{space 1}    5.50{col 46}{space 3}0.000{col 54}{space 4} .0581773{col 67}{space 3} .1226613
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2}-.0166098{col 26}{space 2} .0295423{col 37}{space 1}   -0.56{col 46}{space 3}0.574{col 54}{space 4}-.0745222{col 67}{space 3} .0413026
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} .0471499{col 26}{space 2} .0409389{col 37}{space 1}    1.15{col 46}{space 3}0.249{col 54}{space 4}-.0331034{col 67}{space 3} .1274032
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2} .0008737{col 26}{space 2} .0194149{col 37}{space 1}    0.05{col 46}{space 3}0.964{col 54}{space 4}-.0371857{col 67}{space 3} .0389331
{txt}{space 7}2015  {c |}{col 14}{res}{space 2}-.0191353{col 26}{space 2} .0195243{col 37}{space 1}   -0.98{col 46}{space 3}0.327{col 54}{space 4}-.0574091{col 67}{space 3} .0191386
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0000401{col 26}{space 2} .0203205{col 37}{space 1}   -0.00{col 46}{space 3}0.998{col 54}{space 4}-.0398747{col 67}{space 3} .0397946
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} -.016091{col 26}{space 2} .0201917{col 37}{space 1}   -0.80{col 46}{space 3}0.426{col 54}{space 4}-.0556731{col 67}{space 3} .0234911
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0133422{col 26}{space 2} .0256811{col 37}{space 1}   -0.52{col 46}{space 3}0.603{col 54}{space 4}-.0636853{col 67}{space 3} .0370009
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2}-.0565899{col 26}{space 2} .1347145{col 37}{space 1}   -0.42{col 46}{space 3}0.674{col 54}{space 4}-.3206734{col 67}{space 3} .2074936
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-.0377147{col 26}{space 2} .1323058{col 37}{space 1}   -0.29{col 46}{space 3}0.776{col 54}{space 4}-.2970765{col 67}{space 3}  .221647
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-.1441909{col 26}{space 2} .1422781{col 37}{space 1}   -1.01{col 46}{space 3}0.311{col 54}{space 4}-.4231014{col 67}{space 3} .1347195
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-.0516688{col 26}{space 2} .1295237{col 37}{space 1}   -0.40{col 46}{space 3}0.690{col 54}{space 4}-.3055767{col 67}{space 3} .2022391
{txt}{space 9}CO  {c |}{col 14}{res}{space 2}-.0233824{col 26}{space 2} .1318769{col 37}{space 1}   -0.18{col 46}{space 3}0.859{col 54}{space 4}-.2819032{col 67}{space 3} .2351385
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-.0344771{col 26}{space 2} .1307299{col 37}{space 1}   -0.26{col 46}{space 3}0.792{col 54}{space 4}-.2907494{col 67}{space 3} .2217952
{txt}{space 9}DC  {c |}{col 14}{res}{space 2} .0543646{col 26}{space 2} .1527214{col 37}{space 1}    0.36{col 46}{space 3}0.722{col 54}{space 4}-.2450181{col 67}{space 3} .3537473
{txt}{space 9}DE  {c |}{col 14}{res}{space 2} .0127558{col 26}{space 2} .1413592{col 37}{space 1}    0.09{col 46}{space 3}0.928{col 54}{space 4}-.2643535{col 67}{space 3}  .289865
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-.0215044{col 26}{space 2} .1294685{col 37}{space 1}   -0.17{col 46}{space 3}0.868{col 54}{space 4}-.2753041{col 67}{space 3} .2322952
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-.0566489{col 26}{space 2}  .130531{col 37}{space 1}   -0.43{col 46}{space 3}0.664{col 54}{space 4}-.3125314{col 67}{space 3} .1992336
{txt}{space 9}HI  {c |}{col 14}{res}{space 2}-.1404821{col 26}{space 2} .2633842{col 37}{space 1}   -0.53{col 46}{space 3}0.594{col 54}{space 4}-.6567994{col 67}{space 3} .3758353
{txt}{space 9}IA  {c |}{col 14}{res}{space 2} .0159983{col 26}{space 2} .1428058{col 37}{space 1}    0.11{col 46}{space 3}0.911{col 54}{space 4}-.2639468{col 67}{space 3} .2959433
{txt}{space 9}ID  {c |}{col 14}{res}{space 2} .0650268{col 26}{space 2} .1363449{col 37}{space 1}    0.48{col 46}{space 3}0.633{col 54}{space 4}-.2022529{col 67}{space 3} .3323064
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-.0515348{col 26}{space 2}  .130312{col 37}{space 1}   -0.40{col 46}{space 3}0.693{col 54}{space 4}-.3069881{col 67}{space 3} .2039184
{txt}{space 9}IN  {c |}{col 14}{res}{space 2}-.0096472{col 26}{space 2} .1365824{col 37}{space 1}   -0.07{col 46}{space 3}0.944{col 54}{space 4}-.2773924{col 67}{space 3} .2580981
{txt}{space 9}KS  {c |}{col 14}{res}{space 2} .0202762{col 26}{space 2} .1364375{col 37}{space 1}    0.15{col 46}{space 3}0.882{col 54}{space 4} -.247185{col 67}{space 3} .2877374
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-.0029573{col 26}{space 2} .1327052{col 37}{space 1}   -0.02{col 46}{space 3}0.982{col 54}{space 4}-.2631018{col 67}{space 3} .2571873
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-.0696279{col 26}{space 2} .1352662{col 37}{space 1}   -0.51{col 46}{space 3}0.607{col 54}{space 4}-.3347929{col 67}{space 3} .1955371
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-.0283272{col 26}{space 2} .1328018{col 37}{space 1}   -0.21{col 46}{space 3}0.831{col 54}{space 4}-.2886612{col 67}{space 3} .2320068
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-.0033779{col 26}{space 2} .1319311{col 37}{space 1}   -0.03{col 46}{space 3}0.980{col 54}{space 4}-.2620049{col 67}{space 3} .2552492
{txt}{space 9}ME  {c |}{col 14}{res}{space 2} .0968718{col 26}{space 2}  .156233{col 37}{space 1}    0.62{col 46}{space 3}0.535{col 54}{space 4}-.2093948{col 67}{space 3} .4031385
{txt}{space 9}MI  {c |}{col 14}{res}{space 2}-.0577217{col 26}{space 2} .1305911{col 37}{space 1}   -0.44{col 46}{space 3}0.659{col 54}{space 4}-.3137221{col 67}{space 3} .1982786
{txt}{space 9}MN  {c |}{col 14}{res}{space 2} .0359017{col 26}{space 2} .1340888{col 37}{space 1}    0.27{col 46}{space 3}0.789{col 54}{space 4}-.2269552{col 67}{space 3} .2987587
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-.0773789{col 26}{space 2} .1325584{col 37}{space 1}   -0.58{col 46}{space 3}0.559{col 54}{space 4}-.3372357{col 67}{space 3}  .182478
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-.0500909{col 26}{space 2} .1398457{col 37}{space 1}   -0.36{col 46}{space 3}0.720{col 54}{space 4}-.3242331{col 67}{space 3} .2240513
{txt}{space 9}MT  {c |}{col 14}{res}{space 2}-.0334471{col 26}{space 2} .1987148{col 37}{space 1}   -0.17{col 46}{space 3}0.866{col 54}{space 4}-.4229916{col 67}{space 3} .3560974
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-.0332569{col 26}{space 2} .1327242{col 37}{space 1}   -0.25{col 46}{space 3}0.802{col 54}{space 4}-.2934387{col 67}{space 3} .2269249
{txt}{space 9}ND  {c |}{col 14}{res}{space 2} .0477275{col 26}{space 2} .1480161{col 37}{space 1}    0.32{col 46}{space 3}0.747{col 54}{space 4}-.2424313{col 67}{space 3} .3378863
{txt}{space 9}NE  {c |}{col 14}{res}{space 2}  .096464{col 26}{space 2} .1407306{col 37}{space 1}    0.69{col 46}{space 3}0.493{col 54}{space 4} -.179413{col 67}{space 3} .3723411
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-.0135742{col 26}{space 2} .1411759{col 37}{space 1}   -0.10{col 46}{space 3}0.923{col 54}{space 4}-.2903241{col 67}{space 3} .2631757
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-.0746344{col 26}{space 2}  .131035{col 37}{space 1}   -0.57{col 46}{space 3}0.569{col 54}{space 4}-.3315049{col 67}{space 3} .1822361
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-.1471414{col 26}{space 2} .1390741{col 37}{space 1}   -1.06{col 46}{space 3}0.290{col 54}{space 4}-.4197711{col 67}{space 3} .1254884
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}-.0873299{col 26}{space 2} .1670056{col 37}{space 1}   -0.52{col 46}{space 3}0.601{col 54}{space 4}-.4147142{col 67}{space 3} .2400544
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-.0791373{col 26}{space 2} .1297572{col 37}{space 1}   -0.61{col 46}{space 3}0.542{col 54}{space 4}-.3335028{col 67}{space 3} .1752282
{txt}{space 9}OH  {c |}{col 14}{res}{space 2} .0099821{col 26}{space 2} .1323981{col 37}{space 1}    0.08{col 46}{space 3}0.940{col 54}{space 4}-.2495605{col 67}{space 3} .2695248
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-.0551393{col 26}{space 2} .1427788{col 37}{space 1}   -0.39{col 46}{space 3}0.699{col 54}{space 4}-.3350314{col 67}{space 3} .2247528
{txt}{space 9}OR  {c |}{col 14}{res}{space 2} -.024415{col 26}{space 2} .1331574{col 37}{space 1}   -0.18{col 46}{space 3}0.855{col 54}{space 4} -.285446{col 67}{space 3} .2366161
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-.0186837{col 26}{space 2} .1302156{col 37}{space 1}   -0.14{col 46}{space 3}0.886{col 54}{space 4}-.2739478{col 67}{space 3} .2365805
{txt}{space 9}RI  {c |}{col 14}{res}{space 2} .1791118{col 26}{space 2} .1867015{col 37}{space 1}    0.96{col 46}{space 3}0.337{col 54}{space 4}-.1868828{col 67}{space 3} .5451063
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-.0840793{col 26}{space 2} .1338975{col 37}{space 1}   -0.63{col 46}{space 3}0.530{col 54}{space 4}-.3465612{col 67}{space 3} .1784027
{txt}{space 9}SD  {c |}{col 14}{res}{space 2}-.1290986{col 26}{space 2} .1834185{col 37}{space 1}   -0.70{col 46}{space 3}0.482{col 54}{space 4}-.4886575{col 67}{space 3} .2304602
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-.0558975{col 26}{space 2} .1360894{col 37}{space 1}   -0.41{col 46}{space 3}0.681{col 54}{space 4}-.3226763{col 67}{space 3} .2108813
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-.0200476{col 26}{space 2} .1287358{col 37}{space 1}   -0.16{col 46}{space 3}0.876{col 54}{space 4} -.272411{col 67}{space 3} .2323157
{txt}{space 9}UT  {c |}{col 14}{res}{space 2} .0622731{col 26}{space 2} .1516281{col 37}{space 1}    0.41{col 46}{space 3}0.681{col 54}{space 4}-.2349664{col 67}{space 3} .3595126
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}-.0182827{col 26}{space 2} .1317983{col 37}{space 1}   -0.14{col 46}{space 3}0.890{col 54}{space 4}-.2766496{col 67}{space 3} .2400842
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}-.0498486{col 26}{space 2} .1391887{col 37}{space 1}   -0.36{col 46}{space 3}0.720{col 54}{space 4}-.3227029{col 67}{space 3} .2230058
{txt}{space 9}WA  {c |}{col 14}{res}{space 2} .0285165{col 26}{space 2} .1320413{col 37}{space 1}    0.22{col 46}{space 3}0.829{col 54}{space 4}-.2303266{col 67}{space 3} .2873596
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-.0231012{col 26}{space 2} .1321984{col 37}{space 1}   -0.17{col 46}{space 3}0.861{col 54}{space 4}-.2822524{col 67}{space 3}   .23605
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-.1956771{col 26}{space 2} .1622709{col 37}{space 1}   -1.21{col 46}{space 3}0.228{col 54}{space 4}  -.51378{col 67}{space 3} .1224258
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-.1397225{col 26}{space 2} .2382751{col 37}{space 1}   -0.59{col 46}{space 3}0.558{col 54}{space 4}-.6068178{col 67}{space 3} .3273728
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0417718{col 26}{space 2} .1343392{col 37}{space 1}   -0.31{col 46}{space 3}0.756{col 54}{space 4}-.3051196{col 67}{space 3}  .221576
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est16{txt} stored)

Linear regression                                      Number of obs ={res}    6732
                                                       {txt}F( 71,  6660) ={res}    2.83
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0230
                                                       {txt}Root MSE      = {res} .49907

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     IncSkew{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2} .0113301{col 26}{space 2}  .027174{col 37}{space 1}    0.42{col 46}{space 3}0.677{col 54}{space 4}-.0419396{col 67}{space 3} .0645998
{txt}{space 8}Old  {c |}{col 14}{res}{space 2} .0081494{col 26}{space 2} .0399866{col 37}{space 1}    0.20{col 46}{space 3}0.839{col 54}{space 4}-.0702371{col 67}{space 3} .0865359
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2} .0051978{col 26}{space 2} .0196954{col 37}{space 1}    0.26{col 46}{space 3}0.792{col 54}{space 4}-.0334115{col 67}{space 3} .0438072
{txt}High Educ..  {c |}{col 14}{res}{space 2} .0557753{col 26}{space 2} .0194064{col 37}{space 1}    2.87{col 46}{space 3}0.004{col 54}{space 4} .0177326{col 67}{space 3}  .093818
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2} .0716727{col 26}{space 2} .0176325{col 37}{space 1}    4.06{col 46}{space 3}0.000{col 54}{space 4} .0371073{col 67}{space 3} .1062381
{txt}High Income  {c |}{col 14}{res}{space 2} .0781579{col 26}{space 2} .0170974{col 37}{space 1}    4.57{col 46}{space 3}0.000{col 54}{space 4} .0446414{col 67}{space 3} .1116743
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2}-.0105716{col 26}{space 2} .0293974{col 37}{space 1}   -0.36{col 46}{space 3}0.719{col 54}{space 4}-.0681999{col 67}{space 3} .0470566
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} .0536116{col 26}{space 2} .0409976{col 37}{space 1}    1.31{col 46}{space 3}0.191{col 54}{space 4}-.0267567{col 67}{space 3}   .13398
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2} .0043461{col 26}{space 2} .0193556{col 37}{space 1}    0.22{col 46}{space 3}0.822{col 54}{space 4}-.0335971{col 67}{space 3} .0422893
{txt}{space 7}2015  {c |}{col 14}{res}{space 2}-.0154226{col 26}{space 2} .0195831{col 37}{space 1}   -0.79{col 46}{space 3}0.431{col 54}{space 4}-.0538118{col 67}{space 3} .0229667
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}  .004755{col 26}{space 2} .0204623{col 37}{space 1}    0.23{col 46}{space 3}0.816{col 54}{space 4}-.0353577{col 67}{space 3} .0448676
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0115854{col 26}{space 2} .0202738{col 37}{space 1}   -0.57{col 46}{space 3}0.568{col 54}{space 4}-.0513286{col 67}{space 3} .0281578
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0100307{col 26}{space 2} .0257134{col 37}{space 1}   -0.39{col 46}{space 3}0.696{col 54}{space 4}-.0604372{col 67}{space 3} .0403758
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2} -.051319{col 26}{space 2} .1219237{col 37}{space 1}   -0.42{col 46}{space 3}0.674{col 54}{space 4}-.2903285{col 67}{space 3} .1876904
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-.0461134{col 26}{space 2} .1193091{col 37}{space 1}   -0.39{col 46}{space 3}0.699{col 54}{space 4}-.2799975{col 67}{space 3} .1877708
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-.1498708{col 26}{space 2} .1303261{col 37}{space 1}   -1.15{col 46}{space 3}0.250{col 54}{space 4}-.4053516{col 67}{space 3}   .10561
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-.0501519{col 26}{space 2} .1161026{col 37}{space 1}   -0.43{col 46}{space 3}0.666{col 54}{space 4}-.2777501{col 67}{space 3} .1774463
{txt}{space 9}CO  {c |}{col 14}{res}{space 2} -.033942{col 26}{space 2}  .118749{col 37}{space 1}   -0.29{col 46}{space 3}0.775{col 54}{space 4}-.2667281{col 67}{space 3} .1988441
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-.0371622{col 26}{space 2} .1175738{col 37}{space 1}   -0.32{col 46}{space 3}0.752{col 54}{space 4}-.2676445{col 67}{space 3} .1933201
{txt}{space 9}DC  {c |}{col 14}{res}{space 2}  .058556{col 26}{space 2} .1407833{col 37}{space 1}    0.42{col 46}{space 3}0.677{col 54}{space 4}-.2174244{col 67}{space 3} .3345365
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}   .01995{col 26}{space 2} .1278472{col 37}{space 1}    0.16{col 46}{space 3}0.876{col 54}{space 4}-.2306715{col 67}{space 3} .2705715
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-.0227352{col 26}{space 2} .1160918{col 37}{space 1}   -0.20{col 46}{space 3}0.845{col 54}{space 4}-.2503123{col 67}{space 3} .2048418
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-.0492577{col 26}{space 2} .1173506{col 37}{space 1}   -0.42{col 46}{space 3}0.675{col 54}{space 4}-.2793024{col 67}{space 3}  .180787
{txt}{space 9}HI  {c |}{col 14}{res}{space 2}-.1401375{col 26}{space 2} .2302767{col 37}{space 1}   -0.61{col 46}{space 3}0.543{col 54}{space 4}-.5915535{col 67}{space 3} .3112785
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-.0029257{col 26}{space 2} .1308561{col 37}{space 1}   -0.02{col 46}{space 3}0.982{col 54}{space 4}-.2594455{col 67}{space 3} .2535942
{txt}{space 9}ID  {c |}{col 14}{res}{space 2}  .045537{col 26}{space 2} .1236686{col 37}{space 1}    0.37{col 46}{space 3}0.713{col 54}{space 4} -.196893{col 67}{space 3}  .287967
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-.0580453{col 26}{space 2} .1168568{col 37}{space 1}   -0.50{col 46}{space 3}0.619{col 54}{space 4}-.2871221{col 67}{space 3} .1710315
{txt}{space 9}IN  {c |}{col 14}{res}{space 2} -.025071{col 26}{space 2} .1239082{col 37}{space 1}   -0.20{col 46}{space 3}0.840{col 54}{space 4}-.2679708{col 67}{space 3} .2178287
{txt}{space 9}KS  {c |}{col 14}{res}{space 2} .0056677{col 26}{space 2} .1237125{col 37}{space 1}    0.05{col 46}{space 3}0.963{col 54}{space 4}-.2368484{col 67}{space 3} .2481837
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-.0157613{col 26}{space 2} .1197404{col 37}{space 1}   -0.13{col 46}{space 3}0.895{col 54}{space 4}-.2504909{col 67}{space 3} .2189683
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-.0650276{col 26}{space 2} .1220238{col 37}{space 1}   -0.53{col 46}{space 3}0.594{col 54}{space 4}-.3042333{col 67}{space 3} .1741781
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-.0376523{col 26}{space 2} .1197117{col 37}{space 1}   -0.31{col 46}{space 3}0.753{col 54}{space 4}-.2723256{col 67}{space 3} .1970209
{txt}{space 9}MD  {c |}{col 14}{res}{space 2} 5.21e-06{col 26}{space 2} .1188983{col 37}{space 1}    0.00{col 46}{space 3}1.000{col 54}{space 4}-.2330735{col 67}{space 3} .2330839
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}  .080076{col 26}{space 2} .1451902{col 37}{space 1}    0.55{col 46}{space 3}0.581{col 54}{space 4}-.2045433{col 67}{space 3} .3646952
{txt}{space 9}MI  {c |}{col 14}{res}{space 2} -.070796{col 26}{space 2} .1173295{col 37}{space 1}   -0.60{col 46}{space 3}0.546{col 54}{space 4}-.3007995{col 67}{space 3} .1592074
{txt}{space 9}MN  {c |}{col 14}{res}{space 2} .0205686{col 26}{space 2} .1211128{col 37}{space 1}    0.17{col 46}{space 3}0.865{col 54}{space 4}-.2168513{col 67}{space 3} .2579886
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-.0914237{col 26}{space 2} .1194571{col 37}{space 1}   -0.77{col 46}{space 3}0.444{col 54}{space 4} -.325598{col 67}{space 3} .1427505
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-.0358254{col 26}{space 2} .1270299{col 37}{space 1}   -0.28{col 46}{space 3}0.778{col 54}{space 4}-.2848447{col 67}{space 3} .2131938
{txt}{space 9}MT  {c |}{col 14}{res}{space 2}-.0518426{col 26}{space 2} .1910554{col 37}{space 1}   -0.27{col 46}{space 3}0.786{col 54}{space 4}-.4263723{col 67}{space 3} .3226871
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-.0362224{col 26}{space 2} .1197661{col 37}{space 1}   -0.30{col 46}{space 3}0.762{col 54}{space 4}-.2710024{col 67}{space 3} .1985576
{txt}{space 9}ND  {c |}{col 14}{res}{space 2} .0280922{col 26}{space 2} .1367919{col 37}{space 1}    0.21{col 46}{space 3}0.837{col 54}{space 4}-.2400637{col 67}{space 3}  .296248
{txt}{space 9}NE  {c |}{col 14}{res}{space 2} .0791126{col 26}{space 2} .1284952{col 37}{space 1}    0.62{col 46}{space 3}0.538{col 54}{space 4}-.1727793{col 67}{space 3} .3310044
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-.0320778{col 26}{space 2} .1292291{col 37}{space 1}   -0.25{col 46}{space 3}0.804{col 54}{space 4}-.2854083{col 67}{space 3} .2212527
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2} -.077157{col 26}{space 2} .1178234{col 37}{space 1}   -0.65{col 46}{space 3}0.513{col 54}{space 4}-.3081286{col 67}{space 3} .1538146
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-.1579541{col 26}{space 2} .1260944{col 37}{space 1}   -1.25{col 46}{space 3}0.210{col 54}{space 4}-.4051396{col 67}{space 3} .0892314
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}  -.09523{col 26}{space 2} .1572059{col 37}{space 1}   -0.61{col 46}{space 3}0.545{col 54}{space 4}-.4034039{col 67}{space 3}  .212944
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-.0863982{col 26}{space 2} .1162623{col 37}{space 1}   -0.74{col 46}{space 3}0.457{col 54}{space 4}-.3143095{col 67}{space 3} .1415131
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-.0031909{col 26}{space 2} .1200154{col 37}{space 1}   -0.03{col 46}{space 3}0.979{col 54}{space 4}-.2384595{col 67}{space 3} .2320778
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-.0698149{col 26}{space 2} .1302432{col 37}{space 1}   -0.54{col 46}{space 3}0.592{col 54}{space 4}-.3251333{col 67}{space 3} .1855034
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-.0399734{col 26}{space 2} .1201386{col 37}{space 1}   -0.33{col 46}{space 3}0.739{col 54}{space 4}-.2754835{col 67}{space 3} .1955367
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-.0295907{col 26}{space 2} .1169935{col 37}{space 1}   -0.25{col 46}{space 3}0.800{col 54}{space 4}-.2589355{col 67}{space 3} .1997541
{txt}{space 9}RI  {c |}{col 14}{res}{space 2} .1681323{col 26}{space 2} .1793163{col 37}{space 1}    0.94{col 46}{space 3}0.348{col 54}{space 4} -.183385{col 67}{space 3} .5196496
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-.0847844{col 26}{space 2} .1210287{col 37}{space 1}   -0.70{col 46}{space 3}0.484{col 54}{space 4}-.3220393{col 67}{space 3} .1524706
{txt}{space 9}SD  {c |}{col 14}{res}{space 2} -.146285{col 26}{space 2} .1739509{col 37}{space 1}   -0.84{col 46}{space 3}0.400{col 54}{space 4}-.4872844{col 67}{space 3} .1947145
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-.0649235{col 26}{space 2} .1235064{col 37}{space 1}   -0.53{col 46}{space 3}0.599{col 54}{space 4}-.3070356{col 67}{space 3} .1771887
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-.0200175{col 26}{space 2}  .115292{col 37}{space 1}   -0.17{col 46}{space 3}0.862{col 54}{space 4}-.2460267{col 67}{space 3} .2059917
{txt}{space 9}UT  {c |}{col 14}{res}{space 2} .0402972{col 26}{space 2} .1405792{col 37}{space 1}    0.29{col 46}{space 3}0.774{col 54}{space 4} -.235283{col 67}{space 3} .3158774
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}-.0197804{col 26}{space 2} .1186355{col 37}{space 1}   -0.17{col 46}{space 3}0.868{col 54}{space 4}-.2523441{col 67}{space 3} .2127833
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}-.0704948{col 26}{space 2} .1269705{col 37}{space 1}   -0.56{col 46}{space 3}0.579{col 54}{space 4}-.3193977{col 67}{space 3} .1784081
{txt}{space 9}WA  {c |}{col 14}{res}{space 2} .0134407{col 26}{space 2} .1187276{col 37}{space 1}    0.11{col 46}{space 3}0.910{col 54}{space 4}-.2193034{col 67}{space 3} .2461848
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-.0390754{col 26}{space 2} .1190967{col 37}{space 1}   -0.33{col 46}{space 3}0.743{col 54}{space 4}-.2725431{col 67}{space 3} .1943922
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-.2145247{col 26}{space 2} .1520991{col 37}{space 1}   -1.41{col 46}{space 3}0.158{col 54}{space 4}-.5126875{col 67}{space 3} .0836382
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-.1645234{col 26}{space 2} .2314135{col 37}{space 1}   -0.71{col 46}{space 3}0.477{col 54}{space 4} -.618168{col 67}{space 3} .2891211
{txt}{space 12} {c |}
{space 7}2.Q33 {c |}{col 14}{res}{space 2}  .018617{col 26}{space 2} .0126136{col 37}{space 1}    1.48{col 46}{space 3}0.140{col 54}{space 4}-.0061096{col 67}{space 3} .0433436
{txt}{space 7}2.Q34 {c |}{col 14}{res}{space 2}  .052501{col 26}{space 2} .0239948{col 37}{space 1}    2.19{col 46}{space 3}0.029{col 54}{space 4} .0054635{col 67}{space 3} .0995384
{txt}{space 7}Q35_1 {c |}{col 14}{res}{space 2} .0479336{col 26}{space 2} .0392953{col 37}{space 1}    1.22{col 46}{space 3}0.223{col 54}{space 4}-.0290977{col 67}{space 3}  .124965
{txt}{space 7}Q35_2 {c |}{col 14}{res}{space 2}-.0394697{col 26}{space 2}  .039115{col 37}{space 1}   -1.01{col 46}{space 3}0.313{col 54}{space 4}-.1161477{col 67}{space 3} .0372083
{txt}{space 7}Q35_3 {c |}{col 14}{res}{space 2} .0322606{col 26}{space 2}  .070331{col 37}{space 1}    0.46{col 46}{space 3}0.646{col 54}{space 4}-.1056108{col 67}{space 3} .1701319
{txt}{space 7}Q35_4 {c |}{col 14}{res}{space 2} .0231734{col 26}{space 2} .0439232{col 37}{space 1}    0.53{col 46}{space 3}0.598{col 54}{space 4}-.0629302{col 67}{space 3}  .109277
{txt}{space 7}Q35_5 {c |}{col 14}{res}{space 2}-.0107912{col 26}{space 2} .0986473{col 37}{space 1}   -0.11{col 46}{space 3}0.913{col 54}{space 4}-.2041715{col 67}{space 3} .1825891
{txt}{space 7}Q35_6 {c |}{col 14}{res}{space 2} .0439068{col 26}{space 2} .0467214{col 37}{space 1}    0.94{col 46}{space 3}0.347{col 54}{space 4}-.0476821{col 67}{space 3} .1354958
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.1314113{col 26}{space 2} .1281394{col 37}{space 1}   -1.03{col 46}{space 3}0.305{col 54}{space 4}-.3826055{col 67}{space 3} .1197829
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est17{txt} stored)

Linear regression                                      Number of obs ={res}    5636
                                                       {txt}F( 75,  5560) ={res}    2.96
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0289
                                                       {txt}Root MSE      = {res} .49892

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     IncSkew{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2} .0095448{col 26}{space 2} .0285005{col 37}{space 1}    0.33{col 46}{space 3}0.738{col 54}{space 4}-.0463274{col 67}{space 3}  .065417
{txt}{space 8}Old  {c |}{col 14}{res}{space 2}-.0143581{col 26}{space 2}  .040434{col 37}{space 1}   -0.36{col 46}{space 3}0.723{col 54}{space 4}-.0936245{col 67}{space 3} .0649084
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2} .0140385{col 26}{space 2} .0216056{col 37}{space 1}    0.65{col 46}{space 3}0.516{col 54}{space 4}-.0283169{col 67}{space 3}  .056394
{txt}High Educ..  {c |}{col 14}{res}{space 2} .0620471{col 26}{space 2} .0212606{col 37}{space 1}    2.92{col 46}{space 3}0.004{col 54}{space 4} .0203681{col 67}{space 3} .1037261
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2} .0517636{col 26}{space 2}  .019765{col 37}{space 1}    2.62{col 46}{space 3}0.009{col 54}{space 4} .0130165{col 67}{space 3} .0905106
{txt}High Income  {c |}{col 14}{res}{space 2} .0496891{col 26}{space 2} .0192225{col 37}{space 1}    2.58{col 46}{space 3}0.010{col 54}{space 4} .0120056{col 67}{space 3} .0873727
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2}-.0473764{col 26}{space 2} .0297129{col 37}{space 1}   -1.59{col 46}{space 3}0.111{col 54}{space 4}-.1056252{col 67}{space 3} .0108724
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} .0173451{col 26}{space 2} .0427684{col 37}{space 1}    0.41{col 46}{space 3}0.685{col 54}{space 4}-.0664977{col 67}{space 3} .1011878
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2}  .004734{col 26}{space 2}  .020967{col 37}{space 1}    0.23{col 46}{space 3}0.821{col 54}{space 4}-.0363695{col 67}{space 3} .0458374
{txt}{space 7}2015  {c |}{col 14}{res}{space 2}-.0293766{col 26}{space 2} .0215601{col 37}{space 1}   -1.36{col 46}{space 3}0.173{col 54}{space 4}-.0716429{col 67}{space 3} .0128897
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0092501{col 26}{space 2} .0228075{col 37}{space 1}    0.41{col 46}{space 3}0.685{col 54}{space 4}-.0354615{col 67}{space 3} .0539617
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0071246{col 26}{space 2} .0223626{col 37}{space 1}   -0.32{col 46}{space 3}0.750{col 54}{space 4}-.0509641{col 67}{space 3} .0367149
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0080252{col 26}{space 2} .0280227{col 37}{space 1}   -0.29{col 46}{space 3}0.775{col 54}{space 4}-.0629606{col 67}{space 3} .0469102
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2} -.125392{col 26}{space 2} .0983899{col 37}{space 1}   -1.27{col 46}{space 3}0.203{col 54}{space 4}-.3182746{col 67}{space 3} .0674907
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-.0957279{col 26}{space 2} .0937793{col 37}{space 1}   -1.02{col 46}{space 3}0.307{col 54}{space 4}-.2795721{col 67}{space 3} .0881163
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-.2296404{col 26}{space 2} .1136466{col 37}{space 1}   -2.02{col 46}{space 3}0.043{col 54}{space 4}-.4524321{col 67}{space 3}-.0068487
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-.1158522{col 26}{space 2}   .09022{col 37}{space 1}   -1.28{col 46}{space 3}0.199{col 54}{space 4}-.2927187{col 67}{space 3} .0610143
{txt}{space 9}CO  {c |}{col 14}{res}{space 2}-.1071694{col 26}{space 2} .0938102{col 37}{space 1}   -1.14{col 46}{space 3}0.253{col 54}{space 4}-.2910741{col 67}{space 3} .0767354
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-.1002441{col 26}{space 2} .0897648{col 37}{space 1}   -1.12{col 46}{space 3}0.264{col 54}{space 4}-.2762181{col 67}{space 3} .0757299
{txt}{space 9}DC  {c |}{col 14}{res}{space 2}-.0365754{col 26}{space 2} .1240008{col 37}{space 1}   -0.29{col 46}{space 3}0.768{col 54}{space 4}-.2796654{col 67}{space 3} .2065146
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-.0716444{col 26}{space 2} .1055596{col 37}{space 1}   -0.68{col 46}{space 3}0.497{col 54}{space 4}-.2785824{col 67}{space 3} .1352936
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-.1014139{col 26}{space 2}  .089409{col 37}{space 1}   -1.13{col 46}{space 3}0.257{col 54}{space 4}-.2766905{col 67}{space 3} .0738627
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-.1080328{col 26}{space 2} .0915349{col 37}{space 1}   -1.18{col 46}{space 3}0.238{col 54}{space 4}-.2874769{col 67}{space 3} .0714113
{txt}{space 9}HI  {c |}{col 14}{res}{space 2} .0275332{col 26}{space 2} .1449285{col 37}{space 1}    0.19{col 46}{space 3}0.849{col 54}{space 4}-.2565833{col 67}{space 3} .3116496
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-.0758356{col 26}{space 2}  .108782{col 37}{space 1}   -0.70{col 46}{space 3}0.486{col 54}{space 4}-.2890907{col 67}{space 3} .1374196
{txt}{space 9}ID  {c |}{col 14}{res}{space 2}-.0120956{col 26}{space 2}  .101899{col 37}{space 1}   -0.12{col 46}{space 3}0.906{col 54}{space 4}-.2118575{col 67}{space 3} .1876662
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-.1084928{col 26}{space 2} .0904965{col 37}{space 1}   -1.20{col 46}{space 3}0.231{col 54}{space 4}-.2859014{col 67}{space 3} .0689157
{txt}{space 9}IN  {c |}{col 14}{res}{space 2}-.1049734{col 26}{space 2} .1003379{col 37}{space 1}   -1.05{col 46}{space 3}0.296{col 54}{space 4}-.3016748{col 67}{space 3}  .091728
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-.0785806{col 26}{space 2} .1021315{col 37}{space 1}   -0.77{col 46}{space 3}0.442{col 54}{space 4}-.2787982{col 67}{space 3} .1216369
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-.0917658{col 26}{space 2}  .095397{col 37}{space 1}   -0.96{col 46}{space 3}0.336{col 54}{space 4}-.2787813{col 67}{space 3} .0952497
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-.1169036{col 26}{space 2} .0986493{col 37}{space 1}   -1.19{col 46}{space 3}0.236{col 54}{space 4}-.3102948{col 67}{space 3} .0764877
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-.0986019{col 26}{space 2} .0936742{col 37}{space 1}   -1.05{col 46}{space 3}0.293{col 54}{space 4}  -.28224{col 67}{space 3} .0850362
{txt}{space 9}MD  {c |}{col 14}{res}{space 2} -.084393{col 26}{space 2} .0930083{col 37}{space 1}   -0.91{col 46}{space 3}0.364{col 54}{space 4}-.2667255{col 67}{space 3} .0979395
{txt}{space 9}ME  {c |}{col 14}{res}{space 2} .0285541{col 26}{space 2} .1257348{col 37}{space 1}    0.23{col 46}{space 3}0.820{col 54}{space 4}-.2179352{col 67}{space 3} .2750434
{txt}{space 9}MI  {c |}{col 14}{res}{space 2}-.1660269{col 26}{space 2} .0908057{col 37}{space 1}   -1.83{col 46}{space 3}0.068{col 54}{space 4}-.3440416{col 67}{space 3} .0119877
{txt}{space 9}MN  {c |}{col 14}{res}{space 2} -.084896{col 26}{space 2} .0945821{col 37}{space 1}   -0.90{col 46}{space 3}0.369{col 54}{space 4}-.2703138{col 67}{space 3} .1005217
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-.1561248{col 26}{space 2}  .095662{col 37}{space 1}   -1.63{col 46}{space 3}0.103{col 54}{space 4}-.3436598{col 67}{space 3} .0314102
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-.0927462{col 26}{space 2} .1047427{col 37}{space 1}   -0.89{col 46}{space 3}0.376{col 54}{space 4}-.2980828{col 67}{space 3} .1125903
{txt}{space 9}MT  {c |}{col 14}{res}{space 2}-.0334552{col 26}{space 2} .1604842{col 37}{space 1}   -0.21{col 46}{space 3}0.835{col 54}{space 4}-.3480669{col 67}{space 3} .2811566
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-.1063485{col 26}{space 2} .0953364{col 37}{space 1}   -1.12{col 46}{space 3}0.265{col 54}{space 4}-.2932451{col 67}{space 3}  .080548
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}  -.07002{col 26}{space 2} .1209686{col 37}{space 1}   -0.58{col 46}{space 3}0.563{col 54}{space 4}-.3071657{col 67}{space 3} .1671256
{txt}{space 9}NE  {c |}{col 14}{res}{space 2}-.0024835{col 26}{space 2} .1091194{col 37}{space 1}   -0.02{col 46}{space 3}0.982{col 54}{space 4}-.2164001{col 67}{space 3} .2114332
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-.1028861{col 26}{space 2} .1075898{col 37}{space 1}   -0.96{col 46}{space 3}0.339{col 54}{space 4}-.3138042{col 67}{space 3}  .108032
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-.1623654{col 26}{space 2} .0923257{col 37}{space 1}   -1.76{col 46}{space 3}0.079{col 54}{space 4}-.3433598{col 67}{space 3} .0186291
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-.2087179{col 26}{space 2} .0990751{col 37}{space 1}   -2.11{col 46}{space 3}0.035{col 54}{space 4}-.4029439{col 67}{space 3} -.014492
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}-.1893855{col 26}{space 2} .1551559{col 37}{space 1}   -1.22{col 46}{space 3}0.222{col 54}{space 4}-.4935516{col 67}{space 3} .1147807
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-.1653656{col 26}{space 2}   .08943{col 37}{space 1}   -1.85{col 46}{space 3}0.064{col 54}{space 4}-.3406833{col 67}{space 3} .0099521
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-.0795039{col 26}{space 2} .0942447{col 37}{space 1}   -0.84{col 46}{space 3}0.399{col 54}{space 4}-.2642604{col 67}{space 3} .1052525
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-.1827719{col 26}{space 2} .1164336{col 37}{space 1}   -1.57{col 46}{space 3}0.117{col 54}{space 4}-.4110273{col 67}{space 3} .0454835
{txt}{space 9}OR  {c |}{col 14}{res}{space 2} -.123328{col 26}{space 2} .0964989{col 37}{space 1}   -1.28{col 46}{space 3}0.201{col 54}{space 4}-.3125034{col 67}{space 3} .0658475
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-.0860629{col 26}{space 2} .0903715{col 37}{space 1}   -0.95{col 46}{space 3}0.341{col 54}{space 4}-.2632264{col 67}{space 3} .0911007
{txt}{space 9}RI  {c |}{col 14}{res}{space 2} .0431473{col 26}{space 2} .1731882{col 37}{space 1}    0.25{col 46}{space 3}0.803{col 54}{space 4}-.2963692{col 67}{space 3} .3826638
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-.1445384{col 26}{space 2} .0962487{col 37}{space 1}   -1.50{col 46}{space 3}0.133{col 54}{space 4}-.3332235{col 67}{space 3} .0441466
{txt}{space 9}SD  {c |}{col 14}{res}{space 2}-.3682585{col 26}{space 2} .1846901{col 37}{space 1}   -1.99{col 46}{space 3}0.046{col 54}{space 4}-.7303232{col 67}{space 3}-.0061938
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-.1058165{col 26}{space 2} .0949799{col 37}{space 1}   -1.11{col 46}{space 3}0.265{col 54}{space 4}-.2920142{col 67}{space 3} .0803812
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-.0799292{col 26}{space 2} .0881381{col 37}{space 1}   -0.91{col 46}{space 3}0.365{col 54}{space 4}-.2527144{col 67}{space 3} .0928559
{txt}{space 9}UT  {c |}{col 14}{res}{space 2}-.0228484{col 26}{space 2} .1244035{col 37}{space 1}   -0.18{col 46}{space 3}0.854{col 54}{space 4}-.2667279{col 67}{space 3} .2210311
{txt}{space 9}VA  {c |}{col 14}{res}{space 2} -.114832{col 26}{space 2} .0906829{col 37}{space 1}   -1.27{col 46}{space 3}0.205{col 54}{space 4} -.292606{col 67}{space 3} .0629419
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}-.1679527{col 26}{space 2} .1051107{col 37}{space 1}   -1.60{col 46}{space 3}0.110{col 54}{space 4}-.3740107{col 67}{space 3} .0381054
{txt}{space 9}WA  {c |}{col 14}{res}{space 2}-.0575663{col 26}{space 2} .0933372{col 37}{space 1}   -0.62{col 46}{space 3}0.537{col 54}{space 4}-.2405436{col 67}{space 3} .1254111
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-.1382283{col 26}{space 2} .0937264{col 37}{space 1}   -1.47{col 46}{space 3}0.140{col 54}{space 4}-.3219688{col 67}{space 3} .0455121
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-.3334833{col 26}{space 2} .1407378{col 37}{space 1}   -2.37{col 46}{space 3}0.018{col 54}{space 4}-.6093843{col 67}{space 3}-.0575823
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-.3030877{col 26}{space 2} .2627571{col 37}{space 1}   -1.15{col 46}{space 3}0.249{col 54}{space 4}-.8181942{col 67}{space 3} .2120188
{txt}{space 12} {c |}
{space 7}2.Q33 {c |}{col 14}{res}{space 2} .0233942{col 26}{space 2} .0140265{col 37}{space 1}    1.67{col 46}{space 3}0.095{col 54}{space 4}-.0041032{col 67}{space 3} .0508916
{txt}{space 7}2.Q34 {c |}{col 14}{res}{space 2} .0588588{col 26}{space 2}  .027127{col 37}{space 1}    2.17{col 46}{space 3}0.030{col 54}{space 4} .0056791{col 67}{space 3} .1120384
{txt}{space 7}Q35_1 {c |}{col 14}{res}{space 2} .0980748{col 26}{space 2} .0359684{col 37}{space 1}    2.73{col 46}{space 3}0.006{col 54}{space 4} .0275627{col 67}{space 3}  .168587
{txt}{space 7}Q35_2 {c |}{col 14}{res}{space 2}-.0071413{col 26}{space 2} .0364591{col 37}{space 1}   -0.20{col 46}{space 3}0.845{col 54}{space 4}-.0786154{col 67}{space 3} .0643328
{txt}{space 7}Q35_3 {c |}{col 14}{res}{space 2} .0531219{col 26}{space 2} .0825762{col 37}{space 1}    0.64{col 46}{space 3}0.520{col 54}{space 4}-.1087597{col 67}{space 3} .2150034
{txt}{space 7}Q35_4 {c |}{col 14}{res}{space 2} .0601058{col 26}{space 2} .0410668{col 37}{space 1}    1.46{col 46}{space 3}0.143{col 54}{space 4} -.020401{col 67}{space 3} .1406127
{txt}{space 7}Q35_5 {c |}{col 14}{res}{space 2} .0749378{col 26}{space 2} .0646943{col 37}{space 1}    1.16{col 46}{space 3}0.247{col 54}{space 4}-.0518883{col 67}{space 3} .2017639
{txt}{space 7}Q35_6 {c |}{col 14}{res}{space 2} .0781066{col 26}{space 2} .0500747{col 37}{space 1}    1.56{col 46}{space 3}0.119{col 54}{space 4}-.0200594{col 67}{space 3} .1762726
{txt}{space 7}Q4new {c |}{col 14}{res}{space 2}-.0006202{col 26}{space 2} .0003247{col 37}{space 1}   -1.91{col 46}{space 3}0.056{col 54}{space 4}-.0012567{col 67}{space 3} .0000164
{txt}{space 7}Q6new {c |}{col 14}{res}{space 2} .0008317{col 26}{space 2} .0003149{col 37}{space 1}    2.64{col 46}{space 3}0.008{col 54}{space 4} .0002144{col 67}{space 3}  .001449
{txt}{space 5}Q9_mean {c |}{col 14}{res}{space 2} .0016348{col 26}{space 2} .0010771{col 37}{space 1}    1.52{col 46}{space 3}0.129{col 54}{space 4}-.0004767{col 67}{space 3} .0037464
{txt}{space 6}Q13new {c |}{col 14}{res}{space 2}-.0006308{col 26}{space 2} .0003268{col 37}{space 1}   -1.93{col 46}{space 3}0.054{col 54}{space 4}-.0012714{col 67}{space 3} 9.81e-06
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0586968{col 26}{space 2} .1046755{col 37}{space 1}   -0.56{col 46}{space 3}0.575{col 54}{space 4}-.2639017{col 67}{space 3}  .146508
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est18{txt} stored)

Linear regression                                      Number of obs ={res}    6734
                                                       {txt}F( 63,  6670) ={res}    1.75
                                                       {txt}Prob > F      = {res} 0.0002
                                                       {txt}R-squared     = {res} 0.0078
                                                       {txt}Root MSE      = {res} 1.5547

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     IncKurt{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2}-.1628343{col 26}{space 2} .0448341{col 37}{space 1}   -3.63{col 46}{space 3}0.000{col 54}{space 4}-.2507234{col 67}{space 3}-.0749452
{txt}{space 8}Old  {c |}{col 14}{res}{space 2}-.2193568{col 26}{space 2} .0955319{col 37}{space 1}   -2.30{col 46}{space 3}0.022{col 54}{space 4}-.4066298{col 67}{space 3}-.0320838
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2} .0904901{col 26}{space 2} .0429964{col 37}{space 1}    2.10{col 46}{space 3}0.035{col 54}{space 4} .0062035{col 67}{space 3} .1747767
{txt}High Educ..  {c |}{col 14}{res}{space 2}  .129363{col 26}{space 2} .0401887{col 37}{space 1}    3.22{col 46}{space 3}0.001{col 54}{space 4} .0505804{col 67}{space 3} .2081457
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2}  .074559{col 26}{space 2} .0498843{col 37}{space 1}    1.49{col 46}{space 3}0.135{col 54}{space 4}-.0232302{col 67}{space 3} .1723483
{txt}High Income  {c |}{col 14}{res}{space 2} .0875203{col 26}{space 2} .0432569{col 37}{space 1}    2.02{col 46}{space 3}0.043{col 54}{space 4}  .002723{col 67}{space 3} .1723177
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2}-.0629318{col 26}{space 2} .0772485{col 37}{space 1}   -0.81{col 46}{space 3}0.415{col 54}{space 4}-.2143636{col 67}{space 3} .0884999
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2}-.1269259{col 26}{space 2} .0996129{col 37}{space 1}   -1.27{col 46}{space 3}0.203{col 54}{space 4}-.3221991{col 67}{space 3} .0683473
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2}-.0540789{col 26}{space 2} .0485979{col 37}{space 1}   -1.11{col 46}{space 3}0.266{col 54}{space 4}-.1493463{col 67}{space 3} .0411884
{txt}{space 7}2015  {c |}{col 14}{res}{space 2}-.0234997{col 26}{space 2} .0642514{col 37}{space 1}   -0.37{col 46}{space 3}0.715{col 54}{space 4} -.149453{col 67}{space 3} .1024535
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0298692{col 26}{space 2} .0553291{col 37}{space 1}    0.54{col 46}{space 3}0.589{col 54}{space 4}-.0785937{col 67}{space 3}  .138332
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0109867{col 26}{space 2} .0738211{col 37}{space 1}   -0.15{col 46}{space 3}0.882{col 54}{space 4}-.1556996{col 67}{space 3} .1337262
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0289065{col 26}{space 2}  .057549{col 37}{space 1}   -0.50{col 46}{space 3}0.615{col 54}{space 4} -.141721{col 67}{space 3}  .083908
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2}-.0495336{col 26}{space 2} .1359358{col 37}{space 1}   -0.36{col 46}{space 3}0.716{col 54}{space 4}-.3160112{col 67}{space 3}  .216944
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-.0731601{col 26}{space 2} .1278141{col 37}{space 1}   -0.57{col 46}{space 3}0.567{col 54}{space 4}-.3237166{col 67}{space 3} .1773965
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2} .3554552{col 26}{space 2} .4143336{col 37}{space 1}    0.86{col 46}{space 3}0.391{col 54}{space 4}-.4567713{col 67}{space 3} 1.167682
{txt}{space 9}CA  {c |}{col 14}{res}{space 2} .1934625{col 26}{space 2}  .143017{col 37}{space 1}    1.35{col 46}{space 3}0.176{col 54}{space 4}-.0868965{col 67}{space 3} .4738214
{txt}{space 9}CO  {c |}{col 14}{res}{space 2}-.0470939{col 26}{space 2} .1269419{col 37}{space 1}   -0.37{col 46}{space 3}0.711{col 54}{space 4}-.2959406{col 67}{space 3} .2017527
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-.1205587{col 26}{space 2} .1257868{col 37}{space 1}   -0.96{col 46}{space 3}0.338{col 54}{space 4} -.367141{col 67}{space 3} .1260237
{txt}{space 9}DC  {c |}{col 14}{res}{space 2} .0320545{col 26}{space 2} .1499642{col 37}{space 1}    0.21{col 46}{space 3}0.831{col 54}{space 4}-.2619233{col 67}{space 3} .3260323
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-.0800286{col 26}{space 2} .1408086{col 37}{space 1}   -0.57{col 46}{space 3}0.570{col 54}{space 4}-.3560584{col 67}{space 3} .1960013
{txt}{space 9}FL  {c |}{col 14}{res}{space 2} .0187018{col 26}{space 2} .1274219{col 37}{space 1}    0.15{col 46}{space 3}0.883{col 54}{space 4}-.2310859{col 67}{space 3} .2684895
{txt}{space 9}GA  {c |}{col 14}{res}{space 2} .0064162{col 26}{space 2} .1268239{col 37}{space 1}    0.05{col 46}{space 3}0.960{col 54}{space 4}-.2421991{col 67}{space 3} .2550315
{txt}{space 9}HI  {c |}{col 14}{res}{space 2} .5459589{col 26}{space 2} .6006698{col 37}{space 1}    0.91{col 46}{space 3}0.363{col 54}{space 4} -.631546{col 67}{space 3} 1.723464
{txt}{space 9}IA  {c |}{col 14}{res}{space 2} .2826598{col 26}{space 2} .1966619{col 37}{space 1}    1.44{col 46}{space 3}0.151{col 54}{space 4}-.1028605{col 67}{space 3} .6681801
{txt}{space 9}ID  {c |}{col 14}{res}{space 2} .0503313{col 26}{space 2} .1475183{col 37}{space 1}    0.34{col 46}{space 3}0.733{col 54}{space 4}-.2388518{col 67}{space 3} .3395144
{txt}{space 9}IL  {c |}{col 14}{res}{space 2} .0793787{col 26}{space 2} .1469443{col 37}{space 1}    0.54{col 46}{space 3}0.589{col 54}{space 4}-.2086792{col 67}{space 3} .3674365
{txt}{space 9}IN  {c |}{col 14}{res}{space 2} .1669872{col 26}{space 2} .1778203{col 37}{space 1}    0.94{col 46}{space 3}0.348{col 54}{space 4}-.1815975{col 67}{space 3} .5155718
{txt}{space 9}KS  {c |}{col 14}{res}{space 2} .0072616{col 26}{space 2} .1417363{col 37}{space 1}    0.05{col 46}{space 3}0.959{col 54}{space 4}-.2705868{col 67}{space 3}   .28511
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-.0099988{col 26}{space 2} .1365931{col 37}{space 1}   -0.07{col 46}{space 3}0.942{col 54}{space 4} -.277765{col 67}{space 3} .2577674
{txt}{space 9}LA  {c |}{col 14}{res}{space 2} -.040159{col 26}{space 2} .1259668{col 37}{space 1}   -0.32{col 46}{space 3}0.750{col 54}{space 4}-.2870941{col 67}{space 3} .2067761
{txt}{space 9}MA  {c |}{col 14}{res}{space 2} .0384338{col 26}{space 2} .1353775{col 37}{space 1}    0.28{col 46}{space 3}0.776{col 54}{space 4}-.2269493{col 67}{space 3}  .303817
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-.0034428{col 26}{space 2} .1292942{col 37}{space 1}   -0.03{col 46}{space 3}0.979{col 54}{space 4}-.2569009{col 67}{space 3} .2500152
{txt}{space 9}ME  {c |}{col 14}{res}{space 2} .2192872{col 26}{space 2} .2888794{col 37}{space 1}    0.76{col 46}{space 3}0.448{col 54}{space 4}-.3470088{col 67}{space 3} .7855833
{txt}{space 9}MI  {c |}{col 14}{res}{space 2} .0150818{col 26}{space 2} .1264936{col 37}{space 1}    0.12{col 46}{space 3}0.905{col 54}{space 4}-.2328861{col 67}{space 3} .2630497
{txt}{space 9}MN  {c |}{col 14}{res}{space 2} .1760538{col 26}{space 2} .1747995{col 37}{space 1}    1.01{col 46}{space 3}0.314{col 54}{space 4}-.1666092{col 67}{space 3} .5187167
{txt}{space 9}MO  {c |}{col 14}{res}{space 2} .0290762{col 26}{space 2} .1338829{col 37}{space 1}    0.22{col 46}{space 3}0.828{col 54}{space 4}-.2333771{col 67}{space 3} .2915296
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-.0447894{col 26}{space 2} .1314568{col 37}{space 1}   -0.34{col 46}{space 3}0.733{col 54}{space 4}-.3024867{col 67}{space 3}  .212908
{txt}{space 9}MT  {c |}{col 14}{res}{space 2} .3247476{col 26}{space 2} .3183849{col 37}{space 1}    1.02{col 46}{space 3}0.308{col 54}{space 4}-.2993886{col 67}{space 3} .9488838
{txt}{space 9}NC  {c |}{col 14}{res}{space 2} .1625308{col 26}{space 2}  .142611{col 37}{space 1}    1.14{col 46}{space 3}0.254{col 54}{space 4}-.1170324{col 67}{space 3} .4420941
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-.0384962{col 26}{space 2} .1522457{col 37}{space 1}   -0.25{col 46}{space 3}0.800{col 54}{space 4}-.3369463{col 67}{space 3}  .259954
{txt}{space 9}NE  {c |}{col 14}{res}{space 2} .1509303{col 26}{space 2}  .143481{col 37}{space 1}    1.05{col 46}{space 3}0.293{col 54}{space 4}-.1303383{col 67}{space 3}  .432199
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-.0111517{col 26}{space 2} .1715354{col 37}{space 1}   -0.07{col 46}{space 3}0.948{col 54}{space 4} -.347416{col 67}{space 3} .3251126
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2} .0169543{col 26}{space 2} .1331632{col 37}{space 1}    0.13{col 46}{space 3}0.899{col 54}{space 4}-.2440882{col 67}{space 3} .2779967
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-.0999411{col 26}{space 2} .1329188{col 37}{space 1}   -0.75{col 46}{space 3}0.452{col 54}{space 4}-.3605044{col 67}{space 3} .1606221
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}  .455633{col 26}{space 2} .5153447{col 37}{space 1}    0.88{col 46}{space 3}0.377{col 54}{space 4}-.5546074{col 67}{space 3} 1.465873
{txt}{space 9}NY  {c |}{col 14}{res}{space 2} .0449623{col 26}{space 2} .1328784{col 37}{space 1}    0.34{col 46}{space 3}0.735{col 54}{space 4}-.2155218{col 67}{space 3} .3054464
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}  .235167{col 26}{space 2} .2654537{col 37}{space 1}    0.89{col 46}{space 3}0.376{col 54}{space 4} -.285207{col 67}{space 3}  .755541
{txt}{space 9}OK  {c |}{col 14}{res}{space 2} .1581245{col 26}{space 2} .1830954{col 37}{space 1}    0.86{col 46}{space 3}0.388{col 54}{space 4} -.200801{col 67}{space 3} .5170499
{txt}{space 9}OR  {c |}{col 14}{res}{space 2} .0399269{col 26}{space 2} .1310479{col 37}{space 1}    0.30{col 46}{space 3}0.761{col 54}{space 4}-.2169688{col 67}{space 3} .2968227
{txt}{space 9}PA  {c |}{col 14}{res}{space 2} .1042904{col 26}{space 2} .1459443{col 37}{space 1}    0.71{col 46}{space 3}0.475{col 54}{space 4}-.1818071{col 67}{space 3} .3903879
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}  .245244{col 26}{space 2} .3712909{col 37}{space 1}    0.66{col 46}{space 3}0.509{col 54}{space 4}-.4826049{col 67}{space 3} .9730929
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-.0845921{col 26}{space 2} .1233629{col 37}{space 1}   -0.69{col 46}{space 3}0.493{col 54}{space 4}-.3264228{col 67}{space 3} .1572387
{txt}{space 9}SD  {c |}{col 14}{res}{space 2}-.0119932{col 26}{space 2} .1907097{col 37}{space 1}   -0.06{col 46}{space 3}0.950{col 54}{space 4}-.3858451{col 67}{space 3} .3618588
{txt}{space 9}TN  {c |}{col 14}{res}{space 2} .0714235{col 26}{space 2} .1575613{col 37}{space 1}    0.45{col 46}{space 3}0.650{col 54}{space 4}-.2374469{col 67}{space 3}  .380294
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-.0203576{col 26}{space 2} .1237556{col 37}{space 1}   -0.16{col 46}{space 3}0.869{col 54}{space 4}-.2629582{col 67}{space 3}  .222243
{txt}{space 9}UT  {c |}{col 14}{res}{space 2} .2207239{col 26}{space 2} .2442651{col 37}{space 1}    0.90{col 46}{space 3}0.366{col 54}{space 4}-.2581139{col 67}{space 3} .6995616
{txt}{space 9}VA  {c |}{col 14}{res}{space 2} .0560487{col 26}{space 2} .1369825{col 37}{space 1}    0.41{col 46}{space 3}0.682{col 54}{space 4}-.2124808{col 67}{space 3} .3245781
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}-.0969015{col 26}{space 2} .1357103{col 37}{space 1}   -0.71{col 46}{space 3}0.475{col 54}{space 4}-.3629371{col 67}{space 3} .1691341
{txt}{space 9}WA  {c |}{col 14}{res}{space 2} .0883672{col 26}{space 2} .1411965{col 37}{space 1}    0.63{col 46}{space 3}0.531{col 54}{space 4}-.1884231{col 67}{space 3} .3651576
{txt}{space 9}WI  {c |}{col 14}{res}{space 2} .0542708{col 26}{space 2} .1303156{col 37}{space 1}    0.42{col 46}{space 3}0.677{col 54}{space 4}-.2011895{col 67}{space 3}  .309731
{txt}{space 9}WV  {c |}{col 14}{res}{space 2} .0754419{col 26}{space 2} .1771112{col 37}{space 1}    0.43{col 46}{space 3}0.670{col 54}{space 4}-.2717527{col 67}{space 3} .4226365
{txt}{space 9}WY  {c |}{col 14}{res}{space 2} .4096218{col 26}{space 2} .4633542{col 37}{space 1}    0.88{col 46}{space 3}0.377{col 54}{space 4}-.4987005{col 67}{space 3} 1.317944
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.4793138{col 26}{space 2} .1518156{col 37}{space 1}   -3.16{col 46}{space 3}0.002{col 54}{space 4}-.7769209{col 67}{space 3}-.1817067
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est19{txt} stored)

Linear regression                                      Number of obs ={res}    6732
                                                       {txt}F( 71,  6660) ={res}    1.95
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0107
                                                       {txt}Root MSE      = {res} 1.5536

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     IncKurt{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2}-.1675805{col 26}{space 2} .0458839{col 37}{space 1}   -3.65{col 46}{space 3}0.000{col 54}{space 4}-.2575277{col 67}{space 3}-.0776334
{txt}{space 8}Old  {c |}{col 14}{res}{space 2}-.2173185{col 26}{space 2} .0939179{col 37}{space 1}   -2.31{col 46}{space 3}0.021{col 54}{space 4}-.4014277{col 67}{space 3}-.0332093
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2} .0926352{col 26}{space 2}  .042544{col 37}{space 1}    2.18{col 46}{space 3}0.029{col 54}{space 4} .0092354{col 67}{space 3}  .176035
{txt}High Educ..  {c |}{col 14}{res}{space 2} .1387317{col 26}{space 2} .0482567{col 37}{space 1}    2.87{col 46}{space 3}0.004{col 54}{space 4}  .044133{col 67}{space 3} .2333303
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2}  .066459{col 26}{space 2} .0514516{col 37}{space 1}    1.29{col 46}{space 3}0.197{col 54}{space 4}-.0344027{col 67}{space 3} .1673207
{txt}High Income  {c |}{col 14}{res}{space 2} .0784817{col 26}{space 2} .0486272{col 37}{space 1}    1.61{col 46}{space 3}0.107{col 54}{space 4}-.0168432{col 67}{space 3} .1738067
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2}-.0487016{col 26}{space 2} .0762832{col 37}{space 1}   -0.64{col 46}{space 3}0.523{col 54}{space 4}-.1982412{col 67}{space 3}  .100838
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2}-.1181511{col 26}{space 2} .1004599{col 37}{space 1}   -1.18{col 46}{space 3}0.240{col 54}{space 4}-.3150846{col 67}{space 3} .0787825
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2}-.0509396{col 26}{space 2} .0479943{col 37}{space 1}   -1.06{col 46}{space 3}0.289{col 54}{space 4}-.1450238{col 67}{space 3} .0431446
{txt}{space 7}2015  {c |}{col 14}{res}{space 2}-.0235266{col 26}{space 2} .0647407{col 37}{space 1}   -0.36{col 46}{space 3}0.716{col 54}{space 4}-.1504391{col 67}{space 3}  .103386
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0293271{col 26}{space 2} .0559981{col 37}{space 1}    0.52{col 46}{space 3}0.600{col 54}{space 4} -.080447{col 67}{space 3} .1391013
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0063144{col 26}{space 2} .0744742{col 37}{space 1}   -0.08{col 46}{space 3}0.932{col 54}{space 4}-.1523077{col 67}{space 3} .1396789
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0278292{col 26}{space 2} .0573408{col 37}{space 1}   -0.49{col 46}{space 3}0.627{col 54}{space 4}-.1402355{col 67}{space 3}  .084577
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2}-.0402217{col 26}{space 2} .1182343{col 37}{space 1}   -0.34{col 46}{space 3}0.734{col 54}{space 4}-.2719988{col 67}{space 3} .1915554
{txt}{space 9}AR  {c |}{col 14}{res}{space 2} -.098889{col 26}{space 2} .1078531{col 37}{space 1}   -0.92{col 46}{space 3}0.359{col 54}{space 4}-.3103156{col 67}{space 3} .1125375
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2} .3115834{col 26}{space 2} .4121898{col 37}{space 1}    0.76{col 46}{space 3}0.450{col 54}{space 4}-.4964405{col 67}{space 3} 1.119607
{txt}{space 9}CA  {c |}{col 14}{res}{space 2} .1678368{col 26}{space 2} .1282432{col 37}{space 1}    1.31{col 46}{space 3}0.191{col 54}{space 4} -.083561{col 67}{space 3} .4192346
{txt}{space 9}CO  {c |}{col 14}{res}{space 2}-.0825318{col 26}{space 2}  .106958{col 37}{space 1}   -0.77{col 46}{space 3}0.440{col 54}{space 4}-.2922036{col 67}{space 3} .1271401
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-.1272652{col 26}{space 2} .1038093{col 37}{space 1}   -1.23{col 46}{space 3}0.220{col 54}{space 4}-.3307648{col 67}{space 3} .0762343
{txt}{space 9}DC  {c |}{col 14}{res}{space 2} .0279087{col 26}{space 2} .1313319{col 37}{space 1}    0.21{col 46}{space 3}0.832{col 54}{space 4}-.2295439{col 67}{space 3} .2853613
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-.0840035{col 26}{space 2} .1196712{col 37}{space 1}   -0.70{col 46}{space 3}0.483{col 54}{space 4}-.3185974{col 67}{space 3} .1505904
{txt}{space 9}FL  {c |}{col 14}{res}{space 2} .0033438{col 26}{space 2} .1068555{col 37}{space 1}    0.03{col 46}{space 3}0.975{col 54}{space 4}-.2061273{col 67}{space 3} .2128148
{txt}{space 9}GA  {c |}{col 14}{res}{space 2} .0184033{col 26}{space 2} .1065523{col 37}{space 1}    0.17{col 46}{space 3}0.863{col 54}{space 4}-.1904733{col 67}{space 3} .2272799
{txt}{space 9}HI  {c |}{col 14}{res}{space 2} .5327959{col 26}{space 2} .5054159{col 37}{space 1}    1.05{col 46}{space 3}0.292{col 54}{space 4}-.4579811{col 67}{space 3} 1.523573
{txt}{space 9}IA  {c |}{col 14}{res}{space 2} .2674054{col 26}{space 2} .1856503{col 37}{space 1}    1.44{col 46}{space 3}0.150{col 54}{space 4}-.0965286{col 67}{space 3} .6313394
{txt}{space 9}ID  {c |}{col 14}{res}{space 2} .0355794{col 26}{space 2} .1342152{col 37}{space 1}    0.27{col 46}{space 3}0.791{col 54}{space 4}-.2275253{col 67}{space 3} .2986842
{txt}{space 9}IL  {c |}{col 14}{res}{space 2} .0702402{col 26}{space 2} .1285302{col 37}{space 1}    0.55{col 46}{space 3}0.585{col 54}{space 4}  -.18172{col 67}{space 3} .3222005
{txt}{space 9}IN  {c |}{col 14}{res}{space 2} .1406288{col 26}{space 2} .1641359{col 37}{space 1}    0.86{col 46}{space 3}0.392{col 54}{space 4}-.1811302{col 67}{space 3} .4623878
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-.0199884{col 26}{space 2} .1237452{col 37}{space 1}   -0.16{col 46}{space 3}0.872{col 54}{space 4}-.2625686{col 67}{space 3} .2225918
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-.0252728{col 26}{space 2} .1189773{col 37}{space 1}   -0.21{col 46}{space 3}0.832{col 54}{space 4}-.2585064{col 67}{space 3} .2079607
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-.0433379{col 26}{space 2} .1063888{col 37}{space 1}   -0.41{col 46}{space 3}0.684{col 54}{space 4} -.251894{col 67}{space 3} .1652181
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}  .026852{col 26}{space 2} .1151368{col 37}{space 1}    0.23{col 46}{space 3}0.816{col 54}{space 4}-.1988531{col 67}{space 3} .2525571
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-.0087804{col 26}{space 2} .1094645{col 37}{space 1}   -0.08{col 46}{space 3}0.936{col 54}{space 4}-.2233659{col 67}{space 3} .2058052
{txt}{space 9}ME  {c |}{col 14}{res}{space 2} .2034873{col 26}{space 2} .2809179{col 37}{space 1}    0.72{col 46}{space 3}0.469{col 54}{space 4}-.3472018{col 67}{space 3} .7541764
{txt}{space 9}MI  {c |}{col 14}{res}{space 2}-.0002966{col 26}{space 2} .1075586{col 37}{space 1}   -0.00{col 46}{space 3}0.998{col 54}{space 4}-.2111458{col 67}{space 3} .2105527
{txt}{space 9}MN  {c |}{col 14}{res}{space 2} .1561959{col 26}{space 2} .1604559{col 37}{space 1}    0.97{col 46}{space 3}0.330{col 54}{space 4}-.1583489{col 67}{space 3} .4707408
{txt}{space 9}MO  {c |}{col 14}{res}{space 2} .0075052{col 26}{space 2} .1152785{col 37}{space 1}    0.07{col 46}{space 3}0.948{col 54}{space 4}-.2184774{col 67}{space 3} .2334879
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-.0268564{col 26}{space 2} .1130676{col 37}{space 1}   -0.24{col 46}{space 3}0.812{col 54}{space 4} -.248505{col 67}{space 3} .1947923
{txt}{space 9}MT  {c |}{col 14}{res}{space 2} .2906423{col 26}{space 2} .3121067{col 37}{space 1}    0.93{col 46}{space 3}0.352{col 54}{space 4}-.3211868{col 67}{space 3} .9024715
{txt}{space 9}NC  {c |}{col 14}{res}{space 2} .1607769{col 26}{space 2} .1266707{col 37}{space 1}    1.27{col 46}{space 3}0.204{col 54}{space 4}-.0875383{col 67}{space 3} .4090921
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-.0807683{col 26}{space 2} .1411777{col 37}{space 1}   -0.57{col 46}{space 3}0.567{col 54}{space 4}-.3575219{col 67}{space 3} .1959853
{txt}{space 9}NE  {c |}{col 14}{res}{space 2} .1280719{col 26}{space 2} .1250265{col 37}{space 1}    1.02{col 46}{space 3}0.306{col 54}{space 4}  -.11702{col 67}{space 3} .3731638
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-.0222941{col 26}{space 2} .1600581{col 37}{space 1}   -0.14{col 46}{space 3}0.889{col 54}{space 4}-.3360592{col 67}{space 3} .2914709
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-.0041338{col 26}{space 2} .1136713{col 37}{space 1}   -0.04{col 46}{space 3}0.971{col 54}{space 4}-.2269659{col 67}{space 3} .2186984
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-.1296825{col 26}{space 2} .1151996{col 37}{space 1}   -1.13{col 46}{space 3}0.260{col 54}{space 4}-.3555106{col 67}{space 3} .0961456
{txt}{space 9}NV  {c |}{col 14}{res}{space 2} .4333704{col 26}{space 2} .5107811{col 37}{space 1}    0.85{col 46}{space 3}0.396{col 54}{space 4}-.5679241{col 67}{space 3} 1.434665
{txt}{space 9}NY  {c |}{col 14}{res}{space 2} .0303538{col 26}{space 2} .1123444{col 37}{space 1}    0.27{col 46}{space 3}0.787{col 54}{space 4}-.1898772{col 67}{space 3} .2505849
{txt}{space 9}OH  {c |}{col 14}{res}{space 2} .2165331{col 26}{space 2} .2756255{col 37}{space 1}    0.79{col 46}{space 3}0.432{col 54}{space 4}-.3237812{col 67}{space 3} .7568474
{txt}{space 9}OK  {c |}{col 14}{res}{space 2} .0839033{col 26}{space 2} .1727723{col 37}{space 1}    0.49{col 46}{space 3}0.627{col 54}{space 4}-.2547858{col 67}{space 3} .4225924
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-.0018001{col 26}{space 2}  .111841{col 37}{space 1}   -0.02{col 46}{space 3}0.987{col 54}{space 4}-.2210444{col 67}{space 3} .2174441
{txt}{space 9}PA  {c |}{col 14}{res}{space 2} .0914851{col 26}{space 2} .1308156{col 37}{space 1}    0.70{col 46}{space 3}0.484{col 54}{space 4}-.1649554{col 67}{space 3} .3479255
{txt}{space 9}RI  {c |}{col 14}{res}{space 2} .2341046{col 26}{space 2} .3648446{col 37}{space 1}    0.64{col 46}{space 3}0.521{col 54}{space 4}-.4811077{col 67}{space 3}  .949317
{txt}{space 9}SC  {c |}{col 14}{res}{space 2} -.086197{col 26}{space 2} .1028994{col 37}{space 1}   -0.84{col 46}{space 3}0.402{col 54}{space 4}-.2879127{col 67}{space 3} .1155187
{txt}{space 9}SD  {c |}{col 14}{res}{space 2}-.0544075{col 26}{space 2} .1812306{col 37}{space 1}   -0.30{col 46}{space 3}0.764{col 54}{space 4}-.4096776{col 67}{space 3} .3008625
{txt}{space 9}TN  {c |}{col 14}{res}{space 2} .0490688{col 26}{space 2} .1415243{col 37}{space 1}    0.35{col 46}{space 3}0.729{col 54}{space 4}-.2283641{col 67}{space 3} .3265017
{txt}{space 9}TX  {c |}{col 14}{res}{space 2} -.042523{col 26}{space 2} .1028903{col 37}{space 1}   -0.41{col 46}{space 3}0.679{col 54}{space 4}-.2442209{col 67}{space 3}  .159175
{txt}{space 9}UT  {c |}{col 14}{res}{space 2}  .189731{col 26}{space 2} .2374034{col 37}{space 1}    0.80{col 46}{space 3}0.424{col 54}{space 4}-.2756556{col 67}{space 3} .6551176
{txt}{space 9}VA  {c |}{col 14}{res}{space 2} .0451464{col 26}{space 2} .1178973{col 37}{space 1}    0.38{col 46}{space 3}0.702{col 54}{space 4}-.1859701{col 67}{space 3} .2762629
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}-.1129823{col 26}{space 2} .1195674{col 37}{space 1}   -0.94{col 46}{space 3}0.345{col 54}{space 4}-.3473727{col 67}{space 3} .1214082
{txt}{space 9}WA  {c |}{col 14}{res}{space 2} .0638125{col 26}{space 2} .1218979{col 37}{space 1}    0.52{col 46}{space 3}0.601{col 54}{space 4}-.1751463{col 67}{space 3} .3027714
{txt}{space 9}WI  {c |}{col 14}{res}{space 2} .0332748{col 26}{space 2}   .11283{col 37}{space 1}    0.29{col 46}{space 3}0.768{col 54}{space 4} -.187908{col 67}{space 3} .2544577
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}  .063561{col 26}{space 2} .1650505{col 37}{space 1}    0.39{col 46}{space 3}0.700{col 54}{space 4}-.2599908{col 67}{space 3} .3871128
{txt}{space 9}WY  {c |}{col 14}{res}{space 2} .3609293{col 26}{space 2} .4611419{col 37}{space 1}    0.78{col 46}{space 3}0.434{col 54}{space 4}-.5430564{col 67}{space 3} 1.264915
{txt}{space 12} {c |}
{space 7}2.Q33 {c |}{col 14}{res}{space 2} .0245074{col 26}{space 2} .0352464{col 37}{space 1}    0.70{col 46}{space 3}0.487{col 54}{space 4}-.0445869{col 67}{space 3} .0936017
{txt}{space 7}2.Q34 {c |}{col 14}{res}{space 2}-.0124283{col 26}{space 2} .0813873{col 37}{space 1}   -0.15{col 46}{space 3}0.879{col 54}{space 4}-.1719734{col 67}{space 3} .1471168
{txt}{space 7}Q35_1 {c |}{col 14}{res}{space 2} .0950541{col 26}{space 2} .1178083{col 37}{space 1}    0.81{col 46}{space 3}0.420{col 54}{space 4}-.1358878{col 67}{space 3}  .325996
{txt}{space 7}Q35_2 {c |}{col 14}{res}{space 2}-.0278775{col 26}{space 2}  .116526{col 37}{space 1}   -0.24{col 46}{space 3}0.811{col 54}{space 4}-.2563058{col 67}{space 3} .2005508
{txt}{space 7}Q35_3 {c |}{col 14}{res}{space 2} .5033155{col 26}{space 2} .4890845{col 37}{space 1}    1.03{col 46}{space 3}0.303{col 54}{space 4}-.4554468{col 67}{space 3} 1.462078
{txt}{space 7}Q35_4 {c |}{col 14}{res}{space 2} .0410696{col 26}{space 2} .1072782{col 37}{space 1}    0.38{col 46}{space 3}0.702{col 54}{space 4}  -.16923{col 67}{space 3} .2513692
{txt}{space 7}Q35_5 {c |}{col 14}{res}{space 2} .0511109{col 26}{space 2} .2462769{col 37}{space 1}    0.21{col 46}{space 3}0.836{col 54}{space 4}-.4316708{col 67}{space 3} .5338925
{txt}{space 7}Q35_6 {c |}{col 14}{res}{space 2} .2009499{col 26}{space 2} .1738007{col 37}{space 1}    1.16{col 46}{space 3}0.248{col 54}{space 4} -.139755{col 67}{space 3} .5416549
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.5692095{col 26}{space 2} .1954073{col 37}{space 1}   -2.91{col 46}{space 3}0.004{col 54}{space 4}-.9522703{col 67}{space 3}-.1861487
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est20{txt} stored)

Linear regression                                      Number of obs ={res}    5636
                                                       {txt}F( 75,  5560) ={res}    1.84
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0141
                                                       {txt}Root MSE      = {res} 1.6445

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     IncKurt{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2}-.1460576{col 26}{space 2} .0502373{col 37}{space 1}   -2.91{col 46}{space 3}0.004{col 54}{space 4}-.2445424{col 67}{space 3}-.0475727
{txt}{space 8}Old  {c |}{col 14}{res}{space 2} -.224968{col 26}{space 2} .0835283{col 37}{space 1}   -2.69{col 46}{space 3}0.007{col 54}{space 4}-.3887161{col 67}{space 3}-.0612199
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2}  .079732{col 26}{space 2} .0492731{col 37}{space 1}    1.62{col 46}{space 3}0.106{col 54}{space 4}-.0168624{col 67}{space 3} .1763265
{txt}High Educ..  {c |}{col 14}{res}{space 2} .1272197{col 26}{space 2} .0552235{col 37}{space 1}    2.30{col 46}{space 3}0.021{col 54}{space 4} .0189602{col 67}{space 3} .2354793
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2} .0840524{col 26}{space 2} .0611654{col 37}{space 1}    1.37{col 46}{space 3}0.169{col 54}{space 4}-.0358557{col 67}{space 3} .2039606
{txt}High Income  {c |}{col 14}{res}{space 2} .0755591{col 26}{space 2} .0555556{col 37}{space 1}    1.36{col 46}{space 3}0.174{col 54}{space 4}-.0333515{col 67}{space 3} .1844697
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2}-.1287552{col 26}{space 2} .0637117{col 37}{space 1}   -2.02{col 46}{space 3}0.043{col 54}{space 4} -.253655{col 67}{space 3}-.0038554
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2}-.1852969{col 26}{space 2} .1036674{col 37}{space 1}   -1.79{col 46}{space 3}0.074{col 54}{space 4}-.3885256{col 67}{space 3} .0179318
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2}-.0712732{col 26}{space 2} .0539359{col 37}{space 1}   -1.32{col 46}{space 3}0.186{col 54}{space 4}-.1770086{col 67}{space 3} .0344622
{txt}{space 7}2015  {c |}{col 14}{res}{space 2}-.0273427{col 26}{space 2} .0737059{col 37}{space 1}   -0.37{col 46}{space 3}0.711{col 54}{space 4} -.171835{col 67}{space 3} .1171497
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0113765{col 26}{space 2} .0666761{col 37}{space 1}    0.17{col 46}{space 3}0.865{col 54}{space 4}-.1193346{col 67}{space 3} .1420877
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0079788{col 26}{space 2}  .084763{col 37}{space 1}   -0.09{col 46}{space 3}0.925{col 54}{space 4}-.1741473{col 67}{space 3} .1581898
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0476176{col 26}{space 2} .0636948{col 37}{space 1}   -0.75{col 46}{space 3}0.455{col 54}{space 4}-.1724843{col 67}{space 3} .0772492
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2} .0286412{col 26}{space 2} .1445038{col 37}{space 1}    0.20{col 46}{space 3}0.843{col 54}{space 4}-.2546427{col 67}{space 3}  .311925
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-.0273661{col 26}{space 2} .1402112{col 37}{space 1}   -0.20{col 46}{space 3}0.845{col 54}{space 4}-.3022349{col 67}{space 3} .2475026
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2} .4682739{col 26}{space 2} .4954057{col 37}{space 1}    0.95{col 46}{space 3}0.345{col 54}{space 4}-.5029149{col 67}{space 3} 1.439463
{txt}{space 9}CA  {c |}{col 14}{res}{space 2} .2922009{col 26}{space 2} .1716161{col 37}{space 1}    1.70{col 46}{space 3}0.089{col 54}{space 4}-.0442336{col 67}{space 3} .6286354
{txt}{space 9}CO  {c |}{col 14}{res}{space 2} .0117785{col 26}{space 2}  .141809{col 37}{space 1}    0.08{col 46}{space 3}0.934{col 54}{space 4}-.2662226{col 67}{space 3} .2897796
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-.0705242{col 26}{space 2} .1316644{col 37}{space 1}   -0.54{col 46}{space 3}0.592{col 54}{space 4}-.3286379{col 67}{space 3} .1875895
{txt}{space 9}DC  {c |}{col 14}{res}{space 2} .0693243{col 26}{space 2} .1591485{col 37}{space 1}    0.44{col 46}{space 3}0.663{col 54}{space 4}-.2426689{col 67}{space 3} .3813175
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-.0279572{col 26}{space 2} .1503843{col 37}{space 1}   -0.19{col 46}{space 3}0.853{col 54}{space 4}-.3227692{col 67}{space 3} .2668548
{txt}{space 9}FL  {c |}{col 14}{res}{space 2} .0966786{col 26}{space 2} .1371957{col 37}{space 1}    0.70{col 46}{space 3}0.481{col 54}{space 4}-.1722786{col 67}{space 3} .3656358
{txt}{space 9}GA  {c |}{col 14}{res}{space 2} .0960857{col 26}{space 2} .1344505{col 37}{space 1}    0.71{col 46}{space 3}0.475{col 54}{space 4}-.1674898{col 67}{space 3} .3596611
{txt}{space 9}HI  {c |}{col 14}{res}{space 2} .1954761{col 26}{space 2} .2187072{col 37}{space 1}    0.89{col 46}{space 3}0.371{col 54}{space 4}-.2332754{col 67}{space 3} .6242277
{txt}{space 9}IA  {c |}{col 14}{res}{space 2} .3312415{col 26}{space 2} .2126188{col 37}{space 1}    1.56{col 46}{space 3}0.119{col 54}{space 4}-.0855744{col 67}{space 3} .7480575
{txt}{space 9}ID  {c |}{col 14}{res}{space 2} .1572818{col 26}{space 2} .1624496{col 37}{space 1}    0.97{col 46}{space 3}0.333{col 54}{space 4} -.161183{col 67}{space 3} .4757465
{txt}{space 9}IL  {c |}{col 14}{res}{space 2} .1266623{col 26}{space 2} .1631782{col 37}{space 1}    0.78{col 46}{space 3}0.438{col 54}{space 4}-.1932307{col 67}{space 3} .4465554
{txt}{space 9}IN  {c |}{col 14}{res}{space 2} .1856604{col 26}{space 2} .1916915{col 37}{space 1}    0.97{col 46}{space 3}0.333{col 54}{space 4}-.1901299{col 67}{space 3} .5614506
{txt}{space 9}KS  {c |}{col 14}{res}{space 2} .0875842{col 26}{space 2} .1536486{col 37}{space 1}    0.57{col 46}{space 3}0.569{col 54}{space 4} -.213627{col 67}{space 3} .3887954
{txt}{space 9}KY  {c |}{col 14}{res}{space 2} .0538654{col 26}{space 2}  .145569{col 37}{space 1}    0.37{col 46}{space 3}0.711{col 54}{space 4}-.2315068{col 67}{space 3} .3392376
{txt}{space 9}LA  {c |}{col 14}{res}{space 2} .0585076{col 26}{space 2} .1358102{col 37}{space 1}    0.43{col 46}{space 3}0.667{col 54}{space 4}-.2077335{col 67}{space 3} .3247486
{txt}{space 9}MA  {c |}{col 14}{res}{space 2} .0682981{col 26}{space 2} .1403332{col 37}{space 1}    0.49{col 46}{space 3}0.627{col 54}{space 4}-.2068098{col 67}{space 3} .3434061
{txt}{space 9}MD  {c |}{col 14}{res}{space 2} .0473732{col 26}{space 2} .1400875{col 37}{space 1}    0.34{col 46}{space 3}0.735{col 54}{space 4}-.2272529{col 67}{space 3} .3219994
{txt}{space 9}ME  {c |}{col 14}{res}{space 2} .2450853{col 26}{space 2}  .307931{col 37}{space 1}    0.80{col 46}{space 3}0.426{col 54}{space 4}-.3585798{col 67}{space 3} .8487504
{txt}{space 9}MI  {c |}{col 14}{res}{space 2} .0656306{col 26}{space 2} .1322546{col 37}{space 1}    0.50{col 46}{space 3}0.620{col 54}{space 4}-.1936402{col 67}{space 3} .3249013
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}  .132622{col 26}{space 2} .1734045{col 37}{space 1}    0.76{col 46}{space 3}0.444{col 54}{space 4}-.2073185{col 67}{space 3} .4725626
{txt}{space 9}MO  {c |}{col 14}{res}{space 2} .1199862{col 26}{space 2} .1477536{col 37}{space 1}    0.81{col 46}{space 3}0.417{col 54}{space 4}-.1696685{col 67}{space 3}  .409641
{txt}{space 9}MS  {c |}{col 14}{res}{space 2} .0631447{col 26}{space 2} .1387907{col 37}{space 1}    0.45{col 46}{space 3}0.649{col 54}{space 4}-.2089392{col 67}{space 3} .3352287
{txt}{space 9}MT  {c |}{col 14}{res}{space 2} .1071639{col 26}{space 2} .2628183{col 37}{space 1}    0.41{col 46}{space 3}0.683{col 54}{space 4}-.4080626{col 67}{space 3} .6223903
{txt}{space 9}NC  {c |}{col 14}{res}{space 2} .2816648{col 26}{space 2} .1540144{col 37}{space 1}    1.83{col 46}{space 3}0.067{col 54}{space 4}-.0202636{col 67}{space 3} .5835933
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-.0431571{col 26}{space 2} .1789724{col 37}{space 1}   -0.24{col 46}{space 3}0.809{col 54}{space 4} -.394013{col 67}{space 3} .3076987
{txt}{space 9}NE  {c |}{col 14}{res}{space 2} .2166874{col 26}{space 2} .1561939{col 37}{space 1}    1.39{col 46}{space 3}0.165{col 54}{space 4}-.0895137{col 67}{space 3} .5228885
{txt}{space 9}NH  {c |}{col 14}{res}{space 2} .1042335{col 26}{space 2} .1935037{col 37}{space 1}    0.54{col 46}{space 3}0.590{col 54}{space 4}-.2751093{col 67}{space 3} .4835764
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2} .0694763{col 26}{space 2}  .150593{col 37}{space 1}    0.46{col 46}{space 3}0.645{col 54}{space 4}-.2257448{col 67}{space 3} .3646974
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-.1124501{col 26}{space 2} .1478814{col 37}{space 1}   -0.76{col 46}{space 3}0.447{col 54}{space 4}-.4023554{col 67}{space 3} .1774551
{txt}{space 9}NV  {c |}{col 14}{res}{space 2} .6403539{col 26}{space 2} .6131756{col 37}{space 1}    1.04{col 46}{space 3}0.296{col 54}{space 4}  -.56171{col 67}{space 3} 1.842418
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}   .11161{col 26}{space 2}  .140112{col 37}{space 1}    0.80{col 46}{space 3}0.426{col 54}{space 4}-.1630643{col 67}{space 3} .3862843
{txt}{space 9}OH  {c |}{col 14}{res}{space 2} .3310349{col 26}{space 2} .2834618{col 37}{space 1}    1.17{col 46}{space 3}0.243{col 54}{space 4} -.224661{col 67}{space 3} .8867309
{txt}{space 9}OK  {c |}{col 14}{res}{space 2} .1845976{col 26}{space 2} .2326503{col 37}{space 1}    0.79{col 46}{space 3}0.428{col 54}{space 4} -.271488{col 67}{space 3} .6406831
{txt}{space 9}OR  {c |}{col 14}{res}{space 2} .0848453{col 26}{space 2}  .144239{col 37}{space 1}    0.59{col 46}{space 3}0.556{col 54}{space 4}-.1979194{col 67}{space 3}   .36761
{txt}{space 9}PA  {c |}{col 14}{res}{space 2} .1912447{col 26}{space 2} .1543134{col 37}{space 1}    1.24{col 46}{space 3}0.215{col 54}{space 4}-.1112698{col 67}{space 3} .4937593
{txt}{space 9}RI  {c |}{col 14}{res}{space 2} .3081465{col 26}{space 2} .4073355{col 37}{space 1}    0.76{col 46}{space 3}0.449{col 54}{space 4}-.4903901{col 67}{space 3} 1.106683
{txt}{space 9}SC  {c |}{col 14}{res}{space 2} .0068023{col 26}{space 2} .1306612{col 37}{space 1}    0.05{col 46}{space 3}0.958{col 54}{space 4}-.2493448{col 67}{space 3} .2629493
{txt}{space 9}SD  {c |}{col 14}{res}{space 2} .0112165{col 26}{space 2} .2607344{col 37}{space 1}    0.04{col 46}{space 3}0.966{col 54}{space 4}-.4999248{col 67}{space 3} .5223578
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-.0099172{col 26}{space 2} .1414596{col 37}{space 1}   -0.07{col 46}{space 3}0.944{col 54}{space 4}-.2872333{col 67}{space 3} .2673988
{txt}{space 9}TX  {c |}{col 14}{res}{space 2} .0195192{col 26}{space 2} .1376379{col 37}{space 1}    0.14{col 46}{space 3}0.887{col 54}{space 4}-.2503049{col 67}{space 3} .2893432
{txt}{space 9}UT  {c |}{col 14}{res}{space 2} .3087176{col 26}{space 2} .2680308{col 37}{space 1}    1.15{col 46}{space 3}0.249{col 54}{space 4}-.2167276{col 67}{space 3} .8341627
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}  .054373{col 26}{space 2} .1353254{col 37}{space 1}    0.40{col 46}{space 3}0.688{col 54}{space 4}-.2109178{col 67}{space 3} .3196637
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}-.0552969{col 26}{space 2} .1372949{col 37}{space 1}   -0.40{col 46}{space 3}0.687{col 54}{space 4}-.3244486{col 67}{space 3} .2138548
{txt}{space 9}WA  {c |}{col 14}{res}{space 2} .1707452{col 26}{space 2} .1504894{col 37}{space 1}    1.13{col 46}{space 3}0.257{col 54}{space 4}-.1242728{col 67}{space 3} .4657632
{txt}{space 9}WI  {c |}{col 14}{res}{space 2} .1169579{col 26}{space 2}  .139724{col 37}{space 1}    0.84{col 46}{space 3}0.403{col 54}{space 4}-.1569557{col 67}{space 3} .3908715
{txt}{space 9}WV  {c |}{col 14}{res}{space 2} .1511964{col 26}{space 2} .2095948{col 37}{space 1}    0.72{col 46}{space 3}0.471{col 54}{space 4}-.2596913{col 67}{space 3} .5620841
{txt}{space 9}WY  {c |}{col 14}{res}{space 2} .5920055{col 26}{space 2} .5658404{col 37}{space 1}    1.05{col 46}{space 3}0.295{col 54}{space 4}-.5172628{col 67}{space 3} 1.701274
{txt}{space 12} {c |}
{space 7}2.Q33 {c |}{col 14}{res}{space 2}-.0059244{col 26}{space 2} .0423807{col 37}{space 1}   -0.14{col 46}{space 3}0.889{col 54}{space 4}-.0890071{col 67}{space 3} .0771584
{txt}{space 7}2.Q34 {c |}{col 14}{res}{space 2}-.0083088{col 26}{space 2} .0933825{col 37}{space 1}   -0.09{col 46}{space 3}0.929{col 54}{space 4} -.191375{col 67}{space 3} .1747575
{txt}{space 7}Q35_1 {c |}{col 14}{res}{space 2}-.0085178{col 26}{space 2} .1189773{col 37}{space 1}   -0.07{col 46}{space 3}0.943{col 54}{space 4}-.2417598{col 67}{space 3} .2247243
{txt}{space 7}Q35_2 {c |}{col 14}{res}{space 2}-.1237599{col 26}{space 2}  .117162{col 37}{space 1}   -1.06{col 46}{space 3}0.291{col 54}{space 4}-.3534433{col 67}{space 3} .1059234
{txt}{space 7}Q35_3 {c |}{col 14}{res}{space 2} .5894122{col 26}{space 2}  .598609{col 37}{space 1}    0.98{col 46}{space 3}0.325{col 54}{space 4}-.5840953{col 67}{space 3}  1.76292
{txt}{space 7}Q35_4 {c |}{col 14}{res}{space 2}-.0644509{col 26}{space 2} .1006391{col 37}{space 1}   -0.64{col 46}{space 3}0.522{col 54}{space 4}-.2617429{col 67}{space 3} .1328411
{txt}{space 7}Q35_5 {c |}{col 14}{res}{space 2}-.2570414{col 26}{space 2} .1111076{col 37}{space 1}   -2.31{col 46}{space 3}0.021{col 54}{space 4}-.4748556{col 67}{space 3}-.0392271
{txt}{space 7}Q35_6 {c |}{col 14}{res}{space 2}  .168407{col 26}{space 2} .2159683{col 37}{space 1}    0.78{col 46}{space 3}0.436{col 54}{space 4}-.2549752{col 67}{space 3} .5917892
{txt}{space 7}Q4new {c |}{col 14}{res}{space 2} .0015683{col 26}{space 2} .0011265{col 37}{space 1}    1.39{col 46}{space 3}0.164{col 54}{space 4}-.0006402{col 67}{space 3} .0037767
{txt}{space 7}Q6new {c |}{col 14}{res}{space 2} .0032329{col 26}{space 2} .0013553{col 37}{space 1}    2.39{col 46}{space 3}0.017{col 54}{space 4}  .000576{col 67}{space 3} .0058897
{txt}{space 5}Q9_mean {c |}{col 14}{res}{space 2}-.0032831{col 26}{space 2} .0031847{col 37}{space 1}   -1.03{col 46}{space 3}0.303{col 54}{space 4}-.0095263{col 67}{space 3} .0029601
{txt}{space 6}Q13new {c |}{col 14}{res}{space 2}-.0006274{col 26}{space 2} .0009299{col 37}{space 1}   -0.67{col 46}{space 3}0.500{col 54}{space 4}-.0024504{col 67}{space 3} .0011957
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.6465185{col 26}{space 2} .2270908{col 37}{space 1}   -2.85{col 46}{space 3}0.004{col 54}{space 4}-1.091705{col 67}{space 3}-.2013319
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est21{txt} stored)

{com}. 
. esttab using "${c -(}sum_table_folder{c )-}/mom_group.csv", ///
>              se r2 drop(0.age_g 0.edu_g 0.inc_g 0.cohort_g  *.year *state_id 1.Q33 1.Q34 _cons) ///
>                          label replace
{res}{txt}(output written to {browse  `"/Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/mom_group.csv"'})

{com}. 
. 
. log close 
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/Myworld/Dropbox/IncExpProject/WorkingFolder/indSCE_Est_log.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 7 Nov 2019, 12:17:47
{txt}{.-}
{smcl}
{txt}{sf}{ul off}