{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/Myworld/Dropbox/IncExpProject/WorkingFolder/indSCE_Est_log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}29 Oct 2019, 12:03:30
{txt}
{com}. 
. 
. ***************************
. **  Clean and Merge Data **
. ***************************
. 
. use "${c -(}folder{c )-}/SCE/IncExpSCEDstIndM",clear 
{txt}
{com}. 
. duplicates report year month userid

{p 0 4}{txt}Duplicates in terms of {res} year month userid{p_end}

{txt}{hline 10}{c TT}{hline 27}
   copies {c |} observations       surplus
{hline 10}{c +}{hline 27}
        1 {c |}        {res}79064             0
{txt}{hline 10}{c BT}{hline 27}

{com}. 
. 
. ******************************
. *** Merge with demographics **
. *****************************
. 
. merge 1:1 year month userid using "${c -(}folder{c )-}/SCE/IncExpSCEProbIndM",keep(master match) 
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}          79,064{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge hh_info_merge
{res}{txt}
{com}. 
. *******************************
. **  Set Panel Data Structure **
. *******************************
. rename userid ID 
{res}{txt}
{com}. xtset ID date   /* this is not correct. ID is unique here.*/
{res}{txt}{col 8}panel variable:  {res}ID (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}date, 01jun2013 00:00:00 to 01may2018 00:00:00
{col 25}but with gaps
{txt}{col 17}delta:  {res}.001 seconds
{txt}
{com}. sort ID year month 
{txt}
{com}. 
. *******************************
. ** Exclude extreme outliers 
. ******************************
. 
. keep if Q32 < 100 & Q32 >= 10
{txt}(67437 observations deleted)

{com}. 
. drop if IncVar < 0
{txt}(125 observations deleted)

{com}. 
. *****************************
. *** generate other vars *****
. *****************************
. 
. gen age_sq = (Q32-30)^2
{txt}
{com}. label var age_sq "Age-squared"
{txt}
{com}. 
. encode _STATE, gen(state_id)
{txt}
{com}. label var state_id "state id"
{txt}
{com}. 
. *****************************
. *** generate group vars *****
. *****************************
. 
. gen cohort = year-Q32
{txt}
{com}. label var cohort "cohort by year of birth"
{txt}
{com}. egen cohort_g = cut(cohort), group(3)
{txt}
{com}. label define cohortlb 0 "1915-1956" 1 "1957-1972" 2 "1973-2000"
{txt}
{com}. label value cohort_g cohortlb
{txt}
{com}. 
. egen age_g = cut(Q32), group(3)  
{txt}
{com}. label var age_g "age group"
{txt}
{com}. label define agelb 0 "Young" 1 "Middle-age" 2 "Old"
{txt}
{com}. label value age_g agelb
{txt}
{com}. 
. egen edu_g = cut(Q36), group(3) 
{txt}(1 missing value generated)

{com}. label var edu_g "education group"
{txt}
{com}. label define edulb 0 "Low Education" 1 "Medium Education" 2 "High Education"
{txt}
{com}. label value edu_g edulb
{txt}
{com}. 
. gen gender_g = Q33 
{txt}(2 missing values generated)

{com}. label var gender_g "gender_grou"
{txt}
{com}. label define gdlb 0 "Male" 1 "Female" 
{txt}
{com}. label value gender_g gdlb
{txt}
{com}. 
. egen inc_g = cut(Q47), group(3)
{txt}(124 missing values generated)

{com}. label var inc_g "income_g"
{txt}
{com}. label define inclb 0 "Low income" 1 "Middle Income" 2 "High Income"
{txt}
{com}. label value inc_g inclb
{txt}
{com}. 
. local group_vars age_g edu_g inc_g cohort_g
{txt}
{com}. 
. 
. **********************************
. *** tables and hists of Vars *****
. **********************************
. 
. 
. foreach gp in `group_vars' {c -(}
{txt}  2{com}. tabstat Q24_mean Q24_var Q24_iqr IncMean IncVar, st(p10 p50 p90) by(`gp')
{txt}  3{com}. {c )-}

{txt}Summary statistics: p10, p50, p90
  by categories of: age_g (age group)

{ralign 10:age_g} {...}
{c |}{...}
  Q24_mean   Q24_var   Q24_iqr   IncMean    IncVar
{hline 11}{c +}{hline 50}
{ralign 10:Young} {...}
{c |}{...}
 {res} .7784061  .3333333  .9061641  .2324811  .0123229
{txt}{space 10} {...}
{c |}{...}
 {res} 2.969947  1.646167         2  .6666667  .0688264
{txt}{space 10} {...}
{c |}{...}
 {res} 6.809876  21.35942  10.15805         4  1.333333
{txt}{hline 11}{c +}{hline 50}
{ralign 10:Middle-age} {...}
{c |}{...}
 {res} .4114535  .3333333  .8566982  .2132489  .0148046
{txt}{space 10} {...}
{c |}{...}
 {res} 2.367884  1.044458  1.430702  .6797574  .3333333
{txt}{space 10} {...}
{c |}{...}
 {res} 6.025575  17.93517  8.361641         3  .8147773
{txt}{hline 11}{c +}{hline 50}
{ralign 10:Old} {...}
{c |}{...}
 {res} .7119929  .3333333  .9061639  .2062253  .0165931
{txt}{space 10} {...}
{c |}{...}
 {res}        2  1.007457  1.373606         1  .3333333
{txt}{space 10} {...}
{c |}{...}
 {res} 6.017493  22.50437  9.520308         4  1.333333
{txt}{hline 11}{c +}{hline 50}
{ralign 10:Total} {...}
{c |}{...}
 {res} .5793654  .3333333  .9061639  .2234316  .0144461
{txt}{space 10} {...}
{c |}{...}
 {res} 2.537525  1.333333  1.713396  .6666667  .2764937
{txt}{space 10} {...}
{c |}{...}
 {res}  6.47924  20.54752  9.196979  3.577936  1.233755
{txt}{hline 11}{c BT}{hline 50}

Summary statistics: p10, p50, p90
  by categories of: edu_g (education group)

{ralign 16:edu_g} {...}
{c |}{...}
  Q24_mean   Q24_var   Q24_iqr   IncMean    IncVar
{hline 17}{c +}{hline 50}
{ralign 16:Low Education} {...}
{c |}{...}
 {res} 2.08e-08  .3333333         1  .2396565  .0225437
{txt}{space 16} {...}
{c |}{...}
 {res}        2  1.333333         2  .6666667  .3333333
{txt}{space 16} {...}
{c |}{...}
 {res} 6.576015    30.028        13  4.381966  1.333333
{txt}{hline 17}{c +}{hline 50}
{ralign 16:Medium Education} {...}
{c |}{...}
 {res}  .137618  .3333333  .9061641  .2142335  .0161982
{txt}{space 16} {...}
{c |}{...}
 {res} 2.453082  1.050448   1.55292  .8268279  .3333333
{txt}{space 16} {...}
{c |}{...}
 {res} 6.318821  20.98034  12.18417  4.720759  1.333333
{txt}{hline 17}{c +}{hline 50}
{ralign 16:High Education} {...}
{c |}{...}
 {res} .8121909  .3333333   .856698  .2236531  .0126881
{txt}{space 16} {...}
{c |}{...}
 {res} 2.711993  1.333333  1.713396  .6666667  .0864103
{txt}{space 16} {...}
{c |}{...}
 {res} 6.486081  18.70815  7.387736         3  .8147773
{txt}{hline 17}{c +}{hline 50}
{ralign 16:Total} {...}
{c |}{...}
 {res} .5793654  .3333333  .9061639  .2234316  .0144461
{txt}{space 16} {...}
{c |}{...}
 {res} 2.537525  1.333333  1.713396  .6666667  .2764937
{txt}{space 16} {...}
{c |}{...}
 {res}  6.47924  20.54752  9.196979  3.577936  1.233755
{txt}{hline 17}{c BT}{hline 50}

Summary statistics: p10, p50, p90
  by categories of: inc_g (income_g)

{ralign 13:inc_g} {...}
{c |}{...}
  Q24_mean   Q24_var   Q24_iqr   IncMean    IncVar
{hline 14}{c +}{hline 50}
{ralign 13:Low income} {...}
{c |}{...}
 {res} 2.08e-08  .3333333         1  .2118033  .0205381
{txt}{space 13} {...}
{c |}{...}
 {res}        2  1.333333         2  .6666667  .3333333
{txt}{space 13} {...}
{c |}{...}
 {res} 6.924951  32.52219        13         5  1.333333
{txt}{hline 14}{c +}{hline 50}
{ralign 13:Middle Income} {...}
{c |}{...}
 {res} .4530818  .3333333  .9061639  .2069548   .013815
{txt}{space 13} {...}
{c |}{...}
 {res} 2.190983  1.118348  1.495339  .6978815  .3333333
{txt}{space 13} {...}
{c |}{...}
 {res}        6  18.89418  8.680031         3  1.233755
{txt}{hline 14}{c +}{hline 50}
{ralign 13:High Income} {...}
{c |}{...}
 {res}        1  .3333333   .856698  .2329144  .0132882
{txt}{space 13} {...}
{c |}{...}
 {res} 2.793575  1.333333  1.624727  .6666667  .0947234
{txt}{space 13} {...}
{c |}{...}
 {res} 6.599971  17.57929   7.15572  3.288007  .8147773
{txt}{hline 14}{c +}{hline 50}
{ralign 13:Total} {...}
{c |}{...}
 {res} .5793654  .3333333  .9061639  .2234316  .0143363
{txt}{space 13} {...}
{c |}{...}
 {res} 2.554599  1.333333  1.713396  .6666667  .2764937
{txt}{space 13} {...}
{c |}{...}
 {res} 6.481738  20.55223  9.231606  3.462475  1.233755
{txt}{hline 14}{c BT}{hline 50}

Summary statistics: p10, p50, p90
  by categories of: cohort_g 

{ralign 9:cohort_g} {...}
{c |}{...}
  Q24_mean   Q24_var   Q24_iqr   IncMean    IncVar
{hline 10}{c +}{hline 50}
{ralign 9:1915-1956} {...}
{c |}{...}
 {res} .6228527  .3333333  .9061639   .190983  .0167938
{txt}{space 9} {...}
{c |}{...}
 {res}        2  .9302561  1.306578         1  .3333333
{txt}{space 9} {...}
{c |}{...}
 {res} 6.008746   22.5037  8.814301         4  1.333333
{txt}{hline 10}{c +}{hline 50}
{ralign 9:1957-1972} {...}
{c |}{...}
 {res} .4221108  .3333333   .856698  .2205617  .0150681
{txt}{space 9} {...}
{c |}{...}
 {res} 2.280812   .977199  1.391605  .7000327  .3333333
{txt}{space 9} {...}
{c |}{...}
 {res}        6  17.57929  8.519976         3  .8147773
{txt}{hline 10}{c +}{hline 50}
{ralign 9:1973-2000} {...}
{c |}{...}
 {res} .7677129  .3333333  .9061641  .2329144  .0123964
{txt}{space 9} {...}
{c |}{...}
 {res} 2.969947  1.630277         2  .6666667  .0689623
{txt}{space 9} {...}
{c |}{...}
 {res} 6.876436  21.60151  10.28904  4.211032  1.333333
{txt}{hline 10}{c +}{hline 50}
{ralign 9:Total} {...}
{c |}{...}
 {res} .5793654  .3333333  .9061639  .2234316  .0144461
{txt}{space 9} {...}
{c |}{...}
 {res} 2.537525  1.333333  1.713396  .6666667  .2764937
{txt}{space 9} {...}
{c |}{...}
 {res}  6.47924  20.54752  9.196979  3.577936  1.233755
{txt}{hline 10}{c BT}{hline 50}

{com}. 
. 
. foreach gp in `group_vars' {c -(}
{txt}  2{com}. table `gp', c(median Q24_var) by(year)
{txt}  3{com}. {c )-}

{txt}{hline 11}{c TT}{hline 13}
year and   {c |}
age group  {c |} med(Q24_var)
{hline 11}{c +}{hline 13}
2013       {c |}
     Young {c |}    {res}1.5831884
{txt}Middle-age {c |}     {res}1.038487
       {txt}Old {c |}    {res}.80126882
{txt}{hline 11}{c +}{hline 13}
2014       {c |}
     Young {c |}     {res}1.595304
{txt}Middle-age {c |}     {res}1.333333
       {txt}Old {c |}    {res}.87788975
{txt}{hline 11}{c +}{hline 13}
2015       {c |}
     Young {c |}    {res}1.7899328
{txt}Middle-age {c |}    {res}.81328654
       {txt}Old {c |}     {res}1.333333
{txt}{hline 11}{c +}{hline 13}
2016       {c |}
     Young {c |}    {res}1.6639975
{txt}Middle-age {c |}    {res}.80901131
       {txt}Old {c |}    {res}1.1651365
{txt}{hline 11}{c +}{hline 13}
2017       {c |}
     Young {c |}    {res}1.7716688
{txt}Middle-age {c |}    {res}.87684157
       {txt}Old {c |}    {res}.66666669
{txt}{hline 11}{c +}{hline 13}
2018       {c |}
     Young {c |}    {res}1.4911855
{txt}Middle-age {c |}    {res}.87410492
       {txt}Old {c |}    {res}1.0444583
{txt}{hline 11}{c BT}{hline 13}

{hline 17}{c TT}{hline 13}
year and         {c |}
education group  {c |} med(Q24_var)
{hline 17}{c +}{hline 13}
2013             {c |}
   Low Education {c |}    {res}.98053184
{txt}Medium Education {c |}    {res}.94603947
  {txt}High Education {c |}     {res}1.333333
{txt}{hline 17}{c +}{hline 13}
2014             {c |}
   Low Education {c |}    {res}1.3430001
{txt}Medium Education {c |}     {res}1.333333
  {txt}High Education {c |}    {res}1.4611937
{txt}{hline 17}{c +}{hline 13}
2015             {c |}
   Low Education {c |}    {res}1.9264031
{txt}Medium Education {c |}    {res}.66666669
  {txt}High Education {c |}    {res}1.5653085
{txt}{hline 17}{c +}{hline 13}
2016             {c |}
   Low Education {c |}     {res}1.333333
{txt}Medium Education {c |}    {res}1.0504482
  {txt}High Education {c |}    {res}1.3262935
{txt}{hline 17}{c +}{hline 13}
2017             {c |}
   Low Education {c |}     {res}1.105975
{txt}Medium Education {c |}     {res}1.105975
  {txt}High Education {c |}    {res}1.3443192
{txt}{hline 17}{c +}{hline 13}
2018             {c |}
   Low Education {c |}     {res}1.536028
{txt}Medium Education {c |}    {res}.91848373
  {txt}High Education {c |}     {res}1.333333
{txt}{hline 17}{c BT}{hline 13}

{hline 14}{c TT}{hline 13}
year and      {c |}
income_g      {c |} med(Q24_var)
{hline 14}{c +}{hline 13}
2013          {c |}
   Low income {c |}    {res}1.7110175
{txt}Middle Income {c |}    {res}.66666669
  {txt}High Income {c |}     {res}1.333333
{txt}{hline 14}{c +}{hline 13}
2014          {c |}
   Low income {c |}     {res}1.465506
{txt}Middle Income {c |}     {res}1.333333
  {txt}High Income {c |}     {res}1.333333
{txt}{hline 14}{c +}{hline 13}
2015          {c |}
   Low income {c |}     {res}1.333333
{txt}Middle Income {c |}    {res}.92686188
  {txt}High Income {c |}     {res}1.425889
{txt}{hline 14}{c +}{hline 13}
2016          {c |}
   Low income {c |}     {res}1.333333
{txt}Middle Income {c |}    {res}1.3144444
  {txt}High Income {c |}    {res}1.1358674
{txt}{hline 14}{c +}{hline 13}
2017          {c |}
   Low income {c |}    {res}1.1316594
{txt}Middle Income {c |}     {res}1.333333
  {txt}High Income {c |}     {res}1.333333
{txt}{hline 14}{c +}{hline 13}
2018          {c |}
   Low income {c |}     {res}1.333333
{txt}Middle Income {c |}     {res}1.333333
  {txt}High Income {c |}    {res}1.2872341
{txt}{hline 14}{c BT}{hline 13}

{hline 10}{c TT}{hline 13}
year and  {c |}
cohort_g  {c |} med(Q24_var)
{hline 10}{c +}{hline 13}
2013      {c |}
1915-1956 {c |}    {res}.70478046
{txt}1957-1972 {c |}    {res}1.1185131
{txt}1973-2000 {c |}     {res}1.646167
{txt}{hline 10}{c +}{hline 13}
2014      {c |}
1915-1956 {c |}    {res}.87788975
{txt}1957-1972 {c |}     {res}1.333333
{txt}1973-2000 {c |}     {res}1.595304
{txt}{hline 10}{c +}{hline 13}
2015      {c |}
1915-1956 {c |}     {res}1.333333
{txt}1957-1972 {c |}    {res}.81328654
{txt}1973-2000 {c |}    {res}1.7716688
{txt}{hline 10}{c +}{hline 13}
2016      {c |}
1915-1956 {c |}    {res}1.0820034
{txt}1957-1972 {c |}    {res}.82808617
{txt}1973-2000 {c |}     {res}1.425889
{txt}{hline 10}{c +}{hline 13}
2017      {c |}
1915-1956 {c |}    {res}1.0586678
{txt}1957-1972 {c |}    {res}.66666669
{txt}1973-2000 {c |}    {res}1.6681409
{txt}{hline 10}{c +}{hline 13}
2018      {c |}
1915-1956 {c |}     {res}1.333333
{txt}1957-1972 {c |}    {res}.66666669
{txt}1973-2000 {c |}    {res}1.4706577
{txt}{hline 10}{c BT}{hline 13}

{com}. 
. /*
> 
> foreach mom in iqr var mean {c -(}
> 
> twoway (hist Q24_`mom',fcolor(ltblue) lcolor(none)), ///
>            ytitle("") ///
>            title("`mom'")
> graph export "${c -(}sum_graph_folder{c )-}/hist/hist_`mom'.png",as(png) replace  
> 
> {c )-}
> 
> foreach gp in `group_vars' {c -(}
> foreach mom in iqr var mean {c -(}
> 
> twoway (hist Q24_`mom' if `gp'==0,fcolor(gs15) lcolor("")) /// 
>        (hist Q24_`mom' if `gp'==1,fcolor(ltblue) lcolor("")) ///
>            (hist Q24_`mom' if `gp'==2,fcolor(red) lcolor("")), ///
>            xtitle("") ///
>            ytitle("") ///
>            title("`mom'") ///
>            legend(label(1 `gp'=0) label(2 `gp'=1) label(3 `gp'=2) col(1))
> 
> graph export "${c -(}sum_graph_folder{c )-}/hist/hist_`mom'_`gp'.png",as(png) replace  
> 
> {c )-}
> {c )-}
> 
> 
> 
> foreach mom in Mean Var{c -(}
> 
> twoway (hist Inc`mom',fcolor(ltblue) lcolor(none)), ///
>            ytitle("") ///
>            title("`mom'")
> graph export "${c -(}sum_graph_folder{c )-}/hist/hist_Inc`mom'.png",as(png) replace  
> 
> {c )-}
> 
> foreach gp in `group_vars' {c -(}
> foreach mom in Mean Var{c -(}
> 
> twoway (hist Inc`mom' if `gp'==0,fcolor(gs15) lcolor("")) /// 
>        (hist Inc`mom' if `gp'==1,fcolor(ltblue) lcolor("")) ///
>            (hist Inc`mom' if `gp'==2,fcolor(red) lcolor("")), ///
>            xtitle("") ///
>            ytitle("") ///
>            title("`mom'") ///
>            legend(label(1 `gp'=0) label(2 `gp'=1) label(3 `gp'=2) col(1))
> 
> graph export "${c -(}sum_graph_folder{c )-}/hist/hist_Inc_`mom'_`gp'.png",as(png) replace  
> 
> {c )-}
> {c )-}
> 
> */
. 
. ********************
. ** Regression ******
. ********************
. 
. global other_control i.Q33 i.Q34 Q35_1 Q35_2 Q35_3 Q35_4 Q35_5 Q35_6 
{txt}
{com}. global macro_ex_var Q4new Q6new Q9_mean Q13new
{txt}
{com}. 
. eststo clear
{txt}
{com}. 
. foreach mom in var iqr mean{c -(}
{txt}  2{com}. eststo: reg Q24_`mom' i.age_g i.edu_g i.inc_g i.cohort_g i.year i.state_id, robust 
{txt}  3{com}. eststo: reg Q24_`mom' i.age_g i.edu_g i.inc_g i.cohort_g i.year i.state_id ${c -(}other_control{c )-}, robust 
{txt}  4{com}. eststo: reg Q24_`mom' i.age_g i.edu_g i.inc_g i.cohort_g i.year i.state_id ${c -(}other_control{c )-} ${c -(}macro_ex_var{c )-}, robust 
{txt}  5{com}. {c )-}

{txt}Linear regression                                      Number of obs ={res}    6693
                                                       {txt}F( 63,  6629) ={res}    3.14
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0240
                                                       {txt}Root MSE      = {res} 12.156

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     Q24_var{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2} .4791169{col 26}{space 2} .9031861{col 37}{space 1}    0.53{col 46}{space 3}0.596{col 54}{space 4}-1.291419{col 67}{space 3} 2.249652
{txt}{space 8}Old  {c |}{col 14}{res}{space 2} 1.016641{col 26}{space 2} 1.262814{col 37}{space 1}    0.81{col 46}{space 3}0.421{col 54}{space 4}-1.458881{col 67}{space 3} 3.492164
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2}-1.369064{col 26}{space 2} .6360451{col 37}{space 1}   -2.15{col 46}{space 3}0.031{col 54}{space 4}-2.615917{col 67}{space 3}-.1222103
{txt}High Educ..  {c |}{col 14}{res}{space 2}-1.449874{col 26}{space 2} .6149977{col 37}{space 1}   -2.36{col 46}{space 3}0.018{col 54}{space 4}-2.655467{col 67}{space 3}-.2442801
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2}-2.678387{col 26}{space 2} .4996924{col 37}{space 1}   -5.36{col 46}{space 3}0.000{col 54}{space 4}-3.657945{col 67}{space 3}-1.698829
{txt}High Income  {c |}{col 14}{res}{space 2}-2.540583{col 26}{space 2} .4911152{col 37}{space 1}   -5.17{col 46}{space 3}0.000{col 54}{space 4}-3.503326{col 67}{space 3}-1.577839
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2} -.294574{col 26}{space 2}  .901647{col 37}{space 1}   -0.33{col 46}{space 3}0.744{col 54}{space 4}-2.062092{col 67}{space 3} 1.472944
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} 1.606826{col 26}{space 2} 1.297581{col 37}{space 1}    1.24{col 46}{space 3}0.216{col 54}{space 4} -.936851{col 67}{space 3} 4.150502
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2}-.1800805{col 26}{space 2} .4645055{col 37}{space 1}   -0.39{col 46}{space 3}0.698{col 54}{space 4}-1.090661{col 67}{space 3} .7304997
{txt}{space 7}2015  {c |}{col 14}{res}{space 2}-.0296659{col 26}{space 2}  .470404{col 37}{space 1}   -0.06{col 46}{space 3}0.950{col 54}{space 4}-.9518092{col 67}{space 3} .8924774
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0249389{col 26}{space 2} .4788428{col 37}{space 1}   -0.05{col 46}{space 3}0.958{col 54}{space 4}-.9636249{col 67}{space 3} .9137471
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .6143479{col 26}{space 2} .5043022{col 37}{space 1}    1.22{col 46}{space 3}0.223{col 54}{space 4}-.3742468{col 67}{space 3} 1.602943
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0273392{col 26}{space 2} .6420817{col 37}{space 1}    0.04{col 46}{space 3}0.966{col 54}{space 4}-1.231348{col 67}{space 3} 1.286026
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2}-7.752128{col 26}{space 2} 9.900887{col 37}{space 1}   -0.78{col 46}{space 3}0.434{col 54}{space 4}-27.16105{col 67}{space 3}  11.6568
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-8.664431{col 26}{space 2} 9.973845{col 37}{space 1}   -0.87{col 46}{space 3}0.385{col 54}{space 4}-28.21638{col 67}{space 3} 10.88752
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-8.330552{col 26}{space 2} 9.846955{col 37}{space 1}   -0.85{col 46}{space 3}0.398{col 54}{space 4}-27.63375{col 67}{space 3} 10.97265
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-6.641198{col 26}{space 2} 9.812481{col 37}{space 1}   -0.68{col 46}{space 3}0.499{col 54}{space 4}-25.87682{col 67}{space 3} 12.59442
{txt}{space 9}CO  {c |}{col 14}{res}{space 2}-8.161245{col 26}{space 2} 9.850421{col 37}{space 1}   -0.83{col 46}{space 3}0.407{col 54}{space 4}-27.47124{col 67}{space 3} 11.14875
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-9.832828{col 26}{space 2}  9.84294{col 37}{space 1}   -1.00{col 46}{space 3}0.318{col 54}{space 4}-29.12816{col 67}{space 3} 9.462504
{txt}{space 9}DC  {c |}{col 14}{res}{space 2} -8.31803{col 26}{space 2}  9.91597{col 37}{space 1}   -0.84{col 46}{space 3}0.402{col 54}{space 4}-27.75652{col 67}{space 3} 11.12046
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-9.236291{col 26}{space 2} 10.20051{col 37}{space 1}   -0.91{col 46}{space 3}0.365{col 54}{space 4}-29.23257{col 67}{space 3} 10.75999
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-7.559562{col 26}{space 2} 9.822517{col 37}{space 1}   -0.77{col 46}{space 3}0.442{col 54}{space 4}-26.81486{col 67}{space 3} 11.69573
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-8.386958{col 26}{space 2} 9.832795{col 37}{space 1}   -0.85{col 46}{space 3}0.394{col 54}{space 4} -27.6624{col 67}{space 3} 10.88848
{txt}{space 9}HI  {c |}{col 14}{res}{space 2}-6.843209{col 26}{space 2} 10.15216{col 37}{space 1}   -0.67{col 46}{space 3}0.500{col 54}{space 4}-26.74472{col 67}{space 3}  13.0583
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-12.52521{col 26}{space 2} 9.817839{col 37}{space 1}   -1.28{col 46}{space 3}0.202{col 54}{space 4}-31.77133{col 67}{space 3} 6.720917
{txt}{space 9}ID  {c |}{col 14}{res}{space 2}-9.823132{col 26}{space 2} 9.920532{col 37}{space 1}   -0.99{col 46}{space 3}0.322{col 54}{space 4}-29.27057{col 67}{space 3} 9.624305
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-9.565084{col 26}{space 2} 9.815363{col 37}{space 1}   -0.97{col 46}{space 3}0.330{col 54}{space 4}-28.80635{col 67}{space 3} 9.676187
{txt}{space 9}IN  {c |}{col 14}{res}{space 2}-8.025802{col 26}{space 2} 9.857136{col 37}{space 1}   -0.81{col 46}{space 3}0.416{col 54}{space 4}-27.34896{col 67}{space 3} 11.29736
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-9.274632{col 26}{space 2} 9.912381{col 37}{space 1}   -0.94{col 46}{space 3}0.349{col 54}{space 4}-28.70609{col 67}{space 3} 10.15682
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-9.474877{col 26}{space 2} 9.894822{col 37}{space 1}   -0.96{col 46}{space 3}0.338{col 54}{space 4}-28.87191{col 67}{space 3} 9.922161
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-7.592172{col 26}{space 2} 9.928844{col 37}{space 1}   -0.76{col 46}{space 3}0.445{col 54}{space 4} -27.0559{col 67}{space 3} 11.87156
{txt}{space 9}MA  {c |}{col 14}{res}{space 2} -7.71285{col 26}{space 2} 9.851024{col 37}{space 1}   -0.78{col 46}{space 3}0.434{col 54}{space 4}-27.02403{col 67}{space 3} 11.59833
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-7.509026{col 26}{space 2} 9.856956{col 37}{space 1}   -0.76{col 46}{space 3}0.446{col 54}{space 4}-26.83183{col 67}{space 3} 11.81378
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-10.84094{col 26}{space 2} 9.862206{col 37}{space 1}   -1.10{col 46}{space 3}0.272{col 54}{space 4}-30.17404{col 67}{space 3} 8.492157
{txt}{space 9}MI  {c |}{col 14}{res}{space 2}-9.054916{col 26}{space 2} 9.818444{col 37}{space 1}   -0.92{col 46}{space 3}0.356{col 54}{space 4}-28.30223{col 67}{space 3} 10.19239
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-9.577943{col 26}{space 2} 9.827203{col 37}{space 1}   -0.97{col 46}{space 3}0.330{col 54}{space 4}-28.84242{col 67}{space 3} 9.686538
{txt}{space 9}MO  {c |}{col 14}{res}{space 2} -8.77466{col 26}{space 2} 9.839538{col 37}{space 1}   -0.89{col 46}{space 3}0.373{col 54}{space 4}-28.06332{col 67}{space 3}   10.514
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-6.358274{col 26}{space 2} 10.01567{col 37}{space 1}   -0.63{col 46}{space 3}0.526{col 54}{space 4} -25.9922{col 67}{space 3} 13.27565
{txt}{space 9}MT  {c |}{col 14}{res}{space 2}-10.96878{col 26}{space 2} 9.896613{col 37}{space 1}   -1.11{col 46}{space 3}0.268{col 54}{space 4}-30.36933{col 67}{space 3} 8.431768
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-8.050159{col 26}{space 2} 9.831316{col 37}{space 1}   -0.82{col 46}{space 3}0.413{col 54}{space 4} -27.3227{col 67}{space 3} 11.22239
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-8.557831{col 26}{space 2} 10.03786{col 37}{space 1}   -0.85{col 46}{space 3}0.394{col 54}{space 4}-28.23527{col 67}{space 3}  11.1196
{txt}{space 9}NE  {c |}{col 14}{res}{space 2}-11.04038{col 26}{space 2} 9.838854{col 37}{space 1}   -1.12{col 46}{space 3}0.262{col 54}{space 4} -30.3277{col 67}{space 3} 8.246944
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-11.35408{col 26}{space 2}  9.87936{col 37}{space 1}   -1.15{col 46}{space 3}0.250{col 54}{space 4} -30.7208{col 67}{space 3}  8.01265
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-7.806336{col 26}{space 2} 9.826709{col 37}{space 1}   -0.79{col 46}{space 3}0.427{col 54}{space 4}-27.06985{col 67}{space 3} 11.45718
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-10.10619{col 26}{space 2} 9.969467{col 37}{space 1}   -1.01{col 46}{space 3}0.311{col 54}{space 4}-29.64955{col 67}{space 3} 9.437176
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}-6.604216{col 26}{space 2} 9.973082{col 37}{space 1}   -0.66{col 46}{space 3}0.508{col 54}{space 4}-26.15467{col 67}{space 3} 12.94624
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-8.488195{col 26}{space 2} 9.811863{col 37}{space 1}   -0.87{col 46}{space 3}0.387{col 54}{space 4} -27.7226{col 67}{space 3} 10.74621
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-9.273316{col 26}{space 2}  9.82008{col 37}{space 1}   -0.94{col 46}{space 3}0.345{col 54}{space 4}-28.52383{col 67}{space 3} 9.977201
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-5.033204{col 26}{space 2} 10.01948{col 37}{space 1}   -0.50{col 46}{space 3}0.615{col 54}{space 4}-24.67461{col 67}{space 3}  14.6082
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-10.63456{col 26}{space 2} 9.832964{col 37}{space 1}   -1.08{col 46}{space 3}0.280{col 54}{space 4}-29.91033{col 67}{space 3} 8.641218
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-9.465666{col 26}{space 2} 9.811392{col 37}{space 1}   -0.96{col 46}{space 3}0.335{col 54}{space 4}-28.69915{col 67}{space 3} 9.767821
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-5.926846{col 26}{space 2} 10.46655{col 37}{space 1}   -0.57{col 46}{space 3}0.571{col 54}{space 4}-26.44466{col 67}{space 3} 14.59097
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-6.528086{col 26}{space 2} 9.907931{col 37}{space 1}   -0.66{col 46}{space 3}0.510{col 54}{space 4}-25.95082{col 67}{space 3} 12.89465
{txt}{space 9}SD  {c |}{col 14}{res}{space 2}-9.751426{col 26}{space 2} 9.919514{col 37}{space 1}   -0.98{col 46}{space 3}0.326{col 54}{space 4}-29.19687{col 67}{space 3} 9.694014
{txt}{space 9}TN  {c |}{col 14}{res}{space 2} -6.67517{col 26}{space 2} 9.866272{col 37}{space 1}   -0.68{col 46}{space 3}0.499{col 54}{space 4}-26.01624{col 67}{space 3}  12.6659
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-6.442974{col 26}{space 2} 9.820808{col 37}{space 1}   -0.66{col 46}{space 3}0.512{col 54}{space 4}-25.69492{col 67}{space 3} 12.80897
{txt}{space 9}UT  {c |}{col 14}{res}{space 2}-9.794578{col 26}{space 2} 9.851909{col 37}{space 1}   -0.99{col 46}{space 3}0.320{col 54}{space 4}-29.10749{col 67}{space 3} 9.518334
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}-8.476257{col 26}{space 2} 9.836324{col 37}{space 1}   -0.86{col 46}{space 3}0.389{col 54}{space 4}-27.75862{col 67}{space 3}  10.8061
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}-12.90827{col 26}{space 2} 9.826636{col 37}{space 1}   -1.31{col 46}{space 3}0.189{col 54}{space 4}-32.17164{col 67}{space 3} 6.355102
{txt}{space 9}WA  {c |}{col 14}{res}{space 2}-9.105005{col 26}{space 2} 9.835934{col 37}{space 1}   -0.93{col 46}{space 3}0.355{col 54}{space 4} -28.3866{col 67}{space 3} 10.17659
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-8.734066{col 26}{space 2} 9.839024{col 37}{space 1}   -0.89{col 46}{space 3}0.375{col 54}{space 4}-28.02172{col 67}{space 3} 10.55359
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-10.02755{col 26}{space 2} 9.937442{col 37}{space 1}   -1.01{col 46}{space 3}0.313{col 54}{space 4}-29.50813{col 67}{space 3} 9.453037
{txt}{space 9}WY  {c |}{col 14}{res}{space 2} -10.2512{col 26}{space 2} 10.05968{col 37}{space 1}   -1.02{col 46}{space 3}0.308{col 54}{space 4} -29.9714{col 67}{space 3} 9.469003
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 17.22159{col 26}{space 2} 9.879001{col 37}{space 1}    1.74{col 46}{space 3}0.081{col 54}{space 4}-2.144435{col 67}{space 3} 36.58761
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est1{txt} stored)

Linear regression                                      Number of obs ={res}    6691
                                                       {txt}F( 71,  6619) ={res}    3.26
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0304
                                                       {txt}Root MSE      = {res} 12.124

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     Q24_var{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2} .3576613{col 26}{space 2} .9021554{col 37}{space 1}    0.40{col 46}{space 3}0.692{col 54}{space 4}-1.410854{col 67}{space 3} 2.126177
{txt}{space 8}Old  {c |}{col 14}{res}{space 2} .7082508{col 26}{space 2} 1.266671{col 37}{space 1}    0.56{col 46}{space 3}0.576{col 54}{space 4}-1.774833{col 67}{space 3} 3.191335
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2}-1.253966{col 26}{space 2} .6346532{col 37}{space 1}   -1.98{col 46}{space 3}0.048{col 54}{space 4}-2.498091{col 67}{space 3}-.0098414
{txt}High Educ..  {c |}{col 14}{res}{space 2}-1.329162{col 26}{space 2} .6146446{col 37}{space 1}   -2.16{col 46}{space 3}0.031{col 54}{space 4}-2.534064{col 67}{space 3}-.1242609
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2}-2.714727{col 26}{space 2} .4985255{col 37}{space 1}   -5.45{col 46}{space 3}0.000{col 54}{space 4}-3.691998{col 67}{space 3}-1.737457
{txt}High Income  {c |}{col 14}{res}{space 2}-2.657051{col 26}{space 2} .4977667{col 37}{space 1}   -5.34{col 46}{space 3}0.000{col 54}{space 4}-3.632834{col 67}{space 3}-1.681268
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2}-.5040089{col 26}{space 2} .9047615{col 37}{space 1}   -0.56{col 46}{space 3}0.578{col 54}{space 4}-2.277633{col 67}{space 3} 1.269615
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} 1.277483{col 26}{space 2}  1.30021{col 37}{space 1}    0.98{col 46}{space 3}0.326{col 54}{space 4}-1.271348{col 67}{space 3} 3.826314
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2}-.2363877{col 26}{space 2}  .462823{col 37}{space 1}   -0.51{col 46}{space 3}0.610{col 54}{space 4} -1.14367{col 67}{space 3} .6708946
{txt}{space 7}2015  {c |}{col 14}{res}{space 2}-.0780926{col 26}{space 2} .4687445{col 37}{space 1}   -0.17{col 46}{space 3}0.868{col 54}{space 4} -.996983{col 67}{space 3} .8407978
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0299508{col 26}{space 2} .4779784{col 37}{space 1}   -0.06{col 46}{space 3}0.950{col 54}{space 4}-.9669426{col 67}{space 3} .9070411
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .6195073{col 26}{space 2} .5027545{col 37}{space 1}    1.23{col 46}{space 3}0.218{col 54}{space 4}-.3660537{col 67}{space 3} 1.605068
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0528698{col 26}{space 2} .6414409{col 37}{space 1}    0.08{col 46}{space 3}0.934{col 54}{space 4}-1.204561{col 67}{space 3} 1.310301
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2}-7.869124{col 26}{space 2} 10.08246{col 37}{space 1}   -0.78{col 46}{space 3}0.435{col 54}{space 4}-27.63399{col 67}{space 3} 11.89575
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-8.617545{col 26}{space 2} 10.14998{col 37}{space 1}   -0.85{col 46}{space 3}0.396{col 54}{space 4}-28.51478{col 67}{space 3} 11.27969
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-8.321774{col 26}{space 2} 10.02934{col 37}{space 1}   -0.83{col 46}{space 3}0.407{col 54}{space 4}-27.98252{col 67}{space 3} 11.33897
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-6.740714{col 26}{space 2} 10.00757{col 37}{space 1}   -0.67{col 46}{space 3}0.501{col 54}{space 4}-26.35877{col 67}{space 3} 12.87735
{txt}{space 9}CO  {c |}{col 14}{res}{space 2} -8.04075{col 26}{space 2} 10.03449{col 37}{space 1}   -0.80{col 46}{space 3}0.423{col 54}{space 4}-27.71158{col 67}{space 3} 11.63008
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-9.704042{col 26}{space 2} 10.02847{col 37}{space 1}   -0.97{col 46}{space 3}0.333{col 54}{space 4}-29.36308{col 67}{space 3}    9.955
{txt}{space 9}DC  {c |}{col 14}{res}{space 2}-8.298751{col 26}{space 2} 10.10067{col 37}{space 1}   -0.82{col 46}{space 3}0.411{col 54}{space 4}-28.09933{col 67}{space 3} 11.50183
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-9.405293{col 26}{space 2} 10.38165{col 37}{space 1}   -0.91{col 46}{space 3}0.365{col 54}{space 4}-29.75666{col 67}{space 3} 10.94608
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-7.558954{col 26}{space 2} 10.00844{col 37}{space 1}   -0.76{col 46}{space 3}0.450{col 54}{space 4}-27.17873{col 67}{space 3} 12.06082
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-8.777942{col 26}{space 2} 10.02139{col 37}{space 1}   -0.88{col 46}{space 3}0.381{col 54}{space 4} -28.4231{col 67}{space 3} 10.86722
{txt}{space 9}HI  {c |}{col 14}{res}{space 2}-7.891379{col 26}{space 2} 10.37149{col 37}{space 1}   -0.76{col 46}{space 3}0.447{col 54}{space 4}-28.22284{col 67}{space 3} 12.44008
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-12.23382{col 26}{space 2} 10.00098{col 37}{space 1}   -1.22{col 46}{space 3}0.221{col 54}{space 4}-31.83897{col 67}{space 3} 7.371326
{txt}{space 9}ID  {c |}{col 14}{res}{space 2}-9.609993{col 26}{space 2} 10.10291{col 37}{space 1}   -0.95{col 46}{space 3}0.342{col 54}{space 4}-29.41495{col 67}{space 3} 10.19496
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-9.389836{col 26}{space 2} 10.00544{col 37}{space 1}   -0.94{col 46}{space 3}0.348{col 54}{space 4}-29.00373{col 67}{space 3} 10.22406
{txt}{space 9}IN  {c |}{col 14}{res}{space 2}-7.914146{col 26}{space 2} 10.03844{col 37}{space 1}   -0.79{col 46}{space 3}0.431{col 54}{space 4}-27.59272{col 67}{space 3} 11.76443
{txt}{space 9}KS  {c |}{col 14}{res}{space 2} -8.86741{col 26}{space 2} 10.09739{col 37}{space 1}   -0.88{col 46}{space 3}0.380{col 54}{space 4}-28.66156{col 67}{space 3} 10.92674
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-9.248806{col 26}{space 2} 10.07691{col 37}{space 1}   -0.92{col 46}{space 3}0.359{col 54}{space 4} -29.0028{col 67}{space 3} 10.50519
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-7.626282{col 26}{space 2} 10.11225{col 37}{space 1}   -0.75{col 46}{space 3}0.451{col 54}{space 4}-27.44955{col 67}{space 3} 12.19699
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-7.426048{col 26}{space 2} 10.03719{col 37}{space 1}   -0.74{col 46}{space 3}0.459{col 54}{space 4}-27.10218{col 67}{space 3} 12.25008
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-7.615285{col 26}{space 2} 10.04373{col 37}{space 1}   -0.76{col 46}{space 3}0.448{col 54}{space 4}-27.30423{col 67}{space 3} 12.07366
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-10.27529{col 26}{space 2}  10.0498{col 37}{space 1}   -1.02{col 46}{space 3}0.307{col 54}{space 4}-29.97614{col 67}{space 3} 9.425571
{txt}{space 9}MI  {c |}{col 14}{res}{space 2}-8.920847{col 26}{space 2}  10.0012{col 37}{space 1}   -0.89{col 46}{space 3}0.372{col 54}{space 4}-28.52643{col 67}{space 3} 10.68473
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-9.275338{col 26}{space 2} 10.01293{col 37}{space 1}   -0.93{col 46}{space 3}0.354{col 54}{space 4} -28.9039{col 67}{space 3} 10.35323
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-8.388966{col 26}{space 2} 10.02455{col 37}{space 1}   -0.84{col 46}{space 3}0.403{col 54}{space 4}-28.04032{col 67}{space 3} 11.26239
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-6.760668{col 26}{space 2} 10.19025{col 37}{space 1}   -0.66{col 46}{space 3}0.507{col 54}{space 4}-26.73683{col 67}{space 3}  13.2155
{txt}{space 9}MT  {c |}{col 14}{res}{space 2}-10.47921{col 26}{space 2} 10.07817{col 37}{space 1}   -1.04{col 46}{space 3}0.298{col 54}{space 4}-30.23567{col 67}{space 3} 9.277252
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-8.160768{col 26}{space 2} 10.01585{col 37}{space 1}   -0.81{col 46}{space 3}0.415{col 54}{space 4}-27.79506{col 67}{space 3} 11.47352
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-8.029084{col 26}{space 2} 10.22137{col 37}{space 1}   -0.79{col 46}{space 3}0.432{col 54}{space 4}-28.06626{col 67}{space 3} 12.00809
{txt}{space 9}NE  {c |}{col 14}{res}{space 2}-10.79623{col 26}{space 2} 10.02017{col 37}{space 1}   -1.08{col 46}{space 3}0.281{col 54}{space 4}  -30.439{col 67}{space 3} 8.846534
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-10.86031{col 26}{space 2} 10.06433{col 37}{space 1}   -1.08{col 46}{space 3}0.281{col 54}{space 4}-30.58965{col 67}{space 3} 8.869018
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-7.797069{col 26}{space 2} 10.01519{col 37}{space 1}   -0.78{col 46}{space 3}0.436{col 54}{space 4}-27.43008{col 67}{space 3} 11.83594
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-9.944089{col 26}{space 2} 10.15308{col 37}{space 1}   -0.98{col 46}{space 3}0.327{col 54}{space 4}-29.84739{col 67}{space 3} 9.959214
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}-6.349792{col 26}{space 2}  10.1563{col 37}{space 1}   -0.63{col 46}{space 3}0.532{col 54}{space 4}-26.25942{col 67}{space 3} 13.55983
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-8.388527{col 26}{space 2} 10.00194{col 37}{space 1}   -0.84{col 46}{space 3}0.402{col 54}{space 4}-27.99556{col 67}{space 3}  11.2185
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-9.154099{col 26}{space 2} 10.00326{col 37}{space 1}   -0.92{col 46}{space 3}0.360{col 54}{space 4}-28.76372{col 67}{space 3} 10.45552
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-4.720053{col 26}{space 2} 10.19802{col 37}{space 1}   -0.46{col 46}{space 3}0.643{col 54}{space 4}-24.71146{col 67}{space 3} 15.27135
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-10.24998{col 26}{space 2} 10.01846{col 37}{space 1}   -1.02{col 46}{space 3}0.306{col 54}{space 4}-29.88939{col 67}{space 3} 9.389436
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-9.241184{col 26}{space 2} 9.996659{col 37}{space 1}   -0.92{col 46}{space 3}0.355{col 54}{space 4}-28.83786{col 67}{space 3} 10.35549
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-5.965812{col 26}{space 2} 10.64298{col 37}{space 1}   -0.56{col 46}{space 3}0.575{col 54}{space 4}-26.82948{col 67}{space 3} 14.89786
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-6.565417{col 26}{space 2} 10.09748{col 37}{space 1}   -0.65{col 46}{space 3}0.516{col 54}{space 4}-26.35973{col 67}{space 3}  13.2289
{txt}{space 9}SD  {c |}{col 14}{res}{space 2}-9.626615{col 26}{space 2} 10.09756{col 37}{space 1}   -0.95{col 46}{space 3}0.340{col 54}{space 4}-29.42109{col 67}{space 3} 10.16786
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-6.589258{col 26}{space 2} 10.04857{col 37}{space 1}   -0.66{col 46}{space 3}0.512{col 54}{space 4} -26.2877{col 67}{space 3} 13.10918
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-6.421571{col 26}{space 2} 10.00928{col 37}{space 1}   -0.64{col 46}{space 3}0.521{col 54}{space 4}-26.04299{col 67}{space 3} 13.19985
{txt}{space 9}UT  {c |}{col 14}{res}{space 2} -9.62955{col 26}{space 2} 10.03626{col 37}{space 1}   -0.96{col 46}{space 3}0.337{col 54}{space 4}-29.30387{col 67}{space 3} 10.04477
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}-8.496655{col 26}{space 2}  10.0269{col 37}{space 1}   -0.85{col 46}{space 3}0.397{col 54}{space 4} -28.1526{col 67}{space 3} 11.15929
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}-12.56687{col 26}{space 2} 10.00554{col 37}{space 1}   -1.26{col 46}{space 3}0.209{col 54}{space 4}-32.18094{col 67}{space 3}  7.04721
{txt}{space 9}WA  {c |}{col 14}{res}{space 2} -8.77811{col 26}{space 2} 10.02625{col 37}{space 1}   -0.88{col 46}{space 3}0.381{col 54}{space 4}-28.43279{col 67}{space 3} 10.87657
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-8.420898{col 26}{space 2} 10.02003{col 37}{space 1}   -0.84{col 46}{space 3}0.401{col 54}{space 4}-28.06338{col 67}{space 3} 11.22159
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-9.914829{col 26}{space 2} 10.10709{col 37}{space 1}   -0.98{col 46}{space 3}0.327{col 54}{space 4}-29.72799{col 67}{space 3} 9.898334
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-9.889593{col 26}{space 2} 10.24568{col 37}{space 1}   -0.97{col 46}{space 3}0.334{col 54}{space 4}-29.97443{col 67}{space 3} 10.19525
{txt}{space 12} {c |}
{space 7}2.Q33 {c |}{col 14}{res}{space 2} 1.405993{col 26}{space 2} .3082682{col 37}{space 1}    4.56{col 46}{space 3}0.000{col 54}{space 4} .8016882{col 67}{space 3} 2.010298
{txt}{space 7}2.Q34 {c |}{col 14}{res}{space 2}-.9728599{col 26}{space 2} .6652325{col 37}{space 1}   -1.46{col 46}{space 3}0.144{col 54}{space 4} -2.27693{col 67}{space 3} .3312102
{txt}{space 7}Q35_1 {c |}{col 14}{res}{space 2} -1.43135{col 26}{space 2} 1.002441{col 37}{space 1}   -1.43{col 46}{space 3}0.153{col 54}{space 4}-3.396458{col 67}{space 3} .5337569
{txt}{space 7}Q35_2 {c |}{col 14}{res}{space 2} 1.023974{col 26}{space 2} 1.078194{col 37}{space 1}    0.95{col 46}{space 3}0.342{col 54}{space 4}-1.089635{col 67}{space 3} 3.137582
{txt}{space 7}Q35_3 {c |}{col 14}{res}{space 2}-.5954934{col 26}{space 2} 1.116965{col 37}{space 1}   -0.53{col 46}{space 3}0.594{col 54}{space 4}-2.785106{col 67}{space 3} 1.594119
{txt}{space 7}Q35_4 {c |}{col 14}{res}{space 2}-1.013888{col 26}{space 2} 1.107002{col 37}{space 1}   -0.92{col 46}{space 3}0.360{col 54}{space 4} -3.18397{col 67}{space 3} 1.156193
{txt}{space 7}Q35_5 {c |}{col 14}{res}{space 2} 2.384056{col 26}{space 2}  3.36808{col 37}{space 1}    0.71{col 46}{space 3}0.479{col 54}{space 4}-4.218466{col 67}{space 3} 8.986579
{txt}{space 7}Q35_6 {c |}{col 14}{res}{space 2}-.0340843{col 26}{space 2} 1.090835{col 37}{space 1}   -0.03{col 46}{space 3}0.975{col 54}{space 4}-2.172474{col 67}{space 3} 2.104305
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 18.74892{col 26}{space 2}  10.1754{col 37}{space 1}    1.84{col 46}{space 3}0.065{col 54}{space 4}-1.198156{col 67}{space 3} 38.69599
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est2{txt} stored)

Linear regression                                      Number of obs ={res}    5565
                                                       {txt}F( 75,  5489) ={res}    3.18
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0381
                                                       {txt}Root MSE      = {res} 10.447

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     Q24_var{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2}-.0950111{col 26}{space 2} .8703748{col 37}{space 1}   -0.11{col 46}{space 3}0.913{col 54}{space 4}-1.801291{col 67}{space 3} 1.611268
{txt}{space 8}Old  {c |}{col 14}{res}{space 2} .2107948{col 26}{space 2} 1.238042{col 37}{space 1}    0.17{col 46}{space 3}0.865{col 54}{space 4}-2.216259{col 67}{space 3} 2.637848
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2}-1.390779{col 26}{space 2} .6437083{col 37}{space 1}   -2.16{col 46}{space 3}0.031{col 54}{space 4}-2.652702{col 67}{space 3}-.1288555
{txt}High Educ..  {c |}{col 14}{res}{space 2}-1.972749{col 26}{space 2} .6110951{col 37}{space 1}   -3.23{col 46}{space 3}0.001{col 54}{space 4}-3.170737{col 67}{space 3}-.7747605
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2} -2.01196{col 26}{space 2} .4847468{col 37}{space 1}   -4.15{col 46}{space 3}0.000{col 54}{space 4}-2.962256{col 67}{space 3}-1.061664
{txt}High Income  {c |}{col 14}{res}{space 2}-1.990911{col 26}{space 2} .4758525{col 37}{space 1}   -4.18{col 46}{space 3}0.000{col 54}{space 4}-2.923771{col 67}{space 3}-1.058052
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2} .4763078{col 26}{space 2} .8936334{col 37}{space 1}    0.53{col 46}{space 3}0.594{col 54}{space 4}-1.275568{col 67}{space 3} 2.228183
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} 2.165816{col 26}{space 2} 1.271477{col 37}{space 1}    1.70{col 46}{space 3}0.089{col 54}{space 4}-.3267827{col 67}{space 3} 4.658414
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2}-.6762182{col 26}{space 2} .4412364{col 37}{space 1}   -1.53{col 46}{space 3}0.125{col 54}{space 4}-1.541216{col 67}{space 3}   .18878
{txt}{space 7}2015  {c |}{col 14}{res}{space 2}-.5063445{col 26}{space 2} .4555741{col 37}{space 1}   -1.11{col 46}{space 3}0.266{col 54}{space 4} -1.39945{col 67}{space 3} .3867612
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.6487773{col 26}{space 2}  .455799{col 37}{space 1}   -1.42{col 46}{space 3}0.155{col 54}{space 4}-1.542324{col 67}{space 3} .2447693
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .2432507{col 26}{space 2} .4889616{col 37}{space 1}    0.50{col 46}{space 3}0.619{col 54}{space 4}-.7153077{col 67}{space 3} 1.201809
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.6942953{col 26}{space 2} .5987681{col 37}{space 1}   -1.16{col 46}{space 3}0.246{col 54}{space 4}-1.868118{col 67}{space 3} .4795275
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2}-11.06347{col 26}{space 2} 12.11464{col 37}{space 1}   -0.91{col 46}{space 3}0.361{col 54}{space 4}-34.81297{col 67}{space 3} 12.68602
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-13.03916{col 26}{space 2} 12.17277{col 37}{space 1}   -1.07{col 46}{space 3}0.284{col 54}{space 4}-36.90261{col 67}{space 3} 10.82429
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-12.84067{col 26}{space 2} 12.04813{col 37}{space 1}   -1.07{col 46}{space 3}0.287{col 54}{space 4}-36.45978{col 67}{space 3} 10.77844
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-11.97961{col 26}{space 2} 12.04389{col 37}{space 1}   -0.99{col 46}{space 3}0.320{col 54}{space 4}-35.59041{col 67}{space 3} 11.63119
{txt}{space 9}CO  {c |}{col 14}{res}{space 2}-13.19316{col 26}{space 2}  12.0478{col 37}{space 1}   -1.10{col 46}{space 3}0.274{col 54}{space 4}-36.81162{col 67}{space 3} 10.42531
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-13.62155{col 26}{space 2} 12.05372{col 37}{space 1}   -1.13{col 46}{space 3}0.258{col 54}{space 4}-37.25163{col 67}{space 3} 10.00852
{txt}{space 9}DC  {c |}{col 14}{res}{space 2} -12.4579{col 26}{space 2} 12.09085{col 37}{space 1}   -1.03{col 46}{space 3}0.303{col 54}{space 4}-36.16075{col 67}{space 3} 11.24495
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-12.98524{col 26}{space 2} 12.43315{col 37}{space 1}   -1.04{col 46}{space 3}0.296{col 54}{space 4}-37.35913{col 67}{space 3} 11.38866
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-12.09274{col 26}{space 2} 12.04314{col 37}{space 1}   -1.00{col 46}{space 3}0.315{col 54}{space 4}-35.70206{col 67}{space 3} 11.51658
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-12.65134{col 26}{space 2} 12.04751{col 37}{space 1}   -1.05{col 46}{space 3}0.294{col 54}{space 4}-36.26924{col 67}{space 3} 10.96656
{txt}{space 9}HI  {c |}{col 14}{res}{space 2}-14.16358{col 26}{space 2}  12.2254{col 37}{space 1}   -1.16{col 46}{space 3}0.247{col 54}{space 4}-38.13022{col 67}{space 3} 9.803053
{txt}{space 9}IA  {c |}{col 14}{res}{space 2} -15.2788{col 26}{space 2} 12.03557{col 37}{space 1}   -1.27{col 46}{space 3}0.204{col 54}{space 4}-38.87328{col 67}{space 3} 8.315674
{txt}{space 9}ID  {c |}{col 14}{res}{space 2}-14.07307{col 26}{space 2} 12.13223{col 37}{space 1}   -1.16{col 46}{space 3}0.246{col 54}{space 4}-37.85705{col 67}{space 3} 9.710918
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-13.79235{col 26}{space 2} 12.03383{col 37}{space 1}   -1.15{col 46}{space 3}0.252{col 54}{space 4}-37.38342{col 67}{space 3} 9.798712
{txt}{space 9}IN  {c |}{col 14}{res}{space 2}-12.58407{col 26}{space 2} 12.06473{col 37}{space 1}   -1.04{col 46}{space 3}0.297{col 54}{space 4}-36.23573{col 67}{space 3} 11.06759
{txt}{space 9}KS  {c |}{col 14}{res}{space 2} -13.2761{col 26}{space 2} 12.09644{col 37}{space 1}   -1.10{col 46}{space 3}0.272{col 54}{space 4}-36.98991{col 67}{space 3} 10.43771
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-12.92046{col 26}{space 2} 12.09817{col 37}{space 1}   -1.07{col 46}{space 3}0.286{col 54}{space 4}-36.63767{col 67}{space 3} 10.79675
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-11.88776{col 26}{space 2} 12.14192{col 37}{space 1}   -0.98{col 46}{space 3}0.328{col 54}{space 4}-35.69073{col 67}{space 3} 11.91521
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-10.73554{col 26}{space 2} 12.07638{col 37}{space 1}   -0.89{col 46}{space 3}0.374{col 54}{space 4}-34.41002{col 67}{space 3} 12.93894
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-12.28127{col 26}{space 2} 12.06359{col 37}{space 1}   -1.02{col 46}{space 3}0.309{col 54}{space 4}-35.93068{col 67}{space 3} 11.36814
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-13.66792{col 26}{space 2} 12.08549{col 37}{space 1}   -1.13{col 46}{space 3}0.258{col 54}{space 4}-37.36026{col 67}{space 3} 10.02443
{txt}{space 9}MI  {c |}{col 14}{res}{space 2}-13.11913{col 26}{space 2} 12.03664{col 37}{space 1}   -1.09{col 46}{space 3}0.276{col 54}{space 4}-36.71571{col 67}{space 3} 10.47745
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-13.59634{col 26}{space 2} 12.04305{col 37}{space 1}   -1.13{col 46}{space 3}0.259{col 54}{space 4} -37.2055{col 67}{space 3} 10.01282
{txt}{space 9}MO  {c |}{col 14}{res}{space 2} -13.1442{col 26}{space 2} 12.04955{col 37}{space 1}   -1.09{col 46}{space 3}0.275{col 54}{space 4}-36.76609{col 67}{space 3} 10.47768
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-12.90233{col 26}{space 2} 12.11703{col 37}{space 1}   -1.06{col 46}{space 3}0.287{col 54}{space 4}-36.65651{col 67}{space 3} 10.85185
{txt}{space 9}MT  {c |}{col 14}{res}{space 2}-13.86223{col 26}{space 2}  12.1228{col 37}{space 1}   -1.14{col 46}{space 3}0.253{col 54}{space 4}-37.62772{col 67}{space 3} 9.903259
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-13.14079{col 26}{space 2} 12.03857{col 37}{space 1}   -1.09{col 46}{space 3}0.275{col 54}{space 4}-36.74117{col 67}{space 3} 10.45958
{txt}{space 9}ND  {c |}{col 14}{res}{space 2} -11.6491{col 26}{space 2} 12.25094{col 37}{space 1}   -0.95{col 46}{space 3}0.342{col 54}{space 4}-35.66579{col 67}{space 3}  12.3676
{txt}{space 9}NE  {c |}{col 14}{res}{space 2}-14.42459{col 26}{space 2} 12.04099{col 37}{space 1}   -1.20{col 46}{space 3}0.231{col 54}{space 4} -38.0297{col 67}{space 3} 9.180518
{txt}{space 9}NH  {c |}{col 14}{res}{space 2} -15.9239{col 26}{space 2} 12.03238{col 37}{space 1}   -1.32{col 46}{space 3}0.186{col 54}{space 4}-39.51213{col 67}{space 3}  7.66433
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2} -12.1959{col 26}{space 2} 12.05121{col 37}{space 1}   -1.01{col 46}{space 3}0.312{col 54}{space 4}-35.82104{col 67}{space 3} 11.42924
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-14.68978{col 26}{space 2} 12.12386{col 37}{space 1}   -1.21{col 46}{space 3}0.226{col 54}{space 4}-38.45736{col 67}{space 3} 9.077796
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}-10.48234{col 26}{space 2} 12.16516{col 37}{space 1}   -0.86{col 46}{space 3}0.389{col 54}{space 4}-34.33088{col 67}{space 3}  13.3662
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-13.17642{col 26}{space 2} 12.03381{col 37}{space 1}   -1.09{col 46}{space 3}0.274{col 54}{space 4}-36.76747{col 67}{space 3} 10.41462
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-12.81619{col 26}{space 2} 12.03721{col 37}{space 1}   -1.06{col 46}{space 3}0.287{col 54}{space 4}-36.41389{col 67}{space 3} 10.78151
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-10.36389{col 26}{space 2} 12.18942{col 37}{space 1}   -0.85{col 46}{space 3}0.395{col 54}{space 4}-34.25997{col 67}{space 3}  13.5322
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-14.41767{col 26}{space 2} 12.04047{col 37}{space 1}   -1.20{col 46}{space 3}0.231{col 54}{space 4}-38.02176{col 67}{space 3} 9.186433
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-13.32731{col 26}{space 2} 12.02987{col 37}{space 1}   -1.11{col 46}{space 3}0.268{col 54}{space 4}-36.91062{col 67}{space 3} 10.25601
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-8.715228{col 26}{space 2}  12.6104{col 37}{space 1}   -0.69{col 46}{space 3}0.490{col 54}{space 4}-33.43661{col 67}{space 3} 16.00615
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-11.08326{col 26}{space 2} 12.12797{col 37}{space 1}   -0.91{col 46}{space 3}0.361{col 54}{space 4} -34.8589{col 67}{space 3} 12.69237
{txt}{space 9}SD  {c |}{col 14}{res}{space 2}-14.45381{col 26}{space 2} 12.08008{col 37}{space 1}   -1.20{col 46}{space 3}0.232{col 54}{space 4}-38.13556{col 67}{space 3} 9.227934
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-10.15961{col 26}{space 2} 12.08535{col 37}{space 1}   -0.84{col 46}{space 3}0.401{col 54}{space 4}-33.85169{col 67}{space 3} 13.53247
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-11.42186{col 26}{space 2} 12.03758{col 37}{space 1}   -0.95{col 46}{space 3}0.343{col 54}{space 4}-35.02028{col 67}{space 3} 12.17657
{txt}{space 9}UT  {c |}{col 14}{res}{space 2} -12.6798{col 26}{space 2} 12.07298{col 37}{space 1}   -1.05{col 46}{space 3}0.294{col 54}{space 4}-36.34762{col 67}{space 3} 10.98801
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}-12.87415{col 26}{space 2} 12.05026{col 37}{space 1}   -1.07{col 46}{space 3}0.285{col 54}{space 4}-36.49743{col 67}{space 3} 10.74912
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}-15.51333{col 26}{space 2} 12.03725{col 37}{space 1}   -1.29{col 46}{space 3}0.198{col 54}{space 4}-39.11111{col 67}{space 3} 8.084442
{txt}{space 9}WA  {c |}{col 14}{res}{space 2}-13.54902{col 26}{space 2} 12.04837{col 37}{space 1}   -1.12{col 46}{space 3}0.261{col 54}{space 4} -37.1686{col 67}{space 3} 10.07057
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-12.44577{col 26}{space 2} 12.05096{col 37}{space 1}   -1.03{col 46}{space 3}0.302{col 54}{space 4}-36.07044{col 67}{space 3} 11.17889
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-12.87389{col 26}{space 2}  12.1621{col 37}{space 1}   -1.06{col 46}{space 3}0.290{col 54}{space 4}-36.71642{col 67}{space 3} 10.96864
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-13.69103{col 26}{space 2} 12.30027{col 37}{space 1}   -1.11{col 46}{space 3}0.266{col 54}{space 4}-37.80443{col 67}{space 3} 10.42238
{txt}{space 12} {c |}
{space 7}2.Q33 {c |}{col 14}{res}{space 2} 1.062354{col 26}{space 2} .2901049{col 37}{space 1}    3.66{col 46}{space 3}0.000{col 54}{space 4} .4936335{col 67}{space 3} 1.631075
{txt}{space 7}2.Q34 {c |}{col 14}{res}{space 2}-1.349277{col 26}{space 2} .6128122{col 37}{space 1}   -2.20{col 46}{space 3}0.028{col 54}{space 4}-2.550632{col 67}{space 3}-.1479223
{txt}{space 7}Q35_1 {c |}{col 14}{res}{space 2} -1.74123{col 26}{space 2} .8998744{col 37}{space 1}   -1.93{col 46}{space 3}0.053{col 54}{space 4} -3.50534{col 67}{space 3} .0228806
{txt}{space 7}Q35_2 {c |}{col 14}{res}{space 2} .7939281{col 26}{space 2} .9845852{col 37}{space 1}    0.81{col 46}{space 3}0.420{col 54}{space 4}-1.136249{col 67}{space 3} 2.724105
{txt}{space 7}Q35_3 {c |}{col 14}{res}{space 2} .2928043{col 26}{space 2} 1.128792{col 37}{space 1}    0.26{col 46}{space 3}0.795{col 54}{space 4}-1.920076{col 67}{space 3} 2.505685
{txt}{space 7}Q35_4 {c |}{col 14}{res}{space 2}-.7374912{col 26}{space 2}  .988357{col 37}{space 1}   -0.75{col 46}{space 3}0.456{col 54}{space 4}-2.675063{col 67}{space 3}  1.20008
{txt}{space 7}Q35_5 {c |}{col 14}{res}{space 2} 1.792911{col 26}{space 2} 2.994699{col 37}{space 1}    0.60{col 46}{space 3}0.549{col 54}{space 4}-4.077885{col 67}{space 3} 7.663707
{txt}{space 7}Q35_6 {c |}{col 14}{res}{space 2}-1.637976{col 26}{space 2}  .974119{col 37}{space 1}   -1.68{col 46}{space 3}0.093{col 54}{space 4}-3.547636{col 67}{space 3}  .271683
{txt}{space 7}Q4new {c |}{col 14}{res}{space 2}-.0002646{col 26}{space 2} .0067085{col 37}{space 1}   -0.04{col 46}{space 3}0.969{col 54}{space 4}-.0134159{col 67}{space 3} .0128867
{txt}{space 7}Q6new {c |}{col 14}{res}{space 2} .0077084{col 26}{space 2} .0068219{col 37}{space 1}    1.13{col 46}{space 3}0.259{col 54}{space 4}-.0056653{col 67}{space 3} .0210821
{txt}{space 5}Q9_mean {c |}{col 14}{res}{space 2}-.0562627{col 26}{space 2}  .039862{col 37}{space 1}   -1.41{col 46}{space 3}0.158{col 54}{space 4} -.134408{col 67}{space 3} .0218825
{txt}{space 6}Q13new {c |}{col 14}{res}{space 2} .0039529{col 26}{space 2} .0073171{col 37}{space 1}    0.54{col 46}{space 3}0.589{col 54}{space 4}-.0103914{col 67}{space 3} .0182972
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 22.32914{col 26}{space 2} 12.16066{col 37}{space 1}    1.84{col 46}{space 3}0.066{col 54}{space 4}-1.510573{col 67}{space 3} 46.16885
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est3{txt} stored)

Linear regression                                      Number of obs ={res}    7553
                                                       {txt}F( 63,  7489) ={res}    4.73
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0546
                                                       {txt}Root MSE      = {res} 4.3055

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     Q24_iqr{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2} .0625868{col 26}{space 2}  .275941{col 37}{space 1}    0.23{col 46}{space 3}0.821{col 54}{space 4}-.4783351{col 67}{space 3} .6035088
{txt}{space 8}Old  {c |}{col 14}{res}{space 2} .6403894{col 26}{space 2} .4371202{col 37}{space 1}    1.47{col 46}{space 3}0.143{col 54}{space 4}-.2164889{col 67}{space 3} 1.497268
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2}-.9878136{col 26}{space 2} .2478209{col 37}{space 1}   -3.99{col 46}{space 3}0.000{col 54}{space 4}-1.473612{col 67}{space 3} -.502015
{txt}High Educ..  {c |}{col 14}{res}{space 2}-1.541032{col 26}{space 2}   .23509{col 37}{space 1}   -6.56{col 46}{space 3}0.000{col 54}{space 4}-2.001874{col 67}{space 3}-1.080189
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2}-1.358619{col 26}{space 2} .1728952{col 37}{space 1}   -7.86{col 46}{space 3}0.000{col 54}{space 4}-1.697542{col 67}{space 3}-1.019696
{txt}High Income  {c |}{col 14}{res}{space 2} -1.46659{col 26}{space 2} .1617336{col 37}{space 1}   -9.07{col 46}{space 3}0.000{col 54}{space 4}-1.783633{col 67}{space 3}-1.149547
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2} .6000398{col 26}{space 2} .3424947{col 37}{space 1}    1.75{col 46}{space 3}0.080{col 54}{space 4} -.071346{col 67}{space 3} 1.271426
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} 1.189052{col 26}{space 2} .4429809{col 37}{space 1}    2.68{col 46}{space 3}0.007{col 54}{space 4} .3206852{col 67}{space 3} 2.057419
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2} .1646651{col 26}{space 2} .1592153{col 37}{space 1}    1.03{col 46}{space 3}0.301{col 54}{space 4}-.1474416{col 67}{space 3} .4767718
{txt}{space 7}2015  {c |}{col 14}{res}{space 2} .1383617{col 26}{space 2} .1564375{col 37}{space 1}    0.88{col 46}{space 3}0.376{col 54}{space 4}-.1682998{col 67}{space 3} .4450232
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}  .184145{col 26}{space 2} .1597329{col 37}{space 1}    1.15{col 46}{space 3}0.249{col 54}{space 4}-.1289763{col 67}{space 3} .4972663
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1901106{col 26}{space 2} .1539102{col 37}{space 1}    1.24{col 46}{space 3}0.217{col 54}{space 4}-.1115966{col 67}{space 3} .4918177
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .2663977{col 26}{space 2} .2312667{col 37}{space 1}    1.15{col 46}{space 3}0.249{col 54}{space 4}  -.18695{col 67}{space 3} .7197454
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2}-2.607374{col 26}{space 2}  2.32467{col 37}{space 1}   -1.12{col 46}{space 3}0.262{col 54}{space 4}-7.164381{col 67}{space 3} 1.949632
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-3.937437{col 26}{space 2} 2.308133{col 37}{space 1}   -1.71{col 46}{space 3}0.088{col 54}{space 4}-8.462027{col 67}{space 3} .5871521
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-2.651589{col 26}{space 2} 2.305831{col 37}{space 1}   -1.15{col 46}{space 3}0.250{col 54}{space 4}-7.171666{col 67}{space 3} 1.868488
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-2.520127{col 26}{space 2} 2.280008{col 37}{space 1}   -1.11{col 46}{space 3}0.269{col 54}{space 4}-6.989584{col 67}{space 3} 1.949329
{txt}{space 9}CO  {c |}{col 14}{res}{space 2}-2.952019{col 26}{space 2} 2.293555{col 37}{space 1}   -1.29{col 46}{space 3}0.198{col 54}{space 4}-7.448032{col 67}{space 3} 1.543993
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-3.461431{col 26}{space 2} 2.291604{col 37}{space 1}   -1.51{col 46}{space 3}0.131{col 54}{space 4}-7.953618{col 67}{space 3} 1.030756
{txt}{space 9}DC  {c |}{col 14}{res}{space 2}-2.262674{col 26}{space 2} 2.458187{col 37}{space 1}   -0.92{col 46}{space 3}0.357{col 54}{space 4} -7.08141{col 67}{space 3} 2.556062
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-2.931184{col 26}{space 2} 2.536588{col 37}{space 1}   -1.16{col 46}{space 3}0.248{col 54}{space 4}-7.903608{col 67}{space 3} 2.041241
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-2.490705{col 26}{space 2} 2.289393{col 37}{space 1}   -1.09{col 46}{space 3}0.277{col 54}{space 4}-6.978557{col 67}{space 3} 1.997148
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-2.775158{col 26}{space 2} 2.293623{col 37}{space 1}   -1.21{col 46}{space 3}0.226{col 54}{space 4}-7.271304{col 67}{space 3} 1.720987
{txt}{space 9}HI  {c |}{col 14}{res}{space 2}-2.800849{col 26}{space 2} 2.423944{col 37}{space 1}   -1.16{col 46}{space 3}0.248{col 54}{space 4} -7.55246{col 67}{space 3} 1.950762
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-3.860972{col 26}{space 2} 2.311394{col 37}{space 1}   -1.67{col 46}{space 3}0.095{col 54}{space 4}-8.391953{col 67}{space 3} .6700103
{txt}{space 9}ID  {c |}{col 14}{res}{space 2}-3.985223{col 26}{space 2}  2.30592{col 37}{space 1}   -1.73{col 46}{space 3}0.084{col 54}{space 4}-8.505473{col 67}{space 3} .5350282
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-3.092249{col 26}{space 2} 2.286008{col 37}{space 1}   -1.35{col 46}{space 3}0.176{col 54}{space 4}-7.573466{col 67}{space 3} 1.388969
{txt}{space 9}IN  {c |}{col 14}{res}{space 2}-3.137683{col 26}{space 2} 2.295894{col 37}{space 1}   -1.37{col 46}{space 3}0.172{col 54}{space 4} -7.63828{col 67}{space 3} 1.362914
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-3.220433{col 26}{space 2} 2.314651{col 37}{space 1}   -1.39{col 46}{space 3}0.164{col 54}{space 4}  -7.7578{col 67}{space 3} 1.316934
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-3.597691{col 26}{space 2}  2.30724{col 37}{space 1}   -1.56{col 46}{space 3}0.119{col 54}{space 4} -8.12053{col 67}{space 3} .9251481
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-.9542076{col 26}{space 2} 2.425913{col 37}{space 1}   -0.39{col 46}{space 3}0.694{col 54}{space 4}-5.709678{col 67}{space 3} 3.801263
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-2.847505{col 26}{space 2} 2.298278{col 37}{space 1}   -1.24{col 46}{space 3}0.215{col 54}{space 4}-7.352774{col 67}{space 3} 1.657765
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-2.836926{col 26}{space 2} 2.296126{col 37}{space 1}   -1.24{col 46}{space 3}0.217{col 54}{space 4}-7.337978{col 67}{space 3} 1.664127
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-3.240387{col 26}{space 2} 2.345933{col 37}{space 1}   -1.38{col 46}{space 3}0.167{col 54}{space 4}-7.839074{col 67}{space 3} 1.358301
{txt}{space 9}MI  {c |}{col 14}{res}{space 2}-3.289566{col 26}{space 2} 2.286699{col 37}{space 1}   -1.44{col 46}{space 3}0.150{col 54}{space 4}-7.772137{col 67}{space 3} 1.193006
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-3.351619{col 26}{space 2} 2.293719{col 37}{space 1}   -1.46{col 46}{space 3}0.144{col 54}{space 4}-7.847952{col 67}{space 3} 1.144714
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-3.235438{col 26}{space 2}  2.29499{col 37}{space 1}   -1.41{col 46}{space 3}0.159{col 54}{space 4}-7.734263{col 67}{space 3} 1.263388
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-1.897552{col 26}{space 2} 2.429013{col 37}{space 1}   -0.78{col 46}{space 3}0.435{col 54}{space 4}-6.659099{col 67}{space 3} 2.863996
{txt}{space 9}MT  {c |}{col 14}{res}{space 2}-3.672496{col 26}{space 2} 2.378939{col 37}{space 1}   -1.54{col 46}{space 3}0.123{col 54}{space 4}-8.335885{col 67}{space 3}  .990893
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-2.439851{col 26}{space 2} 2.295619{col 37}{space 1}   -1.06{col 46}{space 3}0.288{col 54}{space 4} -6.93991{col 67}{space 3} 2.060208
{txt}{space 9}ND  {c |}{col 14}{res}{space 2} -2.79399{col 26}{space 2}  2.39242{col 37}{space 1}   -1.17{col 46}{space 3}0.243{col 54}{space 4}-7.483806{col 67}{space 3} 1.895826
{txt}{space 9}NE  {c |}{col 14}{res}{space 2}-3.640681{col 26}{space 2} 2.301792{col 37}{space 1}   -1.58{col 46}{space 3}0.114{col 54}{space 4} -8.15284{col 67}{space 3} .8714774
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-4.041101{col 26}{space 2} 2.319218{col 37}{space 1}   -1.74{col 46}{space 3}0.081{col 54}{space 4} -8.58742{col 67}{space 3} .5052174
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-2.410708{col 26}{space 2} 2.293108{col 37}{space 1}   -1.05{col 46}{space 3}0.293{col 54}{space 4}-6.905842{col 67}{space 3} 2.084427
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-3.257178{col 26}{space 2} 2.386089{col 37}{space 1}   -1.37{col 46}{space 3}0.172{col 54}{space 4}-7.934582{col 67}{space 3} 1.420226
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}-2.770007{col 26}{space 2} 2.336443{col 37}{space 1}   -1.19{col 46}{space 3}0.236{col 54}{space 4}-7.350092{col 67}{space 3} 1.810078
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-2.793619{col 26}{space 2} 2.283676{col 37}{space 1}   -1.22{col 46}{space 3}0.221{col 54}{space 4}-7.270265{col 67}{space 3} 1.683027
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-3.384509{col 26}{space 2} 2.285482{col 37}{space 1}   -1.48{col 46}{space 3}0.139{col 54}{space 4}-7.864696{col 67}{space 3} 1.095677
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-1.009847{col 26}{space 2} 2.370765{col 37}{space 1}   -0.43{col 46}{space 3}0.670{col 54}{space 4}-5.657211{col 67}{space 3} 3.637517
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-3.667121{col 26}{space 2} 2.308434{col 37}{space 1}   -1.59{col 46}{space 3}0.112{col 54}{space 4}  -8.1923{col 67}{space 3} .8580581
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-3.332353{col 26}{space 2} 2.283162{col 37}{space 1}   -1.46{col 46}{space 3}0.144{col 54}{space 4}-7.807991{col 67}{space 3} 1.143285
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-2.166192{col 26}{space 2} 2.430808{col 37}{space 1}   -0.89{col 46}{space 3}0.373{col 54}{space 4}-6.931259{col 67}{space 3} 2.598875
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-2.766452{col 26}{space 2} 2.307968{col 37}{space 1}   -1.20{col 46}{space 3}0.231{col 54}{space 4}-7.290718{col 67}{space 3} 1.757814
{txt}{space 9}SD  {c |}{col 14}{res}{space 2}-3.740698{col 26}{space 2} 2.326311{col 37}{space 1}   -1.61{col 46}{space 3}0.108{col 54}{space 4}-8.300921{col 67}{space 3} .8195259
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-3.018898{col 26}{space 2} 2.292595{col 37}{space 1}   -1.32{col 46}{space 3}0.188{col 54}{space 4}-7.513029{col 67}{space 3} 1.475232
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-2.227204{col 26}{space 2} 2.285263{col 37}{space 1}   -0.97{col 46}{space 3}0.330{col 54}{space 4}-6.706961{col 67}{space 3} 2.252552
{txt}{space 9}UT  {c |}{col 14}{res}{space 2} -3.26977{col 26}{space 2} 2.329968{col 37}{space 1}   -1.40{col 46}{space 3}0.161{col 54}{space 4} -7.83716{col 67}{space 3} 1.297621
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}-2.567667{col 26}{space 2} 2.301975{col 37}{space 1}   -1.12{col 46}{space 3}0.265{col 54}{space 4}-7.080184{col 67}{space 3} 1.944851
{txt}{space 9}VT  {c |}{col 14}{res}{space 2} -4.64145{col 26}{space 2} 2.302444{col 37}{space 1}   -2.02{col 46}{space 3}0.044{col 54}{space 4}-9.154887{col 67}{space 3}-.1280136
{txt}{space 9}WA  {c |}{col 14}{res}{space 2}-3.443127{col 26}{space 2} 2.289701{col 37}{space 1}   -1.50{col 46}{space 3}0.133{col 54}{space 4}-7.931585{col 67}{space 3} 1.045331
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-3.753944{col 26}{space 2} 2.286153{col 37}{space 1}   -1.64{col 46}{space 3}0.101{col 54}{space 4}-8.235447{col 67}{space 3} .7275581
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-3.502221{col 26}{space 2} 2.345358{col 37}{space 1}   -1.49{col 46}{space 3}0.135{col 54}{space 4}-8.099782{col 67}{space 3} 1.095339
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-4.299126{col 26}{space 2} 2.341433{col 37}{space 1}   -1.84{col 46}{space 3}0.066{col 54}{space 4}-8.888992{col 67}{space 3} .2907392
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 7.739401{col 26}{space 2} 2.328074{col 37}{space 1}    3.32{col 46}{space 3}0.001{col 54}{space 4} 3.175721{col 67}{space 3} 12.30308
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est4{txt} stored)

Linear regression                                      Number of obs ={res}    7551
                                                       {txt}F( 71,  7479) ={res}    5.19
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0766
                                                       {txt}Root MSE      = {res} 4.2579

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     Q24_iqr{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2} .0319059{col 26}{space 2} .2778271{col 37}{space 1}    0.11{col 46}{space 3}0.909{col 54}{space 4}-.5127134{col 67}{space 3} .5765251
{txt}{space 8}Old  {c |}{col 14}{res}{space 2} .5851475{col 26}{space 2} .4388962{col 37}{space 1}    1.33{col 46}{space 3}0.182{col 54}{space 4}-.2752125{col 67}{space 3} 1.445508
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2}-.9526861{col 26}{space 2}  .243655{col 37}{space 1}   -3.91{col 46}{space 3}0.000{col 54}{space 4}-1.430318{col 67}{space 3}-.4750538
{txt}High Educ..  {c |}{col 14}{res}{space 2}-1.447845{col 26}{space 2}  .230614{col 37}{space 1}   -6.28{col 46}{space 3}0.000{col 54}{space 4}-1.899913{col 67}{space 3}-.9957767
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2} -1.28491{col 26}{space 2} .1712655{col 37}{space 1}   -7.50{col 46}{space 3}0.000{col 54}{space 4}-1.620638{col 67}{space 3}-.9491811
{txt}High Income  {c |}{col 14}{res}{space 2}-1.325444{col 26}{space 2} .1620393{col 37}{space 1}   -8.18{col 46}{space 3}0.000{col 54}{space 4}-1.643086{col 67}{space 3}-1.007801
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2} .4710252{col 26}{space 2} .3414737{col 37}{space 1}    1.38{col 46}{space 3}0.168{col 54}{space 4}-.1983593{col 67}{space 3}  1.14041
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} 1.014431{col 26}{space 2} .4431763{col 37}{space 1}    2.29{col 46}{space 3}0.022{col 54}{space 4}  .145681{col 67}{space 3} 1.883181
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2}  .089323{col 26}{space 2} .1575426{col 37}{space 1}    0.57{col 46}{space 3}0.571{col 54}{space 4}-.2195048{col 67}{space 3} .3981509
{txt}{space 7}2015  {c |}{col 14}{res}{space 2} .0648331{col 26}{space 2} .1543326{col 37}{space 1}    0.42{col 46}{space 3}0.674{col 54}{space 4}-.2377022{col 67}{space 3} .3673685
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1005193{col 26}{space 2} .1580597{col 37}{space 1}    0.64{col 46}{space 3}0.525{col 54}{space 4}-.2093222{col 67}{space 3} .4103607
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1230241{col 26}{space 2} .1525796{col 37}{space 1}    0.81{col 46}{space 3}0.420{col 54}{space 4}-.1760749{col 67}{space 3} .4221231
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .2227838{col 26}{space 2} .2282361{col 37}{space 1}    0.98{col 46}{space 3}0.329{col 54}{space 4}-.2246231{col 67}{space 3} .6701907
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2}-2.670359{col 26}{space 2} 2.228083{col 37}{space 1}   -1.20{col 46}{space 3}0.231{col 54}{space 4}-7.038028{col 67}{space 3}  1.69731
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-3.745917{col 26}{space 2} 2.213916{col 37}{space 1}   -1.69{col 46}{space 3}0.091{col 54}{space 4}-8.085814{col 67}{space 3} .5939812
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-2.527992{col 26}{space 2} 2.213607{col 37}{space 1}   -1.14{col 46}{space 3}0.253{col 54}{space 4}-6.867284{col 67}{space 3} 1.811301
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-2.495551{col 26}{space 2} 2.187607{col 37}{space 1}   -1.14{col 46}{space 3}0.254{col 54}{space 4}-6.783875{col 67}{space 3} 1.792774
{txt}{space 9}CO  {c |}{col 14}{res}{space 2}-2.686358{col 26}{space 2} 2.201574{col 37}{space 1}   -1.22{col 46}{space 3}0.222{col 54}{space 4}-7.002062{col 67}{space 3} 1.629346
{txt}{space 9}CT  {c |}{col 14}{res}{space 2} -3.30577{col 26}{space 2} 2.199734{col 37}{space 1}   -1.50{col 46}{space 3}0.133{col 54}{space 4}-7.617868{col 67}{space 3} 1.006327
{txt}{space 9}DC  {c |}{col 14}{res}{space 2}-2.235228{col 26}{space 2} 2.353923{col 37}{space 1}   -0.95{col 46}{space 3}0.342{col 54}{space 4}-6.849579{col 67}{space 3} 2.379122
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-3.038447{col 26}{space 2} 2.428491{col 37}{space 1}   -1.25{col 46}{space 3}0.211{col 54}{space 4}-7.798972{col 67}{space 3} 1.722079
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-2.403307{col 26}{space 2} 2.195995{col 37}{space 1}   -1.09{col 46}{space 3}0.274{col 54}{space 4}-6.708075{col 67}{space 3} 1.901461
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-2.977328{col 26}{space 2} 2.201769{col 37}{space 1}   -1.35{col 46}{space 3}0.176{col 54}{space 4}-7.293414{col 67}{space 3} 1.338759
{txt}{space 9}HI  {c |}{col 14}{res}{space 2}-2.723896{col 26}{space 2} 2.342726{col 37}{space 1}   -1.16{col 46}{space 3}0.245{col 54}{space 4}-7.316299{col 67}{space 3} 1.868506
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-3.437788{col 26}{space 2} 2.218021{col 37}{space 1}   -1.55{col 46}{space 3}0.121{col 54}{space 4}-7.785733{col 67}{space 3} .9101576
{txt}{space 9}ID  {c |}{col 14}{res}{space 2} -3.55597{col 26}{space 2} 2.214639{col 37}{space 1}   -1.61{col 46}{space 3}0.108{col 54}{space 4}-7.897286{col 67}{space 3} .7853462
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-2.877482{col 26}{space 2} 2.193854{col 37}{space 1}   -1.31{col 46}{space 3}0.190{col 54}{space 4}-7.178054{col 67}{space 3} 1.423089
{txt}{space 9}IN  {c |}{col 14}{res}{space 2}-2.843581{col 26}{space 2} 2.204045{col 37}{space 1}   -1.29{col 46}{space 3}0.197{col 54}{space 4} -7.16413{col 67}{space 3} 1.476968
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-2.853209{col 26}{space 2} 2.221374{col 37}{space 1}   -1.28{col 46}{space 3}0.199{col 54}{space 4}-7.207727{col 67}{space 3} 1.501309
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-3.268242{col 26}{space 2} 2.216766{col 37}{space 1}   -1.47{col 46}{space 3}0.140{col 54}{space 4}-7.613727{col 67}{space 3} 1.077243
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-1.009867{col 26}{space 2}  2.32728{col 37}{space 1}   -0.43{col 46}{space 3}0.664{col 54}{space 4}-5.571991{col 67}{space 3} 3.552257
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-2.555576{col 26}{space 2} 2.205234{col 37}{space 1}   -1.16{col 46}{space 3}0.247{col 54}{space 4}-6.878455{col 67}{space 3} 1.767304
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-2.879156{col 26}{space 2}  2.20452{col 37}{space 1}   -1.31{col 46}{space 3}0.192{col 54}{space 4}-7.200635{col 67}{space 3} 1.442323
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-2.722605{col 26}{space 2} 2.257329{col 37}{space 1}   -1.21{col 46}{space 3}0.228{col 54}{space 4}-7.147605{col 67}{space 3} 1.702395
{txt}{space 9}MI  {c |}{col 14}{res}{space 2}-3.021917{col 26}{space 2}  2.19349{col 37}{space 1}   -1.38{col 46}{space 3}0.168{col 54}{space 4}-7.321774{col 67}{space 3} 1.277939
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-2.967266{col 26}{space 2} 2.201044{col 37}{space 1}   -1.35{col 46}{space 3}0.178{col 54}{space 4}-7.281932{col 67}{space 3}   1.3474
{txt}{space 9}MO  {c |}{col 14}{res}{space 2} -2.86882{col 26}{space 2} 2.202748{col 37}{space 1}   -1.30{col 46}{space 3}0.193{col 54}{space 4}-7.186826{col 67}{space 3} 1.449186
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-2.150134{col 26}{space 2} 2.334538{col 37}{space 1}   -0.92{col 46}{space 3}0.357{col 54}{space 4}-6.726484{col 67}{space 3} 2.426217
{txt}{space 9}MT  {c |}{col 14}{res}{space 2}-3.157623{col 26}{space 2} 2.288709{col 37}{space 1}   -1.38{col 46}{space 3}0.168{col 54}{space 4}-7.644137{col 67}{space 3} 1.328891
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-2.391275{col 26}{space 2} 2.202513{col 37}{space 1}   -1.09{col 46}{space 3}0.278{col 54}{space 4}-6.708819{col 67}{space 3}  1.92627
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-2.301373{col 26}{space 2} 2.297274{col 37}{space 1}   -1.00{col 46}{space 3}0.316{col 54}{space 4}-6.804676{col 67}{space 3} 2.201929
{txt}{space 9}NE  {c |}{col 14}{res}{space 2}-3.232018{col 26}{space 2} 2.212226{col 37}{space 1}   -1.46{col 46}{space 3}0.144{col 54}{space 4}-7.568603{col 67}{space 3} 1.104567
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-3.538292{col 26}{space 2} 2.228521{col 37}{space 1}   -1.59{col 46}{space 3}0.112{col 54}{space 4} -7.90682{col 67}{space 3} .8302357
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-2.333951{col 26}{space 2} 2.200665{col 37}{space 1}   -1.06{col 46}{space 3}0.289{col 54}{space 4}-6.647873{col 67}{space 3}  1.97997
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-2.986202{col 26}{space 2} 2.300262{col 37}{space 1}   -1.30{col 46}{space 3}0.194{col 54}{space 4}-7.495362{col 67}{space 3} 1.522958
{txt}{space 9}NV  {c |}{col 14}{res}{space 2} -2.56142{col 26}{space 2} 2.237161{col 37}{space 1}   -1.14{col 46}{space 3}0.252{col 54}{space 4}-6.946886{col 67}{space 3} 1.824045
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-2.619825{col 26}{space 2} 2.190659{col 37}{space 1}   -1.20{col 46}{space 3}0.232{col 54}{space 4}-6.914132{col 67}{space 3} 1.674482
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-3.111391{col 26}{space 2}  2.19222{col 37}{space 1}   -1.42{col 46}{space 3}0.156{col 54}{space 4}-7.408759{col 67}{space 3} 1.185978
{txt}{space 9}OK  {c |}{col 14}{res}{space 2} -.681197{col 26}{space 2} 2.276827{col 37}{space 1}   -0.30{col 46}{space 3}0.765{col 54}{space 4}-5.144418{col 67}{space 3} 3.782024
{txt}{space 9}OR  {c |}{col 14}{res}{space 2} -3.25819{col 26}{space 2} 2.216488{col 37}{space 1}   -1.47{col 46}{space 3}0.142{col 54}{space 4} -7.60313{col 67}{space 3}  1.08675
{txt}{space 9}PA  {c |}{col 14}{res}{space 2} -3.04643{col 26}{space 2} 2.190517{col 37}{space 1}   -1.39{col 46}{space 3}0.164{col 54}{space 4}-7.340461{col 67}{space 3}   1.2476
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-2.058543{col 26}{space 2} 2.337782{col 37}{space 1}   -0.88{col 46}{space 3}0.379{col 54}{space 4}-6.641253{col 67}{space 3} 2.524167
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-2.744179{col 26}{space 2} 2.218366{col 37}{space 1}   -1.24{col 46}{space 3}0.216{col 54}{space 4}-7.092801{col 67}{space 3} 1.604443
{txt}{space 9}SD  {c |}{col 14}{res}{space 2}-3.390271{col 26}{space 2} 2.234121{col 37}{space 1}   -1.52{col 46}{space 3}0.129{col 54}{space 4}-7.769777{col 67}{space 3} .9892345
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-2.812393{col 26}{space 2} 2.200698{col 37}{space 1}   -1.28{col 46}{space 3}0.201{col 54}{space 4}-7.126381{col 67}{space 3} 1.501595
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-2.155684{col 26}{space 2}  2.19235{col 37}{space 1}   -0.98{col 46}{space 3}0.326{col 54}{space 4}-6.453308{col 67}{space 3} 2.141939
{txt}{space 9}UT  {c |}{col 14}{res}{space 2}-2.845438{col 26}{space 2} 2.240243{col 37}{space 1}   -1.27{col 46}{space 3}0.204{col 54}{space 4}-7.236945{col 67}{space 3} 1.546069
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}-2.477358{col 26}{space 2} 2.209574{col 37}{space 1}   -1.12{col 46}{space 3}0.262{col 54}{space 4}-6.808745{col 67}{space 3}  1.85403
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}-4.191453{col 26}{space 2} 2.206402{col 37}{space 1}   -1.90{col 46}{space 3}0.058{col 54}{space 4}-8.516621{col 67}{space 3} .1337142
{txt}{space 9}WA  {c |}{col 14}{res}{space 2}-3.061062{col 26}{space 2} 2.196761{col 37}{space 1}   -1.39{col 46}{space 3}0.164{col 54}{space 4}-7.367331{col 67}{space 3} 1.245207
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-3.349132{col 26}{space 2} 2.192842{col 37}{space 1}   -1.53{col 46}{space 3}0.127{col 54}{space 4} -7.64772{col 67}{space 3} .9494554
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-3.119625{col 26}{space 2} 2.251935{col 37}{space 1}   -1.39{col 46}{space 3}0.166{col 54}{space 4} -7.53405{col 67}{space 3} 1.294801
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-3.789639{col 26}{space 2} 2.251587{col 37}{space 1}   -1.68{col 46}{space 3}0.092{col 54}{space 4}-8.203384{col 67}{space 3} .6241056
{txt}{space 12} {c |}
{space 7}2.Q33 {c |}{col 14}{res}{space 2} .3308442{col 26}{space 2} .1004082{col 37}{space 1}    3.29{col 46}{space 3}0.001{col 54}{space 4} .1340158{col 67}{space 3} .5276725
{txt}{space 7}2.Q34 {c |}{col 14}{res}{space 2}-1.019354{col 26}{space 2} .2395791{col 37}{space 1}   -4.25{col 46}{space 3}0.000{col 54}{space 4}-1.488997{col 67}{space 3}-.5497119
{txt}{space 7}Q35_1 {c |}{col 14}{res}{space 2}-1.046561{col 26}{space 2} .3261719{col 37}{space 1}   -3.21{col 46}{space 3}0.001{col 54}{space 4}-1.685949{col 67}{space 3}-.4071721
{txt}{space 7}Q35_2 {c |}{col 14}{res}{space 2} .9991012{col 26}{space 2} .3547062{col 37}{space 1}    2.82{col 46}{space 3}0.005{col 54}{space 4} .3037774{col 67}{space 3} 1.694425
{txt}{space 7}Q35_3 {c |}{col 14}{res}{space 2}-.4193734{col 26}{space 2} .3462771{col 37}{space 1}   -1.21{col 46}{space 3}0.226{col 54}{space 4}-1.098174{col 67}{space 3}  .259427
{txt}{space 7}Q35_4 {c |}{col 14}{res}{space 2}-.7713339{col 26}{space 2} .3623361{col 37}{space 1}   -2.13{col 46}{space 3}0.033{col 54}{space 4}-1.481614{col 67}{space 3}-.0610533
{txt}{space 7}Q35_5 {c |}{col 14}{res}{space 2} .2961841{col 26}{space 2} .8332675{col 37}{space 1}    0.36{col 46}{space 3}0.722{col 54}{space 4}-1.337255{col 67}{space 3} 1.929623
{txt}{space 7}Q35_6 {c |}{col 14}{res}{space 2}-.3212202{col 26}{space 2} .3763548{col 37}{space 1}   -0.85{col 46}{space 3}0.393{col 54}{space 4}-1.058981{col 67}{space 3}  .416541
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 9.186566{col 26}{space 2} 2.282013{col 37}{space 1}    4.03{col 46}{space 3}0.000{col 54}{space 4}  4.71318{col 67}{space 3} 13.65995
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est5{txt} stored)

Linear regression                                      Number of obs ={res}    6258
                                                       {txt}F( 75,  6182) ={res}    5.03
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.1053
                                                       {txt}Root MSE      = {res} 3.8406

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     Q24_iqr{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2} .1549294{col 26}{space 2} .2963044{col 37}{space 1}    0.52{col 46}{space 3}0.601{col 54}{space 4}-.4259303{col 67}{space 3} .7357892
{txt}{space 8}Old  {c |}{col 14}{res}{space 2} .4669052{col 26}{space 2} .4434989{col 37}{space 1}    1.05{col 46}{space 3}0.292{col 54}{space 4}-.4025068{col 67}{space 3} 1.336317
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2}-.8969603{col 26}{space 2} .2525914{col 37}{space 1}   -3.55{col 46}{space 3}0.000{col 54}{space 4}-1.392127{col 67}{space 3}-.4017933
{txt}High Educ..  {c |}{col 14}{res}{space 2}-1.587053{col 26}{space 2} .2397996{col 37}{space 1}   -6.62{col 46}{space 3}0.000{col 54}{space 4}-2.057144{col 67}{space 3}-1.116963
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2}-1.100051{col 26}{space 2} .1794513{col 37}{space 1}   -6.13{col 46}{space 3}0.000{col 54}{space 4}-1.451838{col 67}{space 3}-.7482636
{txt}High Income  {c |}{col 14}{res}{space 2}-1.167181{col 26}{space 2} .1708314{col 37}{space 1}   -6.83{col 46}{space 3}0.000{col 54}{space 4}-1.502071{col 67}{space 3}-.8322924
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2} .5383181{col 26}{space 2} .3325356{col 37}{space 1}    1.62{col 46}{space 3}0.106{col 54}{space 4}-.1135674{col 67}{space 3} 1.190204
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} 1.322737{col 26}{space 2} .4471271{col 37}{space 1}    2.96{col 46}{space 3}0.003{col 54}{space 4} .4462126{col 67}{space 3} 2.199262
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2}-.0262112{col 26}{space 2} .1558534{col 37}{space 1}   -0.17{col 46}{space 3}0.866{col 54}{space 4}-.3317381{col 67}{space 3} .2793157
{txt}{space 7}2015  {c |}{col 14}{res}{space 2}-.0384918{col 26}{space 2} .1571914{col 37}{space 1}   -0.24{col 46}{space 3}0.807{col 54}{space 4}-.3466416{col 67}{space 3}  .269658
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}  -.18356{col 26}{space 2} .1548147{col 37}{space 1}   -1.19{col 46}{space 3}0.236{col 54}{space 4}-.4870506{col 67}{space 3} .1199306
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0072266{col 26}{space 2} .1506374{col 37}{space 1}    0.05{col 46}{space 3}0.962{col 54}{space 4}-.2880751{col 67}{space 3} .3025282
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0043694{col 26}{space 2} .2269525{col 37}{space 1}    0.02{col 46}{space 3}0.985{col 54}{space 4}-.4405364{col 67}{space 3} .4492753
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2}  -2.6448{col 26}{space 2} 2.892483{col 37}{space 1}   -0.91{col 46}{space 3}0.361{col 54}{space 4}-8.315072{col 67}{space 3} 3.025473
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-3.955376{col 26}{space 2} 2.880426{col 37}{space 1}   -1.37{col 46}{space 3}0.170{col 54}{space 4}-9.602012{col 67}{space 3} 1.691261
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-2.775889{col 26}{space 2} 2.877026{col 37}{space 1}   -0.96{col 46}{space 3}0.335{col 54}{space 4} -8.41586{col 67}{space 3} 2.864083
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-2.654195{col 26}{space 2} 2.862048{col 37}{space 1}   -0.93{col 46}{space 3}0.354{col 54}{space 4}-8.264805{col 67}{space 3} 2.956415
{txt}{space 9}CO  {c |}{col 14}{res}{space 2}-3.065637{col 26}{space 2} 2.867544{col 37}{space 1}   -1.07{col 46}{space 3}0.285{col 54}{space 4}-8.687022{col 67}{space 3} 2.555747
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-3.345856{col 26}{space 2} 2.867183{col 37}{space 1}   -1.17{col 46}{space 3}0.243{col 54}{space 4}-8.966532{col 67}{space 3}  2.27482
{txt}{space 9}DC  {c |}{col 14}{res}{space 2}-2.014318{col 26}{space 2} 2.998319{col 37}{space 1}   -0.67{col 46}{space 3}0.502{col 54}{space 4}-7.892066{col 67}{space 3} 3.863431
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-2.779125{col 26}{space 2} 3.070459{col 37}{space 1}   -0.91{col 46}{space 3}0.365{col 54}{space 4}-8.798292{col 67}{space 3} 3.240042
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-2.623216{col 26}{space 2} 2.866809{col 37}{space 1}   -0.92{col 46}{space 3}0.360{col 54}{space 4}-8.243159{col 67}{space 3} 2.996726
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-3.121959{col 26}{space 2} 2.869382{col 37}{space 1}   -1.09{col 46}{space 3}0.277{col 54}{space 4}-8.746945{col 67}{space 3} 2.503027
{txt}{space 9}HI  {c |}{col 14}{res}{space 2}-3.757098{col 26}{space 2}  2.92473{col 37}{space 1}   -1.28{col 46}{space 3}0.199{col 54}{space 4}-9.490585{col 67}{space 3}  1.97639
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-3.223608{col 26}{space 2} 2.883439{col 37}{space 1}   -1.12{col 46}{space 3}0.264{col 54}{space 4}-8.876152{col 67}{space 3} 2.428935
{txt}{space 9}ID  {c |}{col 14}{res}{space 2} -3.48583{col 26}{space 2} 2.884211{col 37}{space 1}   -1.21{col 46}{space 3}0.227{col 54}{space 4}-9.139886{col 67}{space 3} 2.168226
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-3.126462{col 26}{space 2} 2.864308{col 37}{space 1}   -1.09{col 46}{space 3}0.275{col 54}{space 4}-8.741502{col 67}{space 3} 2.488579
{txt}{space 9}IN  {c |}{col 14}{res}{space 2}-2.822101{col 26}{space 2} 2.876075{col 37}{space 1}   -0.98{col 46}{space 3}0.327{col 54}{space 4}-8.460209{col 67}{space 3} 2.816006
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-2.641904{col 26}{space 2} 2.891056{col 37}{space 1}   -0.91{col 46}{space 3}0.361{col 54}{space 4}-8.309379{col 67}{space 3} 3.025571
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-3.269467{col 26}{space 2} 2.885317{col 37}{space 1}   -1.13{col 46}{space 3}0.257{col 54}{space 4}-8.925692{col 67}{space 3} 2.386759
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-1.449897{col 26}{space 2}  2.97184{col 37}{space 1}   -0.49{col 46}{space 3}0.626{col 54}{space 4}-7.275737{col 67}{space 3} 4.375943
{txt}{space 9}MA  {c |}{col 14}{res}{space 2} -2.58797{col 26}{space 2} 2.873274{col 37}{space 1}   -0.90{col 46}{space 3}0.368{col 54}{space 4}-8.220587{col 67}{space 3} 3.044646
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-2.950267{col 26}{space 2} 2.874655{col 37}{space 1}   -1.03{col 46}{space 3}0.305{col 54}{space 4}-8.585591{col 67}{space 3} 2.685056
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-2.986355{col 26}{space 2}  2.89202{col 37}{space 1}   -1.03{col 46}{space 3}0.302{col 54}{space 4}-8.655719{col 67}{space 3}  2.68301
{txt}{space 9}MI  {c |}{col 14}{res}{space 2}-2.975336{col 26}{space 2} 2.865113{col 37}{space 1}   -1.04{col 46}{space 3}0.299{col 54}{space 4}-8.591953{col 67}{space 3} 2.641282
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-3.307491{col 26}{space 2} 2.867776{col 37}{space 1}   -1.15{col 46}{space 3}0.249{col 54}{space 4}-8.929329{col 67}{space 3} 2.314347
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-3.173594{col 26}{space 2} 2.872044{col 37}{space 1}   -1.10{col 46}{space 3}0.269{col 54}{space 4}-8.803799{col 67}{space 3}  2.45661
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-2.307674{col 26}{space 2} 2.987086{col 37}{space 1}   -0.77{col 46}{space 3}0.440{col 54}{space 4}-8.163401{col 67}{space 3} 3.548053
{txt}{space 9}MT  {c |}{col 14}{res}{space 2}-3.098311{col 26}{space 2} 2.944719{col 37}{space 1}   -1.05{col 46}{space 3}0.293{col 54}{space 4}-8.870984{col 67}{space 3} 2.674362
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-2.742631{col 26}{space 2} 2.870873{col 37}{space 1}   -0.96{col 46}{space 3}0.339{col 54}{space 4} -8.37054{col 67}{space 3} 2.885278
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-2.179124{col 26}{space 2}  2.95974{col 37}{space 1}   -0.74{col 46}{space 3}0.462{col 54}{space 4}-7.981243{col 67}{space 3} 3.622995
{txt}{space 9}NE  {c |}{col 14}{res}{space 2}-2.881931{col 26}{space 2} 2.881487{col 37}{space 1}   -1.00{col 46}{space 3}0.317{col 54}{space 4}-8.530648{col 67}{space 3} 2.766785
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-3.655208{col 26}{space 2} 2.891805{col 37}{space 1}   -1.26{col 46}{space 3}0.206{col 54}{space 4}-9.324151{col 67}{space 3} 2.013735
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2} -2.47654{col 26}{space 2} 2.873141{col 37}{space 1}   -0.86{col 46}{space 3}0.389{col 54}{space 4}-8.108896{col 67}{space 3} 3.155816
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-3.751076{col 26}{space 2} 2.925299{col 37}{space 1}   -1.28{col 46}{space 3}0.200{col 54}{space 4} -9.48568{col 67}{space 3} 1.983528
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}-2.432447{col 26}{space 2} 2.901416{col 37}{space 1}   -0.84{col 46}{space 3}0.402{col 54}{space 4}-8.120231{col 67}{space 3} 3.255337
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-2.915917{col 26}{space 2} 2.862256{col 37}{space 1}   -1.02{col 46}{space 3}0.308{col 54}{space 4}-8.526934{col 67}{space 3} 2.695101
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-3.173824{col 26}{space 2} 2.863073{col 37}{space 1}   -1.11{col 46}{space 3}0.268{col 54}{space 4}-8.786442{col 67}{space 3} 2.438795
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-1.109675{col 26}{space 2} 2.941751{col 37}{space 1}   -0.38{col 46}{space 3}0.706{col 54}{space 4} -6.87653{col 67}{space 3} 4.657181
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-3.789947{col 26}{space 2} 2.861578{col 37}{space 1}   -1.32{col 46}{space 3}0.185{col 54}{space 4}-9.399636{col 67}{space 3} 1.819741
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-3.109968{col 26}{space 2} 2.862681{col 37}{space 1}   -1.09{col 46}{space 3}0.277{col 54}{space 4}-8.721819{col 67}{space 3} 2.501883
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-1.912648{col 26}{space 2} 2.971644{col 37}{space 1}   -0.64{col 46}{space 3}0.520{col 54}{space 4}-7.738104{col 67}{space 3} 3.912808
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-3.222655{col 26}{space 2} 2.877982{col 37}{space 1}   -1.12{col 46}{space 3}0.263{col 54}{space 4}  -8.8645{col 67}{space 3}  2.41919
{txt}{space 9}SD  {c |}{col 14}{res}{space 2}-3.676313{col 26}{space 2} 2.910496{col 37}{space 1}   -1.26{col 46}{space 3}0.207{col 54}{space 4}-9.381899{col 67}{space 3} 2.029272
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-2.846417{col 26}{space 2} 2.872015{col 37}{space 1}   -0.99{col 46}{space 3}0.322{col 54}{space 4}-8.476565{col 67}{space 3} 2.783731
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-2.488821{col 26}{space 2} 2.864796{col 37}{space 1}   -0.87{col 46}{space 3}0.385{col 54}{space 4}-8.104817{col 67}{space 3} 3.127175
{txt}{space 9}UT  {c |}{col 14}{res}{space 2}-2.608133{col 26}{space 2} 2.906177{col 37}{space 1}   -0.90{col 46}{space 3}0.370{col 54}{space 4}-8.305252{col 67}{space 3} 3.088985
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}-2.620803{col 26}{space 2} 2.874361{col 37}{space 1}   -0.91{col 46}{space 3}0.362{col 54}{space 4}-8.255551{col 67}{space 3} 3.013945
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}-3.813928{col 26}{space 2} 2.885674{col 37}{space 1}   -1.32{col 46}{space 3}0.186{col 54}{space 4}-9.470852{col 67}{space 3} 1.842997
{txt}{space 9}WA  {c |}{col 14}{res}{space 2}-3.226051{col 26}{space 2}  2.86717{col 37}{space 1}   -1.13{col 46}{space 3}0.261{col 54}{space 4}-8.846702{col 67}{space 3}   2.3946
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-3.234324{col 26}{space 2} 2.865814{col 37}{space 1}   -1.13{col 46}{space 3}0.259{col 54}{space 4}-8.852315{col 67}{space 3} 2.383668
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-2.843147{col 26}{space 2} 2.921456{col 37}{space 1}   -0.97{col 46}{space 3}0.330{col 54}{space 4}-8.570216{col 67}{space 3} 2.883923
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-3.897366{col 26}{space 2} 2.902782{col 37}{space 1}   -1.34{col 46}{space 3}0.179{col 54}{space 4}-9.587829{col 67}{space 3} 1.793096
{txt}{space 12} {c |}
{space 7}2.Q33 {c |}{col 14}{res}{space 2}  .123617{col 26}{space 2} .1020817{col 37}{space 1}    1.21{col 46}{space 3}0.226{col 54}{space 4}-.0764987{col 67}{space 3} .3237327
{txt}{space 7}2.Q34 {c |}{col 14}{res}{space 2}-1.005774{col 26}{space 2} .2390909{col 37}{space 1}   -4.21{col 46}{space 3}0.000{col 54}{space 4}-1.474475{col 67}{space 3}-.5370723
{txt}{space 7}Q35_1 {c |}{col 14}{res}{space 2}-1.387973{col 26}{space 2} .3055727{col 37}{space 1}   -4.54{col 46}{space 3}0.000{col 54}{space 4}-1.987002{col 67}{space 3}-.7889441
{txt}{space 7}Q35_2 {c |}{col 14}{res}{space 2} .7004477{col 26}{space 2} .3320286{col 37}{space 1}    2.11{col 46}{space 3}0.035{col 54}{space 4} .0495562{col 67}{space 3} 1.351339
{txt}{space 7}Q35_3 {c |}{col 14}{res}{space 2}-.0382279{col 26}{space 2} .3642982{col 37}{space 1}   -0.10{col 46}{space 3}0.916{col 54}{space 4}-.7523792{col 67}{space 3} .6759233
{txt}{space 7}Q35_4 {c |}{col 14}{res}{space 2}-.8268426{col 26}{space 2} .3551737{col 37}{space 1}   -2.33{col 46}{space 3}0.020{col 54}{space 4}-1.523107{col 67}{space 3}-.1305787
{txt}{space 7}Q35_5 {c |}{col 14}{res}{space 2} -.119828{col 26}{space 2} .8106079{col 37}{space 1}   -0.15{col 46}{space 3}0.882{col 54}{space 4}-1.708901{col 67}{space 3} 1.469245
{txt}{space 7}Q35_6 {c |}{col 14}{res}{space 2}-.7804938{col 26}{space 2} .3510704{col 37}{space 1}   -2.22{col 46}{space 3}0.026{col 54}{space 4}-1.468714{col 67}{space 3}-.0922738
{txt}{space 7}Q4new {c |}{col 14}{res}{space 2}  .007533{col 26}{space 2} .0025062{col 37}{space 1}    3.01{col 46}{space 3}0.003{col 54}{space 4}   .00262{col 67}{space 3} .0124459
{txt}{space 7}Q6new {c |}{col 14}{res}{space 2} .0055411{col 26}{space 2} .0024596{col 37}{space 1}    2.25{col 46}{space 3}0.024{col 54}{space 4} .0007195{col 67}{space 3} .0103628
{txt}{space 5}Q9_mean {c |}{col 14}{res}{space 2}-.0901253{col 26}{space 2} .0134826{col 37}{space 1}   -6.68{col 46}{space 3}0.000{col 54}{space 4}-.1165559{col 67}{space 3}-.0636947
{txt}{space 6}Q13new {c |}{col 14}{res}{space 2} .0038595{col 26}{space 2} .0028354{col 37}{space 1}    1.36{col 46}{space 3}0.174{col 54}{space 4}-.0016989{col 67}{space 3} .0094179
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 8.928126{col 26}{space 2} 2.930381{col 37}{space 1}    3.05{col 46}{space 3}0.002{col 54}{space 4} 3.183559{col 67}{space 3} 14.67269
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est6{txt} stored)

Linear regression                                      Number of obs ={res}    6620
                                                       {txt}F( 63,  6556) ={res}    3.86
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0336
                                                       {txt}Root MSE      = {res} 2.4259

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}    Q24_mean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2}-.1753057{col 26}{space 2} .1605004{col 37}{space 1}   -1.09{col 46}{space 3}0.275{col 54}{space 4}-.4899388{col 67}{space 3} .1393275
{txt}{space 8}Old  {c |}{col 14}{res}{space 2}-.1391656{col 26}{space 2} .2347127{col 37}{space 1}   -0.59{col 46}{space 3}0.553{col 54}{space 4} -.599279{col 67}{space 3} .3209477
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2} -.020663{col 26}{space 2}   .11495{col 37}{space 1}   -0.18{col 46}{space 3}0.857{col 54}{space 4}-.2460024{col 67}{space 3} .2046764
{txt}High Educ..  {c |}{col 14}{res}{space 2} .0617277{col 26}{space 2} .1118388{col 37}{space 1}    0.55{col 46}{space 3}0.581{col 54}{space 4}-.1575128{col 67}{space 3} .2809681
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2}-.1082471{col 26}{space 2} .0943664{col 37}{space 1}   -1.15{col 46}{space 3}0.251{col 54}{space 4}-.2932361{col 67}{space 3} .0767418
{txt}High Income  {c |}{col 14}{res}{space 2} .2497436{col 26}{space 2} .0932573{col 37}{space 1}    2.68{col 46}{space 3}0.007{col 54}{space 4} .0669289{col 67}{space 3} .4325583
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2} .0367845{col 26}{space 2} .1748971{col 37}{space 1}    0.21{col 46}{space 3}0.833{col 54}{space 4}-.3060709{col 67}{space 3} .3796399
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2}  .398961{col 26}{space 2} .2416737{col 37}{space 1}    1.65{col 46}{space 3}0.099{col 54}{space 4}-.0747981{col 67}{space 3} .8727202
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2} .2735997{col 26}{space 2} .0984692{col 37}{space 1}    2.78{col 46}{space 3}0.005{col 54}{space 4} .0805681{col 67}{space 3} .4666314
{txt}{space 7}2015  {c |}{col 14}{res}{space 2} .2250111{col 26}{space 2} .0956697{col 37}{space 1}    2.35{col 46}{space 3}0.019{col 54}{space 4} .0374672{col 67}{space 3} .4125549
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1419988{col 26}{space 2} .0952871{col 37}{space 1}    1.49{col 46}{space 3}0.136{col 54}{space 4}-.0447949{col 67}{space 3} .3287925
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .3087754{col 26}{space 2} .0957162{col 37}{space 1}    3.23{col 46}{space 3}0.001{col 54}{space 4} .1211406{col 67}{space 3} .4964103
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .2991406{col 26}{space 2}  .130108{col 37}{space 1}    2.30{col 46}{space 3}0.022{col 54}{space 4} .0440865{col 67}{space 3} .5541946
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2} .0458318{col 26}{space 2} 1.255659{col 37}{space 1}    0.04{col 46}{space 3}0.971{col 54}{space 4}-2.415669{col 67}{space 3} 2.507332
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-.1317381{col 26}{space 2}  1.27262{col 37}{space 1}   -0.10{col 46}{space 3}0.918{col 54}{space 4}-2.626488{col 67}{space 3} 2.363012
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2} .1822855{col 26}{space 2} 1.247167{col 37}{space 1}    0.15{col 46}{space 3}0.884{col 54}{space 4}-2.262568{col 67}{space 3} 2.627139
{txt}{space 9}CA  {c |}{col 14}{res}{space 2} .3389745{col 26}{space 2} 1.230859{col 37}{space 1}    0.28{col 46}{space 3}0.783{col 54}{space 4} -2.07391{col 67}{space 3} 2.751859
{txt}{space 9}CO  {c |}{col 14}{res}{space 2} .1888057{col 26}{space 2} 1.244263{col 37}{space 1}    0.15{col 46}{space 3}0.879{col 54}{space 4}-2.250356{col 67}{space 3} 2.627967
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-.0228811{col 26}{space 2} 1.254727{col 37}{space 1}   -0.02{col 46}{space 3}0.985{col 54}{space 4}-2.482555{col 67}{space 3} 2.436793
{txt}{space 9}DC  {c |}{col 14}{res}{space 2} .5940683{col 26}{space 2} 1.328809{col 37}{space 1}    0.45{col 46}{space 3}0.655{col 54}{space 4} -2.01083{col 67}{space 3} 3.198967
{txt}{space 9}DE  {c |}{col 14}{res}{space 2} .7754374{col 26}{space 2} 1.368954{col 37}{space 1}    0.57{col 46}{space 3}0.571{col 54}{space 4}-1.908158{col 67}{space 3} 3.459033
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-.0850373{col 26}{space 2} 1.233087{col 37}{space 1}   -0.07{col 46}{space 3}0.945{col 54}{space 4} -2.50229{col 67}{space 3} 2.332215
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-.0076105{col 26}{space 2} 1.239074{col 37}{space 1}   -0.01{col 46}{space 3}0.995{col 54}{space 4}-2.436599{col 67}{space 3} 2.421378
{txt}{space 9}HI  {c |}{col 14}{res}{space 2} .5860203{col 26}{space 2} 1.382175{col 37}{space 1}    0.42{col 46}{space 3}0.672{col 54}{space 4}-2.123492{col 67}{space 3} 3.295533
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-.3073051{col 26}{space 2} 1.246298{col 37}{space 1}   -0.25{col 46}{space 3}0.805{col 54}{space 4}-2.750456{col 67}{space 3} 2.135846
{txt}{space 9}ID  {c |}{col 14}{res}{space 2} .3729855{col 26}{space 2} 1.284906{col 37}{space 1}    0.29{col 46}{space 3}0.772{col 54}{space 4} -2.14585{col 67}{space 3} 2.891821
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-.0785398{col 26}{space 2} 1.232819{col 37}{space 1}   -0.06{col 46}{space 3}0.949{col 54}{space 4}-2.495266{col 67}{space 3} 2.338187
{txt}{space 9}IN  {c |}{col 14}{res}{space 2} .0352223{col 26}{space 2} 1.241594{col 37}{space 1}    0.03{col 46}{space 3}0.977{col 54}{space 4}-2.398706{col 67}{space 3}  2.46915
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-.4809999{col 26}{space 2} 1.255411{col 37}{space 1}   -0.38{col 46}{space 3}0.702{col 54}{space 4}-2.942014{col 67}{space 3} 1.980014
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-.6065046{col 26}{space 2} 1.248231{col 37}{space 1}   -0.49{col 46}{space 3}0.627{col 54}{space 4}-3.053445{col 67}{space 3} 1.840435
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-.1181554{col 26}{space 2} 1.266616{col 37}{space 1}   -0.09{col 46}{space 3}0.926{col 54}{space 4}-2.601136{col 67}{space 3} 2.364825
{txt}{space 9}MA  {c |}{col 14}{res}{space 2} .1763395{col 26}{space 2} 1.237411{col 37}{space 1}    0.14{col 46}{space 3}0.887{col 54}{space 4}-2.249389{col 67}{space 3} 2.602068
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-.2333724{col 26}{space 2} 1.240418{col 37}{space 1}   -0.19{col 46}{space 3}0.851{col 54}{space 4}-2.664996{col 67}{space 3} 2.198251
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-.0986373{col 26}{space 2} 1.280922{col 37}{space 1}   -0.08{col 46}{space 3}0.939{col 54}{space 4}-2.609662{col 67}{space 3} 2.412388
{txt}{space 9}MI  {c |}{col 14}{res}{space 2}-.0167896{col 26}{space 2} 1.236687{col 37}{space 1}   -0.01{col 46}{space 3}0.989{col 54}{space 4}  -2.4411{col 67}{space 3} 2.407521
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-.1052711{col 26}{space 2} 1.241105{col 37}{space 1}   -0.08{col 46}{space 3}0.932{col 54}{space 4}-2.538241{col 67}{space 3} 2.327699
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-.0472373{col 26}{space 2} 1.242586{col 37}{space 1}   -0.04{col 46}{space 3}0.970{col 54}{space 4}-2.483111{col 67}{space 3} 2.388636
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-.2687636{col 26}{space 2} 1.276623{col 37}{space 1}   -0.21{col 46}{space 3}0.833{col 54}{space 4} -2.77136{col 67}{space 3} 2.233833
{txt}{space 9}MT  {c |}{col 14}{res}{space 2} .1829608{col 26}{space 2} 1.368788{col 37}{space 1}    0.13{col 46}{space 3}0.894{col 54}{space 4}-2.500309{col 67}{space 3} 2.866231
{txt}{space 9}NC  {c |}{col 14}{res}{space 2} .2899846{col 26}{space 2} 1.239151{col 37}{space 1}    0.23{col 46}{space 3}0.815{col 54}{space 4}-2.139155{col 67}{space 3} 2.719124
{txt}{space 9}ND  {c |}{col 14}{res}{space 2} .2152897{col 26}{space 2} 1.385948{col 37}{space 1}    0.16{col 46}{space 3}0.877{col 54}{space 4}-2.501621{col 67}{space 3}   2.9322
{txt}{space 9}NE  {c |}{col 14}{res}{space 2} .1407086{col 26}{space 2} 1.258237{col 37}{space 1}    0.11{col 46}{space 3}0.911{col 54}{space 4}-2.325845{col 67}{space 3} 2.607262
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-.3180418{col 26}{space 2} 1.277435{col 37}{space 1}   -0.25{col 46}{space 3}0.803{col 54}{space 4} -2.82223{col 67}{space 3} 2.186146
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-.2612745{col 26}{space 2} 1.235484{col 37}{space 1}   -0.21{col 46}{space 3}0.833{col 54}{space 4}-2.683226{col 67}{space 3} 2.160677
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-1.063592{col 26}{space 2} 1.287146{col 37}{space 1}   -0.83{col 46}{space 3}0.409{col 54}{space 4}-3.586818{col 67}{space 3} 1.459633
{txt}{space 9}NV  {c |}{col 14}{res}{space 2} 1.003287{col 26}{space 2} 1.296059{col 37}{space 1}    0.77{col 46}{space 3}0.439{col 54}{space 4} -1.53741{col 67}{space 3} 3.543984
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-.0076727{col 26}{space 2} 1.232133{col 37}{space 1}   -0.01{col 46}{space 3}0.995{col 54}{space 4}-2.423054{col 67}{space 3} 2.407709
{txt}{space 9}OH  {c |}{col 14}{res}{space 2} .0411416{col 26}{space 2} 1.233913{col 37}{space 1}    0.03{col 46}{space 3}0.973{col 54}{space 4}-2.377731{col 67}{space 3} 2.460014
{txt}{space 9}OK  {c |}{col 14}{res}{space 2} .3217837{col 26}{space 2} 1.275908{col 37}{space 1}    0.25{col 46}{space 3}0.801{col 54}{space 4}-2.179412{col 67}{space 3} 2.822979
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-.1276212{col 26}{space 2} 1.244339{col 37}{space 1}   -0.10{col 46}{space 3}0.918{col 54}{space 4}-2.566931{col 67}{space 3} 2.311689
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-.3147167{col 26}{space 2} 1.231057{col 37}{space 1}   -0.26{col 46}{space 3}0.798{col 54}{space 4} -2.72799{col 67}{space 3} 2.098556
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-.1429718{col 26}{space 2} 1.304254{col 37}{space 1}   -0.11{col 46}{space 3}0.913{col 54}{space 4}-2.699735{col 67}{space 3} 2.413792
{txt}{space 9}SC  {c |}{col 14}{res}{space 2} .5383402{col 26}{space 2} 1.267937{col 37}{space 1}    0.42{col 46}{space 3}0.671{col 54}{space 4}-1.947229{col 67}{space 3} 3.023909
{txt}{space 9}SD  {c |}{col 14}{res}{space 2} 2.070231{col 26}{space 2} 1.442462{col 37}{space 1}    1.44{col 46}{space 3}0.151{col 54}{space 4}-.7574652{col 67}{space 3} 4.897927
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-.0031341{col 26}{space 2} 1.245771{col 37}{space 1}   -0.00{col 46}{space 3}0.998{col 54}{space 4}-2.445251{col 67}{space 3} 2.438983
{txt}{space 9}TX  {c |}{col 14}{res}{space 2} .4009006{col 26}{space 2} 1.231663{col 37}{space 1}    0.33{col 46}{space 3}0.745{col 54}{space 4}-2.013561{col 67}{space 3} 2.815362
{txt}{space 9}UT  {c |}{col 14}{res}{space 2} .2331969{col 26}{space 2} 1.271418{col 37}{space 1}    0.18{col 46}{space 3}0.854{col 54}{space 4}-2.259196{col 67}{space 3}  2.72559
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}-.0212254{col 26}{space 2} 1.239335{col 37}{space 1}   -0.02{col 46}{space 3}0.986{col 54}{space 4}-2.450726{col 67}{space 3} 2.408275
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}  .788018{col 26}{space 2} 1.311544{col 37}{space 1}    0.60{col 46}{space 3}0.548{col 54}{space 4}-1.783035{col 67}{space 3} 3.359071
{txt}{space 9}WA  {c |}{col 14}{res}{space 2} .2267627{col 26}{space 2} 1.241065{col 37}{space 1}    0.18{col 46}{space 3}0.855{col 54}{space 4}-2.206129{col 67}{space 3} 2.659654
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-.0362929{col 26}{space 2} 1.242597{col 37}{space 1}   -0.03{col 46}{space 3}0.977{col 54}{space 4}-2.472188{col 67}{space 3} 2.399602
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-.0174591{col 26}{space 2} 1.321687{col 37}{space 1}   -0.01{col 46}{space 3}0.989{col 54}{space 4}-2.608397{col 67}{space 3} 2.573478
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-1.051258{col 26}{space 2} 1.270364{col 37}{space 1}   -0.83{col 46}{space 3}0.408{col 54}{space 4}-3.541585{col 67}{space 3}  1.43907
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.516312{col 26}{space 2} 1.253695{col 37}{space 1}    2.01{col 46}{space 3}0.045{col 54}{space 4} .0586611{col 67}{space 3} 4.973963
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est7{txt} stored)

Linear regression                                      Number of obs ={res}    6618
                                                       {txt}F( 71,  6546) ={res}    3.78
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0381
                                                       {txt}Root MSE      = {res} 2.4218

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}    Q24_mean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2}-.1932911{col 26}{space 2} .1595769{col 37}{space 1}   -1.21{col 46}{space 3}0.226{col 54}{space 4}-.5061139{col 67}{space 3} .1195317
{txt}{space 8}Old  {c |}{col 14}{res}{space 2}-.1917576{col 26}{space 2} .2351211{col 37}{space 1}   -0.82{col 46}{space 3}0.415{col 54}{space 4}-.6526717{col 67}{space 3} .2691565
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2}-.0008189{col 26}{space 2} .1153869{col 37}{space 1}   -0.01{col 46}{space 3}0.994{col 54}{space 4} -.227015{col 67}{space 3} .2253771
{txt}High Educ..  {c |}{col 14}{res}{space 2} .0707138{col 26}{space 2} .1121611{col 37}{space 1}    0.63{col 46}{space 3}0.528{col 54}{space 4}-.1491586{col 67}{space 3} .2905862
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2}-.1305277{col 26}{space 2} .0944375{col 37}{space 1}   -1.38{col 46}{space 3}0.167{col 54}{space 4}-.3156561{col 67}{space 3} .0546007
{txt}High Income  {c |}{col 14}{res}{space 2} .1880203{col 26}{space 2} .0948118{col 37}{space 1}    1.98{col 46}{space 3}0.047{col 54}{space 4} .0021583{col 67}{space 3} .3738824
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2} .0276737{col 26}{space 2} .1758539{col 37}{space 1}    0.16{col 46}{space 3}0.875{col 54}{space 4}-.3170573{col 67}{space 3} .3724047
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} .3742981{col 26}{space 2} .2416412{col 37}{space 1}    1.55{col 46}{space 3}0.121{col 54}{space 4}-.0993974{col 67}{space 3} .8479937
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2} .2667458{col 26}{space 2} .0983527{col 37}{space 1}    2.71{col 46}{space 3}0.007{col 54}{space 4} .0739424{col 67}{space 3} .4595491
{txt}{space 7}2015  {c |}{col 14}{res}{space 2} .2300186{col 26}{space 2} .0955679{col 37}{space 1}    2.41{col 46}{space 3}0.016{col 54}{space 4} .0426743{col 67}{space 3} .4173629
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1491274{col 26}{space 2} .0953154{col 37}{space 1}    1.56{col 46}{space 3}0.118{col 54}{space 4}-.0377219{col 67}{space 3} .3359766
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .3134812{col 26}{space 2} .0958645{col 37}{space 1}    3.27{col 46}{space 3}0.001{col 54}{space 4} .1255555{col 67}{space 3} .5014068
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .3056256{col 26}{space 2} .1296203{col 37}{space 1}    2.36{col 46}{space 3}0.018{col 54}{space 4} .0515274{col 67}{space 3} .5597238
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2} .1278058{col 26}{space 2} 1.229013{col 37}{space 1}    0.10{col 46}{space 3}0.917{col 54}{space 4}-2.281461{col 67}{space 3} 2.537073
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-.0551595{col 26}{space 2} 1.246178{col 37}{space 1}   -0.04{col 46}{space 3}0.965{col 54}{space 4}-2.498076{col 67}{space 3} 2.387757
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2} .2860991{col 26}{space 2}  1.22013{col 37}{space 1}    0.23{col 46}{space 3}0.815{col 54}{space 4}-2.105753{col 67}{space 3} 2.677951
{txt}{space 9}CA  {c |}{col 14}{res}{space 2} .4096844{col 26}{space 2} 1.203189{col 37}{space 1}    0.34{col 46}{space 3}0.733{col 54}{space 4}-1.948958{col 67}{space 3} 2.768327
{txt}{space 9}CO  {c |}{col 14}{res}{space 2} .2634183{col 26}{space 2} 1.216691{col 37}{space 1}    0.22{col 46}{space 3}0.829{col 54}{space 4}-2.121694{col 67}{space 3}  2.64853
{txt}{space 9}CT  {c |}{col 14}{res}{space 2} .0753198{col 26}{space 2} 1.227232{col 37}{space 1}    0.06{col 46}{space 3}0.951{col 54}{space 4}-2.330456{col 67}{space 3} 2.481096
{txt}{space 9}DC  {c |}{col 14}{res}{space 2} .6752201{col 26}{space 2} 1.305229{col 37}{space 1}    0.52{col 46}{space 3}0.605{col 54}{space 4}-1.883456{col 67}{space 3} 3.233896
{txt}{space 9}DE  {c |}{col 14}{res}{space 2} .8426632{col 26}{space 2}  1.34319{col 37}{space 1}    0.63{col 46}{space 3}0.530{col 54}{space 4}-1.790429{col 67}{space 3} 3.475755
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-.0031876{col 26}{space 2}  1.20532{col 37}{space 1}   -0.00{col 46}{space 3}0.998{col 54}{space 4}-2.366008{col 67}{space 3} 2.359632
{txt}{space 9}GA  {c |}{col 14}{res}{space 2} .0499868{col 26}{space 2} 1.212444{col 37}{space 1}    0.04{col 46}{space 3}0.967{col 54}{space 4}  -2.3268{col 67}{space 3} 2.426773
{txt}{space 9}HI  {c |}{col 14}{res}{space 2} .8378224{col 26}{space 2} 1.386838{col 37}{space 1}    0.60{col 46}{space 3}0.546{col 54}{space 4}-1.880833{col 67}{space 3} 3.556477
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-.2393372{col 26}{space 2} 1.218748{col 37}{space 1}   -0.20{col 46}{space 3}0.844{col 54}{space 4}-2.628482{col 67}{space 3} 2.149807
{txt}{space 9}ID  {c |}{col 14}{res}{space 2} .4432306{col 26}{space 2} 1.259367{col 37}{space 1}    0.35{col 46}{space 3}0.725{col 54}{space 4} -2.02554{col 67}{space 3} 2.912001
{txt}{space 9}IL  {c |}{col 14}{res}{space 2} -.003745{col 26}{space 2} 1.205259{col 37}{space 1}   -0.00{col 46}{space 3}0.998{col 54}{space 4}-2.366447{col 67}{space 3} 2.358957
{txt}{space 9}IN  {c |}{col 14}{res}{space 2} .0911209{col 26}{space 2} 1.214292{col 37}{space 1}    0.08{col 46}{space 3}0.940{col 54}{space 4}-2.289289{col 67}{space 3} 2.471531
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-.3904883{col 26}{space 2} 1.229061{col 37}{space 1}   -0.32{col 46}{space 3}0.751{col 54}{space 4} -2.79985{col 67}{space 3} 2.018873
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-.5237385{col 26}{space 2} 1.221227{col 37}{space 1}   -0.43{col 46}{space 3}0.668{col 54}{space 4}-2.917741{col 67}{space 3} 1.870264
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-.0644552{col 26}{space 2} 1.239778{col 37}{space 1}   -0.05{col 46}{space 3}0.959{col 54}{space 4}-2.494825{col 67}{space 3} 2.365914
{txt}{space 9}MA  {c |}{col 14}{res}{space 2} .2689758{col 26}{space 2} 1.209889{col 37}{space 1}    0.22{col 46}{space 3}0.824{col 54}{space 4}-2.102801{col 67}{space 3} 2.640753
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-.1360249{col 26}{space 2} 1.213268{col 37}{space 1}   -0.11{col 46}{space 3}0.911{col 54}{space 4}-2.514426{col 67}{space 3} 2.242376
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-.0016891{col 26}{space 2} 1.253614{col 37}{space 1}   -0.00{col 46}{space 3}0.999{col 54}{space 4}-2.459181{col 67}{space 3} 2.455803
{txt}{space 9}MI  {c |}{col 14}{res}{space 2} .0465782{col 26}{space 2} 1.209242{col 37}{space 1}    0.04{col 46}{space 3}0.969{col 54}{space 4} -2.32393{col 67}{space 3} 2.417087
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-.0308865{col 26}{space 2} 1.213681{col 37}{space 1}   -0.03{col 46}{space 3}0.980{col 54}{space 4}-2.410097{col 67}{space 3} 2.348324
{txt}{space 9}MO  {c |}{col 14}{res}{space 2} .0458495{col 26}{space 2} 1.215395{col 37}{space 1}    0.04{col 46}{space 3}0.970{col 54}{space 4}-2.336721{col 67}{space 3}  2.42842
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-.1926792{col 26}{space 2} 1.250063{col 37}{space 1}   -0.15{col 46}{space 3}0.878{col 54}{space 4}-2.643211{col 67}{space 3} 2.257852
{txt}{space 9}MT  {c |}{col 14}{res}{space 2} .2799717{col 26}{space 2}  1.34805{col 37}{space 1}    0.21{col 46}{space 3}0.835{col 54}{space 4}-2.362646{col 67}{space 3} 2.922589
{txt}{space 9}NC  {c |}{col 14}{res}{space 2} .3646556{col 26}{space 2} 1.211735{col 37}{space 1}    0.30{col 46}{space 3}0.763{col 54}{space 4}-2.010741{col 67}{space 3} 2.740052
{txt}{space 9}ND  {c |}{col 14}{res}{space 2} .3121038{col 26}{space 2} 1.361748{col 37}{space 1}    0.23{col 46}{space 3}0.819{col 54}{space 4}-2.357367{col 67}{space 3} 2.981575
{txt}{space 9}NE  {c |}{col 14}{res}{space 2} .2293557{col 26}{space 2} 1.231432{col 37}{space 1}    0.19{col 46}{space 3}0.852{col 54}{space 4}-2.184652{col 67}{space 3} 2.643364
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-.2058573{col 26}{space 2} 1.249865{col 37}{space 1}   -0.16{col 46}{space 3}0.869{col 54}{space 4}-2.656001{col 67}{space 3} 2.244286
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-.1957421{col 26}{space 2}  1.20804{col 37}{space 1}   -0.16{col 46}{space 3}0.871{col 54}{space 4}-2.563894{col 67}{space 3}  2.17241
{txt}{space 9}NM  {c |}{col 14}{res}{space 2} -.975382{col 26}{space 2} 1.262412{col 37}{space 1}   -0.77{col 46}{space 3}0.440{col 54}{space 4}-3.450121{col 67}{space 3} 1.499357
{txt}{space 9}NV  {c |}{col 14}{res}{space 2} 1.080947{col 26}{space 2} 1.268616{col 37}{space 1}    0.85{col 46}{space 3}0.394{col 54}{space 4}-1.405956{col 67}{space 3} 3.567849
{txt}{space 9}NY  {c |}{col 14}{res}{space 2} .0610906{col 26}{space 2} 1.204369{col 37}{space 1}    0.05{col 46}{space 3}0.960{col 54}{space 4}-2.299867{col 67}{space 3} 2.422048
{txt}{space 9}OH  {c |}{col 14}{res}{space 2} .0975428{col 26}{space 2} 1.206373{col 37}{space 1}    0.08{col 46}{space 3}0.936{col 54}{space 4}-2.267342{col 67}{space 3} 2.462428
{txt}{space 9}OK  {c |}{col 14}{res}{space 2} .4100115{col 26}{space 2} 1.249258{col 37}{space 1}    0.33{col 46}{space 3}0.743{col 54}{space 4}-2.038942{col 67}{space 3} 2.858965
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-.0329433{col 26}{space 2} 1.216776{col 37}{space 1}   -0.03{col 46}{space 3}0.978{col 54}{space 4}-2.418222{col 67}{space 3} 2.352335
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-.2284487{col 26}{space 2} 1.203584{col 37}{space 1}   -0.19{col 46}{space 3}0.849{col 54}{space 4}-2.587866{col 67}{space 3} 2.130968
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-.1120398{col 26}{space 2}  1.27725{col 37}{space 1}   -0.09{col 46}{space 3}0.930{col 54}{space 4}-2.615867{col 67}{space 3} 2.391788
{txt}{space 9}SC  {c |}{col 14}{res}{space 2} .6184937{col 26}{space 2} 1.240938{col 37}{space 1}    0.50{col 46}{space 3}0.618{col 54}{space 4} -1.81415{col 67}{space 3} 3.051138
{txt}{space 9}SD  {c |}{col 14}{res}{space 2} 2.122627{col 26}{space 2} 1.418919{col 37}{space 1}    1.50{col 46}{space 3}0.135{col 54}{space 4}-.6589178{col 67}{space 3} 4.904172
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}  .062111{col 26}{space 2} 1.218555{col 37}{space 1}    0.05{col 46}{space 3}0.959{col 54}{space 4}-2.326654{col 67}{space 3} 2.450876
{txt}{space 9}TX  {c |}{col 14}{res}{space 2} .4947044{col 26}{space 2}  1.20442{col 37}{space 1}    0.41{col 46}{space 3}0.681{col 54}{space 4}-1.866351{col 67}{space 3}  2.85576
{txt}{space 9}UT  {c |}{col 14}{res}{space 2} .2878861{col 26}{space 2} 1.244696{col 37}{space 1}    0.23{col 46}{space 3}0.817{col 54}{space 4}-2.152125{col 67}{space 3} 2.727897
{txt}{space 9}VA  {c |}{col 14}{res}{space 2} .0396812{col 26}{space 2} 1.211884{col 37}{space 1}    0.03{col 46}{space 3}0.974{col 54}{space 4}-2.336007{col 67}{space 3}  2.41537
{txt}{space 9}VT  {c |}{col 14}{res}{space 2} .8682415{col 26}{space 2} 1.281627{col 37}{space 1}    0.68{col 46}{space 3}0.498{col 54}{space 4}-1.644165{col 67}{space 3} 3.380648
{txt}{space 9}WA  {c |}{col 14}{res}{space 2} .2991227{col 26}{space 2} 1.212859{col 37}{space 1}    0.25{col 46}{space 3}0.805{col 54}{space 4}-2.078476{col 67}{space 3} 2.676721
{txt}{space 9}WI  {c |}{col 14}{res}{space 2} .0587666{col 26}{space 2} 1.215024{col 37}{space 1}    0.05{col 46}{space 3}0.961{col 54}{space 4}-2.323077{col 67}{space 3}  2.44061
{txt}{space 9}WV  {c |}{col 14}{res}{space 2} .0290532{col 26}{space 2} 1.293144{col 37}{space 1}    0.02{col 46}{space 3}0.982{col 54}{space 4}-2.505931{col 67}{space 3} 2.564037
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-.9829579{col 26}{space 2} 1.248301{col 37}{space 1}   -0.79{col 46}{space 3}0.431{col 54}{space 4}-3.430035{col 67}{space 3} 1.464119
{txt}{space 12} {c |}
{space 7}2.Q33 {c |}{col 14}{res}{space 2} .2972664{col 26}{space 2} .0612711{col 37}{space 1}    4.85{col 46}{space 3}0.000{col 54}{space 4} .1771549{col 67}{space 3} .4173778
{txt}{space 7}2.Q34 {c |}{col 14}{res}{space 2} .0109267{col 26}{space 2} .1238766{col 37}{space 1}    0.09{col 46}{space 3}0.930{col 54}{space 4}-.2319119{col 67}{space 3} .2537652
{txt}{space 7}Q35_1 {c |}{col 14}{res}{space 2} .2736562{col 26}{space 2} .1957526{col 37}{space 1}    1.40{col 46}{space 3}0.162{col 54}{space 4}-.1100829{col 67}{space 3} .6573952
{txt}{space 7}Q35_2 {c |}{col 14}{res}{space 2} .3465906{col 26}{space 2} .2038872{col 37}{space 1}    1.70{col 46}{space 3}0.089{col 54}{space 4}-.0530948{col 67}{space 3}  .746276
{txt}{space 7}Q35_3 {c |}{col 14}{res}{space 2} .1295098{col 26}{space 2} .2204172{col 37}{space 1}    0.59{col 46}{space 3}0.557{col 54}{space 4}-.3025798{col 67}{space 3} .5615994
{txt}{space 7}Q35_4 {c |}{col 14}{res}{space 2}  .480267{col 26}{space 2} .2301605{col 37}{space 1}    2.09{col 46}{space 3}0.037{col 54}{space 4} .0290772{col 67}{space 3} .9314567
{txt}{space 7}Q35_5 {c |}{col 14}{res}{space 2} -.614337{col 26}{space 2} .3844673{col 37}{space 1}   -1.60{col 46}{space 3}0.110{col 54}{space 4}-1.368018{col 67}{space 3} .1393443
{txt}{space 7}Q35_6 {c |}{col 14}{res}{space 2} .3141016{col 26}{space 2} .2185459{col 37}{space 1}    1.44{col 46}{space 3}0.151{col 54}{space 4}-.1143196{col 67}{space 3} .7425228
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.030957{col 26}{space 2} 1.258521{col 37}{space 1}    1.61{col 46}{space 3}0.107{col 54}{space 4}-.4361557{col 67}{space 3}  4.49807
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est8{txt} stored)

Linear regression                                      Number of obs ={res}    5704
                                                       {txt}F( 75,  5628) ={res}    5.79
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0697
                                                       {txt}Root MSE      = {res} 2.2553

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}    Q24_mean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2}-.2530127{col 26}{space 2} .1648464{col 37}{space 1}   -1.53{col 46}{space 3}0.125{col 54}{space 4}-.5761752{col 67}{space 3} .0701497
{txt}{space 8}Old  {c |}{col 14}{res}{space 2}-.2524954{col 26}{space 2}  .246607{col 37}{space 1}   -1.02{col 46}{space 3}0.306{col 54}{space 4}-.7359403{col 67}{space 3} .2309494
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2} .0419319{col 26}{space 2} .1151481{col 37}{space 1}    0.36{col 46}{space 3}0.716{col 54}{space 4}-.1838027{col 67}{space 3} .2676665
{txt}High Educ..  {c |}{col 14}{res}{space 2} .0709952{col 26}{space 2} .1111928{col 37}{space 1}    0.64{col 46}{space 3}0.523{col 54}{space 4}-.1469856{col 67}{space 3} .2889759
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2} -.164714{col 26}{space 2} .0975258{col 37}{space 1}   -1.69{col 46}{space 3}0.091{col 54}{space 4}-.3559022{col 67}{space 3} .0264742
{txt}High Income  {c |}{col 14}{res}{space 2} .0951831{col 26}{space 2} .0978278{col 37}{space 1}    0.97{col 46}{space 3}0.331{col 54}{space 4}-.0965971{col 67}{space 3} .2869633
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2} .2005599{col 26}{space 2} .1844118{col 37}{space 1}    1.09{col 46}{space 3}0.277{col 54}{space 4}-.1609582{col 67}{space 3} .5620781
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} .5001622{col 26}{space 2} .2516701{col 37}{space 1}    1.99{col 46}{space 3}0.047{col 54}{space 4} .0067916{col 67}{space 3} .9935327
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2} .1431845{col 26}{space 2} .0988625{col 37}{space 1}    1.45{col 46}{space 3}0.148{col 54}{space 4}-.0506241{col 67}{space 3}  .336993
{txt}{space 7}2015  {c |}{col 14}{res}{space 2} .1625328{col 26}{space 2} .0958701{col 37}{space 1}    1.70{col 46}{space 3}0.090{col 54}{space 4}-.0254095{col 67}{space 3} .3504751
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1339883{col 26}{space 2} .0958999{col 37}{space 1}    1.40{col 46}{space 3}0.162{col 54}{space 4}-.0540124{col 67}{space 3}  .321989
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .2831371{col 26}{space 2} .0980345{col 37}{space 1}    2.89{col 46}{space 3}0.004{col 54}{space 4} .0909517{col 67}{space 3} .4753224
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .2096446{col 26}{space 2} .1299886{col 37}{space 1}    1.61{col 46}{space 3}0.107{col 54}{space 4}-.0451832{col 67}{space 3} .4644725
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2}-2.398892{col 26}{space 2} .9827434{col 37}{space 1}   -2.44{col 46}{space 3}0.015{col 54}{space 4}-4.325448{col 67}{space 3} -.472336
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-2.860737{col 26}{space 2} 1.006533{col 37}{space 1}   -2.84{col 46}{space 3}0.004{col 54}{space 4}-4.833931{col 67}{space 3}-.8875438
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-2.556653{col 26}{space 2} .9686834{col 37}{space 1}   -2.64{col 46}{space 3}0.008{col 54}{space 4}-4.455646{col 67}{space 3}-.6576601
{txt}{space 9}CA  {c |}{col 14}{res}{space 2} -2.38628{col 26}{space 2} .9498351{col 37}{space 1}   -2.51{col 46}{space 3}0.012{col 54}{space 4}-4.248323{col 67}{space 3}-.5242366
{txt}{space 9}CO  {c |}{col 14}{res}{space 2}-2.546378{col 26}{space 2} .9654748{col 37}{space 1}   -2.64{col 46}{space 3}0.008{col 54}{space 4}-4.439081{col 67}{space 3}-.6536754
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-2.648874{col 26}{space 2} .9726418{col 37}{space 1}   -2.72{col 46}{space 3}0.006{col 54}{space 4}-4.555627{col 67}{space 3}-.7421209
{txt}{space 9}DC  {c |}{col 14}{res}{space 2}-2.071723{col 26}{space 2} 1.085974{col 37}{space 1}   -1.91{col 46}{space 3}0.056{col 54}{space 4} -4.20065{col 67}{space 3} .0572039
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-2.125318{col 26}{space 2} 1.141473{col 37}{space 1}   -1.86{col 46}{space 3}0.063{col 54}{space 4}-4.363045{col 67}{space 3}  .112409
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-2.852667{col 26}{space 2} .9514533{col 37}{space 1}   -3.00{col 46}{space 3}0.003{col 54}{space 4}-4.717883{col 67}{space 3} -.987452
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-2.684783{col 26}{space 2} .9583347{col 37}{space 1}   -2.80{col 46}{space 3}0.005{col 54}{space 4}-4.563488{col 67}{space 3}-.8060769
{txt}{space 9}HI  {c |}{col 14}{res}{space 2}-2.685273{col 26}{space 2} 1.114163{col 37}{space 1}   -2.41{col 46}{space 3}0.016{col 54}{space 4}-4.869463{col 67}{space 3}-.5010832
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-2.869575{col 26}{space 2}  .970072{col 37}{space 1}   -2.96{col 46}{space 3}0.003{col 54}{space 4} -4.77129{col 67}{space 3}  -.96786
{txt}{space 9}ID  {c |}{col 14}{res}{space 2}-2.153827{col 26}{space 2} 1.017249{col 37}{space 1}   -2.12{col 46}{space 3}0.034{col 54}{space 4}-4.148028{col 67}{space 3}-.1596263
{txt}{space 9}IL  {c |}{col 14}{res}{space 2} -2.74064{col 26}{space 2} .9501962{col 37}{space 1}   -2.88{col 46}{space 3}0.004{col 54}{space 4}-4.603391{col 67}{space 3}-.8778888
{txt}{space 9}IN  {c |}{col 14}{res}{space 2}  -2.7108{col 26}{space 2} .9626697{col 37}{space 1}   -2.82{col 46}{space 3}0.005{col 54}{space 4}-4.598004{col 67}{space 3}-.8235966
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-2.932525{col 26}{space 2} .9837469{col 37}{space 1}   -2.98{col 46}{space 3}0.003{col 54}{space 4}-4.861049{col 67}{space 3}-1.004002
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-3.147002{col 26}{space 2} .9714435{col 37}{space 1}   -3.24{col 46}{space 3}0.001{col 54}{space 4}-5.051406{col 67}{space 3}-1.242598
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-2.859665{col 26}{space 2} .9945931{col 37}{space 1}   -2.88{col 46}{space 3}0.004{col 54}{space 4}-4.809451{col 67}{space 3}-.9098789
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-2.525469{col 26}{space 2} .9537908{col 37}{space 1}   -2.65{col 46}{space 3}0.008{col 54}{space 4}-4.395267{col 67}{space 3}-.6556712
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-2.906203{col 26}{space 2} .9612457{col 37}{space 1}   -3.02{col 46}{space 3}0.003{col 54}{space 4}-4.790615{col 67}{space 3}-1.021791
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-2.795471{col 26}{space 2} 1.003928{col 37}{space 1}   -2.78{col 46}{space 3}0.005{col 54}{space 4}-4.763558{col 67}{space 3}-.8273844
{txt}{space 9}MI  {c |}{col 14}{res}{space 2}-2.734181{col 26}{space 2} .9551953{col 37}{space 1}   -2.86{col 46}{space 3}0.004{col 54}{space 4}-4.606732{col 67}{space 3}-.8616297
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-2.841015{col 26}{space 2} .9627771{col 37}{space 1}   -2.95{col 46}{space 3}0.003{col 54}{space 4}-4.728429{col 67}{space 3}-.9536004
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-2.760902{col 26}{space 2} .9639782{col 37}{space 1}   -2.86{col 46}{space 3}0.004{col 54}{space 4}-4.650671{col 67}{space 3}-.8711331
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-3.165296{col 26}{space 2} .9803564{col 37}{space 1}   -3.23{col 46}{space 3}0.001{col 54}{space 4}-5.087172{col 67}{space 3}-1.243419
{txt}{space 9}MT  {c |}{col 14}{res}{space 2}-2.381106{col 26}{space 2} 1.163807{col 37}{space 1}   -2.05{col 46}{space 3}0.041{col 54}{space 4}-4.662616{col 67}{space 3} -.099596
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-2.419161{col 26}{space 2} .9565485{col 37}{space 1}   -2.53{col 46}{space 3}0.011{col 54}{space 4}-4.294365{col 67}{space 3}-.5439571
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-2.469936{col 26}{space 2}  1.16048{col 37}{space 1}   -2.13{col 46}{space 3}0.033{col 54}{space 4}-4.744924{col 67}{space 3}-.1949483
{txt}{space 9}NE  {c |}{col 14}{res}{space 2}-2.642842{col 26}{space 2} .9837191{col 37}{space 1}   -2.69{col 46}{space 3}0.007{col 54}{space 4}-4.571311{col 67}{space 3}-.7143736
{txt}{space 9}NH  {c |}{col 14}{res}{space 2} -3.01535{col 26}{space 2} .9837897{col 37}{space 1}   -3.07{col 46}{space 3}0.002{col 54}{space 4}-4.943957{col 67}{space 3}-1.086742
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-2.908812{col 26}{space 2} .9559238{col 37}{space 1}   -3.04{col 46}{space 3}0.002{col 54}{space 4}-4.782791{col 67}{space 3}-1.034832
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-3.903136{col 26}{space 2}  .987823{col 37}{space 1}   -3.95{col 46}{space 3}0.000{col 54}{space 4} -5.83965{col 67}{space 3}-1.966622
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}-1.606479{col 26}{space 2} 1.036949{col 37}{space 1}   -1.55{col 46}{space 3}0.121{col 54}{space 4}-3.639299{col 67}{space 3} .4263411
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-2.712388{col 26}{space 2} .9500218{col 37}{space 1}   -2.86{col 46}{space 3}0.004{col 54}{space 4}-4.574797{col 67}{space 3}-.8499795
{txt}{space 9}OH  {c |}{col 14}{res}{space 2} -2.60794{col 26}{space 2} .9509991{col 37}{space 1}   -2.74{col 46}{space 3}0.006{col 54}{space 4}-4.472265{col 67}{space 3}-.7436154
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-2.406735{col 26}{space 2} 1.025753{col 37}{space 1}   -2.35{col 46}{space 3}0.019{col 54}{space 4}-4.417607{col 67}{space 3}-.3958628
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-2.851144{col 26}{space 2} .9647108{col 37}{space 1}   -2.96{col 46}{space 3}0.003{col 54}{space 4}-4.742349{col 67}{space 3}-.9599385
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-2.809313{col 26}{space 2}  .948715{col 37}{space 1}   -2.96{col 46}{space 3}0.003{col 54}{space 4}-4.669161{col 67}{space 3} -.949466
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-2.663373{col 26}{space 2} 1.056374{col 37}{space 1}   -2.52{col 46}{space 3}0.012{col 54}{space 4}-4.734273{col 67}{space 3}-.5924735
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-2.364658{col 26}{space 2} .9966271{col 37}{space 1}   -2.37{col 46}{space 3}0.018{col 54}{space 4}-4.318432{col 67}{space 3} -.410885
{txt}{space 9}SD  {c |}{col 14}{res}{space 2}-2.072401{col 26}{space 2} 1.176748{col 37}{space 1}   -1.76{col 46}{space 3}0.078{col 54}{space 4}-4.379281{col 67}{space 3} .2344799
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-2.625054{col 26}{space 2} .9686704{col 37}{space 1}   -2.71{col 46}{space 3}0.007{col 54}{space 4}-4.524021{col 67}{space 3}-.7260862
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-2.289671{col 26}{space 2} .9491826{col 37}{space 1}   -2.41{col 46}{space 3}0.016{col 54}{space 4}-4.150434{col 67}{space 3}-.4289067
{txt}{space 9}UT  {c |}{col 14}{res}{space 2}-2.482841{col 26}{space 2} .9949789{col 37}{space 1}   -2.50{col 46}{space 3}0.013{col 54}{space 4}-4.433384{col 67}{space 3}-.5322993
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}-2.624042{col 26}{space 2} .9624422{col 37}{space 1}   -2.73{col 46}{space 3}0.006{col 54}{space 4}-4.510799{col 67}{space 3}-.7372838
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}-1.665545{col 26}{space 2}  1.03843{col 37}{space 1}   -1.60{col 46}{space 3}0.109{col 54}{space 4}-3.701269{col 67}{space 3} .3701789
{txt}{space 9}WA  {c |}{col 14}{res}{space 2}-2.463541{col 26}{space 2} .9597784{col 37}{space 1}   -2.57{col 46}{space 3}0.010{col 54}{space 4}-4.345076{col 67}{space 3}-.5820048
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-2.549433{col 26}{space 2} .9645963{col 37}{space 1}   -2.64{col 46}{space 3}0.008{col 54}{space 4}-4.440414{col 67}{space 3}-.6584523
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-3.137111{col 26}{space 2} .9936632{col 37}{space 1}   -3.16{col 46}{space 3}0.002{col 54}{space 4}-5.085074{col 67}{space 3}-1.189148
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-3.759114{col 26}{space 2} .9921217{col 37}{space 1}   -3.79{col 46}{space 3}0.000{col 54}{space 4}-5.704055{col 67}{space 3}-1.814173
{txt}{space 12} {c |}
{space 7}2.Q33 {c |}{col 14}{res}{space 2} .2717688{col 26}{space 2} .0621903{col 37}{space 1}    4.37{col 46}{space 3}0.000{col 54}{space 4} .1498519{col 67}{space 3} .3936857
{txt}{space 7}2.Q34 {c |}{col 14}{res}{space 2}-.0856328{col 26}{space 2} .1271585{col 37}{space 1}   -0.67{col 46}{space 3}0.501{col 54}{space 4}-.3349125{col 67}{space 3} .1636469
{txt}{space 7}Q35_1 {c |}{col 14}{res}{space 2} .2521714{col 26}{space 2}  .203841{col 37}{space 1}    1.24{col 46}{space 3}0.216{col 54}{space 4}-.1474356{col 67}{space 3} .6517784
{txt}{space 7}Q35_2 {c |}{col 14}{res}{space 2} .3252799{col 26}{space 2} .2097745{col 37}{space 1}    1.55{col 46}{space 3}0.121{col 54}{space 4}-.0859589{col 67}{space 3} .7365187
{txt}{space 7}Q35_3 {c |}{col 14}{res}{space 2} .3173379{col 26}{space 2} .2332805{col 37}{space 1}    1.36{col 46}{space 3}0.174{col 54}{space 4}-.1399818{col 67}{space 3} .7746576
{txt}{space 7}Q35_4 {c |}{col 14}{res}{space 2} .5671162{col 26}{space 2} .2384159{col 37}{space 1}    2.38{col 46}{space 3}0.017{col 54}{space 4} .0997291{col 67}{space 3} 1.034503
{txt}{space 7}Q35_5 {c |}{col 14}{res}{space 2}-.4739621{col 26}{space 2} .4385339{col 37}{space 1}   -1.08{col 46}{space 3}0.280{col 54}{space 4}-1.333658{col 67}{space 3} .3857335
{txt}{space 7}Q35_6 {c |}{col 14}{res}{space 2} .1926146{col 26}{space 2} .2248447{col 37}{space 1}    0.86{col 46}{space 3}0.392{col 54}{space 4}-.2481678{col 67}{space 3}  .633397
{txt}{space 7}Q4new {c |}{col 14}{res}{space 2}-.0050599{col 26}{space 2} .0014089{col 37}{space 1}   -3.59{col 46}{space 3}0.000{col 54}{space 4}-.0078219{col 67}{space 3} -.002298
{txt}{space 7}Q6new {c |}{col 14}{res}{space 2} .0089715{col 26}{space 2} .0014549{col 37}{space 1}    6.17{col 46}{space 3}0.000{col 54}{space 4} .0061194{col 67}{space 3} .0118235
{txt}{space 5}Q9_mean {c |}{col 14}{res}{space 2} .0448092{col 26}{space 2} .0071802{col 37}{space 1}    6.24{col 46}{space 3}0.000{col 54}{space 4} .0307332{col 67}{space 3} .0588851
{txt}{space 6}Q13new {c |}{col 14}{res}{space 2}-.0117985{col 26}{space 2}  .001515{col 37}{space 1}   -7.79{col 46}{space 3}0.000{col 54}{space 4}-.0147685{col 67}{space 3}-.0088285
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  4.58397{col 26}{space 2} 1.015683{col 37}{space 1}    4.51{col 46}{space 3}0.000{col 54}{space 4} 2.592839{col 67}{space 3}   6.5751
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est9{txt} stored)

{com}. foreach mom in Mean Var{c -(}
{txt}  2{com}. eststo: reg Inc`mom' i.age_g i.edu_g i.inc_g i.cohort_g i.year i.state_id, robust 
{txt}  3{com}. eststo: reg Inc`mom' i.age_g i.edu_g i.inc_g i.cohort_g i.year i.state_id ${c -(}other_control{c )-}, robust 
{txt}  4{com}. eststo: reg Inc`mom' i.age_g i.edu_g i.inc_g i.cohort_g i.year i.state_id ${c -(}other_control{c )-} ${c -(}macro_ex_var{c )-}, robust 
{txt}  5{com}. 
. {c )-}

{txt}Linear regression                                      Number of obs ={res}    6737
                                                       {txt}F( 63,  6673) ={res}    1.55
                                                       {txt}Prob > F      = {res} 0.0036
                                                       {txt}R-squared     = {res} 0.0143
                                                       {txt}Root MSE      = {res} 2.8497

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     IncMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2} .0368492{col 26}{space 2} .1903472{col 37}{space 1}    0.19{col 46}{space 3}0.847{col 54}{space 4}-.3362921{col 67}{space 3} .4099905
{txt}{space 8}Old  {c |}{col 14}{res}{space 2} .1126875{col 26}{space 2} .2726323{col 37}{space 1}    0.41{col 46}{space 3}0.679{col 54}{space 4} -.421759{col 67}{space 3}  .647134
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2} .0598808{col 26}{space 2} .1358553{col 37}{space 1}    0.44{col 46}{space 3}0.659{col 54}{space 4}-.2064389{col 67}{space 3} .3262006
{txt}High Educ..  {c |}{col 14}{res}{space 2}-.1820873{col 26}{space 2}  .130988{col 37}{space 1}   -1.39{col 46}{space 3}0.165{col 54}{space 4}-.4388657{col 67}{space 3} .0746911
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2}-.2885493{col 26}{space 2} .1134422{col 37}{space 1}   -2.54{col 46}{space 3}0.011{col 54}{space 4}-.5109322{col 67}{space 3}-.0661664
{txt}High Income  {c |}{col 14}{res}{space 2}-.1707691{col 26}{space 2} .1149954{col 37}{space 1}   -1.49{col 46}{space 3}0.138{col 54}{space 4}-.3961969{col 67}{space 3} .0546588
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2}-.1091726{col 26}{space 2} .2021534{col 37}{space 1}   -0.54{col 46}{space 3}0.589{col 54}{space 4}-.5054578{col 67}{space 3} .2871126
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} .0951388{col 26}{space 2} .2820858{col 37}{space 1}    0.34{col 46}{space 3}0.736{col 54}{space 4}-.4578395{col 67}{space 3} .6481171
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2} .1062188{col 26}{space 2} .1076419{col 37}{space 1}    0.99{col 46}{space 3}0.324{col 54}{space 4}-.1047938{col 67}{space 3} .3172314
{txt}{space 7}2015  {c |}{col 14}{res}{space 2} .2594698{col 26}{space 2} .1078695{col 37}{space 1}    2.41{col 46}{space 3}0.016{col 54}{space 4} .0480111{col 67}{space 3} .4709285
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1685068{col 26}{space 2} .1089491{col 37}{space 1}    1.55{col 46}{space 3}0.122{col 54}{space 4}-.0450682{col 67}{space 3} .3820819
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .4361093{col 26}{space 2} .1174476{col 37}{space 1}    3.71{col 46}{space 3}0.000{col 54}{space 4} .2058745{col 67}{space 3} .6663441
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}  .537429{col 26}{space 2} .1641666{col 37}{space 1}    3.27{col 46}{space 3}0.001{col 54}{space 4} .2156101{col 67}{space 3}  .859248
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2}-.3864041{col 26}{space 2} 2.935374{col 37}{space 1}   -0.13{col 46}{space 3}0.895{col 54}{space 4}-6.140675{col 67}{space 3} 5.367867
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-.2430776{col 26}{space 2} 2.963482{col 37}{space 1}   -0.08{col 46}{space 3}0.935{col 54}{space 4} -6.05245{col 67}{space 3} 5.566294
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2} -.583259{col 26}{space 2}  2.92483{col 37}{space 1}   -0.20{col 46}{space 3}0.842{col 54}{space 4}-6.316861{col 67}{space 3} 5.150343
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-.2889073{col 26}{space 2} 2.920068{col 37}{space 1}   -0.10{col 46}{space 3}0.921{col 54}{space 4}-6.013173{col 67}{space 3} 5.435359
{txt}{space 9}CO  {c |}{col 14}{res}{space 2}-.6445965{col 26}{space 2} 2.922533{col 37}{space 1}   -0.22{col 46}{space 3}0.825{col 54}{space 4}-6.373696{col 67}{space 3} 5.084502
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-.6776401{col 26}{space 2} 2.922705{col 37}{space 1}   -0.23{col 46}{space 3}0.817{col 54}{space 4}-6.407076{col 67}{space 3} 5.051796
{txt}{space 9}DC  {c |}{col 14}{res}{space 2}-.8939146{col 26}{space 2} 2.956963{col 37}{space 1}   -0.30{col 46}{space 3}0.762{col 54}{space 4}-6.690508{col 67}{space 3} 4.902679
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-.4915315{col 26}{space 2} 2.952986{col 37}{space 1}   -0.17{col 46}{space 3}0.868{col 54}{space 4}-6.280327{col 67}{space 3} 5.297264
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-.2572239{col 26}{space 2}  2.92213{col 37}{space 1}   -0.09{col 46}{space 3}0.930{col 54}{space 4}-5.985532{col 67}{space 3} 5.471084
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-.3718613{col 26}{space 2} 2.925041{col 37}{space 1}   -0.13{col 46}{space 3}0.899{col 54}{space 4}-6.105877{col 67}{space 3} 5.362154
{txt}{space 9}HI  {c |}{col 14}{res}{space 2} .0076817{col 26}{space 2} 2.983891{col 37}{space 1}    0.00{col 46}{space 3}0.998{col 54}{space 4}-5.841697{col 67}{space 3} 5.857061
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-.9089027{col 26}{space 2} 2.923675{col 37}{space 1}   -0.31{col 46}{space 3}0.756{col 54}{space 4}-6.640239{col 67}{space 3} 4.822434
{txt}{space 9}ID  {c |}{col 14}{res}{space 2}-.0046305{col 26}{space 2} 2.958471{col 37}{space 1}   -0.00{col 46}{space 3}0.999{col 54}{space 4}-5.804178{col 67}{space 3} 5.794917
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-.6768413{col 26}{space 2} 2.919653{col 37}{space 1}   -0.23{col 46}{space 3}0.817{col 54}{space 4}-6.400295{col 67}{space 3} 5.046612
{txt}{space 9}IN  {c |}{col 14}{res}{space 2}-.3168059{col 26}{space 2} 2.927325{col 37}{space 1}   -0.11{col 46}{space 3}0.914{col 54}{space 4}-6.055299{col 67}{space 3} 5.421687
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-.1961408{col 26}{space 2} 2.942133{col 37}{space 1}   -0.07{col 46}{space 3}0.947{col 54}{space 4}-5.963662{col 67}{space 3} 5.571381
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-.4864081{col 26}{space 2} 2.930826{col 37}{space 1}   -0.17{col 46}{space 3}0.868{col 54}{space 4}-6.231764{col 67}{space 3} 5.258948
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-1.155772{col 26}{space 2} 2.932826{col 37}{space 1}   -0.39{col 46}{space 3}0.694{col 54}{space 4}-6.905047{col 67}{space 3} 4.593503
{txt}{space 9}MA  {c |}{col 14}{res}{space 2} -.269158{col 26}{space 2} 2.926069{col 37}{space 1}   -0.09{col 46}{space 3}0.927{col 54}{space 4}-6.005189{col 67}{space 3} 5.466873
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-.5854747{col 26}{space 2} 2.928558{col 37}{space 1}   -0.20{col 46}{space 3}0.842{col 54}{space 4}-6.326384{col 67}{space 3} 5.155434
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-1.143231{col 26}{space 2} 2.940203{col 37}{space 1}   -0.39{col 46}{space 3}0.697{col 54}{space 4}-6.906969{col 67}{space 3} 4.620507
{txt}{space 9}MI  {c |}{col 14}{res}{space 2}-.8482661{col 26}{space 2} 2.919039{col 37}{space 1}   -0.29{col 46}{space 3}0.771{col 54}{space 4}-6.570515{col 67}{space 3} 4.873983
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-.7030556{col 26}{space 2} 2.923085{col 37}{space 1}   -0.24{col 46}{space 3}0.810{col 54}{space 4}-6.433236{col 67}{space 3} 5.027125
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-.3788093{col 26}{space 2} 2.926021{col 37}{space 1}   -0.13{col 46}{space 3}0.897{col 54}{space 4}-6.114745{col 67}{space 3} 5.357126
{txt}{space 9}MS  {c |}{col 14}{res}{space 2} -.625363{col 26}{space 2} 2.939527{col 37}{space 1}   -0.21{col 46}{space 3}0.832{col 54}{space 4}-6.387775{col 67}{space 3} 5.137049
{txt}{space 9}MT  {c |}{col 14}{res}{space 2}-.0805659{col 26}{space 2} 2.974481{col 37}{space 1}   -0.03{col 46}{space 3}0.978{col 54}{space 4}-5.911499{col 67}{space 3} 5.750367
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-.3828759{col 26}{space 2} 2.922685{col 37}{space 1}   -0.13{col 46}{space 3}0.896{col 54}{space 4}-6.112272{col 67}{space 3}  5.34652
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-.5203147{col 26}{space 2} 2.961744{col 37}{space 1}   -0.18{col 46}{space 3}0.861{col 54}{space 4} -6.32628{col 67}{space 3} 5.285651
{txt}{space 9}NE  {c |}{col 14}{res}{space 2}-.7927664{col 26}{space 2} 2.930095{col 37}{space 1}   -0.27{col 46}{space 3}0.787{col 54}{space 4}-6.536689{col 67}{space 3} 4.951156
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-.2789544{col 26}{space 2}  2.94258{col 37}{space 1}   -0.09{col 46}{space 3}0.924{col 54}{space 4}-6.047351{col 67}{space 3} 5.489442
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-.6673501{col 26}{space 2} 2.921473{col 37}{space 1}   -0.23{col 46}{space 3}0.819{col 54}{space 4} -6.39437{col 67}{space 3}  5.05967
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-.8422408{col 26}{space 2} 2.937294{col 37}{space 1}   -0.29{col 46}{space 3}0.774{col 54}{space 4}-6.600277{col 67}{space 3} 4.915795
{txt}{space 9}NV  {c |}{col 14}{res}{space 2} .1819632{col 26}{space 2} 2.958032{col 37}{space 1}    0.06{col 46}{space 3}0.951{col 54}{space 4}-5.616725{col 67}{space 3} 5.980651
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-.3039587{col 26}{space 2} 2.919953{col 37}{space 1}   -0.10{col 46}{space 3}0.917{col 54}{space 4}-6.027999{col 67}{space 3} 5.420082
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-.3340921{col 26}{space 2} 2.920602{col 37}{space 1}   -0.11{col 46}{space 3}0.909{col 54}{space 4}-6.059406{col 67}{space 3} 5.391222
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-.3773286{col 26}{space 2} 2.948357{col 37}{space 1}   -0.13{col 46}{space 3}0.898{col 54}{space 4}-6.157051{col 67}{space 3} 5.402393
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-.7821178{col 26}{space 2} 2.926428{col 37}{space 1}   -0.27{col 46}{space 3}0.789{col 54}{space 4}-6.518852{col 67}{space 3} 4.954616
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-.4909536{col 26}{space 2} 2.919617{col 37}{space 1}   -0.17{col 46}{space 3}0.866{col 54}{space 4}-6.214335{col 67}{space 3} 5.232428
{txt}{space 9}RI  {c |}{col 14}{res}{space 2} .1637119{col 26}{space 2} 3.003258{col 37}{space 1}    0.05{col 46}{space 3}0.957{col 54}{space 4}-5.723633{col 67}{space 3} 6.051057
{txt}{space 9}SC  {c |}{col 14}{res}{space 2} -.401746{col 26}{space 2} 2.937105{col 37}{space 1}   -0.14{col 46}{space 3}0.891{col 54}{space 4} -6.15941{col 67}{space 3} 5.355918
{txt}{space 9}SD  {c |}{col 14}{res}{space 2} .4725179{col 26}{space 2} 3.005036{col 37}{space 1}    0.16{col 46}{space 3}0.875{col 54}{space 4}-5.418314{col 67}{space 3} 6.363349
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-.3496966{col 26}{space 2} 2.932586{col 37}{space 1}   -0.12{col 46}{space 3}0.905{col 54}{space 4}-6.098502{col 67}{space 3} 5.399109
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-.3133249{col 26}{space 2} 2.921178{col 37}{space 1}   -0.11{col 46}{space 3}0.915{col 54}{space 4}-6.039767{col 67}{space 3} 5.413117
{txt}{space 9}UT  {c |}{col 14}{res}{space 2}-.5371945{col 26}{space 2} 2.934445{col 37}{space 1}   -0.18{col 46}{space 3}0.855{col 54}{space 4}-6.289644{col 67}{space 3} 5.215255
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}-.3864329{col 26}{space 2} 2.923591{col 37}{space 1}   -0.13{col 46}{space 3}0.895{col 54}{space 4}-6.117605{col 67}{space 3} 5.344739
{txt}{space 9}VT  {c |}{col 14}{res}{space 2} .9600484{col 26}{space 2}  2.98035{col 37}{space 1}    0.32{col 46}{space 3}0.747{col 54}{space 4}-4.882391{col 67}{space 3} 6.802488
{txt}{space 9}WA  {c |}{col 14}{res}{space 2}-.4711913{col 26}{space 2} 2.928616{col 37}{space 1}   -0.16{col 46}{space 3}0.872{col 54}{space 4}-6.212214{col 67}{space 3} 5.269831
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-.4403281{col 26}{space 2} 2.925361{col 37}{space 1}   -0.15{col 46}{space 3}0.880{col 54}{space 4} -6.17497{col 67}{space 3} 5.294314
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-.7813115{col 26}{space 2} 2.943564{col 37}{space 1}   -0.27{col 46}{space 3}0.791{col 54}{space 4}-6.551637{col 67}{space 3} 4.989014
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-.8574189{col 26}{space 2} 2.937671{col 37}{space 1}   -0.29{col 46}{space 3}0.770{col 54}{space 4}-6.616192{col 67}{space 3} 4.901354
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.088664{col 26}{space 2} 2.930242{col 37}{space 1}    0.71{col 46}{space 3}0.476{col 54}{space 4}-3.655547{col 67}{space 3} 7.832876
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est10{txt} stored)

Linear regression                                      Number of obs ={res}    6735
                                                       {txt}F( 71,  6663) ={res}    1.75
                                                       {txt}Prob > F      = {res} 0.0001
                                                       {txt}R-squared     = {res} 0.0177
                                                       {txt}Root MSE      = {res} 2.8469

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     IncMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2} .0340398{col 26}{space 2} .1908345{col 37}{space 1}    0.18{col 46}{space 3}0.858{col 54}{space 4}-.3400569{col 67}{space 3} .4081365
{txt}{space 8}Old  {c |}{col 14}{res}{space 2} .1236858{col 26}{space 2}  .273376{col 37}{space 1}    0.45{col 46}{space 3}0.651{col 54}{space 4}-.4122187{col 67}{space 3} .6595903
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2} .0399084{col 26}{space 2} .1363218{col 37}{space 1}    0.29{col 46}{space 3}0.770{col 54}{space 4}-.2273259{col 67}{space 3} .3071427
{txt}High Educ..  {c |}{col 14}{res}{space 2}-.1802508{col 26}{space 2} .1309443{col 37}{space 1}   -1.38{col 46}{space 3}0.169{col 54}{space 4}-.4369436{col 67}{space 3} .0764419
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2}-.2578956{col 26}{space 2} .1137002{col 37}{space 1}   -2.27{col 46}{space 3}0.023{col 54}{space 4}-.4807843{col 67}{space 3}-.0350069
{txt}High Income  {c |}{col 14}{res}{space 2}-.0852673{col 26}{space 2}  .116747{col 37}{space 1}   -0.73{col 46}{space 3}0.465{col 54}{space 4}-.3141288{col 67}{space 3} .1435942
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2}-.1271696{col 26}{space 2} .2026313{col 37}{space 1}   -0.63{col 46}{space 3}0.530{col 54}{space 4}-.5243918{col 67}{space 3} .2700526
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} .0703455{col 26}{space 2} .2836299{col 37}{space 1}    0.25{col 46}{space 3}0.804{col 54}{space 4}  -.48566{col 67}{space 3} .6263509
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2}  .099512{col 26}{space 2} .1068522{col 37}{space 1}    0.93{col 46}{space 3}0.352{col 54}{space 4}-.1099525{col 67}{space 3} .3089766
{txt}{space 7}2015  {c |}{col 14}{res}{space 2} .2500647{col 26}{space 2} .1075934{col 37}{space 1}    2.32{col 46}{space 3}0.020{col 54}{space 4} .0391472{col 67}{space 3} .4609822
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1479762{col 26}{space 2} .1092651{col 37}{space 1}    1.35{col 46}{space 3}0.176{col 54}{space 4}-.0662183{col 67}{space 3} .3621708
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .4238605{col 26}{space 2} .1173752{col 37}{space 1}    3.61{col 46}{space 3}0.000{col 54}{space 4} .1937675{col 67}{space 3} .6539534
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .5282971{col 26}{space 2}  .164139{col 37}{space 1}    3.22{col 46}{space 3}0.001{col 54}{space 4} .2065322{col 67}{space 3}  .850062
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2}-.4012329{col 26}{space 2} 2.952329{col 37}{space 1}   -0.14{col 46}{space 3}0.892{col 54}{space 4}-6.188743{col 67}{space 3} 5.386277
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}  -.20727{col 26}{space 2} 2.980296{col 37}{space 1}   -0.07{col 46}{space 3}0.945{col 54}{space 4}-6.049604{col 67}{space 3} 5.635064
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-.5403706{col 26}{space 2}  2.94268{col 37}{space 1}   -0.18{col 46}{space 3}0.854{col 54}{space 4}-6.308965{col 67}{space 3} 5.228224
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}   -.2457{col 26}{space 2} 2.941829{col 37}{space 1}   -0.08{col 46}{space 3}0.933{col 54}{space 4}-6.012627{col 67}{space 3} 5.521227
{txt}{space 9}CO  {c |}{col 14}{res}{space 2}-.5879081{col 26}{space 2} 2.941133{col 37}{space 1}   -0.20{col 46}{space 3}0.842{col 54}{space 4} -6.35347{col 67}{space 3} 5.177654
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-.6533409{col 26}{space 2} 2.940144{col 37}{space 1}   -0.22{col 46}{space 3}0.824{col 54}{space 4}-6.416965{col 67}{space 3} 5.110283
{txt}{space 9}DC  {c |}{col 14}{res}{space 2}-.9118529{col 26}{space 2} 2.974793{col 37}{space 1}   -0.31{col 46}{space 3}0.759{col 54}{space 4}  -6.7434{col 67}{space 3} 4.919695
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-.4943848{col 26}{space 2} 2.969354{col 37}{space 1}   -0.17{col 46}{space 3}0.868{col 54}{space 4} -6.31527{col 67}{space 3}   5.3265
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-.2138881{col 26}{space 2} 2.940163{col 37}{space 1}   -0.07{col 46}{space 3}0.942{col 54}{space 4}-5.977549{col 67}{space 3} 5.549773
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-.3716636{col 26}{space 2} 2.943117{col 37}{space 1}   -0.13{col 46}{space 3}0.900{col 54}{space 4}-6.141114{col 67}{space 3} 5.397787
{txt}{space 9}HI  {c |}{col 14}{res}{space 2} .4466601{col 26}{space 2} 3.026407{col 37}{space 1}    0.15{col 46}{space 3}0.883{col 54}{space 4}-5.486066{col 67}{space 3} 6.379386
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-.8050163{col 26}{space 2} 2.941249{col 37}{space 1}   -0.27{col 46}{space 3}0.784{col 54}{space 4}-6.570806{col 67}{space 3} 4.960773
{txt}{space 9}ID  {c |}{col 14}{res}{space 2}  .111699{col 26}{space 2} 2.976874{col 37}{space 1}    0.04{col 46}{space 3}0.970{col 54}{space 4}-5.723926{col 67}{space 3} 5.947324
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-.6239544{col 26}{space 2} 2.938694{col 37}{space 1}   -0.21{col 46}{space 3}0.832{col 54}{space 4}-6.384736{col 67}{space 3} 5.136827
{txt}{space 9}IN  {c |}{col 14}{res}{space 2}-.2369689{col 26}{space 2} 2.944687{col 37}{space 1}   -0.08{col 46}{space 3}0.936{col 54}{space 4}-6.009497{col 67}{space 3}  5.53556
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-.1197271{col 26}{space 2} 2.959714{col 37}{space 1}   -0.04{col 46}{space 3}0.968{col 54}{space 4}-5.921714{col 67}{space 3} 5.682259
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-.4214082{col 26}{space 2} 2.948057{col 37}{space 1}   -0.14{col 46}{space 3}0.886{col 54}{space 4}-6.200543{col 67}{space 3} 5.357726
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-1.171423{col 26}{space 2} 2.949747{col 37}{space 1}   -0.40{col 46}{space 3}0.691{col 54}{space 4}-6.953871{col 67}{space 3} 4.611024
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-.2207215{col 26}{space 2} 2.944489{col 37}{space 1}   -0.07{col 46}{space 3}0.940{col 54}{space 4}-5.992862{col 67}{space 3} 5.551419
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-.5828566{col 26}{space 2} 2.946632{col 37}{space 1}   -0.20{col 46}{space 3}0.843{col 54}{space 4}-6.359199{col 67}{space 3} 5.193485
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-1.072696{col 26}{space 2} 2.958242{col 37}{space 1}   -0.36{col 46}{space 3}0.717{col 54}{space 4}-6.871798{col 67}{space 3} 4.726406
{txt}{space 9}MI  {c |}{col 14}{res}{space 2}-.7681802{col 26}{space 2} 2.936619{col 37}{space 1}   -0.26{col 46}{space 3}0.794{col 54}{space 4}-6.524894{col 67}{space 3} 4.988534
{txt}{space 9}MN  {c |}{col 14}{res}{space 2} -.614635{col 26}{space 2}  2.94222{col 37}{space 1}   -0.21{col 46}{space 3}0.835{col 54}{space 4}-6.382329{col 67}{space 3} 5.153059
{txt}{space 9}MO  {c |}{col 14}{res}{space 2} -.299722{col 26}{space 2} 2.944071{col 37}{space 1}   -0.10{col 46}{space 3}0.919{col 54}{space 4}-6.071044{col 67}{space 3}   5.4716
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-.6637803{col 26}{space 2} 2.956981{col 37}{space 1}   -0.22{col 46}{space 3}0.822{col 54}{space 4} -6.46041{col 67}{space 3}  5.13285
{txt}{space 9}MT  {c |}{col 14}{res}{space 2}-.0021229{col 26}{space 2} 2.989024{col 37}{space 1}   -0.00{col 46}{space 3}0.999{col 54}{space 4}-5.861567{col 67}{space 3} 5.857321
{txt}{space 9}NC  {c |}{col 14}{res}{space 2} -.330409{col 26}{space 2} 2.940429{col 37}{space 1}   -0.11{col 46}{space 3}0.911{col 54}{space 4}-6.094592{col 67}{space 3} 5.433774
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-.4258599{col 26}{space 2} 2.980625{col 37}{space 1}   -0.14{col 46}{space 3}0.886{col 54}{space 4}-6.268838{col 67}{space 3} 5.417119
{txt}{space 9}NE  {c |}{col 14}{res}{space 2}-.7074157{col 26}{space 2} 2.947662{col 37}{space 1}   -0.24{col 46}{space 3}0.810{col 54}{space 4}-6.485776{col 67}{space 3} 5.070945
{txt}{space 9}NH  {c |}{col 14}{res}{space 2} -.194272{col 26}{space 2} 2.960478{col 37}{space 1}   -0.07{col 46}{space 3}0.948{col 54}{space 4}-5.997757{col 67}{space 3} 5.609213
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-.6188708{col 26}{space 2} 2.939833{col 37}{space 1}   -0.21{col 46}{space 3}0.833{col 54}{space 4}-6.381885{col 67}{space 3} 5.144143
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-.8068512{col 26}{space 2} 2.955163{col 37}{space 1}   -0.27{col 46}{space 3}0.785{col 54}{space 4}-6.599916{col 67}{space 3} 4.986214
{txt}{space 9}NV  {c |}{col 14}{res}{space 2} .2398489{col 26}{space 2} 2.975091{col 37}{space 1}    0.08{col 46}{space 3}0.936{col 54}{space 4}-5.592281{col 67}{space 3} 6.071979
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-.2428148{col 26}{space 2} 2.939352{col 37}{space 1}   -0.08{col 46}{space 3}0.934{col 54}{space 4}-6.004885{col 67}{space 3} 5.519256
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-.2494718{col 26}{space 2} 2.938333{col 37}{space 1}   -0.08{col 46}{space 3}0.932{col 54}{space 4}-6.009544{col 67}{space 3} 5.510601
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-.3128529{col 26}{space 2} 2.966594{col 37}{space 1}   -0.11{col 46}{space 3}0.916{col 54}{space 4}-6.128327{col 67}{space 3} 5.502621
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-.7114505{col 26}{space 2}  2.94486{col 37}{space 1}   -0.24{col 46}{space 3}0.809{col 54}{space 4}-6.484318{col 67}{space 3} 5.061417
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-.4245815{col 26}{space 2}  2.93768{col 37}{space 1}   -0.14{col 46}{space 3}0.885{col 54}{space 4}-6.183375{col 67}{space 3} 5.334212
{txt}{space 9}RI  {c |}{col 14}{res}{space 2} .2358536{col 26}{space 2} 3.021465{col 37}{space 1}    0.08{col 46}{space 3}0.938{col 54}{space 4}-5.687184{col 67}{space 3} 6.158891
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-.3831217{col 26}{space 2} 2.955402{col 37}{space 1}   -0.13{col 46}{space 3}0.897{col 54}{space 4}-6.176656{col 67}{space 3} 5.410413
{txt}{space 9}SD  {c |}{col 14}{res}{space 2} .5825114{col 26}{space 2} 3.022353{col 37}{space 1}    0.19{col 46}{space 3}0.847{col 54}{space 4}-5.342268{col 67}{space 3} 6.507291
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-.2912715{col 26}{space 2} 2.949412{col 37}{space 1}   -0.10{col 46}{space 3}0.921{col 54}{space 4}-6.073062{col 67}{space 3} 5.490519
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-.2730944{col 26}{space 2} 2.939919{col 37}{space 1}   -0.09{col 46}{space 3}0.926{col 54}{space 4}-6.036276{col 67}{space 3} 5.490087
{txt}{space 9}UT  {c |}{col 14}{res}{space 2}-.3932641{col 26}{space 2} 2.952399{col 37}{space 1}   -0.13{col 46}{space 3}0.894{col 54}{space 4}-6.180911{col 67}{space 3} 5.394383
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}  -.34625{col 26}{space 2}  2.94191{col 37}{space 1}   -0.12{col 46}{space 3}0.906{col 54}{space 4}-6.113335{col 67}{space 3} 5.420834
{txt}{space 9}VT  {c |}{col 14}{res}{space 2} 1.067413{col 26}{space 2} 2.998753{col 37}{space 1}    0.36{col 46}{space 3}0.722{col 54}{space 4}-4.811103{col 67}{space 3}  6.94593
{txt}{space 9}WA  {c |}{col 14}{res}{space 2}-.3898383{col 26}{space 2} 2.948763{col 37}{space 1}   -0.13{col 46}{space 3}0.895{col 54}{space 4}-6.170357{col 67}{space 3}  5.39068
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-.3570219{col 26}{space 2} 2.942423{col 37}{space 1}   -0.12{col 46}{space 3}0.903{col 54}{space 4}-6.125112{col 67}{space 3} 5.411068
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-.6679387{col 26}{space 2} 2.960154{col 37}{space 1}   -0.23{col 46}{space 3}0.821{col 54}{space 4}-6.470788{col 67}{space 3} 5.134911
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-.7356651{col 26}{space 2} 2.953581{col 37}{space 1}   -0.25{col 46}{space 3}0.803{col 54}{space 4} -6.52563{col 67}{space 3}   5.0543
{txt}{space 12} {c |}
{space 7}2.Q33 {c |}{col 14}{res}{space 2}-.2161817{col 26}{space 2} .0719612{col 37}{space 1}   -3.00{col 46}{space 3}0.003{col 54}{space 4}-.3572487{col 67}{space 3}-.0751147
{txt}{space 7}2.Q34 {c |}{col 14}{res}{space 2} .0094497{col 26}{space 2} .1430967{col 37}{space 1}    0.07{col 46}{space 3}0.947{col 54}{space 4}-.2710656{col 67}{space 3} .2899651
{txt}{space 7}Q35_1 {c |}{col 14}{res}{space 2}-.2088642{col 26}{space 2} .1940672{col 37}{space 1}   -1.08{col 46}{space 3}0.282{col 54}{space 4} -.589298{col 67}{space 3} .1715696
{txt}{space 7}Q35_2 {c |}{col 14}{res}{space 2} .1319493{col 26}{space 2} .2106914{col 37}{space 1}    0.63{col 46}{space 3}0.531{col 54}{space 4}-.2810732{col 67}{space 3} .5449718
{txt}{space 7}Q35_3 {c |}{col 14}{res}{space 2}-.1159559{col 26}{space 2} .2358983{col 37}{space 1}   -0.49{col 46}{space 3}0.623{col 54}{space 4}-.5783921{col 67}{space 3} .3464804
{txt}{space 7}Q35_4 {c |}{col 14}{res}{space 2} -.364195{col 26}{space 2} .2154676{col 37}{space 1}   -1.69{col 46}{space 3}0.091{col 54}{space 4}-.7865804{col 67}{space 3} .0581905
{txt}{space 7}Q35_5 {c |}{col 14}{res}{space 2}-.5097186{col 26}{space 2} .3367472{col 37}{space 1}   -1.51{col 46}{space 3}0.130{col 54}{space 4}-1.169851{col 67}{space 3} .1504137
{txt}{space 7}Q35_6 {c |}{col 14}{res}{space 2}   .14068{col 26}{space 2} .2305794{col 37}{space 1}    0.61{col 46}{space 3}0.542{col 54}{space 4}-.3113295{col 67}{space 3} .5926895
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.291565{col 26}{space 2} 2.991439{col 37}{space 1}    0.77{col 46}{space 3}0.444{col 54}{space 4}-3.572614{col 67}{space 3} 8.155744
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est11{txt} stored)

Linear regression                                      Number of obs ={res}    5639
                                                       {txt}F( 75,  5563) ={res}    2.17
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0357
                                                       {txt}Root MSE      = {res} 2.4092

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     IncMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2} .0847419{col 26}{space 2} .1911409{col 37}{space 1}    0.44{col 46}{space 3}0.658{col 54}{space 4} -.289969{col 67}{space 3} .4594528
{txt}{space 8}Old  {c |}{col 14}{res}{space 2} .1303872{col 26}{space 2} .2632683{col 37}{space 1}    0.50{col 46}{space 3}0.620{col 54}{space 4}-.3857214{col 67}{space 3} .6464959
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2} .0088003{col 26}{space 2} .1335402{col 37}{space 1}    0.07{col 46}{space 3}0.947{col 54}{space 4}-.2529906{col 67}{space 3} .2705912
{txt}High Educ..  {c |}{col 14}{res}{space 2}-.2057219{col 26}{space 2} .1256743{col 37}{space 1}   -1.64{col 46}{space 3}0.102{col 54}{space 4}-.4520927{col 67}{space 3} .0406488
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2}-.1882954{col 26}{space 2} .1083839{col 37}{space 1}   -1.74{col 46}{space 3}0.082{col 54}{space 4}-.4007701{col 67}{space 3} .0241794
{txt}High Income  {c |}{col 14}{res}{space 2}-.0963126{col 26}{space 2} .1101882{col 37}{space 1}   -0.87{col 46}{space 3}0.382{col 54}{space 4}-.3123245{col 67}{space 3} .1196994
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2}-.0444126{col 26}{space 2} .1857744{col 37}{space 1}   -0.24{col 46}{space 3}0.811{col 54}{space 4} -.408603{col 67}{space 3} .3197778
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} .1766688{col 26}{space 2} .2728374{col 37}{space 1}    0.65{col 46}{space 3}0.517{col 54}{space 4} -.358199{col 67}{space 3} .7115366
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2} .0142554{col 26}{space 2} .0985776{col 37}{space 1}    0.14{col 46}{space 3}0.885{col 54}{space 4}-.1789952{col 67}{space 3}  .207506
{txt}{space 7}2015  {c |}{col 14}{res}{space 2} .2363224{col 26}{space 2} .1033962{col 37}{space 1}    2.29{col 46}{space 3}0.022{col 54}{space 4} .0336255{col 67}{space 3} .4390193
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1306996{col 26}{space 2} .1003908{col 37}{space 1}    1.30{col 46}{space 3}0.193{col 54}{space 4}-.0661054{col 67}{space 3} .3275047
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .3228422{col 26}{space 2} .1081185{col 37}{space 1}    2.99{col 46}{space 3}0.003{col 54}{space 4} .1108877{col 67}{space 3} .5347967
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .3695394{col 26}{space 2} .1509989{col 37}{space 1}    2.45{col 46}{space 3}0.014{col 54}{space 4} .0735226{col 67}{space 3} .6655561
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2}-.9964611{col 26}{space 2} 4.241167{col 37}{space 1}   -0.23{col 46}{space 3}0.814{col 54}{space 4}-9.310804{col 67}{space 3} 7.317882
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-.8896009{col 26}{space 2}  4.25345{col 37}{space 1}   -0.21{col 46}{space 3}0.834{col 54}{space 4}-9.228024{col 67}{space 3} 7.448823
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-1.441464{col 26}{space 2} 4.233791{col 37}{space 1}   -0.34{col 46}{space 3}0.734{col 54}{space 4}-9.741347{col 67}{space 3} 6.858419
{txt}{space 9}CA  {c |}{col 14}{res}{space 2} -1.27538{col 26}{space 2} 4.231587{col 37}{space 1}   -0.30{col 46}{space 3}0.763{col 54}{space 4}-9.570943{col 67}{space 3} 7.020183
{txt}{space 9}CO  {c |}{col 14}{res}{space 2}-1.486741{col 26}{space 2} 4.228746{col 37}{space 1}   -0.35{col 46}{space 3}0.725{col 54}{space 4}-9.776733{col 67}{space 3} 6.803252
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-1.409426{col 26}{space 2} 4.228823{col 37}{space 1}   -0.33{col 46}{space 3}0.739{col 54}{space 4} -9.69957{col 67}{space 3} 6.880718
{txt}{space 9}DC  {c |}{col 14}{res}{space 2}-1.639622{col 26}{space 2} 4.262092{col 37}{space 1}   -0.38{col 46}{space 3}0.700{col 54}{space 4}-9.994986{col 67}{space 3} 6.715741
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-1.195099{col 26}{space 2} 4.255801{col 37}{space 1}   -0.28{col 46}{space 3}0.779{col 54}{space 4}-9.538131{col 67}{space 3} 7.147932
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-1.219975{col 26}{space 2} 4.230817{col 37}{space 1}   -0.29{col 46}{space 3}0.773{col 54}{space 4}-9.514029{col 67}{space 3} 7.074079
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-1.331049{col 26}{space 2} 4.232198{col 37}{space 1}   -0.31{col 46}{space 3}0.753{col 54}{space 4} -9.62781{col 67}{space 3} 6.965713
{txt}{space 9}HI  {c |}{col 14}{res}{space 2}-1.174649{col 26}{space 2} 4.256105{col 37}{space 1}   -0.28{col 46}{space 3}0.783{col 54}{space 4}-9.518277{col 67}{space 3} 7.168979
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-1.505819{col 26}{space 2} 4.229355{col 37}{space 1}   -0.36{col 46}{space 3}0.722{col 54}{space 4}-9.797007{col 67}{space 3} 6.785368
{txt}{space 9}ID  {c |}{col 14}{res}{space 2}-.4679684{col 26}{space 2} 4.266918{col 37}{space 1}   -0.11{col 46}{space 3}0.913{col 54}{space 4}-8.832794{col 67}{space 3} 7.896858
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-1.320947{col 26}{space 2}  4.22836{col 37}{space 1}   -0.31{col 46}{space 3}0.755{col 54}{space 4}-9.610184{col 67}{space 3} 6.968291
{txt}{space 9}IN  {c |}{col 14}{res}{space 2}-1.165298{col 26}{space 2} 4.233964{col 37}{space 1}   -0.28{col 46}{space 3}0.783{col 54}{space 4}-9.465521{col 67}{space 3} 7.134926
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-1.345287{col 26}{space 2} 4.237406{col 37}{space 1}   -0.32{col 46}{space 3}0.751{col 54}{space 4}-9.652257{col 67}{space 3} 6.961683
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-1.210584{col 26}{space 2} 4.238177{col 37}{space 1}   -0.29{col 46}{space 3}0.775{col 54}{space 4}-9.519067{col 67}{space 3} 7.097898
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-1.853889{col 26}{space 2} 4.244981{col 37}{space 1}   -0.44{col 46}{space 3}0.662{col 54}{space 4}-10.17571{col 67}{space 3} 6.467932
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-1.093418{col 26}{space 2} 4.232251{col 37}{space 1}   -0.26{col 46}{space 3}0.796{col 54}{space 4}-9.390282{col 67}{space 3} 7.203447
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-1.510983{col 26}{space 2} 4.233911{col 37}{space 1}   -0.36{col 46}{space 3}0.721{col 54}{space 4}-9.811101{col 67}{space 3} 6.789136
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-1.904375{col 26}{space 2} 4.244375{col 37}{space 1}   -0.45{col 46}{space 3}0.654{col 54}{space 4}-10.22501{col 67}{space 3} 6.416257
{txt}{space 9}MI  {c |}{col 14}{res}{space 2}-1.610796{col 26}{space 2} 4.227263{col 37}{space 1}   -0.38{col 46}{space 3}0.703{col 54}{space 4}-9.897882{col 67}{space 3} 6.676289
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-1.403662{col 26}{space 2} 4.229996{col 37}{space 1}   -0.33{col 46}{space 3}0.740{col 54}{space 4}-9.696107{col 67}{space 3} 6.888782
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-1.216884{col 26}{space 2} 4.232245{col 37}{space 1}   -0.29{col 46}{space 3}0.774{col 54}{space 4}-9.513737{col 67}{space 3} 7.079969
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-1.650366{col 26}{space 2} 4.230323{col 37}{space 1}   -0.39{col 46}{space 3}0.696{col 54}{space 4} -9.94345{col 67}{space 3} 6.642719
{txt}{space 9}MT  {c |}{col 14}{res}{space 2}-.5526247{col 26}{space 2} 4.281917{col 37}{space 1}   -0.13{col 46}{space 3}0.897{col 54}{space 4}-8.946855{col 67}{space 3} 7.841605
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-1.292454{col 26}{space 2} 4.230141{col 37}{space 1}   -0.31{col 46}{space 3}0.760{col 54}{space 4}-9.585182{col 67}{space 3} 7.000275
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-1.235361{col 26}{space 2} 4.264661{col 37}{space 1}   -0.29{col 46}{space 3}0.772{col 54}{space 4}-9.595762{col 67}{space 3} 7.125041
{txt}{space 9}NE  {c |}{col 14}{res}{space 2}-1.467345{col 26}{space 2} 4.238154{col 37}{space 1}   -0.35{col 46}{space 3}0.729{col 54}{space 4}-9.775783{col 67}{space 3} 6.841093
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-1.192576{col 26}{space 2} 4.234845{col 37}{space 1}   -0.28{col 46}{space 3}0.778{col 54}{space 4}-9.494527{col 67}{space 3} 7.109374
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-1.406367{col 26}{space 2} 4.229096{col 37}{space 1}   -0.33{col 46}{space 3}0.739{col 54}{space 4}-9.697047{col 67}{space 3} 6.884313
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-1.758895{col 26}{space 2} 4.232715{col 37}{space 1}   -0.42{col 46}{space 3}0.678{col 54}{space 4}-10.05667{col 67}{space 3}  6.53888
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}-.8244303{col 26}{space 2} 4.254023{col 37}{space 1}   -0.19{col 46}{space 3}0.846{col 54}{space 4}-9.163977{col 67}{space 3} 7.515116
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-1.226172{col 26}{space 2} 4.227599{col 37}{space 1}   -0.29{col 46}{space 3}0.772{col 54}{space 4}-9.513918{col 67}{space 3} 7.061573
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-1.020413{col 26}{space 2} 4.229003{col 37}{space 1}   -0.24{col 46}{space 3}0.809{col 54}{space 4}-9.310911{col 67}{space 3} 7.270085
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-1.668428{col 26}{space 2}  4.24556{col 37}{space 1}   -0.39{col 46}{space 3}0.694{col 54}{space 4}-9.991384{col 67}{space 3} 6.654528
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-1.491752{col 26}{space 2} 4.233405{col 37}{space 1}   -0.35{col 46}{space 3}0.725{col 54}{space 4}-9.790878{col 67}{space 3} 6.807375
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-1.253521{col 26}{space 2} 4.227687{col 37}{space 1}   -0.30{col 46}{space 3}0.767{col 54}{space 4}-9.541439{col 67}{space 3} 7.034396
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-.4675605{col 26}{space 2} 4.297242{col 37}{space 1}   -0.11{col 46}{space 3}0.913{col 54}{space 4}-8.891833{col 67}{space 3} 7.956712
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-1.050881{col 26}{space 2} 4.246643{col 37}{space 1}   -0.25{col 46}{space 3}0.805{col 54}{space 4} -9.37596{col 67}{space 3} 7.274197
{txt}{space 9}SD  {c |}{col 14}{res}{space 2}-.5305071{col 26}{space 2} 4.301341{col 37}{space 1}   -0.12{col 46}{space 3}0.902{col 54}{space 4}-8.962815{col 67}{space 3} 7.901801
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-1.345613{col 26}{space 2} 4.235376{col 37}{space 1}   -0.32{col 46}{space 3}0.751{col 54}{space 4}-9.648603{col 67}{space 3} 6.957378
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-1.257619{col 26}{space 2} 4.229099{col 37}{space 1}   -0.30{col 46}{space 3}0.766{col 54}{space 4}-9.548303{col 67}{space 3} 7.033066
{txt}{space 9}UT  {c |}{col 14}{res}{space 2}-1.433505{col 26}{space 2} 4.238375{col 37}{space 1}   -0.34{col 46}{space 3}0.735{col 54}{space 4}-9.742376{col 67}{space 3} 6.875366
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}-1.338533{col 26}{space 2} 4.230587{col 37}{space 1}   -0.32{col 46}{space 3}0.752{col 54}{space 4}-9.632135{col 67}{space 3} 6.955069
{txt}{space 9}VT  {c |}{col 14}{res}{space 2} .3601567{col 26}{space 2} 4.266901{col 37}{space 1}    0.08{col 46}{space 3}0.933{col 54}{space 4}-8.004635{col 67}{space 3} 8.724948
{txt}{space 9}WA  {c |}{col 14}{res}{space 2}-1.378439{col 26}{space 2} 4.232433{col 37}{space 1}   -0.33{col 46}{space 3}0.745{col 54}{space 4}-9.675661{col 67}{space 3} 6.918783
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-1.335086{col 26}{space 2} 4.230853{col 37}{space 1}   -0.32{col 46}{space 3}0.752{col 54}{space 4} -9.62921{col 67}{space 3} 6.959038
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-1.734137{col 26}{space 2} 4.231143{col 37}{space 1}   -0.41{col 46}{space 3}0.682{col 54}{space 4}-10.02883{col 67}{space 3} 6.560555
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-1.558844{col 26}{space 2}  4.23584{col 37}{space 1}   -0.37{col 46}{space 3}0.713{col 54}{space 4}-9.862743{col 67}{space 3} 6.745056
{txt}{space 12} {c |}
{space 7}2.Q33 {c |}{col 14}{res}{space 2}-.1187306{col 26}{space 2} .0664229{col 37}{space 1}   -1.79{col 46}{space 3}0.074{col 54}{space 4}-.2489455{col 67}{space 3} .0114843
{txt}{space 7}2.Q34 {c |}{col 14}{res}{space 2} .0778587{col 26}{space 2} .1257924{col 37}{space 1}    0.62{col 46}{space 3}0.536{col 54}{space 4}-.1687434{col 67}{space 3} .3244609
{txt}{space 7}Q35_1 {c |}{col 14}{res}{space 2} .0347354{col 26}{space 2} .1879144{col 37}{space 1}    0.18{col 46}{space 3}0.853{col 54}{space 4}-.3336501{col 67}{space 3}  .403121
{txt}{space 7}Q35_2 {c |}{col 14}{res}{space 2} .2034299{col 26}{space 2} .2028591{col 37}{space 1}    1.00{col 46}{space 3}0.316{col 54}{space 4} -.194253{col 67}{space 3} .6011129
{txt}{space 7}Q35_3 {c |}{col 14}{res}{space 2} .0938846{col 26}{space 2} .2790605{col 37}{space 1}    0.34{col 46}{space 3}0.737{col 54}{space 4}-.4531831{col 67}{space 3} .6409522
{txt}{space 7}Q35_4 {c |}{col 14}{res}{space 2} -.133015{col 26}{space 2} .1992118{col 37}{space 1}   -0.67{col 46}{space 3}0.504{col 54}{space 4}-.5235479{col 67}{space 3} .2575179
{txt}{space 7}Q35_5 {c |}{col 14}{res}{space 2}-.5801247{col 26}{space 2} .2340818{col 37}{space 1}   -2.48{col 46}{space 3}0.013{col 54}{space 4}-1.039016{col 67}{space 3} -.121233
{txt}{space 7}Q35_6 {c |}{col 14}{res}{space 2} .1761797{col 26}{space 2} .2142752{col 37}{space 1}    0.82{col 46}{space 3}0.411{col 54}{space 4}-.2438835{col 67}{space 3} .5962428
{txt}{space 7}Q4new {c |}{col 14}{res}{space 2}-.0045023{col 26}{space 2} .0015728{col 37}{space 1}   -2.86{col 46}{space 3}0.004{col 54}{space 4}-.0075856{col 67}{space 3} -.001419
{txt}{space 7}Q6new {c |}{col 14}{res}{space 2} .0009659{col 26}{space 2} .0016571{col 37}{space 1}    0.58{col 46}{space 3}0.560{col 54}{space 4}-.0022827{col 67}{space 3} .0042144
{txt}{space 5}Q9_mean {c |}{col 14}{res}{space 2} .0464885{col 26}{space 2} .0096565{col 37}{space 1}    4.81{col 46}{space 3}0.000{col 54}{space 4} .0275579{col 67}{space 3} .0654191
{txt}{space 6}Q13new {c |}{col 14}{res}{space 2}-.0110622{col 26}{space 2} .0017095{col 37}{space 1}   -6.47{col 46}{space 3}0.000{col 54}{space 4}-.0144134{col 67}{space 3}-.0077109
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.835937{col 26}{space 2}  4.27963{col 37}{space 1}    0.66{col 46}{space 3}0.508{col 54}{space 4}-5.553809{col 67}{space 3} 11.22568
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est12{txt} stored)

Linear regression                                      Number of obs ={res}    6737
                                                       {txt}F( 63,  6673) ={res}    1.43
                                                       {txt}Prob > F      = {res} 0.0139
                                                       {txt}R-squared     = {res} 0.0128
                                                       {txt}Root MSE      = {res} .86586

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}      IncVar{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2} .0253782{col 26}{space 2} .0575128{col 37}{space 1}    0.44{col 46}{space 3}0.659{col 54}{space 4}-.0873652{col 67}{space 3} .1381216
{txt}{space 8}Old  {c |}{col 14}{res}{space 2} .0839625{col 26}{space 2} .0812069{col 37}{space 1}    1.03{col 46}{space 3}0.301{col 54}{space 4}-.0752289{col 67}{space 3} .2431539
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2}  .039128{col 26}{space 2}  .039323{col 37}{space 1}    1.00{col 46}{space 3}0.320{col 54}{space 4}-.0379576{col 67}{space 3} .1162136
{txt}High Educ..  {c |}{col 14}{res}{space 2}-.0226604{col 26}{space 2} .0379181{col 37}{space 1}   -0.60{col 46}{space 3}0.550{col 54}{space 4} -.096992{col 67}{space 3} .0516712
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2}-.1051126{col 26}{space 2} .0341799{col 37}{space 1}   -3.08{col 46}{space 3}0.002{col 54}{space 4} -.172116{col 67}{space 3}-.0381092
{txt}High Income  {c |}{col 14}{res}{space 2} -.090712{col 26}{space 2} .0350408{col 37}{space 1}   -2.59{col 46}{space 3}0.010{col 54}{space 4}-.1594032{col 67}{space 3}-.0220209
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2}-.0312212{col 26}{space 2} .0590033{col 37}{space 1}   -0.53{col 46}{space 3}0.597{col 54}{space 4}-.1468865{col 67}{space 3} .0844441
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} .0119981{col 26}{space 2} .0836927{col 37}{space 1}    0.14{col 46}{space 3}0.886{col 54}{space 4}-.1520664{col 67}{space 3} .1760626
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2} -.003215{col 26}{space 2} .0317184{col 37}{space 1}   -0.10{col 46}{space 3}0.919{col 54}{space 4}-.0653933{col 67}{space 3} .0589633
{txt}{space 7}2015  {c |}{col 14}{res}{space 2} .0101419{col 26}{space 2} .0328642{col 37}{space 1}    0.31{col 46}{space 3}0.758{col 54}{space 4}-.0542825{col 67}{space 3} .0745662
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0151094{col 26}{space 2} .0330318{col 37}{space 1}    0.46{col 46}{space 3}0.647{col 54}{space 4}-.0496434{col 67}{space 3} .0798622
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0706931{col 26}{space 2} .0358755{col 37}{space 1}    1.97{col 46}{space 3}0.049{col 54}{space 4} .0003657{col 67}{space 3} .1410205
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1046348{col 26}{space 2} .0502904{col 37}{space 1}    2.08{col 46}{space 3}0.038{col 54}{space 4} .0060496{col 67}{space 3}   .20322
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2}-.9295068{col 26}{space 2} .8051857{col 37}{space 1}   -1.15{col 46}{space 3}0.248{col 54}{space 4}-2.507928{col 67}{space 3} .6489144
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-.7646993{col 26}{space 2} .8145643{col 37}{space 1}   -0.94{col 46}{space 3}0.348{col 54}{space 4}-2.361506{col 67}{space 3} .8321069
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-.9397345{col 26}{space 2} .8022493{col 37}{space 1}   -1.17{col 46}{space 3}0.241{col 54}{space 4}-2.512399{col 67}{space 3} .6329304
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-.8562112{col 26}{space 2} .8018227{col 37}{space 1}   -1.07{col 46}{space 3}0.286{col 54}{space 4} -2.42804{col 67}{space 3} .7156175
{txt}{space 9}CO  {c |}{col 14}{res}{space 2}-1.039858{col 26}{space 2} .8020361{col 37}{space 1}   -1.30{col 46}{space 3}0.195{col 54}{space 4}-2.612105{col 67}{space 3} .5323885
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-1.017315{col 26}{space 2} .8021082{col 37}{space 1}   -1.27{col 46}{space 3}0.205{col 54}{space 4}-2.589704{col 67}{space 3} .5550734
{txt}{space 9}DC  {c |}{col 14}{res}{space 2}-1.004041{col 26}{space 2} .8132534{col 37}{space 1}   -1.23{col 46}{space 3}0.217{col 54}{space 4}-2.598277{col 67}{space 3} .5901957
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-1.095021{col 26}{space 2} .8041914{col 37}{space 1}   -1.36{col 46}{space 3}0.173{col 54}{space 4}-2.671493{col 67}{space 3} .4814515
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-.8424436{col 26}{space 2} .8022962{col 37}{space 1}   -1.05{col 46}{space 3}0.294{col 54}{space 4}-2.415201{col 67}{space 3} .7303134
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-.8702478{col 26}{space 2} .8033164{col 37}{space 1}   -1.08{col 46}{space 3}0.279{col 54}{space 4}-2.445005{col 67}{space 3} .7045091
{txt}{space 9}HI  {c |}{col 14}{res}{space 2}-.9533063{col 26}{space 2} .8087549{col 37}{space 1}   -1.18{col 46}{space 3}0.239{col 54}{space 4}-2.538724{col 67}{space 3} .6321116
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-1.005471{col 26}{space 2} .8018359{col 37}{space 1}   -1.25{col 46}{space 3}0.210{col 54}{space 4}-2.577325{col 67}{space 3}  .566384
{txt}{space 9}ID  {c |}{col 14}{res}{space 2}-.7808987{col 26}{space 2} .8150362{col 37}{space 1}   -0.96{col 46}{space 3}0.338{col 54}{space 4} -2.37863{col 67}{space 3} .8168327
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-.9840277{col 26}{space 2} .8014272{col 37}{space 1}   -1.23{col 46}{space 3}0.220{col 54}{space 4}-2.555081{col 67}{space 3} .5870257
{txt}{space 9}IN  {c |}{col 14}{res}{space 2} -.875303{col 26}{space 2}  .804804{col 37}{space 1}   -1.09{col 46}{space 3}0.277{col 54}{space 4}-2.452976{col 67}{space 3}   .70237
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-.8267438{col 26}{space 2}  .810203{col 37}{space 1}   -1.02{col 46}{space 3}0.308{col 54}{space 4}-2.415001{col 67}{space 3}  .761513
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-.8803325{col 26}{space 2} .8075979{col 37}{space 1}   -1.09{col 46}{space 3}0.276{col 54}{space 4}-2.463482{col 67}{space 3} .7028174
{txt}{space 9}LA  {c |}{col 14}{res}{space 2} -1.00883{col 26}{space 2}  .805305{col 37}{space 1}   -1.25{col 46}{space 3}0.210{col 54}{space 4}-2.587486{col 67}{space 3} .5698247
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-.8575864{col 26}{space 2} .8040205{col 37}{space 1}   -1.07{col 46}{space 3}0.286{col 54}{space 4}-2.433723{col 67}{space 3} .7185507
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-.9102802{col 26}{space 2} .8045332{col 37}{space 1}   -1.13{col 46}{space 3}0.258{col 54}{space 4}-2.487422{col 67}{space 3} .6668619
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-.8735061{col 26}{space 2} .8059382{col 37}{space 1}   -1.08{col 46}{space 3}0.278{col 54}{space 4}-2.453403{col 67}{space 3} .7063903
{txt}{space 9}MI  {c |}{col 14}{res}{space 2}-.9998826{col 26}{space 2} .8013214{col 37}{space 1}   -1.25{col 46}{space 3}0.212{col 54}{space 4}-2.570729{col 67}{space 3} .5709634
{txt}{space 9}MN  {c |}{col 14}{res}{space 2} -1.00175{col 26}{space 2} .8026008{col 37}{space 1}   -1.25{col 46}{space 3}0.212{col 54}{space 4}-2.575104{col 67}{space 3}  .571604
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-.9487086{col 26}{space 2} .8031628{col 37}{space 1}   -1.18{col 46}{space 3}0.238{col 54}{space 4}-2.523164{col 67}{space 3} .6257472
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-.9750754{col 26}{space 2} .8096368{col 37}{space 1}   -1.20{col 46}{space 3}0.229{col 54}{space 4}-2.562222{col 67}{space 3} .6120715
{txt}{space 9}MT  {c |}{col 14}{res}{space 2}-.8888243{col 26}{space 2} .8091799{col 37}{space 1}   -1.10{col 46}{space 3}0.272{col 54}{space 4}-2.475075{col 67}{space 3} .6974269
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-.8777627{col 26}{space 2} .8030682{col 37}{space 1}   -1.09{col 46}{space 3}0.274{col 54}{space 4}-2.452033{col 67}{space 3} .6965076
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-.9136281{col 26}{space 2} .8183938{col 37}{space 1}   -1.12{col 46}{space 3}0.264{col 54}{space 4}-2.517942{col 67}{space 3} .6906852
{txt}{space 9}NE  {c |}{col 14}{res}{space 2} -.969173{col 26}{space 2} .8080331{col 37}{space 1}   -1.20{col 46}{space 3}0.230{col 54}{space 4}-2.553176{col 67}{space 3}   .61483
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-.8442071{col 26}{space 2} .8099698{col 37}{space 1}   -1.04{col 46}{space 3}0.297{col 54}{space 4}-2.432007{col 67}{space 3} .7435925
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-.9671836{col 26}{space 2} .8026883{col 37}{space 1}   -1.20{col 46}{space 3}0.228{col 54}{space 4}-2.540709{col 67}{space 3} .6063419
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-1.087545{col 26}{space 2}  .802791{col 37}{space 1}   -1.35{col 46}{space 3}0.176{col 54}{space 4}-2.661272{col 67}{space 3} .4861821
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}-.8147231{col 26}{space 2} .8138409{col 37}{space 1}   -1.00{col 46}{space 3}0.317{col 54}{space 4}-2.410111{col 67}{space 3} .7806652
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-.8867245{col 26}{space 2} .8017672{col 37}{space 1}   -1.11{col 46}{space 3}0.269{col 54}{space 4}-2.458444{col 67}{space 3} .6849954
{txt}{space 9}OH  {c |}{col 14}{res}{space 2} -.899403{col 26}{space 2} .8022425{col 37}{space 1}   -1.12{col 46}{space 3}0.262{col 54}{space 4}-2.472055{col 67}{space 3} .6732487
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-.8780012{col 26}{space 2} .8115134{col 37}{space 1}   -1.08{col 46}{space 3}0.279{col 54}{space 4}-2.468827{col 67}{space 3} .7128244
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-.9798415{col 26}{space 2} .8020583{col 37}{space 1}   -1.22{col 46}{space 3}0.222{col 54}{space 4}-2.552132{col 67}{space 3} .5924492
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-.9214465{col 26}{space 2} .8015906{col 37}{space 1}   -1.15{col 46}{space 3}0.250{col 54}{space 4} -2.49282{col 67}{space 3} .6499272
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-.8290034{col 26}{space 2} .8348428{col 37}{space 1}   -0.99{col 46}{space 3}0.321{col 54}{space 4}-2.465562{col 67}{space 3} .8075553
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-.9018217{col 26}{space 2} .8066541{col 37}{space 1}   -1.12{col 46}{space 3}0.264{col 54}{space 4}-2.483121{col 67}{space 3} .6794782
{txt}{space 9}SD  {c |}{col 14}{res}{space 2}-.8575322{col 26}{space 2} .8164488{col 37}{space 1}   -1.05{col 46}{space 3}0.294{col 54}{space 4}-2.458033{col 67}{space 3} .7429684
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-.8217142{col 26}{space 2} .8064635{col 37}{space 1}   -1.02{col 46}{space 3}0.308{col 54}{space 4} -2.40264{col 67}{space 3}  .759212
{txt}{space 9}TX  {c |}{col 14}{res}{space 2} -.885829{col 26}{space 2} .8020732{col 37}{space 1}   -1.10{col 46}{space 3}0.269{col 54}{space 4}-2.458149{col 67}{space 3} .6864907
{txt}{space 9}UT  {c |}{col 14}{res}{space 2} -.931526{col 26}{space 2} .8053476{col 37}{space 1}   -1.16{col 46}{space 3}0.247{col 54}{space 4}-2.510265{col 67}{space 3} .6472126
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}-.8795091{col 26}{space 2} .8034943{col 37}{space 1}   -1.09{col 46}{space 3}0.274{col 54}{space 4}-2.454615{col 67}{space 3} .6955964
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}-.5213741{col 26}{space 2} .8302922{col 37}{space 1}   -0.63{col 46}{space 3}0.530{col 54}{space 4}-2.149012{col 67}{space 3} 1.106264
{txt}{space 9}WA  {c |}{col 14}{res}{space 2} -.885576{col 26}{space 2} .8038051{col 37}{space 1}   -1.10{col 46}{space 3}0.271{col 54}{space 4}-2.461291{col 67}{space 3} .6901389
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-.9643063{col 26}{space 2} .8032131{col 37}{space 1}   -1.20{col 46}{space 3}0.230{col 54}{space 4}-2.538861{col 67}{space 3}  .610248
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-1.073074{col 26}{space 2} .8030289{col 37}{space 1}   -1.34{col 46}{space 3}0.182{col 54}{space 4}-2.647268{col 67}{space 3} .5011189
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-.9978425{col 26}{space 2} .8039941{col 37}{space 1}   -1.24{col 46}{space 3}0.215{col 54}{space 4}-2.573928{col 67}{space 3} .5782428
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.385664{col 26}{space 2} .8037059{col 37}{space 1}    1.72{col 46}{space 3}0.085{col 54}{space 4}-.1898567{col 67}{space 3} 2.961184
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est13{txt} stored)

Linear regression                                      Number of obs ={res}    6735
                                                       {txt}F( 71,  6663) ={res}    1.49
                                                       {txt}Prob > F      = {res} 0.0051
                                                       {txt}R-squared     = {res} 0.0152
                                                       {txt}Root MSE      = {res} .86542

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}      IncVar{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2} .0253438{col 26}{space 2} .0576321{col 37}{space 1}    0.44{col 46}{space 3}0.660{col 54}{space 4}-.0876335{col 67}{space 3} .1383212
{txt}{space 8}Old  {c |}{col 14}{res}{space 2} .0888976{col 26}{space 2} .0815164{col 37}{space 1}    1.09{col 46}{space 3}0.276{col 54}{space 4}-.0709006{col 67}{space 3} .2486959
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2} .0344982{col 26}{space 2} .0395241{col 37}{space 1}    0.87{col 46}{space 3}0.383{col 54}{space 4}-.0429818{col 67}{space 3} .1119781
{txt}High Educ..  {c |}{col 14}{res}{space 2}-.0218427{col 26}{space 2} .0380716{col 37}{space 1}   -0.57{col 46}{space 3}0.566{col 54}{space 4}-.0964753{col 67}{space 3} .0527899
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2} -.098625{col 26}{space 2} .0341429{col 37}{space 1}   -2.89{col 46}{space 3}0.004{col 54}{space 4} -.165556{col 67}{space 3} -.031694
{txt}High Income  {c |}{col 14}{res}{space 2}-.0705564{col 26}{space 2} .0354637{col 37}{space 1}   -1.99{col 46}{space 3}0.047{col 54}{space 4}-.1400766{col 67}{space 3}-.0010362
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2}-.0332562{col 26}{space 2} .0594346{col 37}{space 1}   -0.56{col 46}{space 3}0.576{col 54}{space 4}-.1497671{col 67}{space 3} .0832548
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} .0097731{col 26}{space 2} .0844523{col 37}{space 1}    0.12{col 46}{space 3}0.908{col 54}{space 4}-.1557804{col 67}{space 3} .1753267
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2}-.0032375{col 26}{space 2} .0314804{col 37}{space 1}   -0.10{col 46}{space 3}0.918{col 54}{space 4}-.0649492{col 67}{space 3} .0584743
{txt}{space 7}2015  {c |}{col 14}{res}{space 2} .0084406{col 26}{space 2} .0327962{col 37}{space 1}    0.26{col 46}{space 3}0.797{col 54}{space 4}-.0558504{col 67}{space 3} .0727316
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0105993{col 26}{space 2} .0331651{col 37}{space 1}    0.32{col 46}{space 3}0.749{col 54}{space 4} -.054415{col 67}{space 3} .0756135
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0691195{col 26}{space 2} .0358575{col 37}{space 1}    1.93{col 46}{space 3}0.054{col 54}{space 4}-.0011726{col 67}{space 3} .1394116
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}  .103224{col 26}{space 2} .0501992{col 37}{space 1}    2.06{col 46}{space 3}0.040{col 54}{space 4} .0048176{col 67}{space 3} .2016304
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2}-.9264176{col 26}{space 2} .8057728{col 37}{space 1}   -1.15{col 46}{space 3}0.250{col 54}{space 4} -2.50599{col 67}{space 3}  .653155
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-.7544744{col 26}{space 2} .8151441{col 37}{space 1}   -0.93{col 46}{space 3}0.355{col 54}{space 4}-2.352418{col 67}{space 3}  .843469
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-.9283261{col 26}{space 2} .8029098{col 37}{space 1}   -1.16{col 46}{space 3}0.248{col 54}{space 4}-2.502286{col 67}{space 3} .6456342
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-.8433552{col 26}{space 2} .8036781{col 37}{space 1}   -1.05{col 46}{space 3}0.294{col 54}{space 4}-2.418821{col 67}{space 3} .7321111
{txt}{space 9}CO  {c |}{col 14}{res}{space 2} -1.02606{col 26}{space 2} .8032138{col 37}{space 1}   -1.28{col 46}{space 3}0.201{col 54}{space 4}-2.600617{col 67}{space 3} .5484958
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-1.008615{col 26}{space 2} .8028675{col 37}{space 1}   -1.26{col 46}{space 3}0.209{col 54}{space 4}-2.582492{col 67}{space 3} .5652622
{txt}{space 9}DC  {c |}{col 14}{res}{space 2}-1.003324{col 26}{space 2} .8142374{col 37}{space 1}   -1.23{col 46}{space 3}0.218{col 54}{space 4} -2.59949{col 67}{space 3} .5928425
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-1.086358{col 26}{space 2} .8051728{col 37}{space 1}   -1.35{col 46}{space 3}0.177{col 54}{space 4}-2.664754{col 67}{space 3} .4920389
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-.8277053{col 26}{space 2}  .803297{col 37}{space 1}   -1.03{col 46}{space 3}0.303{col 54}{space 4}-2.402425{col 67}{space 3} .7470139
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-.8626942{col 26}{space 2} .8039398{col 37}{space 1}   -1.07{col 46}{space 3}0.283{col 54}{space 4}-2.438674{col 67}{space 3} .7132852
{txt}{space 9}HI  {c |}{col 14}{res}{space 2}-.8405788{col 26}{space 2} .8139954{col 37}{space 1}   -1.03{col 46}{space 3}0.302{col 54}{space 4} -2.43627{col 67}{space 3} .7551128
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-.9800031{col 26}{space 2} .8026055{col 37}{space 1}   -1.22{col 46}{space 3}0.222{col 54}{space 4}-2.553367{col 67}{space 3} .5933606
{txt}{space 9}ID  {c |}{col 14}{res}{space 2}-.7538197{col 26}{space 2} .8158962{col 37}{space 1}   -0.92{col 46}{space 3}0.356{col 54}{space 4}-2.353237{col 67}{space 3}  .845598
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-.9685512{col 26}{space 2} .8026362{col 37}{space 1}   -1.21{col 46}{space 3}0.228{col 54}{space 4}-2.541975{col 67}{space 3} .6048728
{txt}{space 9}IN  {c |}{col 14}{res}{space 2}-.8550185{col 26}{space 2} .8053782{col 37}{space 1}   -1.06{col 46}{space 3}0.288{col 54}{space 4}-2.433818{col 67}{space 3} .7237806
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-.8077855{col 26}{space 2} .8110837{col 37}{space 1}   -1.00{col 46}{space 3}0.319{col 54}{space 4}-2.397769{col 67}{space 3} .7821982
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-.8639304{col 26}{space 2} .8082132{col 37}{space 1}   -1.07{col 46}{space 3}0.285{col 54}{space 4}-2.448287{col 67}{space 3} .7204263
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-1.004768{col 26}{space 2} .8060604{col 37}{space 1}   -1.25{col 46}{space 3}0.213{col 54}{space 4}-2.584904{col 67}{space 3} .5753683
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-.8449011{col 26}{space 2} .8050624{col 37}{space 1}   -1.05{col 46}{space 3}0.294{col 54}{space 4}-2.423081{col 67}{space 3} .7332789
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-.9038258{col 26}{space 2} .8054804{col 37}{space 1}   -1.12{col 46}{space 3}0.262{col 54}{space 4}-2.482825{col 67}{space 3} .6751736
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-.8573235{col 26}{space 2} .8072207{col 37}{space 1}   -1.06{col 46}{space 3}0.288{col 54}{space 4}-2.439734{col 67}{space 3} .7250874
{txt}{space 9}MI  {c |}{col 14}{res}{space 2}-.9786669{col 26}{space 2}   .80202{col 37}{space 1}   -1.22{col 46}{space 3}0.222{col 54}{space 4}-2.550883{col 67}{space 3} .5935491
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-.9804617{col 26}{space 2} .8037095{col 37}{space 1}   -1.22{col 46}{space 3}0.223{col 54}{space 4}-2.555989{col 67}{space 3} .5950661
{txt}{space 9}MO  {c |}{col 14}{res}{space 2} -.929258{col 26}{space 2} .8039884{col 37}{space 1}   -1.16{col 46}{space 3}0.248{col 54}{space 4}-2.505333{col 67}{space 3} .6468166
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-.9749289{col 26}{space 2} .8103567{col 37}{space 1}   -1.20{col 46}{space 3}0.229{col 54}{space 4}-2.563487{col 67}{space 3} .6136296
{txt}{space 9}MT  {c |}{col 14}{res}{space 2}-.8691131{col 26}{space 2} .8095131{col 37}{space 1}   -1.07{col 46}{space 3}0.283{col 54}{space 4}-2.456018{col 67}{space 3} .7177918
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-.8601353{col 26}{space 2} .8037435{col 37}{space 1}   -1.07{col 46}{space 3}0.285{col 54}{space 4} -2.43573{col 67}{space 3} .7154591
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-.8924989{col 26}{space 2} .8195749{col 37}{space 1}   -1.09{col 46}{space 3}0.276{col 54}{space 4}-2.499128{col 67}{space 3} .7141302
{txt}{space 9}NE  {c |}{col 14}{res}{space 2}-.9492184{col 26}{space 2} .8086613{col 37}{space 1}   -1.17{col 46}{space 3}0.241{col 54}{space 4}-2.534453{col 67}{space 3} .6360166
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-.8261565{col 26}{space 2} .8106183{col 37}{space 1}   -1.02{col 46}{space 3}0.308{col 54}{space 4}-2.415228{col 67}{space 3} .7629147
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-.9504762{col 26}{space 2} .8038418{col 37}{space 1}   -1.18{col 46}{space 3}0.237{col 54}{space 4}-2.526264{col 67}{space 3} .6253111
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-1.083095{col 26}{space 2} .8036621{col 37}{space 1}   -1.35{col 46}{space 3}0.178{col 54}{space 4} -2.65853{col 67}{space 3} .4923395
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}-.7954725{col 26}{space 2} .8149809{col 37}{space 1}   -0.98{col 46}{space 3}0.329{col 54}{space 4}-2.393096{col 67}{space 3} .8021508
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-.8696249{col 26}{space 2} .8030526{col 37}{space 1}   -1.08{col 46}{space 3}0.279{col 54}{space 4}-2.443865{col 67}{space 3} .7046152
{txt}{space 9}OH  {c |}{col 14}{res}{space 2} -.876265{col 26}{space 2}  .803072{col 37}{space 1}   -1.09{col 46}{space 3}0.275{col 54}{space 4}-2.450543{col 67}{space 3} .6980132
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-.8630292{col 26}{space 2} .8122106{col 37}{space 1}   -1.06{col 46}{space 3}0.288{col 54}{space 4}-2.455222{col 67}{space 3} .7291636
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-.9651199{col 26}{space 2} .8029471{col 37}{space 1}   -1.20{col 46}{space 3}0.229{col 54}{space 4}-2.539153{col 67}{space 3} .6089135
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-.9056176{col 26}{space 2} .8024028{col 37}{space 1}   -1.13{col 46}{space 3}0.259{col 54}{space 4}-2.478584{col 67}{space 3} .6673487
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-.8091038{col 26}{space 2} .8356196{col 37}{space 1}   -0.97{col 46}{space 3}0.333{col 54}{space 4}-2.447186{col 67}{space 3} .8289781
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-.8931882{col 26}{space 2} .8075915{col 37}{space 1}   -1.11{col 46}{space 3}0.269{col 54}{space 4}-2.476326{col 67}{space 3} .6899496
{txt}{space 9}SD  {c |}{col 14}{res}{space 2}-.8337638{col 26}{space 2} .8171615{col 37}{space 1}   -1.02{col 46}{space 3}0.308{col 54}{space 4}-2.435662{col 67}{space 3} .7681343
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-.8038737{col 26}{space 2} .8069798{col 37}{space 1}   -1.00{col 46}{space 3}0.319{col 54}{space 4}-2.385813{col 67}{space 3} .7780651
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-.8726726{col 26}{space 2} .8031434{col 37}{space 1}   -1.09{col 46}{space 3}0.277{col 54}{space 4}-2.447091{col 67}{space 3} .7017455
{txt}{space 9}UT  {c |}{col 14}{res}{space 2}-.8957287{col 26}{space 2} .8062651{col 37}{space 1}   -1.11{col 46}{space 3}0.267{col 54}{space 4}-2.476266{col 67}{space 3}  .684809
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}-.8630009{col 26}{space 2} .8047257{col 37}{space 1}   -1.07{col 46}{space 3}0.284{col 54}{space 4}-2.440521{col 67}{space 3}  .714519
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}-.4965125{col 26}{space 2} .8311407{col 37}{space 1}   -0.60{col 46}{space 3}0.550{col 54}{space 4}-2.125814{col 67}{space 3} 1.132789
{txt}{space 9}WA  {c |}{col 14}{res}{space 2}-.8669034{col 26}{space 2} .8052887{col 37}{space 1}   -1.08{col 46}{space 3}0.282{col 54}{space 4}-2.445527{col 67}{space 3} .7117202
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-.9439619{col 26}{space 2} .8038658{col 37}{space 1}   -1.17{col 46}{space 3}0.240{col 54}{space 4}-2.519796{col 67}{space 3} .6318724
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-1.041874{col 26}{space 2} .8036152{col 37}{space 1}   -1.30{col 46}{space 3}0.195{col 54}{space 4}-2.617217{col 67}{space 3}  .533469
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-.9694849{col 26}{space 2} .8044656{col 37}{space 1}   -1.21{col 46}{space 3}0.228{col 54}{space 4}-2.546495{col 67}{space 3} .6075251
{txt}{space 12} {c |}
{space 7}2.Q33 {c |}{col 14}{res}{space 2}-.0644889{col 26}{space 2} .0216635{col 37}{space 1}   -2.98{col 46}{space 3}0.003{col 54}{space 4}-.1069563{col 67}{space 3}-.0220216
{txt}{space 7}2.Q34 {c |}{col 14}{res}{space 2} .0194828{col 26}{space 2} .0436136{col 37}{space 1}    0.45{col 46}{space 3}0.655{col 54}{space 4}-.0660138{col 67}{space 3} .1049795
{txt}{space 7}Q35_1 {c |}{col 14}{res}{space 2}-.1029656{col 26}{space 2}  .054328{col 37}{space 1}   -1.90{col 46}{space 3}0.058{col 54}{space 4}-.2094659{col 67}{space 3} .0035346
{txt}{space 7}Q35_2 {c |}{col 14}{res}{space 2}-.0513987{col 26}{space 2} .0592579{col 37}{space 1}   -0.87{col 46}{space 3}0.386{col 54}{space 4}-.1675632{col 67}{space 3} .0647657
{txt}{space 7}Q35_3 {c |}{col 14}{res}{space 2}-.0326533{col 26}{space 2} .0776536{col 37}{space 1}   -0.42{col 46}{space 3}0.674{col 54}{space 4}-.1848793{col 67}{space 3} .1195726
{txt}{space 7}Q35_4 {c |}{col 14}{res}{space 2}-.1448894{col 26}{space 2} .0611723{col 37}{space 1}   -2.37{col 46}{space 3}0.018{col 54}{space 4}-.2648066{col 67}{space 3}-.0249722
{txt}{space 7}Q35_5 {c |}{col 14}{res}{space 2}-.1311824{col 26}{space 2} .0911437{col 37}{space 1}   -1.44{col 46}{space 3}0.150{col 54}{space 4}-.3098532{col 67}{space 3} .0474885
{txt}{space 7}Q35_6 {c |}{col 14}{res}{space 2} .0038768{col 26}{space 2} .0660417{col 37}{space 1}    0.06{col 46}{space 3}0.953{col 54}{space 4} -.125586{col 67}{space 3} .1333396
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.474957{col 26}{space 2} .8088064{col 37}{space 1}    1.82{col 46}{space 3}0.068{col 54}{space 4}-.1105625{col 67}{space 3} 3.060476
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est14{txt} stored)

Linear regression                                      Number of obs ={res}    5639
                                                       {txt}F( 75,  5563) ={res}    1.78
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0251
                                                       {txt}Root MSE      = {res} .72709

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}      IncVar{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2} .0305808{col 26}{space 2} .0561643{col 37}{space 1}    0.54{col 46}{space 3}0.586{col 54}{space 4}-.0795231{col 67}{space 3} .1406848
{txt}{space 8}Old  {c |}{col 14}{res}{space 2} .0687528{col 26}{space 2} .0762282{col 37}{space 1}    0.90{col 46}{space 3}0.367{col 54}{space 4}-.0806842{col 67}{space 3} .2181897
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2}   .02683{col 26}{space 2} .0391745{col 37}{space 1}    0.68{col 46}{space 3}0.493{col 54}{space 4}-.0499673{col 67}{space 3} .1036273
{txt}High Educ..  {c |}{col 14}{res}{space 2} -.025491{col 26}{space 2} .0366073{col 37}{space 1}   -0.70{col 46}{space 3}0.486{col 54}{space 4}-.0972556{col 67}{space 3} .0462737
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2}-.0886532{col 26}{space 2} .0321008{col 37}{space 1}   -2.76{col 46}{space 3}0.006{col 54}{space 4}-.1515833{col 67}{space 3} -.025723
{txt}High Income  {c |}{col 14}{res}{space 2} -.071503{col 26}{space 2}  .032661{col 37}{space 1}   -2.19{col 46}{space 3}0.029{col 54}{space 4}-.1355313{col 67}{space 3}-.0074746
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2}-.0086159{col 26}{space 2} .0530592{col 37}{space 1}   -0.16{col 46}{space 3}0.871{col 54}{space 4}-.1126327{col 67}{space 3} .0954008
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} .0389957{col 26}{space 2} .0790729{col 37}{space 1}    0.49{col 46}{space 3}0.622{col 54}{space 4} -.116018{col 67}{space 3} .1940094
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2}-.0041048{col 26}{space 2} .0295275{col 37}{space 1}   -0.14{col 46}{space 3}0.889{col 54}{space 4}-.0619903{col 67}{space 3} .0537806
{txt}{space 7}2015  {c |}{col 14}{res}{space 2}  .023668{col 26}{space 2}  .031481{col 37}{space 1}    0.75{col 46}{space 3}0.452{col 54}{space 4}-.0380472{col 67}{space 3} .0853831
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0125474{col 26}{space 2} .0301642{col 37}{space 1}    0.42{col 46}{space 3}0.677{col 54}{space 4}-.0465862{col 67}{space 3}  .071681
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0431534{col 26}{space 2} .0325787{col 37}{space 1}    1.32{col 46}{space 3}0.185{col 54}{space 4}-.0207136{col 67}{space 3} .1070204
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}  .077467{col 26}{space 2} .0439221{col 37}{space 1}    1.76{col 46}{space 3}0.078{col 54}{space 4}-.0086376{col 67}{space 3} .1635715
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2}-1.541007{col 26}{space 2} .9723082{col 37}{space 1}   -1.58{col 46}{space 3}0.113{col 54}{space 4}-3.447111{col 67}{space 3} .3650966
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-1.446623{col 26}{space 2} .9781334{col 37}{space 1}   -1.48{col 46}{space 3}0.139{col 54}{space 4}-3.364146{col 67}{space 3} .4709008
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-1.602569{col 26}{space 2} .9690454{col 37}{space 1}   -1.65{col 46}{space 3}0.098{col 54}{space 4}-3.502276{col 67}{space 3} .2971385
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-1.567702{col 26}{space 2} .9694628{col 37}{space 1}   -1.62{col 46}{space 3}0.106{col 54}{space 4}-3.468228{col 67}{space 3} .3328239
{txt}{space 9}CO  {c |}{col 14}{res}{space 2} -1.68602{col 26}{space 2} .9682825{col 37}{space 1}   -1.74{col 46}{space 3}0.082{col 54}{space 4}-3.584232{col 67}{space 3}  .212192
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-1.635934{col 26}{space 2} .9689703{col 37}{space 1}   -1.69{col 46}{space 3}0.091{col 54}{space 4}-3.535494{col 67}{space 3}  .263626
{txt}{space 9}DC  {c |}{col 14}{res}{space 2}-1.608131{col 26}{space 2} .9808792{col 37}{space 1}   -1.64{col 46}{space 3}0.101{col 54}{space 4}-3.531037{col 67}{space 3} .3147754
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-1.705633{col 26}{space 2} .9720786{col 37}{space 1}   -1.75{col 46}{space 3}0.079{col 54}{space 4}-3.611286{col 67}{space 3} .2000211
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-1.511114{col 26}{space 2} .9692011{col 37}{space 1}   -1.56{col 46}{space 3}0.119{col 54}{space 4}-3.411126{col 67}{space 3} .3888987
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-1.535957{col 26}{space 2}  .969738{col 37}{space 1}   -1.58{col 46}{space 3}0.113{col 54}{space 4}-3.437022{col 67}{space 3} .3651084
{txt}{space 9}HI  {c |}{col 14}{res}{space 2}-1.576467{col 26}{space 2} .9737726{col 37}{space 1}   -1.62{col 46}{space 3}0.106{col 54}{space 4}-3.485441{col 67}{space 3} .3325078
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-1.639217{col 26}{space 2}  .969031{col 37}{space 1}   -1.69{col 46}{space 3}0.091{col 54}{space 4}-3.538897{col 67}{space 3} .2604616
{txt}{space 9}ID  {c |}{col 14}{res}{space 2}-1.334366{col 26}{space 2} .9859909{col 37}{space 1}   -1.35{col 46}{space 3}0.176{col 54}{space 4}-3.267293{col 67}{space 3}  .598561
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-1.596441{col 26}{space 2} .9687041{col 37}{space 1}   -1.65{col 46}{space 3}0.099{col 54}{space 4}-3.495479{col 67}{space 3} .3025974
{txt}{space 9}IN  {c |}{col 14}{res}{space 2}-1.560408{col 26}{space 2} .9702551{col 37}{space 1}   -1.61{col 46}{space 3}0.108{col 54}{space 4}-3.462487{col 67}{space 3} .3416713
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-1.593608{col 26}{space 2} .9727058{col 37}{space 1}   -1.64{col 46}{space 3}0.101{col 54}{space 4}-3.500491{col 67}{space 3} .3132757
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-1.483622{col 26}{space 2}  .975421{col 37}{space 1}   -1.52{col 46}{space 3}0.128{col 54}{space 4}-3.395828{col 67}{space 3} .4285836
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-1.575673{col 26}{space 2} .9732415{col 37}{space 1}   -1.62{col 46}{space 3}0.106{col 54}{space 4}-3.483607{col 67}{space 3} .3322601
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-1.499325{col 26}{space 2} .9709195{col 37}{space 1}   -1.54{col 46}{space 3}0.123{col 54}{space 4}-3.402707{col 67}{space 3}  .404056
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-1.572546{col 26}{space 2} .9704978{col 37}{space 1}   -1.62{col 46}{space 3}0.105{col 54}{space 4}-3.475101{col 67}{space 3} .3300086
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-1.465711{col 26}{space 2} .9741304{col 37}{space 1}   -1.50{col 46}{space 3}0.132{col 54}{space 4}-3.375387{col 67}{space 3} .4439649
{txt}{space 9}MI  {c |}{col 14}{res}{space 2}-1.639533{col 26}{space 2} .9684024{col 37}{space 1}   -1.69{col 46}{space 3}0.091{col 54}{space 4} -3.53798{col 67}{space 3} .2589135
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-1.613933{col 26}{space 2} .9696784{col 37}{space 1}   -1.66{col 46}{space 3}0.096{col 54}{space 4}-3.514882{col 67}{space 3} .2870149
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-1.585829{col 26}{space 2} .9695872{col 37}{space 1}   -1.64{col 46}{space 3}0.102{col 54}{space 4}-3.486598{col 67}{space 3} .3149409
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-1.690189{col 26}{space 2} .9691338{col 37}{space 1}   -1.74{col 46}{space 3}0.081{col 54}{space 4}-3.590069{col 67}{space 3}  .209692
{txt}{space 9}MT  {c |}{col 14}{res}{space 2}-1.441391{col 26}{space 2} .9775575{col 37}{space 1}   -1.47{col 46}{space 3}0.140{col 54}{space 4}-3.357785{col 67}{space 3} .4750033
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-1.544664{col 26}{space 2} .9695941{col 37}{space 1}   -1.59{col 46}{space 3}0.111{col 54}{space 4}-3.445447{col 67}{space 3} .3561191
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-1.512682{col 26}{space 2} .9850322{col 37}{space 1}   -1.54{col 46}{space 3}0.125{col 54}{space 4} -3.44373{col 67}{space 3} .4183655
{txt}{space 9}NE  {c |}{col 14}{res}{space 2} -1.58333{col 26}{space 2} .9756246{col 37}{space 1}   -1.62{col 46}{space 3}0.105{col 54}{space 4}-3.495935{col 67}{space 3} .3292754
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-1.550375{col 26}{space 2} .9701637{col 37}{space 1}   -1.60{col 46}{space 3}0.110{col 54}{space 4}-3.452274{col 67}{space 3} .3515249
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-1.571923{col 26}{space 2} .9702647{col 37}{space 1}   -1.62{col 46}{space 3}0.105{col 54}{space 4}-3.474021{col 67}{space 3} .3301748
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-1.685304{col 26}{space 2} .9694574{col 37}{space 1}   -1.74{col 46}{space 3}0.082{col 54}{space 4}-3.585819{col 67}{space 3} .2152116
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}-1.525814{col 26}{space 2} .9771995{col 37}{space 1}   -1.56{col 46}{space 3}0.118{col 54}{space 4}-3.441506{col 67}{space 3} .3898789
{txt}{space 9}NY  {c |}{col 14}{res}{space 2} -1.58238{col 26}{space 2}  .968633{col 37}{space 1}   -1.63{col 46}{space 3}0.102{col 54}{space 4}-3.481279{col 67}{space 3} .3165186
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-1.510957{col 26}{space 2} .9693743{col 37}{space 1}   -1.56{col 46}{space 3}0.119{col 54}{space 4}-3.411309{col 67}{space 3} .3893955
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-1.641634{col 26}{space 2} .9739719{col 37}{space 1}   -1.69{col 46}{space 3}0.092{col 54}{space 4}-3.550999{col 67}{space 3} .2677314
{txt}{space 9}OR  {c |}{col 14}{res}{space 2} -1.61309{col 26}{space 2} .9693864{col 37}{space 1}   -1.66{col 46}{space 3}0.096{col 54}{space 4}-3.513466{col 67}{space 3} .2872854
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-1.553812{col 26}{space 2} .9686042{col 37}{space 1}   -1.60{col 46}{space 3}0.109{col 54}{space 4}-3.452655{col 67}{space 3} .3450301
{txt}{space 9}RI  {c |}{col 14}{res}{space 2} -1.43428{col 26}{space 2} 1.001136{col 37}{space 1}   -1.43{col 46}{space 3}0.152{col 54}{space 4}-3.396897{col 67}{space 3}  .528338
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-1.510672{col 26}{space 2} .9745461{col 37}{space 1}   -1.55{col 46}{space 3}0.121{col 54}{space 4}-3.421163{col 67}{space 3} .3998185
{txt}{space 9}SD  {c |}{col 14}{res}{space 2}-1.442755{col 26}{space 2}  .990876{col 37}{space 1}   -1.46{col 46}{space 3}0.145{col 54}{space 4}-3.385259{col 67}{space 3} .4997491
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-1.533964{col 26}{space 2} .9723469{col 37}{space 1}   -1.58{col 46}{space 3}0.115{col 54}{space 4}-3.440144{col 67}{space 3} .3722151
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-1.570283{col 26}{space 2} .9687401{col 37}{space 1}   -1.62{col 46}{space 3}0.105{col 54}{space 4}-3.469392{col 67}{space 3} .3288262
{txt}{space 9}UT  {c |}{col 14}{res}{space 2}-1.558339{col 26}{space 2} .9722917{col 37}{space 1}   -1.60{col 46}{space 3}0.109{col 54}{space 4} -3.46441{col 67}{space 3} .3477327
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}-1.559169{col 26}{space 2} .9704068{col 37}{space 1}   -1.61{col 46}{space 3}0.108{col 54}{space 4}-3.461545{col 67}{space 3} .3432075
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}-1.115056{col 26}{space 2} .9938337{col 37}{space 1}   -1.12{col 46}{space 3}0.262{col 54}{space 4}-3.063358{col 67}{space 3} .8332463
{txt}{space 9}WA  {c |}{col 14}{res}{space 2}-1.603499{col 26}{space 2}  .969953{col 37}{space 1}   -1.65{col 46}{space 3}0.098{col 54}{space 4}-3.504985{col 67}{space 3}  .297988
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-1.647377{col 26}{space 2} .9693401{col 37}{space 1}   -1.70{col 46}{space 3}0.089{col 54}{space 4}-3.547663{col 67}{space 3} .2529078
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-1.749593{col 26}{space 2} .9694334{col 37}{space 1}   -1.80{col 46}{space 3}0.071{col 54}{space 4}-3.650061{col 67}{space 3} .1508755
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-1.612121{col 26}{space 2} .9710104{col 37}{space 1}   -1.66{col 46}{space 3}0.097{col 54}{space 4} -3.51568{col 67}{space 3} .2914388
{txt}{space 12} {c |}
{space 7}2.Q33 {c |}{col 14}{res}{space 2}-.0364081{col 26}{space 2} .0196978{col 37}{space 1}   -1.85{col 46}{space 3}0.065{col 54}{space 4}-.0750235{col 67}{space 3} .0022074
{txt}{space 7}2.Q34 {c |}{col 14}{res}{space 2} .0508506{col 26}{space 2} .0357835{col 37}{space 1}    1.42{col 46}{space 3}0.155{col 54}{space 4}-.0192991{col 67}{space 3} .1210003
{txt}{space 7}Q35_1 {c |}{col 14}{res}{space 2}-.0288921{col 26}{space 2} .0487445{col 37}{space 1}   -0.59{col 46}{space 3}0.553{col 54}{space 4}-.1244503{col 67}{space 3} .0666662
{txt}{space 7}Q35_2 {c |}{col 14}{res}{space 2}-.0234102{col 26}{space 2}  .053422{col 37}{space 1}   -0.44{col 46}{space 3}0.661{col 54}{space 4}-.1281382{col 67}{space 3} .0813178
{txt}{space 7}Q35_3 {c |}{col 14}{res}{space 2} .0630367{col 26}{space 2} .0923743{col 37}{space 1}    0.68{col 46}{space 3}0.495{col 54}{space 4}-.1180531{col 67}{space 3} .2441264
{txt}{space 7}Q35_4 {c |}{col 14}{res}{space 2}-.0946498{col 26}{space 2} .0524797{col 37}{space 1}   -1.80{col 46}{space 3}0.071{col 54}{space 4}-.1975306{col 67}{space 3}  .008231
{txt}{space 7}Q35_5 {c |}{col 14}{res}{space 2}-.1846912{col 26}{space 2} .0638484{col 37}{space 1}   -2.89{col 46}{space 3}0.004{col 54}{space 4}-.3098589{col 67}{space 3}-.0595235
{txt}{space 7}Q35_6 {c |}{col 14}{res}{space 2} .0294667{col 26}{space 2} .0557469{col 37}{space 1}    0.53{col 46}{space 3}0.597{col 54}{space 4} -.079819{col 67}{space 3} .1387524
{txt}{space 7}Q4new {c |}{col 14}{res}{space 2}-.0010689{col 26}{space 2} .0004639{col 37}{space 1}   -2.30{col 46}{space 3}0.021{col 54}{space 4}-.0019783{col 67}{space 3}-.0001594
{txt}{space 7}Q6new {c |}{col 14}{res}{space 2}-.0003532{col 26}{space 2}  .000488{col 37}{space 1}   -0.72{col 46}{space 3}0.469{col 54}{space 4}-.0013099{col 67}{space 3} .0006034
{txt}{space 5}Q9_mean {c |}{col 14}{res}{space 2} .0102666{col 26}{space 2}  .002887{col 37}{space 1}    3.56{col 46}{space 3}0.000{col 54}{space 4} .0046069{col 67}{space 3} .0159263
{txt}{space 6}Q13new {c |}{col 14}{res}{space 2}-.0018275{col 26}{space 2} .0004612{col 37}{space 1}   -3.96{col 46}{space 3}0.000{col 54}{space 4}-.0027315{col 67}{space 3}-.0009234
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.032098{col 26}{space 2}  .971287{col 37}{space 1}    2.09{col 46}{space 3}0.036{col 54}{space 4} .1279959{col 67}{space 3}   3.9362
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est15{txt} stored)

{com}. 
. esttab using "${c -(}sum_table_folder{c )-}/mom_group.csv", ///
>              se r2 drop(0.age_g 0.edu_g 0.inc_g 0.cohort_g  *.year *state_id 1.Q33 1.Q34 _cons) ///
>                          label replace
{res}{txt}(output written to {browse  `"/Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/mom_group.csv"'})

{com}. 
. 
. log close 
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/Myworld/Dropbox/IncExpProject/WorkingFolder/indSCE_Est_log.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}29 Oct 2019, 12:03:36
{txt}{.-}
{smcl}
{txt}{sf}{ul off}