{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/Myworld/Dropbox/IncExpProject/WorkingFolder/indSCE_Est_log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}22 Sep 2019, 14:28:54
{txt}
{com}. 
. 
. ***************************
. **  Clean and Merge Data **
. ***************************
. 
. use "${c -(}folder{c )-}/SCE/IncExpSCEDstIndM",clear 
{txt}
{com}. 
. duplicates report year month userid

{p 0 4}{txt}Duplicates in terms of {res} year month userid{p_end}

{txt}{hline 10}{c TT}{hline 27}
   copies {c |} observations       surplus
{hline 10}{c +}{hline 27}
        1 {c |}        {res}79064             0
{txt}{hline 10}{c BT}{hline 27}

{com}. 
. 
. ******************************
. *** Merge with demographics **
. *****************************
. 
. merge 1:1 year month userid using "${c -(}folder{c )-}/SCE/IncExpSCEProbIndM",keep(master match) 
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}          79,064{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge hh_info_merge
{res}{txt}
{com}. 
. *******************************
. **  Set Panel Data Structure **
. *******************************
. rename userid ID 
{res}{txt}
{com}. xtset ID date
{res}{txt}{col 8}panel variable:  {res}ID (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}date, 01jun2013 00:00:00 to 01may2018 00:00:00
{col 25}but with gaps
{txt}{col 17}delta:  {res}.001 seconds
{txt}
{com}. sort ID year month 
{txt}
{com}. 
. 
. *****************************
. *** generate group vars *****
. *****************************
. 
. egen age_g = cut(Q32), group(3)  
{txt}(67434 missing values generated)

{com}. label var age_g "age group"
{txt}
{com}. 
. egen edu_g = cut(Q36), group(3) 
{txt}(67406 missing values generated)

{com}. label var edu_g "education group"
{txt}
{com}. 
. gen gender_g = Q33 
{txt}(67408 missing values generated)

{com}. label var gender_g "gender_grou"
{txt}
{com}. 
. egen inc_g = cut(Q47), group(3)
{txt}(67541 missing values generated)

{com}. label var inc_g "income_g"
{txt}
{com}. 
. 
. local group_vars age_g edu_g inc_g
{txt}
{com}. 
. 
. **********************************
. *** tables and hists of Vars *****
. **********************************
. 
. 
. 
. foreach gp in `group_vars' {c -(}
{txt}  2{com}. tabstat Q24_mean Q24_var Q24_iqr, st(p10 p50 p90) by(`gp')
{txt}  3{com}. {c )-}

{txt}Summary statistics: p10, p50, p90
  by categories of: age_g (age group)

{ralign 8:age_g} {...}
{c |}{...}
  Q24_mean   Q24_var   Q24_iqr
{hline 9}{c +}{hline 30}
{ralign 8:0} {...}
{c |}{...}
 {res} .7777428  .3333333  .9061641
{txt}{space 8} {...}
{c |}{...}
 {res}  2.96196   1.64812         2
{txt}{space 8} {...}
{c |}{...}
 {res} 6.809876  21.20652  10.19136
{txt}{hline 9}{c +}{hline 30}
{ralign 8:1} {...}
{c |}{...}
 {res} .4221108  .3333333  .8810234
{txt}{space 8} {...}
{c |}{...}
 {res} 2.367884  1.056389  1.437962
{txt}{space 8} {...}
{c |}{...}
 {res} 6.025575  17.71149  8.342402
{txt}{hline 9}{c +}{hline 30}
{ralign 8:2} {...}
{c |}{...}
 {res} .7080645  .3333333  .9061639
{txt}{space 8} {...}
{c |}{...}
 {res}        2  1.044458  1.391605
{txt}{space 8} {...}
{c |}{...}
 {res} 6.008746  22.44984    9.5219
{txt}{hline 9}{c +}{hline 30}
{ralign 8:Total} {...}
{c |}{...}
 {res} .6104578  .3333333  .9061639
{txt}{space 8} {...}
{c |}{...}
 {res} 2.537525  1.333333  1.713396
{txt}{space 8} {...}
{c |}{...}
 {res}  6.47924  20.05368  9.336226
{txt}{hline 9}{c BT}{hline 30}

Summary statistics: p10, p50, p90
  by categories of: edu_g (education group)

{ralign 8:edu_g} {...}
{c |}{...}
  Q24_mean   Q24_var   Q24_iqr
{hline 9}{c +}{hline 30}
{ralign 8:0} {...}
{c |}{...}
 {res} 2.08e-08  .3333333         1
{txt}{space 8} {...}
{c |}{...}
 {res}        2  1.333333         2
{txt}{space 8} {...}
{c |}{...}
 {res} 6.558024    30.028        13
{txt}{hline 9}{c +}{hline 30}
{ralign 8:1} {...}
{c |}{...}
 {res} .1782963  .3333333  .9061641
{txt}{space 8} {...}
{c |}{...}
 {res} 2.453082  1.105975   1.57045
{txt}{space 8} {...}
{c |}{...}
 {res} 6.316294  20.84629  12.18417
{txt}{hline 9}{c +}{hline 30}
{ralign 8:2} {...}
{c |}{...}
 {res} .8121909  .3333333  .8566982
{txt}{space 8} {...}
{c |}{...}
 {res} 2.704531  1.333333  1.713398
{txt}{space 8} {...}
{c |}{...}
 {res} 6.486081  18.49858  7.423146
{txt}{hline 9}{c +}{hline 30}
{ralign 8:Total} {...}
{c |}{...}
 {res} .6069536  .3333333  .9061639
{txt}{space 8} {...}
{c |}{...}
 {res} 2.537525  1.333333  1.713396
{txt}{space 8} {...}
{c |}{...}
 {res}  6.47924  20.02004   9.36533
{txt}{hline 9}{c BT}{hline 30}

Summary statistics: p10, p50, p90
  by categories of: inc_g (income_g)

{ralign 8:inc_g} {...}
{c |}{...}
  Q24_mean   Q24_var   Q24_iqr
{hline 9}{c +}{hline 30}
{ralign 8:0} {...}
{c |}{...}
 {res} 2.08e-08  .3333333         1
{txt}{space 8} {...}
{c |}{...}
 {res}        2  1.333333         2
{txt}{space 8} {...}
{c |}{...}
 {res} 6.924951   31.6453        13
{txt}{hline 9}{c +}{hline 30}
{ralign 8:1} {...}
{c |}{...}
 {res} .5375247  .3333333  .9061639
{txt}{space 8} {...}
{c |}{...}
 {res} 2.192116  1.127061  1.508995
{txt}{space 8} {...}
{c |}{...}
 {res}        6  18.76865  8.725375
{txt}{hline 9}{c +}{hline 30}
{ralign 8:2} {...}
{c |}{...}
 {res}        1  .3333333   .856698
{txt}{space 8} {...}
{c |}{...}
 {res} 2.793575  1.333333   1.64027
{txt}{space 8} {...}
{c |}{...}
 {res} 6.599971  17.20418  7.173429
{txt}{hline 9}{c +}{hline 30}
{ralign 8:Total} {...}
{c |}{...}
 {res} .6069536  .3333333  .9061639
{txt}{space 8} {...}
{c |}{...}
 {res} 2.537525  1.333333  1.713396
{txt}{space 8} {...}
{c |}{...}
 {res} 6.481738  20.21747   9.39088
{txt}{hline 9}{c BT}{hline 30}

{com}. 
. 
. foreach mom in iqr var mean {c -(}
{txt}  2{com}. 
. twoway (hist Q24_`mom',fcolor(ltblue) lcolor(none)), ///
>            ytitle("") ///
>            title("`mom'")
{txt}  3{com}. graph export "${c -(}sum_graph_folder{c )-}/hist/hist_`mom'.png",as(png) replace  
{txt}  4{com}. 
. {c )-}
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_iqr.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_var.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_mean.png written in PNG format)

{com}. 
. foreach gp in `group_vars' {c -(}
{txt}  2{com}. foreach mom in iqr var mean {c -(}
{txt}  3{com}. 
. twoway (hist Q24_`mom' if `gp'==0,fcolor(gs15) lcolor("")) /// 
>        (hist Q24_`mom' if `gp'==1,fcolor(ltblue) lcolor("")) ///
>            (hist Q24_`mom' if `gp'==2,fcolor(red) lcolor("")), ///
>            xtitle("") ///
>            ytitle("") ///
>            title("`mom'") ///
>            legend(label(1 `gp'=0) label(2 `gp'=1) label(3 `gp'=2) col(1))
{txt}  4{com}. 
. graph export "${c -(}sum_graph_folder{c )-}/hist/hist_`mom'_`gp'.png",as(png) replace  
{txt}  5{com}. 
. {c )-}
{txt}  6{com}. {c )-}
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_iqr_age_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_var_age_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_mean_age_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_iqr_edu_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_var_edu_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_mean_edu_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_iqr_inc_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_var_inc_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_mean_inc_g.png written in PNG format)

{com}. 
. log close 
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/Myworld/Dropbox/IncExpProject/WorkingFolder/indSCE_Est_log.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}22 Sep 2019, 14:29:17
{txt}{.-}
{smcl}
{txt}{sf}{ul off}