{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/Myworld/Dropbox/IncExpProject/WorkingFolder/indSCE_log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 1 Jun 2021, 14:16:12
{txt}
{com}. 
. 
. *********************************************************
. *** before working with SCE, clean the macro monthly data 
. ********************************************************
. 
. use "${c -(}mainfolder{c )-}/OtherData/macroM_raw.dta",clear 
{txt}
{com}. 
. generate new_date = dofc(DATE)
{txt}
{com}. *format new_date %tm
. gen year = year(new_date)
{txt}
{com}. gen month = month(new_date)
{txt}
{com}. gen date_str = string(year)+ "m"+string(month)
{txt}
{com}. gen date = monthly(date_str,"YM")
{txt}
{com}. format date %tm
{txt}
{com}. drop DATE date_str year month new_date 
{txt}
{com}. label var sp500 "growth rate (%) of sp500 index from last month"
{txt}
{com}. rename UNRATE uerate
{res}{txt}
{com}. label var uerate "unemployment rate"
{txt}
{com}. label var he "quarterly growth in hourly earning"
{txt}
{com}. rename VIXCLS vix 
{res}{txt}
{com}. label var vix "vix indices"
{txt}
{com}. save "${c -(}mainfolder{c )-}/OtherData/macroM.dta",replace 
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/OtherData/macroM.dta saved

{com}. clear 
{txt}
{com}. 
. ***************************
. **  Clean and Merge Data **
. ***************************
. 
. use "${c -(}folder{c )-}/SCE/IncExpSCEProbIndM",clear 
{txt}
{com}. 
. duplicates report year month userid

{p 0 4}{txt}Duplicates in terms of {res} year month userid{p_end}

{txt}{hline 10}{c TT}{hline 27}
   copies {c |} observations       surplus
{hline 10}{c +}{hline 27}
        1 {c |}        {res}98593             0
{txt}{hline 10}{c BT}{hline 27}

{com}. 
. ************************************
. **  merge with estimated moments **
. ***********************************
. 
. * IncExpSCEDstIndM is the output from ../Pythoncode/DoDensityEst.ipynb
. merge 1:1 userid date using "${c -(}folder{c )-}/SCE/IncExpSCEDstIndM.dta", keep(master match) 
{res}{txt}{p 0 7 2}
(note: variable
date was 
float, now double to accommodate using data's values)
{p_end}

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}          98,593
{txt}{col 9}from master{col 30}{res}          98,593{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}               0{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge IndEst_merge
{res}{txt}
{com}. 
. duplicates report year month userid

{p 0 4}{txt}Duplicates in terms of {res} year month userid{p_end}

{txt}{hline 10}{c TT}{hline 27}
   copies {c |} observations       surplus
{hline 10}{c +}{hline 27}
        1 {c |}        {res}98593             0
{txt}{hline 10}{c BT}{hline 27}

{com}. 
. ** merge labor market module  
. merge 1:1 year month userid using "${c -(}otherfolder{c )-}/data/SCE/LaborExpSCEIndM", keep(master match)
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}          81,988
{txt}{col 9}from master{col 30}{res}          81,988{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}          16,605{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge labor_merge
{res}{txt}
{com}. rename userid ID 
{res}{txt}
{com}. 
. * inflation data 
. merge m:1 date using "${c -(}mainfolder{c )-}/OtherData/macroM.dta",keep(master match)
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}          98,593{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename CPIAUCSL CPIAU
{res}{txt}
{com}. drop _merge 
{txt}
{com}. 
. 
. * inflation data 
. merge m:1 year month using "${c -(}otherfolder{c )-}/workingdata/CPS_worker_flows.dta",keep(master match)
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}          98,593{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge 
{txt}
{com}. 
. 
. *******************************
. **  Set Panel Data Structure **
. *******************************
. 
. xtset ID date
{res}{txt}{col 8}panel variable:  {res}ID (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}date, 2013m6 to 2020m4, but with gaps
{txt}{col 17}delta:  {res}1 month
{txt}
{com}. sort ID date
{txt}
{com}. 
. *******************************
. ** Exclude youth and retired
. ******************************
. keep if Q32 <= 60 & Q32 >= 20
{txt}(23030 observations deleted)

{com}. 
. *******************************
. **  Summary Statistics of SCE **
. *******************************
. 
. tabstat ID,s(count) by(date) column(statistics)

{txt}Summary for variables: ID
{col 6}by categories of: date 

{ralign 9:date} {...}
{c |}         N
{hline 10}{c +}{hline 10}
{ralign 9: 2013m6} {...}
{c |}{...}
 {res}      891
{txt}{ralign 9: 2013m7} {...}
{c |}{...}
 {res}      850
{txt}{ralign 9: 2013m8} {...}
{c |}{...}
 {res}     1233
{txt}{ralign 9: 2013m9} {...}
{c |}{...}
 {res}     1082
{txt}{ralign 9:2013m10} {...}
{c |}{...}
 {res}     1091
{txt}{ralign 9:2013m11} {...}
{c |}{...}
 {res}     1083
{txt}{ralign 9:2013m12} {...}
{c |}{...}
 {res}      947
{txt}{ralign 9: 2014m1} {...}
{c |}{...}
 {res}      938
{txt}{ralign 9: 2014m2} {...}
{c |}{...}
 {res}      915
{txt}{ralign 9: 2014m3} {...}
{c |}{...}
 {res}      938
{txt}{ralign 9: 2014m4} {...}
{c |}{...}
 {res}      927
{txt}{ralign 9: 2014m5} {...}
{c |}{...}
 {res}      892
{txt}{ralign 9: 2014m6} {...}
{c |}{...}
 {res}      910
{txt}{ralign 9: 2014m7} {...}
{c |}{...}
 {res}      954
{txt}{ralign 9: 2014m8} {...}
{c |}{...}
 {res}      936
{txt}{ralign 9: 2014m9} {...}
{c |}{...}
 {res}      915
{txt}{ralign 9:2014m10} {...}
{c |}{...}
 {res}      903
{txt}{ralign 9:2014m11} {...}
{c |}{...}
 {res}      913
{txt}{ralign 9:2014m12} {...}
{c |}{...}
 {res}      882
{txt}{ralign 9: 2015m1} {...}
{c |}{...}
 {res}      900
{txt}{ralign 9: 2015m2} {...}
{c |}{...}
 {res}      907
{txt}{ralign 9: 2015m3} {...}
{c |}{...}
 {res}      869
{txt}{ralign 9: 2015m4} {...}
{c |}{...}
 {res}      885
{txt}{ralign 9: 2015m5} {...}
{c |}{...}
 {res}      891
{txt}{ralign 9: 2015m6} {...}
{c |}{...}
 {res}      885
{txt}{ralign 9: 2015m7} {...}
{c |}{...}
 {res}      869
{txt}{ralign 9: 2015m8} {...}
{c |}{...}
 {res}      848
{txt}{ralign 9: 2015m9} {...}
{c |}{...}
 {res}      879
{txt}{ralign 9:2015m10} {...}
{c |}{...}
 {res}      868
{txt}{ralign 9:2015m11} {...}
{c |}{...}
 {res}      866
{txt}{ralign 9:2015m12} {...}
{c |}{...}
 {res}      843
{txt}{ralign 9: 2016m1} {...}
{c |}{...}
 {res}      861
{txt}{ralign 9: 2016m2} {...}
{c |}{...}
 {res}      815
{txt}{ralign 9: 2016m3} {...}
{c |}{...}
 {res}      872
{txt}{ralign 9: 2016m4} {...}
{c |}{...}
 {res}      841
{txt}{ralign 9: 2016m5} {...}
{c |}{...}
 {res}      879
{txt}{ralign 9: 2016m6} {...}
{c |}{...}
 {res}      877
{txt}{ralign 9: 2016m7} {...}
{c |}{...}
 {res}      918
{txt}{ralign 9: 2016m8} {...}
{c |}{...}
 {res}      884
{txt}{ralign 9: 2016m9} {...}
{c |}{...}
 {res}      911
{txt}{ralign 9:2016m10} {...}
{c |}{...}
 {res}      906
{txt}{ralign 9:2016m11} {...}
{c |}{...}
 {res}      895
{txt}{ralign 9:2016m12} {...}
{c |}{...}
 {res}      933
{txt}{ralign 9: 2017m1} {...}
{c |}{...}
 {res}      936
{txt}{ralign 9: 2017m2} {...}
{c |}{...}
 {res}      932
{txt}{ralign 9: 2017m3} {...}
{c |}{...}
 {res}      949
{txt}{ralign 9: 2017m4} {...}
{c |}{...}
 {res}      886
{txt}{ralign 9: 2017m5} {...}
{c |}{...}
 {res}      944
{txt}{ralign 9: 2017m6} {...}
{c |}{...}
 {res}      941
{txt}{ralign 9: 2017m7} {...}
{c |}{...}
 {res}      948
{txt}{ralign 9: 2017m8} {...}
{c |}{...}
 {res}      942
{txt}{ralign 9: 2017m9} {...}
{c |}{...}
 {res}      919
{txt}{ralign 9:2017m10} {...}
{c |}{...}
 {res}      956
{txt}{ralign 9:2017m11} {...}
{c |}{...}
 {res}      921
{txt}{ralign 9:2017m12} {...}
{c |}{...}
 {res}      870
{txt}{ralign 9: 2018m1} {...}
{c |}{...}
 {res}      906
{txt}{ralign 9: 2018m2} {...}
{c |}{...}
 {res}      908
{txt}{ralign 9: 2018m3} {...}
{c |}{...}
 {res}      896
{txt}{ralign 9: 2018m4} {...}
{c |}{...}
 {res}      875
{txt}{ralign 9: 2018m5} {...}
{c |}{...}
 {res}      878
{txt}{ralign 9: 2018m6} {...}
{c |}{...}
 {res}      873
{txt}{ralign 9: 2018m7} {...}
{c |}{...}
 {res}      910
{txt}{ralign 9: 2018m8} {...}
{c |}{...}
 {res}      897
{txt}{ralign 9: 2018m9} {...}
{c |}{...}
 {res}      884
{txt}{ralign 9:2018m10} {...}
{c |}{...}
 {res}      931
{txt}{ralign 9:2018m11} {...}
{c |}{...}
 {res}      907
{txt}{ralign 9:2018m12} {...}
{c |}{...}
 {res}      855
{txt}{ralign 9: 2019m1} {...}
{c |}{...}
 {res}      937
{txt}{ralign 9: 2019m2} {...}
{c |}{...}
 {res}      917
{txt}{ralign 9: 2019m3} {...}
{c |}{...}
 {res}      925
{txt}{ralign 9: 2019m4} {...}
{c |}{...}
 {res}      912
{txt}{ralign 9: 2019m5} {...}
{c |}{...}
 {res}      895
{txt}{ralign 9: 2019m6} {...}
{c |}{...}
 {res}      896
{txt}{ralign 9: 2019m7} {...}
{c |}{...}
 {res}      908
{txt}{ralign 9: 2019m8} {...}
{c |}{...}
 {res}      894
{txt}{ralign 9: 2019m9} {...}
{c |}{...}
 {res}      904
{txt}{ralign 9:2019m10} {...}
{c |}{...}
 {res}      880
{txt}{ralign 9:2019m11} {...}
{c |}{...}
 {res}      867
{txt}{ralign 9:2019m12} {...}
{c |}{...}
 {res}      874
{txt}{ralign 9: 2020m1} {...}
{c |}{...}
 {res}      896
{txt}{ralign 9: 2020m2} {...}
{c |}{...}
 {res}      913
{txt}{ralign 9: 2020m3} {...}
{c |}{...}
 {res}      884
{txt}{ralign 9: 2020m4} {...}
{c |}{...}
 {res}      895
{txt}{hline 10}{c +}{hline 10}
{ralign 9:Total} {...}
{c |}{...}
 {res}    75563
{txt}{hline 10}{c BT}{hline 10}

{com}. 
. *****************************************
. ****  Renaming so that more consistent **
. *****************************************
. 
. rename Q24_mean incmean
{res}{txt}
{com}. rename Q24_var incvar
{res}{txt}
{com}. rename Q24_iqr inciqr
{res}{txt}
{com}. rename IncSkew incskew 
{res}{txt}
{com}. rename Q24_rmean rincmean
{res}{txt}
{com}. rename Q24_rvar rincvar
{res}{txt}
{com}. 
. *rename Q36 educ
. rename D6 HHinc 
{res}{txt}
{com}. rename Q32 age 
{res}{txt}
{com}. rename Q33 gender 
{res}{txt}
{com}. gen fulltime = Q10_1 
{txt}
{com}. gen parttime = Q10_2 
{txt}
{com}. rename Q12new selfemp
{res}{txt}
{com}. gen Stkprob= Q6new/100
{txt}(626 missing values generated)

{com}. gen UEprobAgg=Q4new/100
{txt}(219 missing values generated)

{com}. gen  UEprobInd4m = oo1_5/100
{txt}(69238 missing values generated)

{com}. gen UEprobInd=Q13new/100
{txt}(19480 missing values generated)

{com}. rename Q26v2 spending_dum
{res}{txt}
{com}. rename Q26v2part2 spending 
{res}{txt}
{com}. replace spending = spending/100
{txt}(71393 real changes made)

{com}. 
. gen exp_offer = oo2u/100
{txt}(74317 missing values generated)

{com}. gen EUprobInd = Q22new/100
{txt}(19312 missing values generated)

{com}. 
. *******************************
. **  Generate Variables       **
. *******************************
. 
. gen Incmean = .
{txt}(75563 missing values generated)

{com}. gen Incvar = .
{txt}(75563 missing values generated)

{com}. gen Inciqr = .
{txt}(75563 missing values generated)

{com}. 
. gen Incmean_ch = .
{txt}(75563 missing values generated)

{com}. gen Incvar_ch = .
{txt}(75563 missing values generated)

{com}. gen Inciqr_ch = .
{txt}(75563 missing values generated)

{com}. 
. 
. gen Inc_mom = .
{txt}(75563 missing values generated)

{com}. gen Inc_mom_ch = .
{txt}(75563 missing values generated)

{com}. 
. *** take the log
. 
. foreach mom in var{c -(}
{txt}  2{com}. gen linc`mom'= log(inc`mom') 
{txt}  3{com}. gen lrinc`mom' = log(rinc`mom') 
{txt}  4{com}. {c )-}
{txt}(18103 missing values generated)
(21604 missing values generated)

{com}. 
. 
. foreach mom in iqr{c -(}
{txt}  2{com}. gen linc`mom'= log(inc`mom') 
{txt}  3{com}. {c )-}
{txt}(13752 missing values generated)

{com}. 
. label var linciqr "log perceived iqr"
{txt}
{com}. label var lincvar "log perceived risk"
{txt}
{com}. label var lrincvar "log perceived risk (real)"
{txt}
{com}. label var spending "expected growth in spending"
{txt}
{com}. 
. *************************************
. *** Poisson rate in expectations 
. **************************************
. 
. 
. gen exp_s = log(1-UEprobInd4m)/(-3) 
{txt}(69290 missing values generated)

{com}. * can use exp_eu from micro data 
. label var exp_s "expected Poisson separation rate"
{txt}
{com}. 
. gen exp_f =log(1-EUprobInd)/(-4)
{txt}(24519 missing values generated)

{com}. * can use exp_ue from micro data 
. label var exp_f "expected Poisson job-finding rate"
{txt}
{com}. 
. 
. gen exp_s_1y = log(1-UEprobInd)/(-12) 
{txt}(19941 missing values generated)

{com}. * can use exp_eu from micro data 
. label var exp_s_1y "expected Poisson separation rate (1 year)"
{txt}
{com}. 
. *************************************
. *** Variables for overreaction test 
. **************************************
. 
. gen exp_s_1y_fe = exp_s_1y - f1.s
{txt}(32064 missing values generated)

{com}. label var exp_s_1y_fe "forecast error of separation rate"
{txt}
{com}. 
. gen exp_s_1y_rv = exp_s_1y - l1.exp_s_1y
{txt}(33477 missing values generated)

{com}. label var exp_s_1y_rv "revision in separation rate"
{txt}
{com}. 
. gen exp_s_fe = exp_s - f4.s
{txt}(72028 missing values generated)

{com}. label var exp_s_fe "forecast error of separation rate"
{txt}
{com}. gen exp_s_rv = exp_s - l4.exp_s
{txt}(73211 missing values generated)

{com}. label var exp_s_rv "revision in separation rate"
{txt}
{com}. 
. gen exp_f_fe = exp_f - f1.f
{txt}(35569 missing values generated)

{com}. label var exp_s_fe "forecast error of separation rate"
{txt}
{com}. 
. gen exp_f_rv = exp_f - l1.exp_f
{txt}(38120 missing values generated)

{com}. label var exp_f_rv "revision in separation rate"
{txt}
{com}. 
. ***********************************************
. **** Job experiences/transitions/search *****
. ***********************************************
. 
. gen emp_status = .
{txt}(75563 missing values generated)

{com}. 
. replace emp_status = 1 if Q10_1==1|Q10_2==1|Q10_5==1
{txt}(62970 real changes made)

{com}. replace emp_status = 2 if Q10_3==1|Q10_4==1
{txt}(3137 real changes made)

{com}. replace emp_status = 3 if Q10_6==1|Q10_7==1|Q10_8==1|Q10_9==1
{txt}(12548 real changes made)

{com}. 
. label define emp_status_lb 1 "employed" 2 "unemployed" 3 "non-working"
{txt}
{com}. label value emp_status emp_status_lb
{txt}
{com}. 
. gen e2u = cond(emp_status==2 & (l1.emp_status==1|l2.emp_status==1|l3.emp_status==1|l4.emp_status==1),1,0)
{txt}
{com}. label var e2u "employed since m-4 and unemployed now"
{txt}
{com}. 
. gen u2e = cond(emp_status==1 &  (l1.emp_status==2|l2.emp_status==2|l3.emp_status==2|l4.emp_status==2),1,0)
{txt}
{com}. label var u2e "unemployed since m-4 and employed now"
{txt}
{com}. 
. 
. gen e2um8 = cond(emp_status==2 & ///
>                  (l1.emp_status==1|l2.emp_status==1|l3.emp_status==1|l4.emp_status==1| ///
>                                   l5.emp_status==1|l6.emp_status==1|l7.emp_status==1|l8.emp_status==1),1,0)
{txt}
{com}. label var e2um8 "employed since m-8 and unemployed now"
{txt}
{com}. 
. gen u2em8 = cond(emp_status==1 &  ///
>                (l1.emp_status==2|l2.emp_status==2|l3.emp_status==2|l4.emp_status==2| ///
>                            l5.emp_status==2|l6.emp_status==2|l7.emp_status==2|l5.emp_status==2),1,0)
{txt}
{com}. label var u2em8 "unemployed since m-8 and employed now"
{txt}
{com}. 
. 
. gen e2um12 = cond(emp_status==2 & ///
>                  (l1.emp_status==1|l2.emp_status==1|l3.emp_status==1|l4.emp_status==1| ///
>                                   l5.emp_status==1|l6.emp_status==1|l7.emp_status==1|l8.emp_status==1| ///
>                                   l9.emp_status==1|l10.emp_status==1|l11.emp_status==1|l12.emp_status==1),1,0)
{txt}
{com}. label var e2um12 "employed since y-1 and unemployed now"
{txt}
{com}. 
. gen u2em12 = cond(emp_status==1 &  ///
>                (l1.emp_status==2|l2.emp_status==2|l3.emp_status==2|l4.emp_status==2| ///
>                            l5.emp_status==2|l6.emp_status==2|l7.emp_status==2|l5.emp_status==2| ///
>                             l9.emp_status==2|l10.emp_status==2|l11.emp_status==2|l12.emp_status==2),1,0)
{txt}
{com}. label var u2em12 "unemployed since y-1 and employed now"
{txt}
{com}. 
. *************************
. *** Exclude outliers *****
. *************************
. 
. local vars incvar rincvar l3
{txt}
{com}. 
. foreach var in `vars'{c -(}
{txt}  2{com}.       egen `var'pl=pctile(`var'),p(1)
{txt}  3{com}.           egen `var'pu=pctile(`var'),p(99)
{txt}  4{com}.           replace `var' = . if `var' <`var'pl | (`var' >`var'pu & `var'!=.)
{txt}  5{com}. {c )-}
{txt}(2858 real changes made, 2858 to missing)
(767 real changes made, 767 to missing)
(201 real changes made, 201 to missing)

{com}. 
. *************************
. ** macro variables normalization
. *****************************
. 
. replace he = he*l3.CPIAU/CPIAU
{txt}(75563 real changes made, 29796 to missing)

{com}. label var he "real hourly earning growth"
{txt}
{com}. 
. gen ue_chg = uerate - l3.uerate
{txt}(29796 missing values generated)

{com}. label var ue_chg "change in unemployment rate"
{txt}
{com}. 
. ************************
. ** group variables ****
. ************************
. ** age square
. gen age2 = age^2
{txt}
{com}. label var age2 "age squared"
{txt}
{com}. 
. egen byear_5yr = cut(byear), ///
>      at(1915 1920 1925 1930 1935 1940 ///
>             1945 1950 1955 1960 1965 1970 ///
>             1975 1980 1985 1990 1995 2000 ///
>                 2005 2010)
{txt}
{com}. label var byear_5yr "5-year cohort"
{txt}
{com}. 
. egen age_5yr = cut(age), ///
>      at(20 25 30 35 40 45 ///
>             50 55 60)
{txt}(2687 missing values generated)

{com}. label var age_5yr "5-year age"
{txt}
{com}. 
. 
. gen edu_g = . 
{txt}(75563 missing values generated)

{com}. replace edu_g = 1 if educ==1
{txt}(620 real changes made)

{com}. replace edu_g = 2 if educ==2 | educ ==3 | educ == 4
{txt}(31887 real changes made)

{com}. replace edu_g = 3 if educ <=9 & educ>4
{txt}(43056 real changes made)

{com}. 
. label var edu_g "education group"
{txt}
{com}. label define edu_glb 1 "HS dropout" 2 "HS graduate" 3 "College/above"
{txt}
{com}. label value edu_g edu_glb
{txt}
{com}. 
. 
. 
. 
. ***********************************
. ** new variables SCE realizations **
. **********************************
. 
. * log earning 
. gen wage_1y = l3*100/CPIAU
{txt}(65427 missing values generated)

{com}. label var wage_1y "average real annual earning from primary job"
{txt}
{com}. 
. ** average earning 
. egen wage_1y_av = mean(wage_1y), by(ID)
{txt}(26147 missing values generated)

{com}. label var wage_1y_av "average real annual earning across time"
{txt}
{com}. 
. ** income decile
. egen earning_gp = xtile(wage_1y_av), by(date) n(10) 
{txt}(26147 missing values generated)

{com}. label var earning_gp "decile of earning from low to high"
{txt}
{com}. 
. gen lwage_1y = log(wage_1y)
{txt}(65427 missing values generated)

{com}. label var lwage_1y "log average annual earning from primary job"
{txt}
{com}. 
. gen lwage_1y_gm4 = lwage_1y-l4.lwage_1y
{txt}(70650 missing values generated)

{com}. label var lwage_1y_gm4 "log annual earning growth from previous m-4 to m"
{txt}
{com}. 
. egen lwage_1y_gm4_sd = sd(lwage_1y_gm4), by(date)
{txt}(61951 missing values generated)

{com}. label var lwage_1y_gm4 "std log annual earning growth from previous m-4 to m"
{txt}
{com}. 
. ** generate cross-sectional std
. egen lwage_1y_sd = sd(lwage_1y), by(date)
{txt}(61013 missing values generated)

{com}. 
. ** mincer regressions 
. reghdfe lwage_1y age age2, a(i.gender i.edu_g) resid
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 3 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     8,751
{txt}Absorbing 2 HDFE groups{col 51}F({res}   2{txt},{res}   8745{txt}){col 67}= {res}     58.44
{txt}{col 51}Prob > F{col 67}= {res}    0.0000
{txt}{col 51}R-squared{col 67}= {res}    0.1281
{txt}{col 51}Adj R-squared{col 67}= {res}    0.1276
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0132
{txt}{col 51}Root MSE{col 67}= {res}    0.9399

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    lwage_1y{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2}  .087877{col 26}{space 2} .0085779{col 37}{space 1}   10.24{col 46}{space 3}0.000{col 54}{space 4} .0710623{col 67}{space 3} .1046917
{txt}{space 8}age2 {c |}{col 14}{res}{space 2}-.0009885{col 26}{space 2}  .000101{col 37}{space 1}   -9.78{col 46}{space 3}0.000{col 54}{space 4}-.0011865{col 67}{space 3}-.0007904
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 7.991126{col 26}{space 2} .1740459{col 37}{space 1}   45.91{col 46}{space 3}0.000{col 54}{space 4} 7.649955{col 67}{space 3} 8.332297
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}      gender{col 14}{c |}{space 1}        2{col 27}{space 1}        0{col 39}{result}{space 1}        2{col 53}{text} {col 54}{c |}
{col 1}{text}       edu_g{col 14}{c |}{space 1}        3{col 27}{space 1}        1{col 39}{result}{space 1}        2{col 53}{text} {col 54}{c |}
{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}

{com}. predict lwage_1y_shk, residuals
{txt}(66812 missing values generated)

{com}. 
. * including aggregate shock
. reghdfe lwage_1y age age2, a(i.date i.gender i.edu_g) resid
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 4 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     8,751
{txt}Absorbing 3 HDFE groups{col 51}F({res}   2{txt},{res}   8730{txt}){col 67}= {res}     58.40
{txt}{col 51}Prob > F{col 67}= {res}    0.0000
{txt}{col 51}R-squared{col 67}= {res}    0.1296
{txt}{col 51}Adj R-squared{col 67}= {res}    0.1276
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0132
{txt}{col 51}Root MSE{col 67}= {res}    0.9399

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    lwage_1y{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2}  .087862{col 26}{space 2}  .008584{col 37}{space 1}   10.24{col 46}{space 3}0.000{col 54}{space 4} .0710354{col 67}{space 3} .1046886
{txt}{space 8}age2 {c |}{col 14}{res}{space 2}-.0009881{col 26}{space 2} .0001011{col 37}{space 1}   -9.77{col 46}{space 3}0.000{col 54}{space 4}-.0011863{col 67}{space 3}-.0007899
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 7.991048{col 26}{space 2} .1741738{col 37}{space 1}   45.88{col 46}{space 3}0.000{col 54}{space 4} 7.649627{col 67}{space 3}  8.33247
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}        date{col 14}{c |}{space 1}       16{col 27}{space 1}        0{col 39}{result}{space 1}       16{col 53}{text} {col 54}{c |}
{col 1}{text}      gender{col 14}{c |}{space 1}        2{col 27}{space 1}        1{col 39}{result}{space 1}        1{col 53}{text} {col 54}{c |}
{col 1}{text}       edu_g{col 14}{c |}{space 1}        3{col 27}{space 1}        1{col 39}{result}{space 1}        2{col 53}{text}?{col 54}{c |}
{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
? = number of redundant parameters may be higher

{com}. predict lwage_1y_id_shk, residuals
{txt}(66812 missing values generated)

{com}. 
. gen lwage_1y_ag_shk = lwage_1y_shk- lwage_1y_id_shk
{txt}(66812 missing values generated)

{com}. 
. label var lwage_1y_shk "log wage shock"
{txt}
{com}. label var lwage_1y_id_shk "log wage idiosyncratic shock"
{txt}
{com}. label var lwage_1y_ag_shk "log wage aggregate shock"
{txt}
{com}. 
. ** first difference
. foreach var in lwage_1y_shk lwage_1y_id_shk lwage_1y_ag_shk{c -(}
{txt}  2{com}. gen `var'_gr = `var'- l4.`var'
{txt}  3{com}. {c )-}
{txt}(71469 missing values generated)
(71469 missing values generated)
(71469 missing values generated)

{com}. 
. label var lwage_1y_shk_gr "log growth of unexplained wage"
{txt}
{com}. label var lwage_1y_id_shk_gr "log growth of idiosyncratic unexplained wage"
{txt}
{com}. label var lwage_1y_ag_shk_gr "log growth of aggregate unexplained wage"
{txt}
{com}. 
. 
. ** inequality  
. gen lwage_1y_shk2 = log(lwage_1y_shk^2)
{txt}(66812 missing values generated)

{com}. label var lwage_1y_shk2 "squared log residuals"
{txt}
{com}. 
. ** volatility 
. gen lwage_1y_shk_gr2 = log(lwage_1y_shk_gr^2)
{txt}(71469 missing values generated)

{com}. label var lwage_1y_shk_gr2 "squared log shocks"
{txt}
{com}. 
. egen lwage_1y_shk_gr_sd = sd(lwage_1y_shk_gr), by(date)
{txt}(61951 missing values generated)

{com}. label var lwage_1y_shk_gr_sd "standard deviation of log shocks"
{txt}
{com}. 
. gen lwage_1y_shk_gr_var = lwage_1y_shk_gr_sd^2
{txt}(61951 missing values generated)

{com}. label var lwage_1y_shk_gr_sd "var of log shocks"
{txt}
{com}. 
. 
. /*
> ***********************************************
> ** summary chart of unconditional wages ********
> ************************************************
> 
> preserve
> 
> collapse (mean) lwage_1y lwage_1y_sd, by(date year month) 
> ** average log wage whole sample
> twoway  (connected lwage_1y date) if lwage_1y!=., title("The mean of log real wages") 
> graph export "${c -(}graph_folder{c )-}/log_wage_av.png", as(png) replace 
> 
> ** std log wage whole sample
> twoway  (connected lwage_1y_sd date) if lwage_1y_sd!=., title("The standard deviation of log real wages") 
> graph export "${c -(}graph_folder{c )-}/log_wage_sd.png", as(png) replace 
> restore 
> 
> 
> ************************************************
> ** summary chart of conditional wages ********
> ************************************************
> 
> preserve
> 
> collapse (mean) lwage_1y_shk_gr lwage_1y_shk_gr_sd, by(year month date) 
> ** average log wage shock whole sample
> twoway  (connected lwage_1y_shk_gr date) if lwage_1y_shk_gr!=., title("The mean of log real wage shocks") 
> graph export "${c -(}graph_folder{c )-}/log_wage_shk_gr.png", as(png) replace 
> 
> ** std log wage whole sample
> twoway  (connected lwage_1y_shk_gr_sd date) if lwage_1y_shk_gr_sd!=., title("The standard deviation of log real wage shocks") 
> graph export "${c -(}graph_folder{c )-}/log_wage_shk_gr_sd.png", as(png) replace
> restore 
> */
. 
. ***************************************
. **** earning level and risk perceptions
. ***************************************
. 
. gen rincsd = sqrt(rincvar)
{txt}(22371 missing values generated)

{com}. 
. graph bar rincsd, ///
>            over(earning_gp,relabel(1 "10%" 2 "20%" 3 "30%" 4 "40%" 5 "50%" 6 "60%" 7 "70%" 8 "80%" 9 "90%" 10 "100%")) ///
>                    bar(1, color(navy)) ///
>                    title("Perceived risk by real earning") ///
>                    b1title("earning decile") ///
>                    ytitle("Average perceived risk (std)") 
{res}{txt}
{com}. graph export "${c -(}sum_graph_folder{c )-}/boxplot_rvar_earning.png", as(png) replace 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/boxplot_rvar_earning.png written in PNG format)

{com}. 
. 
. ***************************************
. **** unemployment experience and risk perceptions
. ***************************************
. 
. /*
> graph box rincsd, over(u2e,relabel(1 "other" 2 "recently unemployed")) ///
>          title("Perceived risk by unemployment experience") ///
>                  ytitle("Average perceived risk (std)") 
> graph export "${c -(}sum_graph_folder{c )-}/boxplot_rvar_ue_peperience.png", as(png) replace 
> 
> 
> graph box rincsd, over(u2em12,relabel(1 "other" 2 "unemployed within past year")) ///
>          title("Perceived risk by unemployment experience") ///
>                  ytitle("Average perceived risk (std)") 
> graph export "${c -(}sum_graph_folder{c )-}/boxplot_rvar_ue_peperience_m12.png", as(png) replace 
> */
. ************************************************
. ** income shock /volatility and risk perceptions ********
. ************************************************
. 
. ** separation expectations 
. 
. eststo clear
{txt}
{com}. 
. label var u2e "unemployed since m-4"
{txt}
{com}. label var u2em8 "unemployed since m-8"
{txt}
{com}. label var u2em12 "unemployed since y-1"
{txt}
{com}. label var ue_chg "quarterly change in ue"
{txt}
{com}. 
. ** seperation risk perceptions and ue experiences 
. eststo: reghdfe exp_s_1y_rv exp_s_1y_fe, a(ID)
{res}{txt}(dropped 723 {browse "http://scorreia.com/research/singletons.pdf":singleton observations})
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 1 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}    33,366
{txt}Absorbing 1 HDFE group{col 51}F({res}   1{txt},{res}  28283{txt}){col 67}= {res}  15483.11
{txt}{col 51}Prob > F{col 67}= {res}    0.0000
{txt}{col 51}R-squared{col 67}= {res}    0.3940
{txt}{col 51}Adj R-squared{col 67}= {res}    0.2851
{txt}{col 51}Within R-sq.{col 67}= {res}    0.3538
{txt}{col 51}Root MSE{col 67}= {res}    0.0254

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1} exp_s_1y_rv{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}exp_s_1y_fe {c |}{col 14}{res}{space 2}  .698535{col 26}{space 2} .0056138{col 37}{space 1}  124.43{col 46}{space 3}0.000{col 54}{space 4} .6875316{col 67}{space 3} .7095383
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0008104{col 26}{space 2} .0001393{col 37}{space 1}   -5.82{col 46}{space 3}0.000{col 54}{space 4}-.0010834{col 67}{space 3}-.0005374
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}          ID{col 14}{c |}{space 1}     5082{col 27}{space 1}        0{col 39}{result}{space 1}     5082{col 53}{text} {col 54}{c |}
{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
({res}est1{txt} stored)

{com}. 
. eststo: reghdfe exp_s_rv exp_s_fe age age2, a(i.gender i.edu_g)  
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 3 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}       798
{txt}Absorbing 2 HDFE groups{col 51}F({res}   3{txt},{res}    791{txt}){col 67}= {res}     39.30
{txt}{col 51}Prob > F{col 67}= {res}    0.0000
{txt}{col 51}R-squared{col 67}= {res}    0.1336
{txt}{col 51}Adj R-squared{col 67}= {res}    0.1271
{txt}{col 51}Within R-sq.{col 67}= {res}    0.1297
{txt}{col 51}Root MSE{col 67}= {res}    0.0909

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    exp_s_rv{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}exp_s_fe {c |}{col 14}{res}{space 2} .3683363{col 26}{space 2} .0340927{col 37}{space 1}   10.80{col 46}{space 3}0.000{col 54}{space 4} .3014134{col 67}{space 3} .4352593
{txt}{space 9}age {c |}{col 14}{res}{space 2} .0001415{col 26}{space 2} .0027089{col 37}{space 1}    0.05{col 46}{space 3}0.958{col 54}{space 4}-.0051759{col 67}{space 3} .0054589
{txt}{space 8}age2 {c |}{col 14}{res}{space 2}-7.79e-06{col 26}{space 2} .0000323{col 37}{space 1}   -0.24{col 46}{space 3}0.810{col 54}{space 4}-.0000712{col 67}{space 3} .0000556
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0046436{col 26}{space 2} .0539621{col 37}{space 1}   -0.09{col 46}{space 3}0.931{col 54}{space 4}-.1105694{col 67}{space 3} .1012822
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}      gender{col 14}{c |}{space 1}        2{col 27}{space 1}        0{col 39}{result}{space 1}        2{col 53}{text} {col 54}{c |}
{col 1}{text}       edu_g{col 14}{c |}{space 1}        3{col 27}{space 1}        1{col 39}{result}{space 1}        2{col 53}{text} {col 54}{c |}
{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
({res}est2{txt} stored)

{com}. 
. eststo: reghdfe exp_f_rv exp_f_fe, a(ID)
{res}{txt}(dropped 791 {browse "http://scorreia.com/research/singletons.pdf":singleton observations})
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 1 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}    29,564
{txt}Absorbing 1 HDFE group{col 51}F({res}   1{txt},{res}  24896{txt}){col 67}= {res}  22577.82
{txt}{col 51}Prob > F{col 67}= {res}    0.0000
{txt}{col 51}R-squared{col 67}= {res}    0.5138
{txt}{col 51}Adj R-squared{col 67}= {res}    0.4226
{txt}{col 51}Within R-sq.{col 67}= {res}    0.4756
{txt}{col 51}Root MSE{col 67}= {res}    0.1313

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    exp_f_rv{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}exp_f_fe {c |}{col 14}{res}{space 2} .9728096{col 26}{space 2} .0064742{col 37}{space 1}  150.26{col 46}{space 3}0.000{col 54}{space 4} .9601198{col 67}{space 3} .9854995
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0342555{col 26}{space 2} .0008003{col 37}{space 1}   42.80{col 46}{space 3}0.000{col 54}{space 4} .0326868{col 67}{space 3} .0358242
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}          ID{col 14}{c |}{space 1}     4667{col 27}{space 1}        0{col 39}{result}{space 1}     4667{col 53}{text} {col 54}{c |}
{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
({res}est3{txt} stored)

{com}. 
. eststo: reghdfe exp_s_1y_rv i.u2e##c.exp_s_1y_fe, a(ID)
{res}{txt}(dropped 723 {browse "http://scorreia.com/research/singletons.pdf":singleton observations})
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 1 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}    33,366
{txt}Absorbing 1 HDFE group{col 51}F({res}   3{txt},{res}  28281{txt}){col 67}= {res}   5167.04
{txt}{col 51}Prob > F{col 67}= {res}    0.0000
{txt}{col 51}R-squared{col 67}= {res}    0.3943
{txt}{col 51}Adj R-squared{col 67}= {res}    0.2854
{txt}{col 51}Within R-sq.{col 67}= {res}    0.3541
{txt}{col 51}Root MSE{col 67}= {res}    0.0254

{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      exp_s_1y_rv{col 19}{c |}      Coef.{col 31}   Std. Err.{col 43}      t{col 51}   P>|t|{col 59}     [95% Con{col 72}f. Interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}1.u2e {c |}{col 19}{res}{space 2}-.0066489{col 31}{space 2} .0019148{col 42}{space 1}   -3.47{col 51}{space 3}0.001{col 59}{space 4} -.010402{col 72}{space 3}-.0028958
{txt}{space 6}exp_s_1y_fe {c |}{col 19}{res}{space 2} .6980705{col 31}{space 2} .0056657{col 42}{space 1}  123.21{col 51}{space 3}0.000{col 59}{space 4} .6869655{col 72}{space 3} .7091755
{txt}{space 17} {c |}
u2e#c.exp_s_1y_fe {c |}
{space 15}1  {c |}{col 19}{res}{space 2} .0228324{col 31}{space 2} .0347888{col 42}{space 1}    0.66{col 51}{space 3}0.512{col 59}{space 4}-.0453554{col 72}{space 3} .0910202
{txt}{space 17} {c |}
{space 12}_cons {c |}{col 19}{res}{space 2}-.0007225{col 31}{space 2} .0001415{col 42}{space 1}   -5.11{col 51}{space 3}0.000{col 59}{space 4}-.0009998{col 72}{space 3}-.0004451
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}          ID{col 14}{c |}{space 1}     5082{col 27}{space 1}        0{col 39}{result}{space 1}     5082{col 53}{text} {col 54}{c |}
{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
({res}est4{txt} stored)

{com}. 
. eststo: reghdfe exp_s_1y_rv i.u2em8##c.exp_s_1y_fe, a(ID)
{res}{txt}(dropped 723 {browse "http://scorreia.com/research/singletons.pdf":singleton observations})
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 1 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}    33,366
{txt}Absorbing 1 HDFE group{col 51}F({res}   3{txt},{res}  28281{txt}){col 67}= {res}   5164.40
{txt}{col 51}Prob > F{col 67}= {res}    0.0000
{txt}{col 51}R-squared{col 67}= {res}    0.3942
{txt}{col 51}Adj R-squared{col 67}= {res}    0.2853
{txt}{col 51}Within R-sq.{col 67}= {res}    0.3539
{txt}{col 51}Root MSE{col 67}= {res}    0.0254

{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        exp_s_1y_rv{col 21}{c |}      Coef.{col 33}   Std. Err.{col 45}      t{col 53}   P>|t|{col 61}     [95% Con{col 74}f. Interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}1.u2em8 {c |}{col 21}{res}{space 2} -.005357{col 33}{space 2} .0020817{col 44}{space 1}   -2.57{col 53}{space 3}0.010{col 61}{space 4}-.0094372{col 74}{space 3}-.0012769
{txt}{space 8}exp_s_1y_fe {c |}{col 21}{res}{space 2} .6984442{col 33}{space 2} .0056938{col 44}{space 1}  122.67{col 53}{space 3}0.000{col 61}{space 4} .6872842{col 74}{space 3} .7096042
{txt}{space 19} {c |}
u2em8#c.exp_s_1y_fe {c |}
{space 17}1  {c |}{col 21}{res}{space 2}-.0035636{col 33}{space 2} .0318266{col 44}{space 1}   -0.11{col 53}{space 3}0.911{col 61}{space 4}-.0659453{col 74}{space 3} .0588181
{txt}{space 19} {c |}
{space 14}_cons {c |}{col 21}{res}{space 2}-.0006966{col 33}{space 2} .0001456{col 44}{space 1}   -4.78{col 53}{space 3}0.000{col 61}{space 4} -.000982{col 74}{space 3}-.0004112
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}          ID{col 14}{c |}{space 1}     5082{col 27}{space 1}        0{col 39}{result}{space 1}     5082{col 53}{text} {col 54}{c |}
{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
({res}est5{txt} stored)

{com}. 
. eststo: reghdfe exp_s_1y_rv i.u2em12##c.exp_s_1y_fe, a(ID)
{res}{txt}(dropped 723 {browse "http://scorreia.com/research/singletons.pdf":singleton observations})
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 1 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}    33,366
{txt}Absorbing 1 HDFE group{col 51}F({res}   3{txt},{res}  28281{txt}){col 67}= {res}   5162.40
{txt}{col 51}Prob > F{col 67}= {res}    0.0000
{txt}{col 51}R-squared{col 67}= {res}    0.3941
{txt}{col 51}Adj R-squared{col 67}= {res}    0.2852
{txt}{col 51}Within R-sq.{col 67}= {res}    0.3538
{txt}{col 51}Root MSE{col 67}= {res}    0.0254

{txt}{hline 21}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         exp_s_1y_rv{col 22}{c |}      Coef.{col 34}   Std. Err.{col 46}      t{col 54}   P>|t|{col 62}     [95% Con{col 75}f. Interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}1.u2em12 {c |}{col 22}{res}{space 2}-.0039875{col 34}{space 2} .0023572{col 45}{space 1}   -1.69{col 54}{space 3}0.091{col 62}{space 4}-.0086078{col 75}{space 3} .0006328
{txt}{space 9}exp_s_1y_fe {c |}{col 22}{res}{space 2} .6986354{col 34}{space 2} .0056975{col 45}{space 1}  122.62{col 54}{space 3}0.000{col 62}{space 4} .6874681{col 75}{space 3} .7098026
{txt}{space 20} {c |}
u2em12#c.exp_s_1y_fe {c |}
{space 18}1  {c |}{col 22}{res}{space 2}-.0101955{col 34}{space 2} .0317092{col 45}{space 1}   -0.32{col 54}{space 3}0.748{col 62}{space 4} -.072347{col 75}{space 3}  .051956
{txt}{space 20} {c |}
{space 15}_cons {c |}{col 22}{res}{space 2}-.0007158{col 34}{space 2}  .000149{col 45}{space 1}   -4.80{col 54}{space 3}0.000{col 62}{space 4}-.0010078{col 75}{space 3}-.0004238
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}          ID{col 14}{c |}{space 1}     5082{col 27}{space 1}        0{col 39}{result}{space 1}     5082{col 53}{text} {col 54}{c |}
{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
({res}est6{txt} stored)

{com}. 
. eststo: reghdfe exp_s_1y_rv c.s##c.exp_s_1y_fe, a(ID)
{res}{txt}(dropped 723 {browse "http://scorreia.com/research/singletons.pdf":singleton observations})
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 1 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}    33,366
{txt}Absorbing 1 HDFE group{col 51}F({res}   3{txt},{res}  28281{txt}){col 67}= {res}   5185.19
{txt}{col 51}Prob > F{col 67}= {res}    0.0000
{txt}{col 51}R-squared{col 67}= {res}    0.3950
{txt}{col 51}Adj R-squared{col 67}= {res}    0.2863
{txt}{col 51}Within R-sq.{col 67}= {res}    0.3549
{txt}{col 51}Root MSE{col 67}= {res}    0.0254

{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      exp_s_1y_rv{col 19}{c |}      Coef.{col 31}   Std. Err.{col 43}      t{col 51}   P>|t|{col 59}     [95% Con{col 72}f. Interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 16}s {c |}{col 19}{res}{space 2}-.0358468{col 31}{space 2} .0144368{col 42}{space 1}   -2.48{col 51}{space 3}0.013{col 59}{space 4}-.0641437{col 72}{space 3}-.0075499
{txt}{space 6}exp_s_1y_fe {c |}{col 19}{res}{space 2} .7297733{col 31}{space 2} .0074192{col 42}{space 1}   98.36{col 51}{space 3}0.000{col 59}{space 4} .7152313{col 72}{space 3} .7443153
{txt}{space 17} {c |}
c.s#c.exp_s_1y_fe {c |}{col 19}{res}{space 2}-2.248274{col 31}{space 2}  .346208{col 42}{space 1}   -6.49{col 51}{space 3}0.000{col 59}{space 4}-2.926858{col 72}{space 3} -1.56969
{txt}{space 17} {c |}
{space 12}_cons {c |}{col 19}{res}{space 2}-.0004546{col 31}{space 2} .0002287{col 42}{space 1}   -1.99{col 51}{space 3}0.047{col 59}{space 4}-.0009028{col 72}{space 3}-6.38e-06
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}          ID{col 14}{c |}{space 1}     5082{col 27}{space 1}        0{col 39}{result}{space 1}     5082{col 53}{text} {col 54}{c |}
{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
({res}est7{txt} stored)

{com}. 
. esttab using "${c -(}sum_table_folder{c )-}/ind/extrapolation_ue_risk.csv", label mtitles se r2 ///
> drop(_cons 0.u2e#c.exp_s_1y_fe 0.u2em8#c.exp_s_1y_fe 0.u2em12#c.exp_s_1y_fe) replace
{res}{txt}(output written to {browse  `"/Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/ind/extrapolation_ue_risk.csv"'})

{com}. eststo clear
{txt}
{com}. 
. 
. *** earning risks 
. 
. eststo clear
{txt}
{com}. 
. label var lwage_1y_id_shk_gr "ind shock"
{txt}
{com}. label var lwage_1y_shk_gr "income shock"
{txt}
{com}. label var lwage_1y_shk_gr2 "income shock squared"
{txt}
{com}. 
. ** risk perceptions and experienced volatility 
. 
. eststo: reghdfe lrincvar lwage_1y_shk_gr2, a(i.date)
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 1 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     3,662
{txt}Absorbing 1 HDFE group{col 51}F({res}   1{txt},{res}   3646{txt}){col 67}= {res}     13.68
{txt}{col 51}Prob > F{col 67}= {res}    0.0002
{txt}{col 51}R-squared{col 67}= {res}    0.0123
{txt}{col 51}Adj R-squared{col 67}= {res}    0.0083
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0037
{txt}{col 51}Root MSE{col 67}= {res}    1.3216

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        lrincvar{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      t{col 50}   P>|t|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
lwage_1y_shk_gr2 {c |}{col 18}{res}{space 2} .0210046{col 30}{space 2}  .005678{col 41}{space 1}    3.70{col 50}{space 3}0.000{col 58}{space 4} .0098722{col 71}{space 3}  .032137
{txt}{space 11}_cons {c |}{col 18}{res}{space 2}-7.607573{col 30}{space 2}  .044357{col 41}{space 1} -171.51{col 50}{space 3}0.000{col 58}{space 4} -7.69454{col 71}{space 3}-7.520606
{txt}{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}        date{col 14}{c |}{space 1}       15{col 27}{space 1}        0{col 39}{result}{space 1}       15{col 53}{text} {col 54}{c |}
{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
({res}est1{txt} stored)

{com}. 
. eststo: reghdfe lrincvar lwage_1y_shk_gr2 age age2, a(i.gender i.edu_g i.date)
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 4 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     3,662
{txt}Absorbing 3 HDFE groups{col 51}F({res}   3{txt},{res}   3641{txt}){col 67}= {res}     19.26
{txt}{col 51}Prob > F{col 67}= {res}    0.0000
{txt}{col 51}R-squared{col 67}= {res}    0.0241
{txt}{col 51}Adj R-squared{col 67}= {res}    0.0188
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0156
{txt}{col 51}Root MSE{col 67}= {res}    1.3146

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        lrincvar{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      t{col 50}   P>|t|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
lwage_1y_shk_gr2 {c |}{col 18}{res}{space 2} .0203678{col 30}{space 2} .0056859{col 41}{space 1}    3.58{col 50}{space 3}0.000{col 58}{space 4}   .00922{col 71}{space 3} .0315155
{txt}{space 13}age {c |}{col 18}{res}{space 2}-.0443073{col 30}{space 2}  .018852{col 41}{space 1}   -2.35{col 50}{space 3}0.019{col 58}{space 4}-.0812688{col 71}{space 3}-.0073458
{txt}{space 12}age2 {c |}{col 18}{res}{space 2} .0003616{col 30}{space 2} .0002213{col 41}{space 1}    1.63{col 50}{space 3}0.102{col 58}{space 4}-.0000723{col 71}{space 3} .0007955
{txt}{space 11}_cons {c |}{col 18}{res}{space 2} -6.42154{col 30}{space 2} .3833731{col 41}{space 1}  -16.75{col 50}{space 3}0.000{col 58}{space 4}-7.173188{col 71}{space 3}-5.669893
{txt}{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}      gender{col 14}{c |}{space 1}        2{col 27}{space 1}        0{col 39}{result}{space 1}        2{col 53}{text} {col 54}{c |}
{col 1}{text}       edu_g{col 14}{c |}{space 1}        3{col 27}{space 1}        1{col 39}{result}{space 1}        2{col 53}{text} {col 54}{c |}
{col 1}{text}        date{col 14}{c |}{space 1}       15{col 27}{space 1}        1{col 39}{result}{space 1}       14{col 53}{text}?{col 54}{c |}
{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
? = number of redundant parameters may be higher
({res}est2{txt} stored)

{com}. 
. ** risk perceptions and ue experience 
. 
. eststo: reghdfe lrincvar u2e lwage_1y_shk_gr2 age age2, a(i.gender i.edu_g)
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 3 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     3,662
{txt}Absorbing 2 HDFE groups{col 51}F({res}   4{txt},{res}   3654{txt}){col 67}= {res}     15.69
{txt}{col 51}Prob > F{col 67}= {res}    0.0000
{txt}{col 51}R-squared{col 67}= {res}    0.0170
{txt}{col 51}Adj R-squared{col 67}= {res}    0.0151
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0169
{txt}{col 51}Root MSE{col 67}= {res}    1.3171

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        lrincvar{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      t{col 50}   P>|t|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 13}u2e {c |}{col 18}{res}{space 2} .5140258{col 30}{space 2}  .260297{col 41}{space 1}    1.97{col 50}{space 3}0.048{col 58}{space 4}  .003684{col 71}{space 3} 1.024368
{txt}lwage_1y_shk_gr2 {c |}{col 18}{res}{space 2} .0197109{col 30}{space 2} .0056284{col 41}{space 1}    3.50{col 50}{space 3}0.000{col 58}{space 4} .0086758{col 71}{space 3}  .030746
{txt}{space 13}age {c |}{col 18}{res}{space 2}-.0491508{col 30}{space 2} .0188182{col 41}{space 1}   -2.61{col 50}{space 3}0.009{col 58}{space 4} -.086046{col 71}{space 3}-.0122556
{txt}{space 12}age2 {c |}{col 18}{res}{space 2} .0004199{col 30}{space 2} .0002209{col 41}{space 1}    1.90{col 50}{space 3}0.057{col 58}{space 4}-.0000132{col 71}{space 3} .0008531
{txt}{space 11}_cons {c |}{col 18}{res}{space 2}-6.335487{col 30}{space 2} .3829465{col 41}{space 1}  -16.54{col 50}{space 3}0.000{col 58}{space 4}-7.086297{col 71}{space 3}-5.584677
{txt}{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}      gender{col 14}{c |}{space 1}        2{col 27}{space 1}        0{col 39}{result}{space 1}        2{col 53}{text} {col 54}{c |}
{col 1}{text}       edu_g{col 14}{c |}{space 1}        3{col 27}{space 1}        1{col 39}{result}{space 1}        2{col 53}{text} {col 54}{c |}
{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
({res}est3{txt} stored)

{com}. 
. ** risk perceptions and macroeconomy  
. eststo: reghdfe lrincvar uerate lwage_1y_shk_gr2 age age2, a(i.gender i.edu_g)
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 3 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     3,662
{txt}Absorbing 2 HDFE groups{col 51}F({res}   4{txt},{res}   3654{txt}){col 67}= {res}     18.70
{txt}{col 51}Prob > F{col 67}= {res}    0.0000
{txt}{col 51}R-squared{col 67}= {res}    0.0201
{txt}{col 51}Adj R-squared{col 67}= {res}    0.0183
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0201
{txt}{col 51}Root MSE{col 67}= {res}    1.3149

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        lrincvar{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      t{col 50}   P>|t|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}uerate {c |}{col 18}{res}{space 2} .1177609{col 30}{space 2} .0296503{col 41}{space 1}    3.97{col 50}{space 3}0.000{col 58}{space 4} .0596281{col 71}{space 3} .1758937
{txt}lwage_1y_shk_gr2 {c |}{col 18}{res}{space 2}  .021618{col 30}{space 2} .0056026{col 41}{space 1}    3.86{col 50}{space 3}0.000{col 58}{space 4} .0106335{col 71}{space 3} .0326025
{txt}{space 13}age {c |}{col 18}{res}{space 2}-.0454419{col 30}{space 2} .0188151{col 41}{space 1}   -2.42{col 50}{space 3}0.016{col 58}{space 4}-.0823311{col 71}{space 3}-.0085527
{txt}{space 12}age2 {c |}{col 18}{res}{space 2} .0003752{col 30}{space 2} .0002209{col 41}{space 1}    1.70{col 50}{space 3}0.090{col 58}{space 4} -.000058{col 71}{space 3} .0008083
{txt}{space 11}_cons {c |}{col 18}{res}{space 2}-6.942458{col 30}{space 2} .4132841{col 41}{space 1}  -16.80{col 50}{space 3}0.000{col 58}{space 4}-7.752748{col 71}{space 3}-6.132168
{txt}{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}      gender{col 14}{c |}{space 1}        2{col 27}{space 1}        0{col 39}{result}{space 1}        2{col 53}{text} {col 54}{c |}
{col 1}{text}       edu_g{col 14}{c |}{space 1}        3{col 27}{space 1}        1{col 39}{result}{space 1}        2{col 53}{text} {col 54}{c |}
{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
({res}est4{txt} stored)

{com}. 
. esttab using "${c -(}sum_table_folder{c )-}/ind/extrapolation_earning_risk.csv", label mtitles se r2 ///
> drop(_cons age age2) replace
{res}{txt}(output written to {browse  `"/Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/ind/extrapolation_earning_risk.csv"'})

{com}. eststo clear
{txt}
{com}. 
. ************************************************
. ** spending decisions and perceived risks **
. ************************************************
. eststo clear
{txt}
{com}. xtset ID date
{res}{txt}{col 8}panel variable:  {res}ID (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}date, 2013m6 to 2020m4, but with gaps
{txt}{col 17}delta:  {res}1 month
{txt}
{com}. 
. label var rincvar "perceived earning risk"
{txt}
{com}. label var incvar "perceived earning risk (nominal)"
{txt}
{com}. label var exp_s "perceived ue risk next 4m"
{txt}
{com}. label var exp_s_1y "perceived ue risk next 1y"
{txt}
{com}. 
. eststo: reg spending rincvar

      {txt}Source {c |}       SS       df       MS              Number of obs ={res}   53178
{txt}{hline 13}{char +}{hline 30}           F(  1, 53176) ={res}   51.08
    {txt}   Model {char |} {res} 11.3693879     1  11.3693879           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} 11836.3309 53176  .222587839           {txt}R-squared     = {res} 0.0010
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0009
    {txt}   Total {char |} {res} 11847.7003 53177  .222797456           {txt}Root MSE      = {res} .47179

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    spending{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}rincvar {c |}{col 14}{res}{space 2} 8.394198{col 26}{space 2} 1.174523{col 37}{space 1}    7.15{col 46}{space 3}0.000{col 54}{space 4} 6.092123{col 67}{space 3} 10.69627
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0351815{col 26}{space 2} .0025108{col 37}{space 1}   14.01{col 46}{space 3}0.000{col 54}{space 4} .0302604{col 67}{space 3} .0401027
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est1{txt} stored)

{com}. 
. estadd local hast "No",replace

{txt}added macro:
               e(hast) : "{res:No}"

{com}. estadd local hasid "No",replace

{txt}added macro:
              e(hasid) : "{res:No}"

{com}. 
. eststo: areg spending rincvar, a(date)
{res}
{txt}Linear regression, absorbing indicators{col 51}Number of obs{col 67}= {res}     53178
{txt}{col 51}F({res}   1{txt},{res}  53094{txt}){col 67}= {res}     50.97
{txt}{col 51}Prob > F{col 67}= {res}    0.0000
{txt}{col 51}R-squared{col 67}= {res}    0.0028
{txt}{col 51}Adj R-squared{col 67}= {res}    0.0013
{txt}{col 51}Root MSE{col 67}= {res}    0.4717

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    spending{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}rincvar {c |}{col 14}{res}{space 2} 8.398687{col 26}{space 2} 1.176387{col 37}{space 1}    7.14{col 46}{space 3}0.000{col 54}{space 4} 6.092958{col 67}{space 3} 10.70442
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  .035176{col 26}{space 2} .0025119{col 37}{space 1}   14.00{col 46}{space 3}0.000{col 54}{space 4} .0302527{col 67}{space 3} .0400992
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
        date {c |}      F(82, 53094) = {res}     1.206   0.099          {txt}(83 categories)
({res}est2{txt} stored)

{com}. 
. estadd local hast "Yes",replace

{txt}added macro:
               e(hast) : "{res:Yes}"

{com}. estadd local hasid "No",replace

{txt}added macro:
              e(hasid) : "{res:No}"

{com}. 
. eststo: areg spending rincvar, a(ID)
{res}
{txt}Linear regression, absorbing indicators{col 51}Number of obs{col 67}= {res}     53178
{txt}{col 51}F({res}   1{txt},{res}  44334{txt}){col 67}= {res}     46.67
{txt}{col 51}Prob > F{col 67}= {res}    0.0000
{txt}{col 51}R-squared{col 67}= {res}    0.9279
{txt}{col 51}Adj R-squared{col 67}= {res}    0.9136
{txt}{col 51}Root MSE{col 67}= {res}    0.1388

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    spending{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}rincvar {c |}{col 14}{res}{space 2} 3.641905{col 26}{space 2} .5331298{col 37}{space 1}    6.83{col 46}{space 3}0.000{col 54}{space 4} 2.596961{col 67}{space 3} 4.686849
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0410704{col 26}{space 2} .0008937{col 37}{space 1}   45.96{col 46}{space 3}0.000{col 54}{space 4} .0393188{col 67}{space 3}  .042822
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
          ID {c |}    F(8842, 44334) = {res}    64.489   0.000        {txt}(8843 categories)
({res}est3{txt} stored)

{com}. 
. estadd local hast "No",replace

{txt}added macro:
               e(hast) : "{res:No}"

{com}. estadd local hasid "Yes",replace

{txt}added macro:
              e(hasid) : "{res:Yes}"

{com}. 
. 
. eststo: areg spending rincvar i.year, a(ID)
{res}
{txt}Linear regression, absorbing indicators{col 51}Number of obs{col 67}= {res}     53178
{txt}{col 51}F({res}   8{txt},{res}  44327{txt}){col 67}= {res}     12.73
{txt}{col 51}Prob > F{col 67}= {res}    0.0000
{txt}{col 51}R-squared{col 67}= {res}    0.9280
{txt}{col 51}Adj R-squared{col 67}= {res}    0.9136
{txt}{col 51}Root MSE{col 67}= {res}    0.1387

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    spending{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}rincvar {c |}{col 14}{res}{space 2} 3.243413{col 26}{space 2}   .53666{col 37}{space 1}    6.04{col 46}{space 3}0.000{col 54}{space 4}  2.19155{col 67}{space 3} 4.295276
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2}-.0047446{col 26}{space 2} .0044229{col 37}{space 1}   -1.07{col 46}{space 3}0.283{col 54}{space 4}-.0134137{col 67}{space 3} .0039244
{txt}{space 7}2015  {c |}{col 14}{res}{space 2}-.0186229{col 26}{space 2} .0061791{col 37}{space 1}   -3.01{col 46}{space 3}0.003{col 54}{space 4} -.030734{col 67}{space 3}-.0065118
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0355292{col 26}{space 2}  .007519{col 37}{space 1}   -4.73{col 46}{space 3}0.000{col 54}{space 4}-.0502666{col 67}{space 3}-.0207918
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} -.054584{col 26}{space 2} .0085819{col 37}{space 1}   -6.36{col 46}{space 3}0.000{col 54}{space 4}-.0714046{col 67}{space 3}-.0377634
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0637878{col 26}{space 2} .0095778{col 37}{space 1}   -6.66{col 46}{space 3}0.000{col 54}{space 4}-.0825605{col 67}{space 3}-.0450151
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0698175{col 26}{space 2} .0104798{col 37}{space 1}   -6.66{col 46}{space 3}0.000{col 54}{space 4}-.0903582{col 67}{space 3}-.0492769
{txt}{space 7}2020  {c |}{col 14}{res}{space 2}-.0690672{col 26}{space 2} .0114372{col 37}{space 1}   -6.04{col 46}{space 3}0.000{col 54}{space 4}-.0914844{col 67}{space 3}-.0466501
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0803102{col 26}{space 2} .0065182{col 37}{space 1}   12.32{col 46}{space 3}0.000{col 54}{space 4} .0675345{col 67}{space 3}  .093086
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
          ID {c |}    F(8842, 44327) = {res}    64.544   0.000        {txt}(8843 categories)
({res}est4{txt} stored)

{com}. 
. estadd local hast "Yes",replace

{txt}added macro:
               e(hast) : "{res:Yes}"

{com}. estadd local hasid "Yes",replace

{txt}added macro:
              e(hasid) : "{res:Yes}"

{com}. 
. eststo: areg spending incvar i.year, a(ID)
{res}
{txt}Linear regression, absorbing indicators{col 51}Number of obs{col 67}= {res}     54584
{txt}{col 51}F({res}   8{txt},{res}  45493{txt}){col 67}= {res}     15.95
{txt}{col 51}Prob > F{col 67}= {res}    0.0000
{txt}{col 51}R-squared{col 67}= {res}    0.9409
{txt}{col 51}Adj R-squared{col 67}= {res}    0.9291
{txt}{col 51}Root MSE{col 67}= {res}    0.1210

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    spending{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}incvar {c |}{col 14}{res}{space 2} 3.656111{col 26}{space 2} .9901106{col 37}{space 1}    3.69{col 46}{space 3}0.000{col 54}{space 4} 1.715478{col 67}{space 3} 5.596743
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2}-.0073665{col 26}{space 2} .0037954{col 37}{space 1}   -1.94{col 46}{space 3}0.052{col 54}{space 4}-.0148056{col 67}{space 3} .0000726
{txt}{space 7}2015  {c |}{col 14}{res}{space 2}-.0278017{col 26}{space 2} .0053015{col 37}{space 1}   -5.24{col 46}{space 3}0.000{col 54}{space 4}-.0381927{col 67}{space 3}-.0174106
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0463844{col 26}{space 2} .0064538{col 37}{space 1}   -7.19{col 46}{space 3}0.000{col 54}{space 4} -.059034{col 67}{space 3}-.0337347
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0656897{col 26}{space 2} .0073644{col 37}{space 1}   -8.92{col 46}{space 3}0.000{col 54}{space 4}-.0801239{col 67}{space 3}-.0512554
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0736032{col 26}{space 2} .0082007{col 37}{space 1}   -8.98{col 46}{space 3}0.000{col 54}{space 4}-.0896768{col 67}{space 3}-.0575297
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0760743{col 26}{space 2} .0089619{col 37}{space 1}   -8.49{col 46}{space 3}0.000{col 54}{space 4}-.0936398{col 67}{space 3}-.0585089
{txt}{space 7}2020  {c |}{col 14}{res}{space 2}-.0917111{col 26}{space 2} .0097776{col 37}{space 1}   -9.38{col 46}{space 3}0.000{col 54}{space 4}-.1108754{col 67}{space 3}-.0725468
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0903323{col 26}{space 2}  .005539{col 37}{space 1}   16.31{col 46}{space 3}0.000{col 54}{space 4} .0794758{col 67}{space 3} .1011888
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
          ID {c |}    F(9082, 45493) = {res}    79.756   0.000        {txt}(9083 categories)
({res}est5{txt} stored)

{com}. 
. estadd local hast "Yes",replace

{txt}added macro:
               e(hast) : "{res:Yes}"

{com}. estadd local hasid "Yes",replace

{txt}added macro:
              e(hasid) : "{res:Yes}"

{com}. 
. eststo: areg spending exp_s_1y i.year, a(ID)
{res}
{txt}Linear regression, absorbing indicators{col 51}Number of obs{col 67}= {res}     55582
{txt}{col 51}F({res}   8{txt},{res}  46893{txt}){col 67}= {res}      1.39
{txt}{col 51}Prob > F{col 67}= {res}    0.1950
{txt}{col 51}R-squared{col 67}= {res}    0.6308
{txt}{col 51}Adj R-squared{col 67}= {res}    0.5623
{txt}{col 51}Root MSE{col 67}= {res}    0.3741

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    spending{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}exp_s_1y {c |}{col 14}{res}{space 2}-.0703815{col 26}{space 2} .0724134{col 37}{space 1}   -0.97{col 46}{space 3}0.331{col 54}{space 4}-.2123128{col 67}{space 3} .0715498
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2}-.0117628{col 26}{space 2} .0116909{col 37}{space 1}   -1.01{col 46}{space 3}0.314{col 54}{space 4}-.0346772{col 67}{space 3} .0111515
{txt}{space 7}2015  {c |}{col 14}{res}{space 2}-.0131491{col 26}{space 2} .0162631{col 37}{space 1}   -0.81{col 46}{space 3}0.419{col 54}{space 4} -.045025{col 67}{space 3} .0187269
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0322668{col 26}{space 2} .0197265{col 37}{space 1}   -1.64{col 46}{space 3}0.102{col 54}{space 4}-.0709309{col 67}{space 3} .0063974
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0528595{col 26}{space 2} .0225044{col 37}{space 1}   -2.35{col 46}{space 3}0.019{col 54}{space 4}-.0969684{col 67}{space 3}-.0087507
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0608416{col 26}{space 2} .0250612{col 37}{space 1}   -2.43{col 46}{space 3}0.015{col 54}{space 4}-.1099619{col 67}{space 3}-.0117214
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0693285{col 26}{space 2} .0272643{col 37}{space 1}   -2.54{col 46}{space 3}0.011{col 54}{space 4}-.1227669{col 67}{space 3}-.0158901
{txt}{space 7}2020  {c |}{col 14}{res}{space 2}-.0840433{col 26}{space 2} .0297041{col 37}{space 1}   -2.83{col 46}{space 3}0.005{col 54}{space 4}-.1422637{col 67}{space 3}-.0258229
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0847821{col 26}{space 2} .0170039{col 37}{space 1}    4.99{col 46}{space 3}0.000{col 54}{space 4} .0514543{col 67}{space 3}   .11811
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
          ID {c |}    F(8680, 46893) = {res}     9.226   0.000        {txt}(8681 categories)
({res}est6{txt} stored)

{com}. 
. estadd local hast "Yes",replace

{txt}added macro:
               e(hast) : "{res:Yes}"

{com}. estadd local hasid "Yes",replace

{txt}added macro:
              e(hasid) : "{res:Yes}"

{com}. 
. eststo: areg spending exp_s i.year, a(ID)
{res}
{txt}Linear regression, absorbing indicators{col 51}Number of obs{col 67}= {res}      6269
{txt}{col 51}F({res}   6{txt},{res}   2520{txt}){col 67}= {res}      7.68
{txt}{col 51}Prob > F{col 67}= {res}    0.0000
{txt}{col 51}R-squared{col 67}= {res}    0.6327
{txt}{col 51}Adj R-squared{col 67}= {res}    0.0865
{txt}{col 51}Root MSE{col 67}= {res}    0.2038

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    spending{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}exp_s {c |}{col 14}{res}{space 2} .3530927{col 26}{space 2} .0553248{col 37}{space 1}    6.38{col 46}{space 3}0.000{col 54}{space 4}  .244606{col 67}{space 3} .4615794
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0001617{col 26}{space 2} .0190614{col 37}{space 1}    0.01{col 46}{space 3}0.993{col 54}{space 4}-.0372159{col 67}{space 3} .0375393
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0432982{col 26}{space 2} .0273991{col 37}{space 1}   -1.58{col 46}{space 3}0.114{col 54}{space 4}-.0970253{col 67}{space 3}  .010429
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0555205{col 26}{space 2} .0332908{col 37}{space 1}   -1.67{col 46}{space 3}0.095{col 54}{space 4}-.1208007{col 67}{space 3} .0097597
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0651334{col 26}{space 2} .0384579{col 37}{space 1}   -1.69{col 46}{space 3}0.090{col 54}{space 4}-.1405458{col 67}{space 3}  .010279
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0614008{col 26}{space 2} .0434352{col 37}{space 1}   -1.41{col 46}{space 3}0.158{col 54}{space 4}-.1465731{col 67}{space 3} .0237715
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0657521{col 26}{space 2} .0235141{col 37}{space 1}    2.80{col 46}{space 3}0.005{col 54}{space 4} .0196431{col 67}{space 3} .1118611
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
          ID {c |}     F(3742, 2520) = {res}     1.155   0.000        {txt}(3743 categories)
({res}est7{txt} stored)

{com}. 
. estadd local hast "Yes",replace

{txt}added macro:
               e(hast) : "{res:Yes}"

{com}. estadd local hasid "Yes",replace

{txt}added macro:
              e(hasid) : "{res:Yes}"

{com}. 
. esttab using "${c -(}sum_table_folder{c )-}/ind/spending_reg_fe.csv", ///
>               label mtitles se  stats(r2 N hast hasid, label("R-squared" "Sample Size" "Time FE" "Individual FE"))  ///
>              drop(_cons *.year) replace
{res}{txt}(output written to {browse  `"/Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/ind/spending_reg_fe.csv"'})

{com}. eststo clear
{txt}
{com}. ddd
{err}unrecognized command:  ddd
{txt}{search r(199):r(199);}

end of do-file

{search r(199):r(199);}

{com}. areg spending exp_f i.year, a(ID)
{res}
{txt}Linear regression, absorbing indicators{col 51}Number of obs{col 67}= {res}     50995
{txt}{col 51}F({res}   8{txt},{res}  42562{txt}){col 67}= {res}      2.00
{txt}{col 51}Prob > F{col 67}= {res}    0.0419
{txt}{col 51}R-squared{col 67}= {res}    0.1436
{txt}{col 51}Adj R-squared{col 67}= {res}   -0.0261
{txt}{col 51}Root MSE{col 67}= {res}    0.3895

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    spending{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}exp_f {c |}{col 14}{res}{space 2} .0357413{col 26}{space 2} .0133572{col 37}{space 1}    2.68{col 46}{space 3}0.007{col 54}{space 4}  .009561{col 67}{space 3} .0619217
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2}-.0095611{col 26}{space 2}  .012579{col 37}{space 1}   -0.76{col 46}{space 3}0.447{col 54}{space 4}-.0342163{col 67}{space 3} .0150941
{txt}{space 7}2015  {c |}{col 14}{res}{space 2}-.0035907{col 26}{space 2}  .017778{col 37}{space 1}   -0.20{col 46}{space 3}0.840{col 54}{space 4}-.0384358{col 67}{space 3} .0312545
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0226685{col 26}{space 2}   .02156{col 37}{space 1}   -1.05{col 46}{space 3}0.293{col 54}{space 4}-.0649264{col 67}{space 3} .0195895
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0454216{col 26}{space 2} .0245663{col 37}{space 1}   -1.85{col 46}{space 3}0.064{col 54}{space 4} -.093572{col 67}{space 3} .0027288
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0524903{col 26}{space 2} .0273829{col 37}{space 1}   -1.92{col 46}{space 3}0.055{col 54}{space 4}-.1061614{col 67}{space 3} .0011807
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0536635{col 26}{space 2}  .029831{col 37}{space 1}   -1.80{col 46}{space 3}0.072{col 54}{space 4}-.1121329{col 67}{space 3} .0048059
{txt}{space 7}2020  {c |}{col 14}{res}{space 2}-.0680329{col 26}{space 2} .0325192{col 37}{space 1}   -2.09{col 46}{space 3}0.036{col 54}{space 4}-.1317712{col 67}{space 3}-.0042946
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}   .06373{col 26}{space 2} .0186968{col 37}{space 1}    3.41{col 46}{space 3}0.001{col 54}{space 4} .0270839{col 67}{space 3} .1003761
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
          ID {c |}    F(8424, 42562) = {res}     0.846   1.000        {txt}(8425 categories)

{com}. areg spending exp_f exp_s i.year, a(ID)
{res}
{txt}Linear regression, absorbing indicators{col 51}Number of obs{col 67}= {res}      4152
{txt}{col 51}F({res}   7{txt},{res}   1595{txt}){col 67}= {res}      3.05
{txt}{col 51}Prob > F{col 67}= {res}    0.0034
{txt}{col 51}R-squared{col 67}= {res}    0.8731
{txt}{col 51}Adj R-squared{col 67}= {res}    0.6698
{txt}{col 51}Root MSE{col 67}= {res}    0.0832

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    spending{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}exp_f {c |}{col 14}{res}{space 2}-.0025857{col 26}{space 2} .0152372{col 37}{space 1}   -0.17{col 46}{space 3}0.865{col 54}{space 4}-.0324728{col 67}{space 3} .0273013
{txt}{space 7}exp_s {c |}{col 14}{res}{space 2} -.186257{col 26}{space 2} .0795039{col 37}{space 1}   -2.34{col 46}{space 3}0.019{col 54}{space 4}-.3422001{col 67}{space 3}-.0303139
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0033248{col 26}{space 2} .0101896{col 37}{space 1}   -0.33{col 46}{space 3}0.744{col 54}{space 4}-.0233112{col 67}{space 3} .0166617
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0256543{col 26}{space 2} .0144443{col 37}{space 1}   -1.78{col 46}{space 3}0.076{col 54}{space 4}-.0539861{col 67}{space 3} .0026774
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0355278{col 26}{space 2}  .017288{col 37}{space 1}   -2.06{col 46}{space 3}0.040{col 54}{space 4}-.0694375{col 67}{space 3}-.0016182
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0660595{col 26}{space 2} .0200559{col 37}{space 1}   -3.29{col 46}{space 3}0.001{col 54}{space 4}-.1053981{col 67}{space 3}-.0267209
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0606959{col 26}{space 2} .0223926{col 37}{space 1}   -2.71{col 46}{space 3}0.007{col 54}{space 4}-.1046179{col 67}{space 3}-.0167739
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0787142{col 26}{space 2} .0131921{col 37}{space 1}    5.97{col 46}{space 3}0.000{col 54}{space 4} .0528386{col 67}{space 3} .1045899
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
          ID {c |}     F(2549, 1595) = {res}     4.300   0.000        {txt}(2550 categories)

{com}. areg spending exp_s i.year, a(ID)
{res}
{txt}Linear regression, absorbing indicators{col 51}Number of obs{col 67}= {res}      6269
{txt}{col 51}F({res}   6{txt},{res}   2520{txt}){col 67}= {res}      7.68
{txt}{col 51}Prob > F{col 67}= {res}    0.0000
{txt}{col 51}R-squared{col 67}= {res}    0.6327
{txt}{col 51}Adj R-squared{col 67}= {res}    0.0865
{txt}{col 51}Root MSE{col 67}= {res}    0.2038

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    spending{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}exp_s {c |}{col 14}{res}{space 2} .3530927{col 26}{space 2} .0553248{col 37}{space 1}    6.38{col 46}{space 3}0.000{col 54}{space 4}  .244606{col 67}{space 3} .4615794
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0001617{col 26}{space 2} .0190614{col 37}{space 1}    0.01{col 46}{space 3}0.993{col 54}{space 4}-.0372159{col 67}{space 3} .0375393
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0432982{col 26}{space 2} .0273991{col 37}{space 1}   -1.58{col 46}{space 3}0.114{col 54}{space 4}-.0970253{col 67}{space 3}  .010429
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0555205{col 26}{space 2} .0332908{col 37}{space 1}   -1.67{col 46}{space 3}0.095{col 54}{space 4}-.1208007{col 67}{space 3} .0097597
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0651334{col 26}{space 2} .0384579{col 37}{space 1}   -1.69{col 46}{space 3}0.090{col 54}{space 4}-.1405458{col 67}{space 3}  .010279
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0614008{col 26}{space 2} .0434352{col 37}{space 1}   -1.41{col 46}{space 3}0.158{col 54}{space 4}-.1465731{col 67}{space 3} .0237715
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0657521{col 26}{space 2} .0235141{col 37}{space 1}    2.80{col 46}{space 3}0.005{col 54}{space 4} .0196431{col 67}{space 3} .1118611
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
          ID {c |}     F(3742, 2520) = {res}     1.155   0.000        {txt}(3743 categories)

{com}. areg spending exp_s_1y i.year, a(ID)
{res}
{txt}Linear regression, absorbing indicators{col 51}Number of obs{col 67}= {res}     55582
{txt}{col 51}F({res}   8{txt},{res}  46893{txt}){col 67}= {res}      1.39
{txt}{col 51}Prob > F{col 67}= {res}    0.1950
{txt}{col 51}R-squared{col 67}= {res}    0.6308
{txt}{col 51}Adj R-squared{col 67}= {res}    0.5623
{txt}{col 51}Root MSE{col 67}= {res}    0.3741

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    spending{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}exp_s_1y {c |}{col 14}{res}{space 2}-.0703815{col 26}{space 2} .0724134{col 37}{space 1}   -0.97{col 46}{space 3}0.331{col 54}{space 4}-.2123128{col 67}{space 3} .0715498
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2}-.0117628{col 26}{space 2} .0116909{col 37}{space 1}   -1.01{col 46}{space 3}0.314{col 54}{space 4}-.0346772{col 67}{space 3} .0111515
{txt}{space 7}2015  {c |}{col 14}{res}{space 2}-.0131491{col 26}{space 2} .0162631{col 37}{space 1}   -0.81{col 46}{space 3}0.419{col 54}{space 4} -.045025{col 67}{space 3} .0187269
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0322668{col 26}{space 2} .0197265{col 37}{space 1}   -1.64{col 46}{space 3}0.102{col 54}{space 4}-.0709309{col 67}{space 3} .0063974
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0528595{col 26}{space 2} .0225044{col 37}{space 1}   -2.35{col 46}{space 3}0.019{col 54}{space 4}-.0969684{col 67}{space 3}-.0087507
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0608416{col 26}{space 2} .0250612{col 37}{space 1}   -2.43{col 46}{space 3}0.015{col 54}{space 4}-.1099619{col 67}{space 3}-.0117214
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0693285{col 26}{space 2} .0272643{col 37}{space 1}   -2.54{col 46}{space 3}0.011{col 54}{space 4}-.1227669{col 67}{space 3}-.0158901
{txt}{space 7}2020  {c |}{col 14}{res}{space 2}-.0840433{col 26}{space 2} .0297041{col 37}{space 1}   -2.83{col 46}{space 3}0.005{col 54}{space 4}-.1422637{col 67}{space 3}-.0258229
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0847821{col 26}{space 2} .0170039{col 37}{space 1}    4.99{col 46}{space 3}0.000{col 54}{space 4} .0514543{col 67}{space 3}   .11811
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
          ID {c |}    F(8680, 46893) = {res}     9.226   0.000        {txt}(8681 categories)

{com}. areg spending exp_s_1y, a(ID)
{res}
{txt}Linear regression, absorbing indicators{col 51}Number of obs{col 67}= {res}     55582
{txt}{col 51}F({res}   1{txt},{res}  46900{txt}){col 67}= {res}      0.84
{txt}{col 51}Prob > F{col 67}= {res}    0.3596
{txt}{col 51}R-squared{col 67}= {res}    0.6307
{txt}{col 51}Adj R-squared{col 67}= {res}    0.5623
{txt}{col 51}Root MSE{col 67}= {res}    0.3742

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    spending{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}exp_s_1y {c |}{col 14}{res}{space 2}-.0663117{col 26}{space 2}  .072375{col 37}{space 1}   -0.92{col 46}{space 3}0.360{col 54}{space 4}-.2081677{col 67}{space 3} .0755443
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0458198{col 26}{space 2} .0019565{col 37}{space 1}   23.42{col 46}{space 3}0.000{col 54}{space 4}  .041985{col 67}{space 3} .0496547
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
          ID {c |}    F(8680, 46900) = {res}     9.227   0.000        {txt}(8681 categories)

{com}. areg spending exp_s_1y, a(year)
{res}
{txt}Linear regression, absorbing indicators{col 51}Number of obs{col 67}= {res}     55582
{txt}{col 51}F({res}   1{txt},{res}  55573{txt}){col 67}= {res}      0.39
{txt}{col 51}Prob > F{col 67}= {res}    0.5319
{txt}{col 51}R-squared{col 67}= {res}    0.0001
{txt}{col 51}Adj R-squared{col 67}= {res}    0.0000
{txt}{col 51}Root MSE{col 67}= {res}    0.5656

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    spending{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}exp_s_1y {c |}{col 14}{res}{space 2}-.0476913{col 26}{space 2} .0762857{col 37}{space 1}   -0.63{col 46}{space 3}0.532{col 54}{space 4}-.1972118{col 67}{space 3} .1018292
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0455255{col 26}{space 2}  .002685{col 37}{space 1}   16.96{col 46}{space 3}0.000{col 54}{space 4} .0402629{col 67}{space 3} .0507881
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
        year {c |}       F(7, 55573) = {res}     1.103   0.358           {txt}(8 categories)

{com}. do "/var/folders/k3/fzq0vzzx2b56ypvhsddgs7hr0000gn/T//SD13865.000000"
{txt}
{com}. ************************************************
. ** spending decisions and perceived risks **
. ************************************************
. eststo clear
{txt}
{com}. xtset ID date
{res}{txt}{col 8}panel variable:  {res}ID (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}date, 2013m6 to 2020m4, but with gaps
{txt}{col 17}delta:  {res}1 month
{txt}
{com}. 
. label var rincvar "perceived earning risk"
{txt}
{com}. label var incvar "perceived earning risk (nominal)"
{txt}
{com}. label var exp_s "perceived ue risk next 4m"
{txt}
{com}. label var exp_s_1y "perceived ue risk next 1y"
{txt}
{com}. 
. eststo: reg spending rincvar

      {txt}Source {c |}       SS       df       MS              Number of obs ={res}   53178
{txt}{hline 13}{char +}{hline 30}           F(  1, 53176) ={res}   51.08
    {txt}   Model {char |} {res} 11.3693879     1  11.3693879           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} 11836.3309 53176  .222587839           {txt}R-squared     = {res} 0.0010
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0009
    {txt}   Total {char |} {res} 11847.7003 53177  .222797456           {txt}Root MSE      = {res} .47179

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    spending{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}rincvar {c |}{col 14}{res}{space 2} 8.394198{col 26}{space 2} 1.174523{col 37}{space 1}    7.15{col 46}{space 3}0.000{col 54}{space 4} 6.092123{col 67}{space 3} 10.69627
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0351815{col 26}{space 2} .0025108{col 37}{space 1}   14.01{col 46}{space 3}0.000{col 54}{space 4} .0302604{col 67}{space 3} .0401027
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est1{txt} stored)

{com}. 
. estadd local hast "No",replace

{txt}added macro:
               e(hast) : "{res:No}"

{com}. estadd local hasid "No",replace

{txt}added macro:
              e(hasid) : "{res:No}"

{com}. 
. eststo: areg spending rincvar, a(date)
{res}
{txt}Linear regression, absorbing indicators{col 51}Number of obs{col 67}= {res}     53178
{txt}{col 51}F({res}   1{txt},{res}  53094{txt}){col 67}= {res}     50.97
{txt}{col 51}Prob > F{col 67}= {res}    0.0000
{txt}{col 51}R-squared{col 67}= {res}    0.0028
{txt}{col 51}Adj R-squared{col 67}= {res}    0.0013
{txt}{col 51}Root MSE{col 67}= {res}    0.4717

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    spending{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}rincvar {c |}{col 14}{res}{space 2} 8.398687{col 26}{space 2} 1.176387{col 37}{space 1}    7.14{col 46}{space 3}0.000{col 54}{space 4} 6.092958{col 67}{space 3} 10.70442
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  .035176{col 26}{space 2} .0025119{col 37}{space 1}   14.00{col 46}{space 3}0.000{col 54}{space 4} .0302527{col 67}{space 3} .0400992
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
        date {c |}      F(82, 53094) = {res}     1.206   0.099          {txt}(83 categories)
({res}est2{txt} stored)

{com}. 
. estadd local hast "Yes",replace

{txt}added macro:
               e(hast) : "{res:Yes}"

{com}. estadd local hasid "No",replace

{txt}added macro:
              e(hasid) : "{res:No}"

{com}. 
. eststo: areg spending rincvar, a(ID)
{res}
{txt}Linear regression, absorbing indicators{col 51}Number of obs{col 67}= {res}     53178
{txt}{col 51}F({res}   1{txt},{res}  44334{txt}){col 67}= {res}     46.67
{txt}{col 51}Prob > F{col 67}= {res}    0.0000
{txt}{col 51}R-squared{col 67}= {res}    0.9279
{txt}{col 51}Adj R-squared{col 67}= {res}    0.9136
{txt}{col 51}Root MSE{col 67}= {res}    0.1388

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    spending{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}rincvar {c |}{col 14}{res}{space 2} 3.641905{col 26}{space 2} .5331298{col 37}{space 1}    6.83{col 46}{space 3}0.000{col 54}{space 4} 2.596961{col 67}{space 3} 4.686849
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0410704{col 26}{space 2} .0008937{col 37}{space 1}   45.96{col 46}{space 3}0.000{col 54}{space 4} .0393188{col 67}{space 3}  .042822
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
          ID {c |}    F(8842, 44334) = {res}    64.489   0.000        {txt}(8843 categories)
({res}est3{txt} stored)

{com}. 
. estadd local hast "No",replace

{txt}added macro:
               e(hast) : "{res:No}"

{com}. estadd local hasid "Yes",replace

{txt}added macro:
              e(hasid) : "{res:Yes}"

{com}. 
. 
. eststo: areg spending rincvar i.year, a(ID)
{res}
{txt}Linear regression, absorbing indicators{col 51}Number of obs{col 67}= {res}     53178
{txt}{col 51}F({res}   8{txt},{res}  44327{txt}){col 67}= {res}     12.73
{txt}{col 51}Prob > F{col 67}= {res}    0.0000
{txt}{col 51}R-squared{col 67}= {res}    0.9280
{txt}{col 51}Adj R-squared{col 67}= {res}    0.9136
{txt}{col 51}Root MSE{col 67}= {res}    0.1387

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    spending{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}rincvar {c |}{col 14}{res}{space 2} 3.243413{col 26}{space 2}   .53666{col 37}{space 1}    6.04{col 46}{space 3}0.000{col 54}{space 4}  2.19155{col 67}{space 3} 4.295276
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2}-.0047446{col 26}{space 2} .0044229{col 37}{space 1}   -1.07{col 46}{space 3}0.283{col 54}{space 4}-.0134137{col 67}{space 3} .0039244
{txt}{space 7}2015  {c |}{col 14}{res}{space 2}-.0186229{col 26}{space 2} .0061791{col 37}{space 1}   -3.01{col 46}{space 3}0.003{col 54}{space 4} -.030734{col 67}{space 3}-.0065118
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0355292{col 26}{space 2}  .007519{col 37}{space 1}   -4.73{col 46}{space 3}0.000{col 54}{space 4}-.0502666{col 67}{space 3}-.0207918
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} -.054584{col 26}{space 2} .0085819{col 37}{space 1}   -6.36{col 46}{space 3}0.000{col 54}{space 4}-.0714046{col 67}{space 3}-.0377634
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0637878{col 26}{space 2} .0095778{col 37}{space 1}   -6.66{col 46}{space 3}0.000{col 54}{space 4}-.0825605{col 67}{space 3}-.0450151
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0698175{col 26}{space 2} .0104798{col 37}{space 1}   -6.66{col 46}{space 3}0.000{col 54}{space 4}-.0903582{col 67}{space 3}-.0492769
{txt}{space 7}2020  {c |}{col 14}{res}{space 2}-.0690672{col 26}{space 2} .0114372{col 37}{space 1}   -6.04{col 46}{space 3}0.000{col 54}{space 4}-.0914844{col 67}{space 3}-.0466501
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0803102{col 26}{space 2} .0065182{col 37}{space 1}   12.32{col 46}{space 3}0.000{col 54}{space 4} .0675345{col 67}{space 3}  .093086
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
          ID {c |}    F(8842, 44327) = {res}    64.544   0.000        {txt}(8843 categories)
({res}est4{txt} stored)

{com}. 
. estadd local hast "Yes",replace

{txt}added macro:
               e(hast) : "{res:Yes}"

{com}. estadd local hasid "Yes",replace

{txt}added macro:
              e(hasid) : "{res:Yes}"

{com}. 
. eststo: areg spending incvar i.year, a(ID)
{res}
{txt}Linear regression, absorbing indicators{col 51}Number of obs{col 67}= {res}     54584
{txt}{col 51}F({res}   8{txt},{res}  45493{txt}){col 67}= {res}     15.95
{txt}{col 51}Prob > F{col 67}= {res}    0.0000
{txt}{col 51}R-squared{col 67}= {res}    0.9409
{txt}{col 51}Adj R-squared{col 67}= {res}    0.9291
{txt}{col 51}Root MSE{col 67}= {res}    0.1210

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    spending{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}incvar {c |}{col 14}{res}{space 2} 3.656111{col 26}{space 2} .9901106{col 37}{space 1}    3.69{col 46}{space 3}0.000{col 54}{space 4} 1.715478{col 67}{space 3} 5.596743
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2}-.0073665{col 26}{space 2} .0037954{col 37}{space 1}   -1.94{col 46}{space 3}0.052{col 54}{space 4}-.0148056{col 67}{space 3} .0000726
{txt}{space 7}2015  {c |}{col 14}{res}{space 2}-.0278017{col 26}{space 2} .0053015{col 37}{space 1}   -5.24{col 46}{space 3}0.000{col 54}{space 4}-.0381927{col 67}{space 3}-.0174106
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0463844{col 26}{space 2} .0064538{col 37}{space 1}   -7.19{col 46}{space 3}0.000{col 54}{space 4} -.059034{col 67}{space 3}-.0337347
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0656897{col 26}{space 2} .0073644{col 37}{space 1}   -8.92{col 46}{space 3}0.000{col 54}{space 4}-.0801239{col 67}{space 3}-.0512554
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0736032{col 26}{space 2} .0082007{col 37}{space 1}   -8.98{col 46}{space 3}0.000{col 54}{space 4}-.0896768{col 67}{space 3}-.0575297
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0760743{col 26}{space 2} .0089619{col 37}{space 1}   -8.49{col 46}{space 3}0.000{col 54}{space 4}-.0936398{col 67}{space 3}-.0585089
{txt}{space 7}2020  {c |}{col 14}{res}{space 2}-.0917111{col 26}{space 2} .0097776{col 37}{space 1}   -9.38{col 46}{space 3}0.000{col 54}{space 4}-.1108754{col 67}{space 3}-.0725468
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0903323{col 26}{space 2}  .005539{col 37}{space 1}   16.31{col 46}{space 3}0.000{col 54}{space 4} .0794758{col 67}{space 3} .1011888
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
          ID {c |}    F(9082, 45493) = {res}    79.756   0.000        {txt}(9083 categories)
({res}est5{txt} stored)

{com}. 
. estadd local hast "Yes",replace

{txt}added macro:
               e(hast) : "{res:Yes}"

{com}. estadd local hasid "Yes",replace

{txt}added macro:
              e(hasid) : "{res:Yes}"

{com}. 
. eststo: areg spending exp_s i.year, a(ID)
{res}
{txt}Linear regression, absorbing indicators{col 51}Number of obs{col 67}= {res}      6269
{txt}{col 51}F({res}   6{txt},{res}   2520{txt}){col 67}= {res}      7.68
{txt}{col 51}Prob > F{col 67}= {res}    0.0000
{txt}{col 51}R-squared{col 67}= {res}    0.6327
{txt}{col 51}Adj R-squared{col 67}= {res}    0.0865
{txt}{col 51}Root MSE{col 67}= {res}    0.2038

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    spending{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}exp_s {c |}{col 14}{res}{space 2} .3530927{col 26}{space 2} .0553248{col 37}{space 1}    6.38{col 46}{space 3}0.000{col 54}{space 4}  .244606{col 67}{space 3} .4615794
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0001617{col 26}{space 2} .0190614{col 37}{space 1}    0.01{col 46}{space 3}0.993{col 54}{space 4}-.0372159{col 67}{space 3} .0375393
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0432982{col 26}{space 2} .0273991{col 37}{space 1}   -1.58{col 46}{space 3}0.114{col 54}{space 4}-.0970253{col 67}{space 3}  .010429
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0555205{col 26}{space 2} .0332908{col 37}{space 1}   -1.67{col 46}{space 3}0.095{col 54}{space 4}-.1208007{col 67}{space 3} .0097597
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0651334{col 26}{space 2} .0384579{col 37}{space 1}   -1.69{col 46}{space 3}0.090{col 54}{space 4}-.1405458{col 67}{space 3}  .010279
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0614008{col 26}{space 2} .0434352{col 37}{space 1}   -1.41{col 46}{space 3}0.158{col 54}{space 4}-.1465731{col 67}{space 3} .0237715
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0657521{col 26}{space 2} .0235141{col 37}{space 1}    2.80{col 46}{space 3}0.005{col 54}{space 4} .0196431{col 67}{space 3} .1118611
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
          ID {c |}     F(3742, 2520) = {res}     1.155   0.000        {txt}(3743 categories)
({res}est6{txt} stored)

{com}. 
. estadd local hast "Yes",replace

{txt}added macro:
               e(hast) : "{res:Yes}"

{com}. estadd local hasid "Yes",replace

{txt}added macro:
              e(hasid) : "{res:Yes}"

{com}. 
. esttab using "${c -(}sum_table_folder{c )-}/ind/spending_reg_fe.csv", ///
>               label mtitles se  stats(r2 N hast hasid, label("R-squared" "Sample Size" "Time FE" "Individual FE"))  ///
>              drop(_cons *.year) replace
{res}{txt}(output written to {browse  `"/Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/ind/spending_reg_fe.csv"'})

{com}. eststo clear
{txt}
{com}. 
{txt}end of do-file

{com}. clear

. 