{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/Myworld/Dropbox/IncExpProject/WorkingFolder/indSCE_Est_log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 9 Nov 2019, 00:48:21
{txt}
{com}. 
. 
. ***************************
. **  Clean and Merge Data **
. ***************************
. 
. use "${c -(}folder{c )-}/SCE/IncExpSCEDstIndM",clear 
{txt}
{com}. 
. duplicates report year month userid

{p 0 4}{txt}Duplicates in terms of {res} year month userid{p_end}

{txt}{hline 10}{c TT}{hline 27}
   copies {c |} observations       surplus
{hline 10}{c +}{hline 27}
        1 {c |}        {res}79064             0
{txt}{hline 10}{c BT}{hline 27}

{com}. 
. ******************************
. *** Merge with demographics **
. *****************************
. 
. merge 1:1 year month userid using "${c -(}folder{c )-}/SCE/IncExpSCEProbIndM",keep(master match) 
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}          79,064{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge hh_info_merge
{res}{txt}
{com}. 
. ddd
{err}unrecognized command:  ddd
{txt}{search r(199):r(199);}

end of do-file

{search r(199):r(199);}

{com}. corr InvVar Q24_var if IncSkew!=0
{err}variable InvVar not found
{txt}{search r(111):r(111);}

{com}. corr IncVar Q24_var if IncSkew!=0
{txt}(obs=20138)

             {c |}   IncVar  Q24_var
{hline 13}{c +}{hline 18}
      IncVar {c |}{res}   1.0000
     {txt}Q24_var {c |}{res}   0.4635   1.0000


{com}. corr IncVar Q24_var if IncSkew==0
{txt}(obs=26748)

             {c |}   IncVar  Q24_var
{hline 13}{c +}{hline 18}
      IncVar {c |}{res}   1.0000
     {txt}Q24_var {c |}{res}   0.6567   1.0000


{com}. corr IncVar Q24_var if IncKurt==0
{err}no observations
{txt}{search r(2000):r(2000);}

{com}. corr IncVar Q24_var
{txt}(obs=46886)

             {c |}   IncVar  Q24_var
{hline 13}{c +}{hline 18}
      IncVar {c |}{res}   1.0000
     {txt}Q24_var {c |}{res}   0.3717   1.0000


{com}. 