{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/Myworld/Dropbox/IncExpProject/WorkingFolder/indSCE_Est_log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}25 Mar 2020, 18:59:30
{txt}
{com}. 
. *********************************************************
. *** before working with SCE, clean the stock market data 
. ********************************************************
. 
. use "${c -(}mainfolder{c )-}/OtherData/sp500.dta",clear 
{txt}
{com}. 
. generate new_date = dofc(DATE)
{txt}
{com}. format new_date %tm
{txt}
{com}. gen year = year(new_date)
{txt}
{com}. gen month = month(new_date)
{txt}
{com}. gen date_str = string(year)+ "m"+string(month)
{txt}
{com}. gen date = monthly(date_str,"YM")
{txt}
{com}. format date %tm
{txt}
{com}. drop DATE date_str year month new_date 
{txt}
{com}. label var sp500 "growth rate (%) of sp500 index from last month"
{txt}
{com}. save "${c -(}mainfolder{c )-}/OtherData/sp500M.dta",replace 
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/OtherData/sp500M.dta saved

{com}. clear 
{txt}
{com}. 
. 
. ***************************
. **  Clean and Merge Data **
. ***************************
. 
. use "${c -(}folder{c )-}/SCE/IncExpSCEDstIndM",clear 
{txt}
{com}. 
. duplicates report year month userid

{p 0 4}{txt}Duplicates in terms of {res} year month userid{p_end}

{txt}{hline 10}{c TT}{hline 27}
   copies {c |} observations       surplus
{hline 10}{c +}{hline 27}
        1 {c |}        {res}85852             0
{txt}{hline 10}{c BT}{hline 27}

{com}. 
. ************************************************
. *** Merge with demographics and other moments **
. ************************************************
. 
. merge 1:1 year month userid using "${c -(}folder{c )-}/SCE/IncExpSCEProbIndM",keep(master match) 
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}          85,852{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge hh_info_merge
{res}{txt}
{com}. 
. ** format the date 
. drop date 
{txt}
{com}. gen date_str=string(year)+"m"+string(month) 
{txt}
{com}. gen date= monthly(date_str,"YM")
{txt}
{com}. format date %tm
{txt}
{com}. order userid date year month   
{txt}
{com}. 
. *************************************
. *** Merge with stock market data   **
. *************************************
. 
. merge m:1 date using "${c -(}mainfolder{c )-}/OtherData/sp500M.dta", keep(master match) 
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}          85,852{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge sp_merge
{res}{txt}
{com}. 
. *******************************
. **  Set Panel Data Structure **
. *******************************
. rename userid ID 
{res}{txt}
{com}. xtset ID date   /* this is not correct. ID is unique here.*/
{res}{txt}{col 8}panel variable:  {res}ID (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}date, 2013m6 to 2019m5, but with gaps
{txt}{col 17}delta:  {res}1 month
{txt}
{com}. sort ID year month 
{txt}
{com}. 
. *******************************
. ** Exclude extreme outliers 
. ******************************
. 
. keep if Q32 <= 65 & Q32 >= 20
{txt}(8926 observations deleted)

{com}. 
. *****************************************
. ****  Renaming so that more consistent **
. *****************************************
. 
. rename Q24_mean incmean
{res}{txt}
{com}. rename Q24_var incvar
{res}{txt}
{com}. rename Q24_iqr inciqr
{res}{txt}
{com}. rename IncSkew incskew 
{res}{txt}
{com}. rename Q24_rmean rincmean
{res}{txt}
{com}. rename Q24_rvar rincvar
{res}{txt}
{com}. 
. rename Q36 educ
{res}{txt}
{com}. rename D6 HHinc 
{res}{txt}
{com}. rename Q32 age 
{res}{txt}
{com}. rename Q33 gender 
{res}{txt}
{com}. rename Q10_1 fulltime
{res}{txt}
{com}. rename Q10_2 parttime
{res}{txt}
{com}. rename Q12new selfemp
{res}{txt}
{com}. rename Q6new Stkprob
{res}{txt}
{com}. rename Q4new UEprobAgg
{res}{txt}
{com}. rename Q13new UEprobInd
{res}{txt}
{com}. rename Q26v2 spending_dum
{res}{txt}
{com}. rename Q26v2part2 spending 
{res}{txt}
{com}. 
. ************************
. ** focus on non-zero skewness
. ****************************
. 
. replace incskew = . if incskew==0
{txt}(28584 real changes made, 28584 to missing)

{com}. 
. 
. *************************
. *** Exclude outliers *****
. *************************
. 
. local Moments incmean rincmean incvar rincvar inciqr incskew 
{txt}
{com}. 
. foreach var in `Moments'{c -(}
{txt}  2{com}.       egen `var'pl=pctile(`var'),p(1)
{txt}  3{com}.           egen `var'pu=pctile(`var'),p(99)
{txt}  4{com}.           replace `var' = . if `var' <`var'pl | (`var' >`var'pu & `var'!=.)
{txt}  5{com}. {c )-}
{txt}(174 real changes made, 174 to missing)
(980 real changes made, 980 to missing)
(294 real changes made, 294 to missing)
(545 real changes made, 545 to missing)
(1054 real changes made, 1054 to missing)
(520 real changes made, 520 to missing)

{com}. 
. 
. * other thresholds 
. 
. 
. foreach var in `Moments'{c -(}
{txt}  2{com}.       egen `var'l_truc=pctile(`var'),p(8)
{txt}  3{com}.           egen `var'u_truc=pctile(`var'),p(92)
{txt}  4{com}.           replace `var' = . if `var' <`var'l_truc | (`var' >`var'u_truc & `var'!=.)
{txt}  5{com}. {c )-}
{txt}(8523 real changes made, 8523 to missing)
(7683 real changes made, 7683 to missing)
(4504 real changes made, 4504 to missing)
(7854 real changes made, 7854 to missing)
(8925 real changes made, 8925 to missing)
(2699 real changes made, 2699 to missing)

{com}. 
. 
. *****************************
. *** generate other vars *****
. *****************************
. 
. gen age_sq = age^2
{txt}
{com}. label var age_sq "Age-squared"
{txt}
{com}. 
. encode _STATE, gen(state_id)
{txt}
{com}. label var state_id "state id"
{txt}
{com}. 
. *****************************
. *** generate group vars *****
. *****************************
. 
. egen byear_g = cut(byear), group(4)
{txt}
{com}. 
. label define byearglb 0 "1950s" 1 "1960s" 2 "1970s" 3 "1980s"
{txt}
{com}. label value byear_g byearlb
{txt}
{com}. 
. egen age_g = cut(age), group(3)  
{txt}
{com}. label var age_g "age group"
{txt}
{com}. label define agelb 0 "young" 1 "middle-age" 2 "old"
{txt}
{com}. label value age_g agelb
{txt}
{com}. 
. egen edu_g = cut(educ), group(2) 
{txt}
{com}. label var edu_g "education group"
{txt}
{com}. label define edulb 0 "low educ" 1 "high educ" 
{txt}
{com}. label value edu_g edulb
{txt}
{com}. 
. label define gdlb 0 "Male" 1 "Female" 
{txt}
{com}. label value gender gdlb
{txt}
{com}. 
. egen HHinc_g = cut(HHinc), group(3)
{txt}(10760 missing values generated)

{com}. label var HHinc_g "Household income group"
{txt}
{com}. label define HHinc_glb 0 "low inc" 1 "middle inc" 2 "high inc"
{txt}
{com}. label value HHinc_g HHinc_glb
{txt}
{com}. 
. local group_vars byear_g age_g edu_g HHinc_g 
{txt}
{com}. 
. **********************************
. *** tables and hists of Vars *****
. **********************************
. /*
> 
> local Moments incmean incvar inciqr rincmean rincvar incskew
> 
> foreach gp in `group_vars' {c -(}
> tabstat `Moments', st(p10 p50 p90) by(`gp')
> {c )-}
> 
> 
> foreach gp in `group_vars' {c -(}
> table `gp', c(median incvar mean incvar median rincvar mean rincvar) by(year)
> {c )-}
> 
> 
> 
> ** histograms 
> 
> foreach mom in `Moments'{c -(}
> 
> twoway (hist `mom',fcolor(ltblue) lcolor(none)), ///
>            ytitle("") ///
>            title("`mom'")
> graph export "${c -(}sum_graph_folder{c )-}/hist/hist_`mom'.png",as(png) replace  
> 
> {c )-}
> 
> 
> * 4 groups 
> foreach gp in byear_g{c -(}
> foreach mom in `Moments'{c -(}
> twoway (hist `mom' if `gp'==0,fcolor(gs15) lcolor("")) /// 
>        (hist `mom' if `gp'==1,fcolor(ltblue) lcolor("")) ///
>            (hist `mom' if `gp'==2,fcolor(red) lcolor("")) ///
>            (hist `mom' if `gp'==3,fcolor(green) lcolor("")), ///
>            xtitle("") ///
>            ytitle("") ///
>            title("`mom'") ///
>            legend(label(1 `gp'=0) label(2 `gp'=1) label(3 `gp'=2) label(4 `gp'=3) col(1))
> 
> graph export "${c -(}sum_graph_folder{c )-}/hist/hist_`mom'_`gp'.png",as(png) replace  
> {c )-}
> {c )-}
> 
> * 3 groups 
> foreach gp in HHinc_g age_g{c -(}
> foreach mom in `Moments'{c -(}
> 
> twoway (hist `mom' if `gp'==0,fcolor(gs15) lcolor("")) /// 
>        (hist `mom' if `gp'==1,fcolor(ltblue) lcolor("")) ///
>            (hist `mom' if `gp'==2,fcolor(red) lcolor("")), ///
>            xtitle("") ///
>            ytitle("") ///
>            title("`mom'") ///
>            legend(label(1 `gp'=0) label(2 `gp'=1) label(3 `gp'=2) col(1))
> 
> graph export "${c -(}sum_graph_folder{c )-}/hist/hist_`mom'_`gp'.png",as(png) replace  
> 
> {c )-}
> {c )-}
> 
> * 2 groups 
> 
> 
> foreach gp in edu_g{c -(}
> foreach mom in `Moments'{c -(}
> 
> twoway (hist `mom' if `gp'==0,fcolor(gs15) lcolor("")) /// 
>        (hist `mom' if `gp'==1,fcolor(ltblue) lcolor("")), ///
>            xtitle("") ///
>            ytitle("") ///
>            title("`mom'") ///
>            legend(label(1 `gp'=0) label(2 `gp'=1) col(1))
> 
> graph export "${c -(}sum_graph_folder{c )-}/hist/hist_`mom'_`gp'.png",as(png) replace  
> 
> {c )-}
> {c )-}
> 
> */
. 
. 
. **********************************
. *** time series pltos by group *****
. **********************************
. 
. 
. ** 4 groups 
. foreach agg in mean median{c -(}
{txt}  2{com}.   foreach gp in byear_g{c -(}
{txt}  3{com}.    preserve 
{txt}  4{com}.    
.    collapse (`agg') `Moments' sp500, by(date `gp')
{txt}  5{com}.    xtset `gp' date 
{txt}  6{com}. 
. foreach mom in `Moments'{c -(}
{txt}  7{com}. keep if `mom'!=.
{txt}  8{com}. * moments only 
. 
. twoway (tsline `mom' if `gp'== 0,lp(solid) lwidth(thick)) ///
>        (tsline `mom' if `gp'== 1,lp(dash) lwidth(thick)) ///
>            (tsline `mom' if `gp'== 2,lp(shortdash) lwidth(thick)) ///
>            (tsline `mom' if `gp'== 3,lp(dash_dot) lwidth(thick)), ///
>        xtitle("date") ///
>            ytitle("") ///
>            title("`mom' by generation") ///
>            legend(label(1 "1950s") label(2 "1960s") label(3 "1970s") label(4 "1980s")  col(4))
{txt}  9{com}.  graph export "${c -(}sum_graph_folder{c )-}/ts/ts_`mom'_`gp'_`agg'.png",as(png) replace  
{txt} 10{com}.  
.  
. ** compute correlation coefficients 
. pwcorr `mom' f11.sp500 if `gp'==0, star(0.05)
{txt} 11{com}. local rho_1: display %4.2f r(rho) 
{txt} 12{com}. pwcorr `mom' f11.sp500 if `gp'==1, star(0.05)
{txt} 13{com}. local rho_2: display %4.2f r(rho) 
{txt} 14{com}. pwcorr `mom' f11.sp500 if `gp'==2, star(0.05)
{txt} 15{com}. local rho_3: display %4.2f r(rho) 
{txt} 16{com}. pwcorr `mom' f11.sp500 if `gp'==3, star(0.05)
{txt} 17{com}. local rho_4: display %4.2f r(rho) 
{txt} 18{com}. 
. ** moments and sp500 
. *** correlation with stock market by group *****
. 
. twoway (bar sp500 date if `gp'== 3,yaxis(2) fcolor(gs10)) ///
>        (tsline `mom' if `gp'== 3,lp(shortdash) lwidth(thick)), ///         
>        xtitle("date") ///
>            ytitle("") ///
>            ytitle("sp500 return (%)",axis(2)) ///
>            title("`mom' by generation") ///
>            legend(label(1 "sp500 (RHS)")  label(2 "1980s") col(3)) ///
>            caption("{c -(}superscript:1950s corr =`rho_1', 1960s corr =`rho_2', 1970s corr =`rho_3',1980s corr =`rho_4',{c )-}", ///
>            justification(left) position(11) size(vlarge))
{txt} 19{com}.  graph export "${c -(}sum_graph_folder{c )-}/ts/ts_`mom'_`gp'_`agg'_stk.png",as(png) replace 
{txt} 20{com}.  
. {c )-}
{txt} 21{com}.   restore
{txt} 22{com}. {c )-}
{txt} 23{com}. {c )-}
{res}{txt}{col 8}panel variable:  {res}byear_g (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}date, 2013m6 to 2019m5
{txt}{col 17}delta:  {res}1 month
{txt}(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incmean_byear_g_mean.png written in PNG format)

             {c |}  incmean F..sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.2598*  1.0000 

             {txt}{c |}  incmean F..sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.1801   1.0000 

             {txt}{c |}  incmean F..sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.4503*  1.0000 

             {txt}{c |}  incmean F..sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.1150   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incmean_byear_g_mean_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincmean_byear_g_mean.png written in PNG format)

             {c |} rincmean F..sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res}  0.0509   1.0000 

             {txt}{c |} rincmean F..sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res}  0.1576   1.0000 

             {txt}{c |} rincmean F..sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.4669*  1.0000 

             {txt}{c |} rincmean F..sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.4757*  1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincmean_byear_g_mean_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incvar_byear_g_mean.png written in PNG format)

             {c |}   incvar F..sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res}  0.0034   1.0000 

             {txt}{c |}   incvar F..sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.0363   1.0000 

             {txt}{c |}   incvar F..sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.4182*  1.0000 

             {txt}{c |}   incvar F..sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.0622   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incvar_byear_g_mean_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincvar_byear_g_mean.png written in PNG format)

             {c |}  rincvar F..sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.0179   1.0000 

             {txt}{c |}  rincvar F..sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res}  0.0566   1.0000 

             {txt}{c |}  rincvar F..sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.0099   1.0000 

             {txt}{c |}  rincvar F..sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res}  0.2071   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincvar_byear_g_mean_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_inciqr_byear_g_mean.png written in PNG format)

             {c |}   inciqr F..sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.1253   1.0000 

             {txt}{c |}   inciqr F..sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res}  0.0793   1.0000 

             {txt}{c |}   inciqr F..sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.3042*  1.0000 

             {txt}{c |}   inciqr F..sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.1032   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_inciqr_byear_g_mean_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incskew_byear_g_mean.png written in PNG format)

             {c |}  incskew F..sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.4122*  1.0000 

             {txt}{c |}  incskew F..sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.1420   1.0000 

             {txt}{c |}  incskew F..sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.2284   1.0000 

             {txt}{c |}  incskew F..sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.2136   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incskew_byear_g_mean_stk.png written in PNG format)
{res}{txt}{col 8}panel variable:  {res}byear_g (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}date, 2013m6 to 2019m5
{txt}{col 17}delta:  {res}1 month
{txt}(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incmean_byear_g_median.png written in PNG format)

             {c |}  incmean F..sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.3657*  1.0000 

             {txt}{c |}  incmean F..sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.0488   1.0000 

             {txt}{c |}  incmean F..sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.3787*  1.0000 

             {txt}{c |}  incmean F..sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.1934   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incmean_byear_g_median_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincmean_byear_g_median.png written in PNG format)

             {c |} rincmean F..sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.0666   1.0000 

             {txt}{c |} rincmean F..sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res}  0.1052   1.0000 

             {txt}{c |} rincmean F..sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.4372*  1.0000 

             {txt}{c |} rincmean F..sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.4657*  1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincmean_byear_g_median_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incvar_byear_g_median.png written in PNG format)

             {c |}   incvar F..sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.0182   1.0000 

             {txt}{c |}   incvar F..sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res}  0.1108   1.0000 

             {txt}{c |}   incvar F..sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.5017*  1.0000 

             {txt}{c |}   incvar F..sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res}  0.0244   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incvar_byear_g_median_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincvar_byear_g_median.png written in PNG format)

             {c |}  rincvar F..sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.0196   1.0000 

             {txt}{c |}  rincvar F..sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res}  0.0394   1.0000 

             {txt}{c |}  rincvar F..sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.2191   1.0000 

             {txt}{c |}  rincvar F..sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.0553   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincvar_byear_g_median_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_inciqr_byear_g_median.png written in PNG format)

             {c |}   inciqr F..sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.0367   1.0000 

             {txt}{c |}   inciqr F..sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res}  0.3293*  1.0000 

             {txt}{c |}   inciqr F..sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.4364*  1.0000 

             {txt}{c |}   inciqr F..sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res}  0.0756   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_inciqr_byear_g_median_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incskew_byear_g_median.png written in PNG format)

             {c |}  incskew F..sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.4469*  1.0000 

             {txt}{c |}  incskew F..sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.2112   1.0000 

             {txt}{c |}  incskew F..sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.1716   1.0000 

             {txt}{c |}  incskew F..sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.3400*  1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incskew_byear_g_median_stk.png written in PNG format)

{com}. 
. ** 3 groups fo HH income 
. foreach agg in mean median{c -(}
{txt}  2{com}.   foreach gp in HHinc_g{c -(}
{txt}  3{com}.    preserve 
{txt}  4{com}.    
.    collapse (`agg') `Moments' sp500, by(date `gp')
{txt}  5{com}.    xtset `gp' date 
{txt}  6{com}.    
. ** plots for moments by group 
.    
. * moments only 
. foreach mom in `Moments'{c -(}
{txt}  7{com}. keep if `mom'!=.
{txt}  8{com}. 
. * moments only 
. twoway (tsline `mom' if `gp'== 0,lp(solid) lwidth(thick)) ///
>        (tsline `mom' if `gp'== 1,lp(dash) lwidth(thick)) ///
>            (tsline `mom' if `gp'== 2,lp(shortdash) lwidth(thick)), ///
>        xtitle("date") ///
>            ytitle("") ///
>            title("`mom' by household income") ///
>            legend(label(1 "low") label(2 "median") label(3 "high")  col(3))
{txt}  9{com}.  graph export "${c -(}sum_graph_folder{c )-}/ts/ts_`mom'_`gp'_`agg'.png",as(png) replace  
{txt} 10{com}.  
. ** compute correlation coefficients 
. pwcorr `mom' f2.sp500 if `gp'==0, star(0.05)
{txt} 11{com}. local rho_lw: display %4.2f r(rho) 
{txt} 12{com}. pwcorr `mom' f2.sp500 if `gp'==1, star(0.05)
{txt} 13{com}. local rho_md: display %4.2f r(rho) 
{txt} 14{com}. pwcorr `mom' f2.sp500 if `gp'==2, star(0.05)
{txt} 15{com}. local rho_hg: display %4.2f r(rho) 
{txt} 16{com}. 
. ** moments and sp500 
. *** correlation with stock market by group *****
. 
. twoway (bar sp500 date if `gp'== 2,yaxis(2) fcolor(gs10)) ///
>            (tsline `mom' if `gp'== 2,lp(shortdash) lwidth(thick)), ///
>        xtitle("date") ///
>            ytitle("") ///
>            ytitle("sp500 return (%)",axis(2)) ///
>            title("`mom' by household income") ///
>            legend(label(1 "sp500 (RHS)")  label(2 "high income") col(3)) ///
>            caption("{c -(}superscript:low corr =`rho_lw', med corr =`rho_md', high corr =`rho_hg',{c )-}", ///
>            justification(left) position(11) size(vlarge))
{txt} 17{com}.  graph export "${c -(}sum_graph_folder{c )-}/ts/ts_`mom'_`gp'_`agg'_stk.png",as(png) replace 
{txt} 18{com}. {c )-}
{txt} 19{com}.           
.   restore
{txt} 20{com}. {c )-}
{txt} 21{com}. {c )-}
{res}{txt}{col 8}panel variable:  {res}HHinc_g (weakly balanced)
{txt}{col 9}time variable:  {res}{col 25}date, 2013m6 to 2019m5
{txt}{col 17}delta:  {res}1 month
{txt}(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incmean_HHinc_g_mean.png written in PNG format)

             {c |}  incmean F2.sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.0567   1.0000 

             {txt}{c |}  incmean F2.sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.0642   1.0000 

             {txt}{c |}  incmean F2.sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.4251*  1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incmean_HHinc_g_mean_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincmean_HHinc_g_mean.png written in PNG format)

             {c |} rincmean F2.sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.2350   1.0000 

             {txt}{c |} rincmean F2.sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.3859*  1.0000 

             {txt}{c |} rincmean F2.sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.6104*  1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincmean_HHinc_g_mean_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incvar_HHinc_g_mean.png written in PNG format)

             {c |}   incvar F2.sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.2262   1.0000 

             {txt}{c |}   incvar F2.sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.1787   1.0000 

             {txt}{c |}   incvar F2.sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.0155   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incvar_HHinc_g_mean_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincvar_HHinc_g_mean.png written in PNG format)

             {c |}  rincvar F2.sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.2256   1.0000 

             {txt}{c |}  rincvar F2.sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.1928   1.0000 

             {txt}{c |}  rincvar F2.sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.2069   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincvar_HHinc_g_mean_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_inciqr_HHinc_g_mean.png written in PNG format)

             {c |}   inciqr F2.sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.1565   1.0000 

             {txt}{c |}   inciqr F2.sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.2190   1.0000 

             {txt}{c |}   inciqr F2.sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.0847   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_inciqr_HHinc_g_mean_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incskew_HHinc_g_mean.png written in PNG format)

             {c |}  incskew F2.sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.1160   1.0000 

             {txt}{c |}  incskew F2.sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.3117*  1.0000 

             {txt}{c |}  incskew F2.sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.3448*  1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incskew_HHinc_g_mean_stk.png written in PNG format)
{res}{txt}{col 8}panel variable:  {res}HHinc_g (weakly balanced)
{txt}{col 9}time variable:  {res}{col 25}date, 2013m6 to 2019m5
{txt}{col 17}delta:  {res}1 month
{txt}(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incmean_HHinc_g_median.png written in PNG format)

             {c |}  incmean F2.sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.1093   1.0000 

             {txt}{c |}  incmean F2.sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.0780   1.0000 

             {txt}{c |}  incmean F2.sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.3366*  1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incmean_HHinc_g_median_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincmean_HHinc_g_median.png written in PNG format)

             {c |} rincmean F2.sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.2490*  1.0000 

             {txt}{c |} rincmean F2.sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.4146*  1.0000 

             {txt}{c |} rincmean F2.sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.5841*  1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincmean_HHinc_g_median_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incvar_HHinc_g_median.png written in PNG format)

             {c |}   incvar F2.sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.0940   1.0000 

             {txt}{c |}   incvar F2.sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.2148   1.0000 

             {txt}{c |}   incvar F2.sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.0325   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incvar_HHinc_g_median_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincvar_HHinc_g_median.png written in PNG format)

             {c |}  rincvar F2.sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.3763*  1.0000 

             {txt}{c |}  rincvar F2.sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.1609   1.0000 

             {txt}{c |}  rincvar F2.sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.0462   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincvar_HHinc_g_median_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_inciqr_HHinc_g_median.png written in PNG format)

             {c |}   inciqr F2.sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.0348   1.0000 

             {txt}{c |}   inciqr F2.sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.3135*  1.0000 

             {txt}{c |}   inciqr F2.sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.0372   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_inciqr_HHinc_g_median_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incskew_HHinc_g_median.png written in PNG format)

             {c |}  incskew F2.sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.0205   1.0000 

             {txt}{c |}  incskew F2.sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res}  0.1482   1.0000 

             {txt}{c |}  incskew F2.sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}  1.0000 
    {txt}F2.sp500 {c |} {res} -0.3816*  1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incskew_HHinc_g_median_stk.png written in PNG format)

{com}. 
. 
. 
. ** 3 groups fo age
. foreach agg in mean median{c -(}
{txt}  2{com}.   foreach gp in age_g{c -(}
{txt}  3{com}.    preserve 
{txt}  4{com}.    
.    collapse (`agg') `Moments' sp500, by(date `gp')
{txt}  5{com}.    xtset `gp' date 
{txt}  6{com}. 
.  ** moments only 
. foreach mom in `Moments'{c -(}
{txt}  7{com}. keep if `mom'!=.
{txt}  8{com}. twoway (tsline `mom' if `gp'== 0,lp(solid) lwidth(thick)) ///
>        (tsline `mom' if `gp'== 1,lp(dash) lwidth(thick)) ///
>            (tsline `mom' if `gp'== 2,lp(shortdash) lwidth(thick)), ///
>        xtitle("date") ///
>            ytitle("") ///
>            title("`mom' by age") ///
>            legend(label(1 "young") label(2 "middle-age") label(3 "old")  col(3))
{txt}  9{com}.            
.  graph export "${c -(}sum_graph_folder{c )-}/ts/ts_`mom'_`gp'_`agg'.png",as(png) replace  
{txt} 10{com}.  
.  
. ** compute correlation coefficients 
. pwcorr `mom' f11.sp500 if `gp'==0, star(0.05)
{txt} 11{com}. local rho_y: display %4.2f r(rho) 
{txt} 12{com}. pwcorr `mom' f11.sp500 if `gp'==1, star(0.05)
{txt} 13{com}. local rho_m: display %4.2f r(rho) 
{txt} 14{com}. pwcorr `mom' f11.sp500 if `gp'==2, star(0.05)
{txt} 15{com}. local rho_o: display %4.2f r(rho) 
{txt} 16{com}. 
. ** moments and sp500 
. *** correlation with stock market by group *****
. 
. twoway (bar sp500 date if `gp'== 2,yaxis(2) fcolor(gs10)) ///
>            (tsline `mom' if `gp'== 2,lp(shortdash) lwidth(thick)) , ///
>        xtitle("date") ///
>            ytitle("") ///
>            ytitle("sp500 return (%)",axis(2)) ///
>            title("`mom' by age") ///
>            legend(label(1 "sp500 (RHS)") label(2 "old")  col(3)) ///
>            caption("{c -(}superscript:young corr =`rho_y', middle-age corr =`rho_m', old corr =`rho_o',{c )-}", ///
>            justification(left) position(11) size(vlarge))
{txt} 17{com}.  graph export "${c -(}sum_graph_folder{c )-}/ts/ts_`mom'_`gp'_`agg'_stk.png",as(png) replace 
{txt} 18{com}.   {c )-}
{txt} 19{com}.  
.   restore
{txt} 20{com}. {c )-}
{txt} 21{com}. {c )-}
{res}{txt}{col 8}panel variable:  {res}age_g (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}date, 2013m6 to 2019m5
{txt}{col 17}delta:  {res}1 month
{txt}(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incmean_age_g_mean.png written in PNG format)

             {c |}  incmean F..sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.2230   1.0000 

             {txt}{c |}  incmean F..sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.3719*  1.0000 

             {txt}{c |}  incmean F..sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.4280*  1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incmean_age_g_mean_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincmean_age_g_mean.png written in PNG format)

             {c |} rincmean F..sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.5121*  1.0000 

             {txt}{c |} rincmean F..sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.1204   1.0000 

             {txt}{c |} rincmean F..sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res}  0.0274   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincmean_age_g_mean_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incvar_age_g_mean.png written in PNG format)

             {c |}   incvar F..sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.1477   1.0000 

             {txt}{c |}   incvar F..sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.4065*  1.0000 

             {txt}{c |}   incvar F..sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.0408   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incvar_age_g_mean_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincvar_age_g_mean.png written in PNG format)

             {c |}  rincvar F..sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res}  0.1480   1.0000 

             {txt}{c |}  rincvar F..sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.0763   1.0000 

             {txt}{c |}  rincvar F..sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res}  0.0628   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincvar_age_g_mean_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_inciqr_age_g_mean.png written in PNG format)

             {c |}   inciqr F..sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.2773*  1.0000 

             {txt}{c |}   inciqr F..sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.2528*  1.0000 

             {txt}{c |}   inciqr F..sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.1194   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_inciqr_age_g_mean_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incskew_age_g_mean.png written in PNG format)

             {c |}  incskew F..sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.3585*  1.0000 

             {txt}{c |}  incskew F..sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.1777   1.0000 

             {txt}{c |}  incskew F..sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.3916*  1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incskew_age_g_mean_stk.png written in PNG format)
{res}{txt}{col 8}panel variable:  {res}age_g (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}date, 2013m6 to 2019m5
{txt}{col 17}delta:  {res}1 month
{txt}(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incmean_age_g_median.png written in PNG format)

             {c |}  incmean F..sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.2717*  1.0000 

             {txt}{c |}  incmean F..sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.2867*  1.0000 

             {txt}{c |}  incmean F..sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.4203*  1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incmean_age_g_median_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincmean_age_g_median.png written in PNG format)

             {c |} rincmean F..sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.4994*  1.0000 

             {txt}{c |} rincmean F..sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.1791   1.0000 

             {txt}{c |} rincmean F..sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.0125   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincmean_age_g_median_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incvar_age_g_median.png written in PNG format)

             {c |}   incvar F..sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.0528   1.0000 

             {txt}{c |}   incvar F..sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.3491*  1.0000 

             {txt}{c |}   incvar F..sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.0645   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incvar_age_g_median_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincvar_age_g_median.png written in PNG format)

             {c |}  rincvar F..sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.1114   1.0000 

             {txt}{c |}  rincvar F..sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.2337   1.0000 

             {txt}{c |}  rincvar F..sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.0044   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincvar_age_g_median_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_inciqr_age_g_median.png written in PNG format)

             {c |}   inciqr F..sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.0653   1.0000 

             {txt}{c |}   inciqr F..sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.3275*  1.0000 

             {txt}{c |}   inciqr F..sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.0291   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_inciqr_age_g_median_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incskew_age_g_median.png written in PNG format)

             {c |}  incskew F..sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.4195*  1.0000 

             {txt}{c |}  incskew F..sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.1915   1.0000 

             {txt}{c |}  incskew F..sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.4348*  1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incskew_age_g_median_stk.png written in PNG format)

{com}. 
. */
. 
. 
. ** 2 groups 
. foreach agg in mean median{c -(}
{txt}  2{com}.   foreach gp in edu_g{c -(}
{txt}  3{com}.    preserve 
{txt}  4{com}.    
.    collapse (`agg') `Moments' sp500, by(date `gp')
{txt}  5{com}.    xtset `gp' date 
{txt}  6{com}.    
. foreach mom in `Moments'{c -(}
{txt}  7{com}. keep if `mom'!=.
{txt}  8{com}. twoway (tsline `mom' if `gp'== 0,lp(solid) lwidth(thick)) ///
>        (tsline `mom' if `gp'== 1,lp(dash) lwidth(thick)), ///
>        xtitle("date") ///
>            ytitle("") ///
>            title("`mom' by education") ///
>            legend(label(1 "low") label(2 "high") col(2))
{txt}  9{com}.  graph export "${c -(}sum_graph_folder{c )-}/ts/ts_`mom'_`gp'_`agg'.png",as(png) replace  
{txt} 10{com}.       
. 
.  
. ** compute correlation coefficients 
. pwcorr `mom' f11.sp500 if `gp'==0, star(0.05)
{txt} 11{com}. local rho_l: display %4.2f r(rho) 
{txt} 12{com}. pwcorr `mom' f11.sp500 if `gp'==1, star(0.05)
{txt} 13{com}. local rho_h: display %4.2f r(rho) 
{txt} 14{com}. 
. ** moments and sp500 
. *** correlation with stock market by group *****
. 
. twoway (bar sp500 date if `gp'== 1,yaxis(2) fcolor(gs10)) ///
>            (tsline `mom' if `gp'== 1,lp(shortdash) lwidth(thick)), ///
>        xtitle("date") ///
>            ytitle("") ///
>            ytitle("sp500 return (%)",axis(2)) ///
>            title("`mom' by education") ///
>            legend(label(1 "sp500 (RHS)") label(2 "high") col(3)) ///
>            caption("{c -(}superscript:low corr =`rho_l', high corr =`rho_h',{c )-}", ///
>            justification(left) position(11) size(vlarge))
{txt} 15{com}. graph export "${c -(}sum_graph_folder{c )-}/ts/ts_`mom'_`gp'_`agg'_stk.png",as(png) replace 
{txt} 16{com}.    {c )-}
{txt} 17{com}.   
.  restore
{txt} 18{com}. {c )-}
{txt} 19{com}. {c )-}
{res}{txt}{col 8}panel variable:  {res}edu_g (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}date, 2013m6 to 2019m5
{txt}{col 17}delta:  {res}1 month
{txt}(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incmean_edu_g_mean.png written in PNG format)

             {c |}  incmean F..sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.3930*  1.0000 

             {txt}{c |}  incmean F..sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.4691*  1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incmean_edu_g_mean_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincmean_edu_g_mean.png written in PNG format)

             {c |} rincmean F..sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.1937   1.0000 

             {txt}{c |} rincmean F..sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.2763*  1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincmean_edu_g_mean_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incvar_edu_g_mean.png written in PNG format)

             {c |}   incvar F..sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.2275   1.0000 

             {txt}{c |}   incvar F..sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.3328*  1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incvar_edu_g_mean_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincvar_edu_g_mean.png written in PNG format)

             {c |}  rincvar F..sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.0813   1.0000 

             {txt}{c |}  rincvar F..sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res}  0.0803   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincvar_edu_g_mean_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_inciqr_edu_g_mean.png written in PNG format)

             {c |}   inciqr F..sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.3001*  1.0000 

             {txt}{c |}   inciqr F..sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.3180*  1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_inciqr_edu_g_mean_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incskew_edu_g_mean.png written in PNG format)

             {c |}  incskew F..sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.0611   1.0000 

             {txt}{c |}  incskew F..sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.6168*  1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incskew_edu_g_mean_stk.png written in PNG format)
{res}{txt}{col 8}panel variable:  {res}edu_g (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}date, 2013m6 to 2019m5
{txt}{col 17}delta:  {res}1 month
{txt}(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incmean_edu_g_median.png written in PNG format)

             {c |}  incmean F..sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.3383*  1.0000 

             {txt}{c |}  incmean F..sp500
{hline 13}{c +}{hline 18}
     incmean {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.3672*  1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incmean_edu_g_median_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincmean_edu_g_median.png written in PNG format)

             {c |} rincmean F..sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.2057   1.0000 

             {txt}{c |} rincmean F..sp500
{hline 13}{c +}{hline 18}
    rincmean {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.3209*  1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincmean_edu_g_median_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incvar_edu_g_median.png written in PNG format)

             {c |}   incvar F..sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res}  0.1018   1.0000 

             {txt}{c |}   incvar F..sp500
{hline 13}{c +}{hline 18}
      incvar {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.3202*  1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incvar_edu_g_median_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincvar_edu_g_median.png written in PNG format)

             {c |}  rincvar F..sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.1213   1.0000 

             {txt}{c |}  rincvar F..sp500
{hline 13}{c +}{hline 18}
     rincvar {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.2077   1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_rincvar_edu_g_median_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_inciqr_edu_g_median.png written in PNG format)

             {c |}   inciqr F..sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.1329   1.0000 

             {txt}{c |}   inciqr F..sp500
{hline 13}{c +}{hline 18}
      inciqr {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.2804*  1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_inciqr_edu_g_median_stk.png written in PNG format)
(0 observations deleted)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incskew_edu_g_median.png written in PNG format)

             {c |}  incskew F..sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.1619   1.0000 

             {txt}{c |}  incskew F..sp500
{hline 13}{c +}{hline 18}
     incskew {c |} {res}  1.0000 
   {txt}F11.sp500 {c |} {res} -0.4545*  1.0000 
{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/ts/ts_incskew_edu_g_median_stk.png written in PNG format)

{com}. 
. 
. /*
> *******************
> *** Seasonal ******
> *******************
> 
> 
> eststo clear
> 
> foreach mom in var iqr mean{c -(}
> eststo: reg Q24_`mom' i.month, robust 
> {c )-}
> foreach mom in Mean Var Skew Kurt{c -(}
> eststo: reg Inc`mom' i.month, robust 
> {c )-}
> 
> esttab using "${c -(}sum_table_folder{c )-}/month_fe.csv", ///
>              se r2 drop(_cons) ///
>                          label replace
> 
> 
> 
> ********************
> ** Regression ******
> ********************
> 
> global other_control i.Q33 i.Q34 Q35_1 Q35_2 Q35_3 Q35_4 Q35_5 Q35_6 
> global macro_ex_var Q4new Q6new Q9_mean Q13new
> 
> eststo clear
> 
> foreach mom in var iqr mean{c -(}
> eststo: reg Q24_`mom' i.age_g i.edu_g i.inc_g i.cohort_g i.year i.state_id, robust 
> eststo: reg Q24_`mom' i.age_g i.edu_g i.inc_g i.cohort_g i.year i.state_id ${c -(}other_control{c )-}, robust 
> eststo: reg Q24_`mom' i.age_g i.edu_g i.inc_g i.cohort_g i.year i.state_id ${c -(}other_control{c )-} ${c -(}macro_ex_var{c )-}, robust 
> {c )-}
> foreach mom in Mean Var Skew Kurt{c -(}
> eststo: reg Inc`mom' i.age_g i.edu_g i.inc_g i.cohort_g i.year i.state_id, robust 
> eststo: reg Inc`mom' i.age_g i.edu_g i.inc_g i.cohort_g i.year i.state_id ${c -(}other_control{c )-}, robust 
> eststo: reg Inc`mom' i.age_g i.edu_g i.inc_g i.cohort_g i.year i.state_id ${c -(}other_control{c )-} ${c -(}macro_ex_var{c )-}, robust 
> 
> {c )-}
> 
> esttab using "${c -(}sum_table_folder{c )-}/mom_group.csv", ///
>              se r2 drop(0.age_g 0.edu_g 0.inc_g 0.cohort_g  *.year *state_id 1.Q33 1.Q34 _cons) ///
>                          label replace
> 
> *****************************
> ** Regression Full-table ******
> *******************************
>                          
> eststo clear
> 
> label var D6 "HH income group"
> label var Q10_1 "full-time"
> label var Q10_2 "part-time"
> label var Q36 "education"
>         
> foreach mom in mean var iqr rmean rvar{c -(}
> eststo: reg Q24_`mom' i.Q10_2 i.Q12new i.month, vce(cl ID)
> eststo: reg Q24_`mom' i.Q10_2 i.Q12new i.D6 i.month,vce(cl ID)
> eststo: reg Q24_`mom' i.Q10_2 i.Q12new i.D6 Q4new Q13new Q6new i.month,vce(cl ID)
> eststo: reg Q24_`mom' i.Q36 i.age_g i.month,vce(cl ID)
> {c )-}
> 
> /*
> foreach mom in Mean Var Skew Kurt{c -(}
> eststo: xtreg Inc`mom' i.Q10_1 i.Q10_2 i.Q12new, fe robust 
> eststo: xtreg Inc`mom' i.Q10_1 i.Q10_2 i.Q12new i.Q47, fe robust 
> eststo: xtreg Inc`mom' i.Q10_1 i.Q10_2 i.Q12new i.Q47 Q4new Q13new Q6new, fe robust 
> {c )-}
> */
> 
> esttab using "${c -(}sum_table_folder{c )-}/mom_ind_reg.csv", ///
>              se r2 drop(0.age_g 1.Q36 0.Q10_2 1.Q12new 1.D6 *.month _cons) ///
>                          label replace
> */      
. log close 
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/Myworld/Dropbox/IncExpProject/WorkingFolder/indSCE_Est_log.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}25 Mar 2020, 19:02:27
{txt}{.-}
{smcl}
{txt}{sf}{ul off}