{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/Myworld/Dropbox/IncExpProject/WorkingFolder/indSCE_Est_log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 2 Oct 2019, 15:36:26
{txt}
{com}. 
. 
. ***************************
. **  Clean and Merge Data **
. ***************************
. 
. use "${c -(}folder{c )-}/SCE/IncExpSCEDstIndM",clear 
{txt}
{com}. 
. duplicates report year month userid

{p 0 4}{txt}Duplicates in terms of {res} year month userid{p_end}

{txt}{hline 10}{c TT}{hline 27}
   copies {c |} observations       surplus
{hline 10}{c +}{hline 27}
        1 {c |}        {res}79064             0
{txt}{hline 10}{c BT}{hline 27}

{com}. 
. 
. ******************************
. *** Merge with demographics **
. *****************************
. 
. merge 1:1 year month userid using "${c -(}folder{c )-}/SCE/IncExpSCEProbIndM",keep(master match) 
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}          79,064{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge hh_info_merge
{res}{txt}
{com}. 
. *******************************
. **  Set Panel Data Structure **
. *******************************
. rename userid ID 
{res}{txt}
{com}. xtset ID date   /* this is not correct. ID is unique here.*/
{res}{txt}{col 8}panel variable:  {res}ID (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}date, 01jun2013 00:00:00 to 01may2018 00:00:00
{col 25}but with gaps
{txt}{col 17}delta:  {res}.001 seconds
{txt}
{com}. sort ID year month 
{txt}
{com}. 
. *******************************
. ** Exclude extreme outliers 
. ******************************
. 
. keep if Q32 < 100 & Q32 >= 10
{txt}(67437 observations deleted)

{com}. 
. 
. 
. *****************************
. *** generate other vars *****
. *****************************
. 
. gen age_sq = (Q32-30)^2
{txt}
{com}. label var age_sq "Age-squared"
{txt}
{com}. 
. encode _STATE, gen(state_id)
{txt}
{com}. label var state_id "state id"
{txt}
{com}. 
. *****************************
. *** generate group vars *****
. *****************************
. 
. gen cohort = year-Q32
{txt}
{com}. label var cohort "cohort by year of birth"
{txt}
{com}. egen cohort_g = cut(cohort), group(3)
{txt}
{com}. label define cohortlb 0 "1915-1956" 1 "1957-1972" 2 "1973-2000"
{txt}
{com}. label value cohort_g cohortlb
{txt}
{com}. 
. egen age_g = cut(Q32), group(3)  
{txt}
{com}. label var age_g "age group"
{txt}
{com}. label define agelb 0 "Young" 1 "Middle-age" 2 "Old"
{txt}
{com}. label value age_g agelb
{txt}
{com}. 
. egen edu_g = cut(Q36), group(3) 
{txt}(1 missing value generated)

{com}. label var edu_g "education group"
{txt}
{com}. label define edulb 0 "Low Education" 1 "Medium Education" 2 "High Education"
{txt}
{com}. label value edu_g adulb
{txt}
{com}. 
. gen gender_g = Q33 
{txt}(2 missing values generated)

{com}. label var gender_g "gender_grou"
{txt}
{com}. 
. egen inc_g = cut(Q47), group(3)
{txt}(126 missing values generated)

{com}. label var inc_g "income_g"
{txt}
{com}. label define inclb 0 "Low income" 1 "Middle Income" 2 "High Income"
{txt}
{com}. label value inc_g inclb
{txt}
{com}. 
. local group_vars age_g edu_g inc_g cohort_g
{txt}
{com}. 
. 
. **********************************
. *** tables and hists of Vars *****
. **********************************
. 
. 
. foreach gp in `group_vars' {c -(}
{txt}  2{com}. tabstat Q24_mean Q24_var Q24_iqr, st(p10 p50 p90) by(`gp')
{txt}  3{com}. {c )-}

{txt}Summary statistics: p10, p50, p90
  by categories of: age_g (age group)

{ralign 10:age_g} {...}
{c |}{...}
  Q24_mean   Q24_var   Q24_iqr
{hline 11}{c +}{hline 30}
{ralign 10:Young} {...}
{c |}{...}
 {res} .7777428  .3333333  .9061641
{txt}{space 10} {...}
{c |}{...}
 {res}  2.96073  1.650073         2
{txt}{space 10} {...}
{c |}{...}
 {res} 6.809876  21.20652  10.22087
{txt}{hline 11}{c +}{hline 30}
{ralign 10:Middle-age} {...}
{c |}{...}
 {res} .4221108  .3333333  .8810234
{txt}{space 10} {...}
{c |}{...}
 {res} 2.367884  1.056389  1.437962
{txt}{space 10} {...}
{c |}{...}
 {res} 6.025575  17.71149  8.342402
{txt}{hline 11}{c +}{hline 30}
{ralign 10:Old} {...}
{c |}{...}
 {res} .7119929  .3333333  .9061639
{txt}{space 10} {...}
{c |}{...}
 {res}        2  1.044458  1.391605
{txt}{space 10} {...}
{c |}{...}
 {res} 6.017493  22.44984  9.520319
{txt}{hline 11}{c +}{hline 30}
{ralign 10:Total} {...}
{c |}{...}
 {res} .6104578  .3333333  .9061639
{txt}{space 10} {...}
{c |}{...}
 {res} 2.537525  1.333333  1.713396
{txt}{space 10} {...}
{c |}{...}
 {res}  6.47924  20.05368  9.314573
{txt}{hline 11}{c BT}{hline 30}

Summary statistics: p10, p50, p90
  by categories of: edu_g (education group)

{ralign 6:edu_g} {...}
{c |}{...}
  Q24_mean   Q24_var   Q24_iqr
{hline 7}{c +}{hline 30}
{ralign 6:0} {...}
{c |}{...}
 {res} 2.08e-08  .3333333         1
{txt}{space 6} {...}
{c |}{...}
 {res}        2  1.333333         2
{txt}{space 6} {...}
{c |}{...}
 {res} 6.558024    30.028        13
{txt}{hline 7}{c +}{hline 30}
{ralign 6:1} {...}
{c |}{...}
 {res} .1782963  .3333333  .9061641
{txt}{space 6} {...}
{c |}{...}
 {res} 2.453082  1.105975  1.570626
{txt}{space 6} {...}
{c |}{...}
 {res} 6.318821  20.84629  12.18417
{txt}{hline 7}{c +}{hline 30}
{ralign 6:2} {...}
{c |}{...}
 {res} .8352844  .3333333  .8566982
{txt}{space 6} {...}
{c |}{...}
 {res} 2.708411   1.34117    1.7134
{txt}{space 6} {...}
{c |}{...}
 {res}  6.49011  18.49858  7.409681
{txt}{hline 7}{c +}{hline 30}
{ralign 6:Total} {...}
{c |}{...}
 {res} .6104578  .3333333  .9061639
{txt}{space 6} {...}
{c |}{...}
 {res} 2.537525  1.333333  1.713396
{txt}{space 6} {...}
{c |}{...}
 {res}  6.47924  20.05368  9.314573
{txt}{hline 7}{c BT}{hline 30}

Summary statistics: p10, p50, p90
  by categories of: inc_g (income_g)

{ralign 13:inc_g} {...}
{c |}{...}
  Q24_mean   Q24_var   Q24_iqr
{hline 14}{c +}{hline 30}
{ralign 13:Low income} {...}
{c |}{...}
 {res} 2.08e-08  .3333333         1
{txt}{space 13} {...}
{c |}{...}
 {res} 2.000654  1.333333         2
{txt}{space 13} {...}
{c |}{...}
 {res} 6.924951   31.6453        13
{txt}{hline 14}{c +}{hline 30}
{ralign 13:Middle Income} {...}
{c |}{...}
 {res} .5375247  .3333333  .9061639
{txt}{space 13} {...}
{c |}{...}
 {res} 2.192116  1.132435  1.514932
{txt}{space 13} {...}
{c |}{...}
 {res}        6  18.82199  8.680031
{txt}{hline 14}{c +}{hline 30}
{ralign 13:High Income} {...}
{c |}{...}
 {res}        1  .3333333   .856698
{txt}{space 13} {...}
{c |}{...}
 {res} 2.793575  1.333333   1.64027
{txt}{space 13} {...}
{c |}{...}
 {res} 6.599971  17.20418  7.156532
{txt}{hline 14}{c +}{hline 30}
{ralign 13:Total} {...}
{c |}{...}
 {res} .6104578  .3333333  .9061639
{txt}{space 13} {...}
{c |}{...}
 {res} 2.537525  1.333333  1.713396
{txt}{space 13} {...}
{c |}{...}
 {res} 6.486081  20.26763  9.346632
{txt}{hline 14}{c BT}{hline 30}

Summary statistics: p10, p50, p90
  by categories of: cohort_g 

{ralign 9:cohort_g} {...}
{c |}{...}
  Q24_mean   Q24_var   Q24_iqr
{hline 10}{c +}{hline 30}
{ralign 9:1915-1956} {...}
{c |}{...}
 {res} .6228527  .3333333  .9061639
{txt}{space 9} {...}
{c |}{...}
 {res}        2  .9760123  1.324268
{txt}{space 9} {...}
{c |}{...}
 {res}        6  21.60151  8.832264
{txt}{hline 10}{c +}{hline 30}
{ralign 9:1957-1972} {...}
{c |}{...}
 {res} .4477587  .3333333  .8566982
{txt}{space 9} {...}
{c |}{...}
 {res} 2.280812  1.044458  1.435542
{txt}{space 9} {...}
{c |}{...}
 {res}        6  16.78715  8.509292
{txt}{hline 10}{c +}{hline 30}
{ralign 9:1973-2000} {...}
{c |}{...}
 {res} .7586042  .3333333  .9061641
{txt}{space 9} {...}
{c |}{...}
 {res} 2.955731  1.632472         2
{txt}{space 9} {...}
{c |}{...}
 {res} 6.868142  21.45051   10.2934
{txt}{hline 10}{c +}{hline 30}
{ralign 9:Total} {...}
{c |}{...}
 {res} .6104578  .3333333  .9061639
{txt}{space 9} {...}
{c |}{...}
 {res} 2.537525  1.333333  1.713396
{txt}{space 9} {...}
{c |}{...}
 {res}  6.47924  20.05368  9.314573
{txt}{hline 10}{c BT}{hline 30}

{com}. 
. 
. foreach gp in `group_vars' {c -(}
{txt}  2{com}. table `gp', c(median Q24_var) by(year)
{txt}  3{com}. {c )-}

{txt}{hline 11}{c TT}{hline 13}
year and   {c |}
age group  {c |} med(Q24_var)
{hline 11}{c +}{hline 13}
2013       {c |}
     Young {c |}    {res}1.4706578
{txt}Middle-age {c |}    {res}1.0504482
       {txt}Old {c |}    {res}.87410492
{txt}{hline 11}{c +}{hline 13}
2014       {c |}
     Young {c |}     {res}1.642285
{txt}Middle-age {c |}     {res}1.333333
       {txt}Old {c |}    {res}.87410492
{txt}{hline 11}{c +}{hline 13}
2015       {c |}
     Young {c |}    {res}1.7716688
{txt}Middle-age {c |}    {res}.87410492
       {txt}Old {c |}     {res}1.333333
{txt}{hline 11}{c +}{hline 13}
2016       {c |}
     Young {c |}    {res}1.6922234
{txt}Middle-age {c |}    {res}.86692697
       {txt}Old {c |}    {res}1.1862721
{txt}{hline 11}{c +}{hline 13}
2017       {c |}
     Young {c |}    {res}1.7856894
{txt}Middle-age {c |}    {res}.93161613
       {txt}Old {c |}    {res}.66666669
{txt}{hline 11}{c +}{hline 13}
2018       {c |}
     Young {c |}    {res}1.5146742
{txt}Middle-age {c |}    {res}.94059372
       {txt}Old {c |}    {res}1.0095498
{txt}{hline 11}{c BT}{hline 13}

{hline 10}{c TT}{hline 13}
year and  {c |}
education {c |}
group     {c |} med(Q24_var)
{hline 10}{c +}{hline 13}
2013      {c |}
        0 {c |}     {res}1.105975
        {txt}1 {c |}    {res}.89902848
        {txt}2 {c |}     {res}1.333333
{txt}{hline 10}{c +}{hline 13}
2014      {c |}
        0 {c |}     {res}1.425889
        {txt}1 {c |}     {res}1.333333
        {txt}2 {c |}    {res}1.4992648
{txt}{hline 10}{c +}{hline 13}
2015      {c |}
        0 {c |}    {res}1.8824012
        {txt}1 {c |}    {res}.66863903
        {txt}2 {c |}    {res}1.5399913
{txt}{hline 10}{c +}{hline 13}
2016      {c |}
        0 {c |}     {res}1.333333
        {txt}1 {c |}     {res}1.105975
        {txt}2 {c |}     {res}1.333333
{txt}{hline 10}{c +}{hline 13}
2017      {c |}
        0 {c |}     {res}1.105975
        {txt}1 {c |}    {res}1.1379284
        {txt}2 {c |}    {res}1.3586999
{txt}{hline 10}{c +}{hline 13}
2018      {c |}
        0 {c |}     {res}1.536028
        {txt}1 {c |}    {res}1.0006096
        {txt}2 {c |}     {res}1.333333
{txt}{hline 10}{c BT}{hline 13}

{hline 14}{c TT}{hline 13}
year and      {c |}
income_g      {c |} med(Q24_var)
{hline 14}{c +}{hline 13}
2013          {c |}
   Low income {c |}    {res}1.9040942
{txt}Middle Income {c |}    {res}.66666669
  {txt}High Income {c |}     {res}1.333333
{txt}{hline 14}{c +}{hline 13}
2014          {c |}
   Low income {c |}    {res}1.6520977
{txt}Middle Income {c |}     {res}1.333333
  {txt}High Income {c |}    {res}1.3432762
{txt}{hline 14}{c +}{hline 13}
2015          {c |}
   Low income {c |}     {res}1.333333
{txt}Middle Income {c |}    {res}.99126315
  {txt}High Income {c |}    {res}1.4270498
{txt}{hline 14}{c +}{hline 13}
2016          {c |}
   Low income {c |}     {res}1.333333
{txt}Middle Income {c |}    {res}1.3262935
  {txt}High Income {c |}    {res}1.2031537
{txt}{hline 14}{c +}{hline 13}
2017          {c |}
   Low income {c |}     {res}1.333333
{txt}Middle Income {c |}     {res}1.333333
  {txt}High Income {c |}     {res}1.333333
{txt}{hline 14}{c +}{hline 13}
2018          {c |}
   Low income {c |}     {res}1.333333
{txt}Middle Income {c |}     {res}1.333333
  {txt}High Income {c |}    {res}1.3093832
{txt}{hline 14}{c BT}{hline 13}

{hline 10}{c TT}{hline 13}
year and  {c |}
cohort_g  {c |} med(Q24_var)
{hline 10}{c +}{hline 13}
2013      {c |}
1915-1956 {c |}    {res}.72505316
{txt}1957-1972 {c |}     {res}1.166442
{txt}1973-2000 {c |}     {res}1.646167
{txt}{hline 10}{c +}{hline 13}
2014      {c |}
1915-1956 {c |}    {res}.87410492
{txt}1957-1972 {c |}     {res}1.333333
{txt}1973-2000 {c |}     {res}1.642285
{txt}{hline 10}{c +}{hline 13}
2015      {c |}
1915-1956 {c |}     {res}1.333333
{txt}1957-1972 {c |}    {res}.84719852
{txt}1973-2000 {c |}    {res}1.7716688
{txt}{hline 10}{c +}{hline 13}
2016      {c |}
1915-1956 {c |}    {res}1.1651365
{txt}1957-1972 {c |}    {res}.93051246
{txt}1973-2000 {c |}    {res}1.5051229
{txt}{hline 10}{c +}{hline 13}
2017      {c |}
1915-1956 {c |}    {res}1.0897299
{txt}1957-1972 {c |}    {res}.81034333
{txt}1973-2000 {c |}    {res}1.7099483
{txt}{hline 10}{c +}{hline 13}
2018      {c |}
1915-1956 {c |}    {res}1.1888956
{txt}1957-1972 {c |}    {res}.66666669
{txt}1973-2000 {c |}    {res}1.4926659
{txt}{hline 10}{c BT}{hline 13}

{com}. 
. /*
> 
> foreach mom in iqr var mean {c -(}
> 
> twoway (hist Q24_`mom',fcolor(ltblue) lcolor(none)), ///
>            ytitle("") ///
>            title("`mom'")
> graph export "${c -(}sum_graph_folder{c )-}/hist/hist_`mom'.png",as(png) replace  
> 
> {c )-}
> 
> foreach gp in `group_vars' {c -(}
> foreach mom in iqr var mean {c -(}
> 
> twoway (hist Q24_`mom' if `gp'==0,fcolor(gs15) lcolor("")) /// 
>        (hist Q24_`mom' if `gp'==1,fcolor(ltblue) lcolor("")) ///
>            (hist Q24_`mom' if `gp'==2,fcolor(red) lcolor("")), ///
>            xtitle("") ///
>            ytitle("") ///
>            title("`mom'") ///
>            legend(label(1 `gp'=0) label(2 `gp'=1) label(3 `gp'=2) col(1))
> 
> graph export "${c -(}sum_graph_folder{c )-}/hist/hist_`mom'_`gp'.png",as(png) replace  
> 
> {c )-}
> {c )-}
> */
. ********************
. ** Regression ******
. ********************
. 
. global other_control i.Q33 i.Q34 Q35_1 Q35_2 Q35_3 Q35_4 Q35_5 Q35_6 
{txt}
{com}. global macro_ex_var Q4new Q6new Q9_mean Q13new
{txt}
{com}. 
. eststo clear
{txt}
{com}. 
. foreach mom in var iqr mean{c -(}
{txt}  2{com}. eststo: reg Q24_`mom' i.age_g i.edu_g i.inc_g i.cohort_g i.year i.state_id, robust 
{txt}  3{com}. eststo: reg Q24_`mom' i.age_g i.edu_g i.inc_g i.cohort_g i.year i.state_id ${c -(}other_control{c )-}, robust 
{txt}  4{com}. eststo: reg Q24_`mom' i.age_g i.edu_g i.inc_g i.cohort_g i.year i.state_id ${c -(}other_control{c )-} ${c -(}macro_ex_var{c )-}, robust 
{txt}  5{com}. {c )-}

{txt}Linear regression                                      Number of obs ={res}    6800
                                                       {txt}F( 63,  6736) ={res}    3.14
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0234
                                                       {txt}Root MSE      = {res} 12.079

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     Q24_var{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2} .4952253{col 26}{space 2} .8934697{col 37}{space 1}    0.55{col 46}{space 3}0.579{col 54}{space 4}-1.256258{col 67}{space 3} 2.246709
{txt}{space 8}Old  {c |}{col 14}{res}{space 2} 1.059205{col 26}{space 2} 1.252666{col 37}{space 1}    0.85{col 46}{space 3}0.398{col 54}{space 4}-1.396417{col 67}{space 3} 3.514827
{txt}{space 12} {c |}
{space 7}edu_g {c |}
{space 10}1  {c |}{col 14}{res}{space 2}-1.335359{col 26}{space 2} .6262923{col 37}{space 1}   -2.13{col 46}{space 3}0.033{col 54}{space 4} -2.56309{col 67}{space 3}-.1076283
{txt}{space 10}2  {c |}{col 14}{res}{space 2}-1.405861{col 26}{space 2} .6071683{col 37}{space 1}   -2.32{col 46}{space 3}0.021{col 54}{space 4}-2.596103{col 67}{space 3}-.2156195
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2}-2.611224{col 26}{space 2} .4902867{col 37}{space 1}   -5.33{col 46}{space 3}0.000{col 54}{space 4}-3.572341{col 67}{space 3}-1.650107
{txt}High Income  {c |}{col 14}{res}{space 2}-2.478488{col 26}{space 2} .4825041{col 37}{space 1}   -5.14{col 46}{space 3}0.000{col 54}{space 4}-3.424349{col 67}{space 3}-1.532628
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2}-.2523947{col 26}{space 2} .8958756{col 37}{space 1}   -0.28{col 46}{space 3}0.778{col 54}{space 4}-2.008594{col 67}{space 3} 1.503805
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} 1.634512{col 26}{space 2} 1.286322{col 37}{space 1}    1.27{col 46}{space 3}0.204{col 54}{space 4}-.8870867{col 67}{space 3} 4.156111
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2}-.1616278{col 26}{space 2} .4586555{col 37}{space 1}   -0.35{col 46}{space 3}0.725{col 54}{space 4}-1.060738{col 67}{space 3}  .737482
{txt}{space 7}2015  {c |}{col 14}{res}{space 2}-.0639467{col 26}{space 2} .4636915{col 37}{space 1}   -0.14{col 46}{space 3}0.890{col 54}{space 4}-.9729286{col 67}{space 3} .8450352
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0575611{col 26}{space 2} .4714433{col 37}{space 1}   -0.12{col 46}{space 3}0.903{col 54}{space 4}-.9817389{col 67}{space 3} .8666168
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .6391514{col 26}{space 2} .4989287{col 37}{space 1}    1.28{col 46}{space 3}0.200{col 54}{space 4}-.3389067{col 67}{space 3}  1.61721
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0008389{col 26}{space 2} .6312083{col 37}{space 1}   -0.00{col 46}{space 3}0.999{col 54}{space 4}-1.238207{col 67}{space 3} 1.236529
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2}-7.737582{col 26}{space 2} 9.903951{col 37}{space 1}   -0.78{col 46}{space 3}0.435{col 54}{space 4}-27.15246{col 67}{space 3} 11.67729
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-8.732422{col 26}{space 2} 9.971084{col 37}{space 1}   -0.88{col 46}{space 3}0.381{col 54}{space 4} -28.2789{col 67}{space 3} 10.81405
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-8.378287{col 26}{space 2} 9.849352{col 37}{space 1}   -0.85{col 46}{space 3}0.395{col 54}{space 4}-27.68613{col 67}{space 3} 10.92956
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-6.703303{col 26}{space 2} 9.815345{col 37}{space 1}   -0.68{col 46}{space 3}0.495{col 54}{space 4}-25.94448{col 67}{space 3} 12.53788
{txt}{space 9}CO  {c |}{col 14}{res}{space 2}-8.170134{col 26}{space 2} 9.851791{col 37}{space 1}   -0.83{col 46}{space 3}0.407{col 54}{space 4}-27.48276{col 67}{space 3} 11.14249
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-9.803401{col 26}{space 2} 9.845029{col 37}{space 1}   -1.00{col 46}{space 3}0.319{col 54}{space 4}-29.10277{col 67}{space 3} 9.495969
{txt}{space 9}DC  {c |}{col 14}{res}{space 2} -8.54098{col 26}{space 2} 9.901575{col 37}{space 1}   -0.86{col 46}{space 3}0.388{col 54}{space 4} -27.9512{col 67}{space 3} 10.86924
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-9.232345{col 26}{space 2} 10.20352{col 37}{space 1}   -0.90{col 46}{space 3}0.366{col 54}{space 4}-29.23448{col 67}{space 3} 10.76979
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-7.628211{col 26}{space 2} 9.824893{col 37}{space 1}   -0.78{col 46}{space 3}0.438{col 54}{space 4}-26.88811{col 67}{space 3} 11.63169
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-8.373963{col 26}{space 2} 9.834718{col 37}{space 1}   -0.85{col 46}{space 3}0.395{col 54}{space 4}-27.65312{col 67}{space 3} 10.90519
{txt}{space 9}HI  {c |}{col 14}{res}{space 2}-6.840401{col 26}{space 2} 10.15523{col 37}{space 1}   -0.67{col 46}{space 3}0.501{col 54}{space 4}-26.74786{col 67}{space 3} 13.06706
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-12.50229{col 26}{space 2} 9.820412{col 37}{space 1}   -1.27{col 46}{space 3}0.203{col 54}{space 4} -31.7534{col 67}{space 3} 6.748824
{txt}{space 9}ID  {c |}{col 14}{res}{space 2}-9.806564{col 26}{space 2} 9.923616{col 37}{space 1}   -0.99{col 46}{space 3}0.323{col 54}{space 4}-29.25999{col 67}{space 3} 9.646862
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-9.626046{col 26}{space 2} 9.817733{col 37}{space 1}   -0.98{col 46}{space 3}0.327{col 54}{space 4}-28.87191{col 67}{space 3} 9.619814
{txt}{space 9}IN  {c |}{col 14}{res}{space 2} -8.01171{col 26}{space 2} 9.860205{col 37}{space 1}   -0.81{col 46}{space 3}0.417{col 54}{space 4}-27.34083{col 67}{space 3} 11.31741
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-9.257441{col 26}{space 2}  9.91548{col 37}{space 1}   -0.93{col 46}{space 3}0.351{col 54}{space 4}-28.69492{col 67}{space 3} 10.18003
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-9.452172{col 26}{space 2} 9.897714{col 37}{space 1}   -0.95{col 46}{space 3}0.340{col 54}{space 4}-28.85482{col 67}{space 3} 9.950478
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-7.740776{col 26}{space 2} 9.920677{col 37}{space 1}   -0.78{col 46}{space 3}0.435{col 54}{space 4}-27.18844{col 67}{space 3} 11.70689
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-7.700153{col 26}{space 2} 9.852873{col 37}{space 1}   -0.78{col 46}{space 3}0.435{col 54}{space 4} -27.0149{col 67}{space 3} 11.61459
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-7.503972{col 26}{space 2} 9.859962{col 37}{space 1}   -0.76{col 46}{space 3}0.447{col 54}{space 4}-26.83262{col 67}{space 3} 11.82467
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-10.83478{col 26}{space 2} 9.865638{col 37}{space 1}   -1.10{col 46}{space 3}0.272{col 54}{space 4}-30.17455{col 67}{space 3} 8.504994
{txt}{space 9}MI  {c |}{col 14}{res}{space 2}-8.945916{col 26}{space 2} 9.820563{col 37}{space 1}   -0.91{col 46}{space 3}0.362{col 54}{space 4}-28.19733{col 67}{space 3} 10.30549
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-9.662644{col 26}{space 2} 9.828366{col 37}{space 1}   -0.98{col 46}{space 3}0.326{col 54}{space 4}-28.92935{col 67}{space 3} 9.604061
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-8.762597{col 26}{space 2} 9.842609{col 37}{space 1}   -0.89{col 46}{space 3}0.373{col 54}{space 4}-28.05722{col 67}{space 3} 10.53203
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-6.339086{col 26}{space 2} 10.01869{col 37}{space 1}   -0.63{col 46}{space 3}0.527{col 54}{space 4}-25.97888{col 67}{space 3} 13.30071
{txt}{space 9}MT  {c |}{col 14}{res}{space 2}-11.12067{col 26}{space 2} 9.893866{col 37}{space 1}   -1.12{col 46}{space 3}0.261{col 54}{space 4}-30.51577{col 67}{space 3} 8.274439
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-8.102817{col 26}{space 2}  9.83303{col 37}{space 1}   -0.82{col 46}{space 3}0.410{col 54}{space 4}-27.37867{col 67}{space 3} 11.17303
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-8.538537{col 26}{space 2} 10.04036{col 37}{space 1}   -0.85{col 46}{space 3}0.395{col 54}{space 4}-28.22081{col 67}{space 3} 11.14374
{txt}{space 9}NE  {c |}{col 14}{res}{space 2}-11.03412{col 26}{space 2} 9.841873{col 37}{space 1}   -1.12{col 46}{space 3}0.262{col 54}{space 4}-30.32731{col 67}{space 3} 8.259061
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-11.34931{col 26}{space 2} 9.882219{col 37}{space 1}   -1.15{col 46}{space 3}0.251{col 54}{space 4}-30.72158{col 67}{space 3} 8.022964
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-7.891234{col 26}{space 2} 9.829045{col 37}{space 1}   -0.80{col 46}{space 3}0.422{col 54}{space 4}-27.15927{col 67}{space 3}  11.3768
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-9.642005{col 26}{space 2} 9.970404{col 37}{space 1}   -0.97{col 46}{space 3}0.334{col 54}{space 4}-29.18715{col 67}{space 3} 9.903139
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}-6.720784{col 26}{space 2} 9.963809{col 37}{space 1}   -0.67{col 46}{space 3}0.500{col 54}{space 4}  -26.253{col 67}{space 3} 12.81143
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-8.521212{col 26}{space 2} 9.814041{col 37}{space 1}   -0.87{col 46}{space 3}0.385{col 54}{space 4}-27.75984{col 67}{space 3} 10.71741
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-9.311328{col 26}{space 2} 9.822619{col 37}{space 1}   -0.95{col 46}{space 3}0.343{col 54}{space 4}-28.56677{col 67}{space 3} 9.944112
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-5.170427{col 26}{space 2} 10.01645{col 37}{space 1}   -0.52{col 46}{space 3}0.606{col 54}{space 4}-24.80583{col 67}{space 3} 14.46498
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-10.70051{col 26}{space 2} 9.834161{col 37}{space 1}   -1.09{col 46}{space 3}0.277{col 54}{space 4}-29.97857{col 67}{space 3} 8.577559
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-9.499212{col 26}{space 2} 9.814116{col 37}{space 1}   -0.97{col 46}{space 3}0.333{col 54}{space 4}-28.73798{col 67}{space 3} 9.739559
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-5.925778{col 26}{space 2} 10.46951{col 37}{space 1}   -0.57{col 46}{space 3}0.571{col 54}{space 4}-26.44932{col 67}{space 3} 14.59777
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-6.621785{col 26}{space 2} 9.908899{col 37}{space 1}   -0.67{col 46}{space 3}0.504{col 54}{space 4}-26.04636{col 67}{space 3} 12.80279
{txt}{space 9}SD  {c |}{col 14}{res}{space 2}-9.744625{col 26}{space 2} 9.922096{col 37}{space 1}   -0.98{col 46}{space 3}0.326{col 54}{space 4}-29.19507{col 67}{space 3} 9.705821
{txt}{space 9}TN  {c |}{col 14}{res}{space 2} -6.85767{col 26}{space 2}  9.86566{col 37}{space 1}   -0.70{col 46}{space 3}0.487{col 54}{space 4}-26.19748{col 67}{space 3} 12.48214
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-6.543691{col 26}{space 2} 9.823192{col 37}{space 1}   -0.67{col 46}{space 3}0.505{col 54}{space 4}-25.80025{col 67}{space 3} 12.71287
{txt}{space 9}UT  {c |}{col 14}{res}{space 2} -9.77409{col 26}{space 2} 9.854717{col 37}{space 1}   -0.99{col 46}{space 3}0.321{col 54}{space 4}-29.09245{col 67}{space 3} 9.544272
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}-8.496405{col 26}{space 2} 9.838186{col 37}{space 1}   -0.86{col 46}{space 3}0.388{col 54}{space 4}-27.78236{col 67}{space 3} 10.78955
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}-12.89732{col 26}{space 2} 9.829277{col 37}{space 1}   -1.31{col 46}{space 3}0.190{col 54}{space 4}-32.16581{col 67}{space 3} 6.371174
{txt}{space 9}WA  {c |}{col 14}{res}{space 2}-9.119802{col 26}{space 2} 9.838495{col 37}{space 1}   -0.93{col 46}{space 3}0.354{col 54}{space 4}-28.40636{col 67}{space 3} 10.16676
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-8.859677{col 26}{space 2} 9.839373{col 37}{space 1}   -0.90{col 46}{space 3}0.368{col 54}{space 4}-28.14796{col 67}{space 3}  10.4286
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-10.01521{col 26}{space 2} 9.941099{col 37}{space 1}   -1.01{col 46}{space 3}0.314{col 54}{space 4}-29.50291{col 67}{space 3} 9.472489
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-10.24189{col 26}{space 2} 10.06249{col 37}{space 1}   -1.02{col 46}{space 3}0.309{col 54}{space 4}-29.96755{col 67}{space 3} 9.483779
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}  17.0843{col 26}{space 2} 9.880633{col 37}{space 1}    1.73{col 46}{space 3}0.084{col 54}{space 4}-2.284862{col 67}{space 3} 36.45347
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est1{txt} stored)

Linear regression                                      Number of obs ={res}    6798
                                                       {txt}F( 71,  6726) ={res}    3.27
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0299
                                                       {txt}Root MSE      = {res} 12.047

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     Q24_var{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2} .3592309{col 26}{space 2}  .892704{col 37}{space 1}    0.40{col 46}{space 3}0.687{col 54}{space 4}-1.390752{col 67}{space 3} 2.109214
{txt}{space 8}Old  {c |}{col 14}{res}{space 2} .7270772{col 26}{space 2} 1.256826{col 37}{space 1}    0.58{col 46}{space 3}0.563{col 54}{space 4}  -1.7367{col 67}{space 3} 3.190855
{txt}{space 12} {c |}
{space 7}edu_g {c |}
{space 10}1  {c |}{col 14}{res}{space 2}-1.223393{col 26}{space 2} .6248622{col 37}{space 1}   -1.96{col 46}{space 3}0.050{col 54}{space 4}-2.448321{col 67}{space 3} .0015345
{txt}{space 10}2  {c |}{col 14}{res}{space 2}-1.288137{col 26}{space 2}  .606666{col 37}{space 1}   -2.12{col 46}{space 3}0.034{col 54}{space 4}-2.477394{col 67}{space 3}-.0988792
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2} -2.64698{col 26}{space 2} .4891713{col 37}{space 1}   -5.41{col 46}{space 3}0.000{col 54}{space 4}-3.605911{col 67}{space 3} -1.68805
{txt}High Income  {c |}{col 14}{res}{space 2}-2.601688{col 26}{space 2} .4891428{col 37}{space 1}   -5.32{col 46}{space 3}0.000{col 54}{space 4}-3.560563{col 67}{space 3}-1.642813
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2}-.4639449{col 26}{space 2} .8990045{col 37}{space 1}   -0.52{col 46}{space 3}0.606{col 54}{space 4}-2.226279{col 67}{space 3} 1.298389
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} 1.290158{col 26}{space 2} 1.289169{col 37}{space 1}    1.00{col 46}{space 3}0.317{col 54}{space 4}-1.237022{col 67}{space 3} 3.817338
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2}-.2121842{col 26}{space 2} .4568393{col 37}{space 1}   -0.46{col 46}{space 3}0.642{col 54}{space 4}-1.107734{col 67}{space 3} .6833655
{txt}{space 7}2015  {c |}{col 14}{res}{space 2}-.1012201{col 26}{space 2} .4621714{col 37}{space 1}   -0.22{col 46}{space 3}0.827{col 54}{space 4}-1.007222{col 67}{space 3} .8047823
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}  -.04862{col 26}{space 2} .4708703{col 37}{space 1}   -0.10{col 46}{space 3}0.918{col 54}{space 4} -.971675{col 67}{space 3}  .874435
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}   .64652{col 26}{space 2} .4974012{col 37}{space 1}    1.30{col 46}{space 3}0.194{col 54}{space 4}-.3285439{col 67}{space 3} 1.621584
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0324454{col 26}{space 2} .6304819{col 37}{space 1}    0.05{col 46}{space 3}0.959{col 54}{space 4}-1.203499{col 67}{space 3}  1.26839
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2}-7.852946{col 26}{space 2} 10.09467{col 37}{space 1}   -0.78{col 46}{space 3}0.437{col 54}{space 4} -27.6417{col 67}{space 3} 11.93581
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-8.695222{col 26}{space 2} 10.15671{col 37}{space 1}   -0.86{col 46}{space 3}0.392{col 54}{space 4} -28.6056{col 67}{space 3} 11.21516
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-8.362068{col 26}{space 2} 10.04099{col 37}{space 1}   -0.83{col 46}{space 3}0.405{col 54}{space 4}-28.04559{col 67}{space 3} 11.32145
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-6.796236{col 26}{space 2} 10.01966{col 37}{space 1}   -0.68{col 46}{space 3}0.498{col 54}{space 4}-26.43795{col 67}{space 3} 12.84548
{txt}{space 9}CO  {c |}{col 14}{res}{space 2}-8.031783{col 26}{space 2} 10.04564{col 37}{space 1}   -0.80{col 46}{space 3}0.424{col 54}{space 4}-27.72443{col 67}{space 3} 11.66086
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-9.664956{col 26}{space 2} 10.03984{col 37}{space 1}   -0.96{col 46}{space 3}0.336{col 54}{space 4}-29.34621{col 67}{space 3}  10.0163
{txt}{space 9}DC  {c |}{col 14}{res}{space 2} -8.57148{col 26}{space 2}  10.0979{col 37}{space 1}   -0.85{col 46}{space 3}0.396{col 54}{space 4}-28.36657{col 67}{space 3} 11.22361
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-9.395929{col 26}{space 2} 10.39357{col 37}{space 1}   -0.90{col 46}{space 3}0.366{col 54}{space 4}-29.77062{col 67}{space 3} 10.97877
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-7.614598{col 26}{space 2} 10.02031{col 37}{space 1}   -0.76{col 46}{space 3}0.447{col 54}{space 4}-27.25758{col 67}{space 3} 12.02838
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-8.771736{col 26}{space 2} 10.03237{col 37}{space 1}   -0.87{col 46}{space 3}0.382{col 54}{space 4}-28.43835{col 67}{space 3} 10.89488
{txt}{space 9}HI  {c |}{col 14}{res}{space 2}-7.904582{col 26}{space 2}  10.3825{col 37}{space 1}   -0.76{col 46}{space 3}0.446{col 54}{space 4}-28.25756{col 67}{space 3}  12.4484
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-12.21135{col 26}{space 2} 10.01283{col 37}{space 1}   -1.22{col 46}{space 3}0.223{col 54}{space 4}-31.83967{col 67}{space 3} 7.416965
{txt}{space 9}ID  {c |}{col 14}{res}{space 2}-9.604543{col 26}{space 2} 10.11505{col 37}{space 1}   -0.95{col 46}{space 3}0.342{col 54}{space 4}-29.43325{col 67}{space 3} 10.22416
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-9.450607{col 26}{space 2} 10.01681{col 37}{space 1}   -0.94{col 46}{space 3}0.345{col 54}{space 4}-29.08672{col 67}{space 3} 10.18551
{txt}{space 9}IN  {c |}{col 14}{res}{space 2}-7.906304{col 26}{space 2} 10.05074{col 37}{space 1}   -0.79{col 46}{space 3}0.432{col 54}{space 4}-27.60895{col 67}{space 3} 11.79634
{txt}{space 9}KS  {c |}{col 14}{res}{space 2} -8.85611{col 26}{space 2} 10.10954{col 37}{space 1}   -0.88{col 46}{space 3}0.381{col 54}{space 4}-28.67402{col 67}{space 3}  10.9618
{txt}{space 9}KY  {c |}{col 14}{res}{space 2} -9.23388{col 26}{space 2} 10.08897{col 37}{space 1}   -0.92{col 46}{space 3}0.360{col 54}{space 4}-29.01146{col 67}{space 3}  10.5437
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-7.781039{col 26}{space 2} 10.11346{col 37}{space 1}   -0.77{col 46}{space 3}0.442{col 54}{space 4}-27.60662{col 67}{space 3} 12.04454
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-7.413947{col 26}{space 2} 10.04813{col 37}{space 1}   -0.74{col 46}{space 3}0.461{col 54}{space 4}-27.11146{col 67}{space 3} 12.28356
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-7.608758{col 26}{space 2} 10.05588{col 37}{space 1}   -0.76{col 46}{space 3}0.449{col 54}{space 4}-27.32148{col 67}{space 3} 12.10396
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-10.27634{col 26}{space 2} 10.06231{col 37}{space 1}   -1.02{col 46}{space 3}0.307{col 54}{space 4}-30.00166{col 67}{space 3} 9.448985
{txt}{space 9}MI  {c |}{col 14}{res}{space 2} -8.82681{col 26}{space 2} 10.01224{col 37}{space 1}   -0.88{col 46}{space 3}0.378{col 54}{space 4}-28.45398{col 67}{space 3} 10.80036
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-9.347333{col 26}{space 2} 10.02334{col 37}{space 1}   -0.93{col 46}{space 3}0.351{col 54}{space 4}-28.99625{col 67}{space 3} 10.30159
{txt}{space 9}MO  {c |}{col 14}{res}{space 2} -8.38479{col 26}{space 2} 10.03681{col 37}{space 1}   -0.84{col 46}{space 3}0.404{col 54}{space 4}-28.06011{col 67}{space 3} 11.29053
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-6.734073{col 26}{space 2} 10.20249{col 37}{space 1}   -0.66{col 46}{space 3}0.509{col 54}{space 4}-26.73419{col 67}{space 3} 13.26604
{txt}{space 9}MT  {c |}{col 14}{res}{space 2}  -10.615{col 26}{space 2} 10.08461{col 37}{space 1}   -1.05{col 46}{space 3}0.293{col 54}{space 4}-30.38403{col 67}{space 3} 9.154031
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-8.228393{col 26}{space 2} 10.02685{col 37}{space 1}   -0.82{col 46}{space 3}0.412{col 54}{space 4} -27.8842{col 67}{space 3} 11.42741
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-8.018633{col 26}{space 2} 10.23306{col 37}{space 1}   -0.78{col 46}{space 3}0.433{col 54}{space 4}-28.07867{col 67}{space 3}  12.0414
{txt}{space 9}NE  {c |}{col 14}{res}{space 2} -10.7986{col 26}{space 2} 10.03233{col 37}{space 1}   -1.08{col 46}{space 3}0.282{col 54}{space 4}-30.46514{col 67}{space 3} 8.867951
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-10.86377{col 26}{space 2} 10.07634{col 37}{space 1}   -1.08{col 46}{space 3}0.281{col 54}{space 4}-30.61658{col 67}{space 3} 8.889043
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-7.892562{col 26}{space 2} 10.02659{col 37}{space 1}   -0.79{col 46}{space 3}0.431{col 54}{space 4}-27.54785{col 67}{space 3} 11.76273
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-9.526978{col 26}{space 2} 10.16131{col 37}{space 1}   -0.94{col 46}{space 3}0.348{col 54}{space 4}-29.44636{col 67}{space 3} 10.39241
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}-6.495131{col 26}{space 2} 10.15701{col 37}{space 1}   -0.64{col 46}{space 3}0.523{col 54}{space 4}-26.40609{col 67}{space 3} 13.41583
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-8.421329{col 26}{space 2} 10.01334{col 37}{space 1}   -0.84{col 46}{space 3}0.400{col 54}{space 4}-28.05065{col 67}{space 3} 11.20799
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-9.200212{col 26}{space 2} 10.01483{col 37}{space 1}   -0.92{col 46}{space 3}0.358{col 54}{space 4}-28.83245{col 67}{space 3} 10.43202
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-4.839546{col 26}{space 2}  10.2043{col 37}{space 1}   -0.47{col 46}{space 3}0.635{col 54}{space 4} -24.8432{col 67}{space 3} 15.16411
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-10.32496{col 26}{space 2} 10.02873{col 37}{space 1}   -1.03{col 46}{space 3}0.303{col 54}{space 4}-29.98444{col 67}{space 3} 9.334522
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-9.274486{col 26}{space 2} 10.00858{col 37}{space 1}   -0.93{col 46}{space 3}0.354{col 54}{space 4}-28.89447{col 67}{space 3}  10.3455
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-5.972917{col 26}{space 2} 10.65428{col 37}{space 1}   -0.56{col 46}{space 3}0.575{col 54}{space 4}-26.85869{col 67}{space 3} 14.91285
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-6.674167{col 26}{space 2} 10.10778{col 37}{space 1}   -0.66{col 46}{space 3}0.509{col 54}{space 4}-26.48862{col 67}{space 3} 13.14028
{txt}{space 9}SD  {c |}{col 14}{res}{space 2}-9.630455{col 26}{space 2} 10.10928{col 37}{space 1}   -0.95{col 46}{space 3}0.341{col 54}{space 4}-29.44785{col 67}{space 3} 10.18694
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-6.754593{col 26}{space 2} 10.05724{col 37}{space 1}   -0.67{col 46}{space 3}0.502{col 54}{space 4}-26.46997{col 67}{space 3} 12.96078
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-6.524449{col 26}{space 2} 10.02091{col 37}{space 1}   -0.65{col 46}{space 3}0.515{col 54}{space 4} -26.1686{col 67}{space 3}  13.1197
{txt}{space 9}UT  {c |}{col 14}{res}{space 2}-9.623167{col 26}{space 2} 10.04822{col 37}{space 1}   -0.96{col 46}{space 3}0.338{col 54}{space 4}-29.32085{col 67}{space 3} 10.07452
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}  -8.5213{col 26}{space 2} 10.03824{col 37}{space 1}   -0.85{col 46}{space 3}0.396{col 54}{space 4}-28.19943{col 67}{space 3} 11.15683
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}-12.56621{col 26}{space 2} 10.01747{col 37}{space 1}   -1.25{col 46}{space 3}0.210{col 54}{space 4}-32.20362{col 67}{space 3} 7.071209
{txt}{space 9}WA  {c |}{col 14}{res}{space 2}-8.806921{col 26}{space 2} 10.03792{col 37}{space 1}   -0.88{col 46}{space 3}0.380{col 54}{space 4}-28.48442{col 67}{space 3} 10.87057
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-8.539886{col 26}{space 2} 10.02989{col 37}{space 1}   -0.85{col 46}{space 3}0.395{col 54}{space 4}-28.20165{col 67}{space 3} 11.12187
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-9.916149{col 26}{space 2} 10.11988{col 37}{space 1}   -0.98{col 46}{space 3}0.327{col 54}{space 4}-29.75432{col 67}{space 3} 9.922018
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-9.892878{col 26}{space 2} 10.25753{col 37}{space 1}   -0.96{col 46}{space 3}0.335{col 54}{space 4}-30.00089{col 67}{space 3} 10.21514
{txt}{space 12} {c |}
{space 7}2.Q33 {c |}{col 14}{res}{space 2} 1.420842{col 26}{space 2} .3042936{col 37}{space 1}    4.67{col 46}{space 3}0.000{col 54}{space 4} .8243305{col 67}{space 3} 2.017354
{txt}{space 7}2.Q34 {c |}{col 14}{res}{space 2}-.9510031{col 26}{space 2} .6544824{col 37}{space 1}   -1.45{col 46}{space 3}0.146{col 54}{space 4}-2.233996{col 67}{space 3} .3319898
{txt}{space 7}Q35_1 {c |}{col 14}{res}{space 2} -1.37273{col 26}{space 2} .9918923{col 37}{space 1}   -1.38{col 46}{space 3}0.166{col 54}{space 4}-3.317153{col 67}{space 3} .5716935
{txt}{space 7}Q35_2 {c |}{col 14}{res}{space 2} 1.044601{col 26}{space 2}  1.06694{col 37}{space 1}    0.98{col 46}{space 3}0.328{col 54}{space 4}-1.046938{col 67}{space 3} 3.136141
{txt}{space 7}Q35_3 {c |}{col 14}{res}{space 2}-.6221737{col 26}{space 2} 1.095289{col 37}{space 1}   -0.57{col 46}{space 3}0.570{col 54}{space 4}-2.769287{col 67}{space 3}  1.52494
{txt}{space 7}Q35_4 {c |}{col 14}{res}{space 2}-1.004402{col 26}{space 2} 1.090281{col 37}{space 1}   -0.92{col 46}{space 3}0.357{col 54}{space 4}-3.141698{col 67}{space 3} 1.132894
{txt}{space 7}Q35_5 {c |}{col 14}{res}{space 2} 2.467031{col 26}{space 2} 3.368456{col 37}{space 1}    0.73{col 46}{space 3}0.464{col 54}{space 4}-4.136209{col 67}{space 3} 9.070272
{txt}{space 7}Q35_6 {c |}{col 14}{res}{space 2} .0150307{col 26}{space 2}  1.07484{col 37}{space 1}    0.01{col 46}{space 3}0.989{col 54}{space 4}-2.091996{col 67}{space 3} 2.122057
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 18.55086{col 26}{space 2} 10.18381{col 37}{space 1}    1.82{col 46}{space 3}0.069{col 54}{space 4}-1.412637{col 67}{space 3} 38.51436
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est2{txt} stored)

Linear regression                                      Number of obs ={res}    5665
                                                       {txt}F( 75,  5589) ={res}    3.21
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0375
                                                       {txt}Root MSE      = {res} 10.375

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     Q24_var{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2}-.1054056{col 26}{space 2} .8594882{col 37}{space 1}   -0.12{col 46}{space 3}0.902{col 54}{space 4}-1.790336{col 67}{space 3} 1.579525
{txt}{space 8}Old  {c |}{col 14}{res}{space 2} .1895205{col 26}{space 2} 1.226745{col 37}{space 1}    0.15{col 46}{space 3}0.877{col 54}{space 4}-2.215377{col 67}{space 3} 2.594418
{txt}{space 12} {c |}
{space 7}edu_g {c |}
{space 10}1  {c |}{col 14}{res}{space 2}-1.364748{col 26}{space 2} .6319194{col 37}{space 1}   -2.16{col 46}{space 3}0.031{col 54}{space 4}-2.603555{col 67}{space 3}-.1259401
{txt}{space 10}2  {c |}{col 14}{res}{space 2}-1.931618{col 26}{space 2} .6015325{col 37}{space 1}   -3.21{col 46}{space 3}0.001{col 54}{space 4}-3.110855{col 67}{space 3}-.7523808
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2}-1.950286{col 26}{space 2} .4737717{col 37}{space 1}   -4.12{col 46}{space 3}0.000{col 54}{space 4}-2.879063{col 67}{space 3} -1.02151
{txt}High Income  {c |}{col 14}{res}{space 2}-1.938553{col 26}{space 2} .4657796{col 37}{space 1}   -4.16{col 46}{space 3}0.000{col 54}{space 4}-2.851662{col 67}{space 3}-1.025444
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2} .4906024{col 26}{space 2} .8867402{col 37}{space 1}    0.55{col 46}{space 3}0.580{col 54}{space 4}-1.247753{col 67}{space 3} 2.228958
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} 2.134853{col 26}{space 2} 1.258631{col 37}{space 1}    1.70{col 46}{space 3}0.090{col 54}{space 4}-.3325533{col 67}{space 3}  4.60226
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2}-.6392191{col 26}{space 2} .4355635{col 37}{space 1}   -1.47{col 46}{space 3}0.142{col 54}{space 4}-1.493093{col 67}{space 3} .2146546
{txt}{space 7}2015  {c |}{col 14}{res}{space 2}-.5107385{col 26}{space 2} .4481572{col 37}{space 1}   -1.14{col 46}{space 3}0.254{col 54}{space 4}-1.389301{col 67}{space 3} .3678238
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.6439751{col 26}{space 2} .4488051{col 37}{space 1}   -1.43{col 46}{space 3}0.151{col 54}{space 4}-1.523807{col 67}{space 3} .2358573
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .2797221{col 26}{space 2} .4825875{col 37}{space 1}    0.58{col 46}{space 3}0.562{col 54}{space 4}-.6663368{col 67}{space 3} 1.225781
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.7124337{col 26}{space 2} .5882322{col 37}{space 1}   -1.21{col 46}{space 3}0.226{col 54}{space 4}-1.865597{col 67}{space 3}   .44073
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2}-11.02429{col 26}{space 2} 12.12978{col 37}{space 1}   -0.91{col 46}{space 3}0.363{col 54}{space 4}-34.80336{col 67}{space 3} 12.75479
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-13.03983{col 26}{space 2} 12.18058{col 37}{space 1}   -1.07{col 46}{space 3}0.284{col 54}{space 4} -36.9185{col 67}{space 3} 10.83883
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-12.85217{col 26}{space 2}  12.0628{col 37}{space 1}   -1.07{col 46}{space 3}0.287{col 54}{space 4}-36.49995{col 67}{space 3} 10.79561
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-12.00949{col 26}{space 2} 12.05882{col 37}{space 1}   -1.00{col 46}{space 3}0.319{col 54}{space 4}-35.64945{col 67}{space 3} 11.63048
{txt}{space 9}CO  {c |}{col 14}{res}{space 2}-13.16273{col 26}{space 2} 12.06343{col 37}{space 1}   -1.09{col 46}{space 3}0.275{col 54}{space 4}-36.81174{col 67}{space 3} 10.48627
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-13.55773{col 26}{space 2} 12.06808{col 37}{space 1}   -1.12{col 46}{space 3}0.261{col 54}{space 4}-37.21585{col 67}{space 3} 10.10039
{txt}{space 9}DC  {c |}{col 14}{res}{space 2}-12.68855{col 26}{space 2} 12.09762{col 37}{space 1}   -1.05{col 46}{space 3}0.294{col 54}{space 4}-36.40458{col 67}{space 3} 11.02748
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-12.95132{col 26}{space 2} 12.44737{col 37}{space 1}   -1.04{col 46}{space 3}0.298{col 54}{space 4}-37.35301{col 67}{space 3} 11.45036
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-12.12167{col 26}{space 2} 12.05768{col 37}{space 1}   -1.01{col 46}{space 3}0.315{col 54}{space 4}-35.75941{col 67}{space 3} 11.51606
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-12.61102{col 26}{space 2} 12.06164{col 37}{space 1}   -1.05{col 46}{space 3}0.296{col 54}{space 4}-36.25653{col 67}{space 3} 11.03449
{txt}{space 9}HI  {c |}{col 14}{res}{space 2}-14.16339{col 26}{space 2} 12.23855{col 37}{space 1}   -1.16{col 46}{space 3}0.247{col 54}{space 4}-38.15571{col 67}{space 3} 9.828932
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-15.22199{col 26}{space 2} 12.05094{col 37}{space 1}   -1.26{col 46}{space 3}0.207{col 54}{space 4}-38.84652{col 67}{space 3} 8.402548
{txt}{space 9}ID  {c |}{col 14}{res}{space 2}-14.05511{col 26}{space 2} 12.14719{col 37}{space 1}   -1.16{col 46}{space 3}0.247{col 54}{space 4}-37.86832{col 67}{space 3} 9.758095
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-13.81383{col 26}{space 2} 12.04829{col 37}{space 1}   -1.15{col 46}{space 3}0.252{col 54}{space 4}-37.43316{col 67}{space 3} 9.805497
{txt}{space 9}IN  {c |}{col 14}{res}{space 2}-12.55392{col 26}{space 2} 12.07991{col 37}{space 1}   -1.04{col 46}{space 3}0.299{col 54}{space 4}-36.23523{col 67}{space 3} 11.12739
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-13.24168{col 26}{space 2} 12.11128{col 37}{space 1}   -1.09{col 46}{space 3}0.274{col 54}{space 4}-36.98449{col 67}{space 3} 10.50114
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-12.88287{col 26}{space 2} 12.11323{col 37}{space 1}   -1.06{col 46}{space 3}0.288{col 54}{space 4} -36.6295{col 67}{space 3} 10.86377
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-12.03419{col 26}{space 2} 12.14424{col 37}{space 1}   -0.99{col 46}{space 3}0.322{col 54}{space 4}-35.84162{col 67}{space 3} 11.77323
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-10.70091{col 26}{space 2} 12.08991{col 37}{space 1}   -0.89{col 46}{space 3}0.376{col 54}{space 4}-34.40182{col 67}{space 3} 13.00001
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-12.25343{col 26}{space 2} 12.07856{col 37}{space 1}   -1.01{col 46}{space 3}0.310{col 54}{space 4} -35.9321{col 67}{space 3} 11.42524
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-13.64556{col 26}{space 2} 12.10072{col 37}{space 1}   -1.13{col 46}{space 3}0.260{col 54}{space 4}-37.36767{col 67}{space 3} 10.07656
{txt}{space 9}MI  {c |}{col 14}{res}{space 2} -12.9403{col 26}{space 2} 12.05077{col 37}{space 1}   -1.07{col 46}{space 3}0.283{col 54}{space 4}-36.56448{col 67}{space 3} 10.68389
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-13.62219{col 26}{space 2} 12.05679{col 37}{space 1}   -1.13{col 46}{space 3}0.259{col 54}{space 4}-37.25818{col 67}{space 3} 10.01379
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-13.11393{col 26}{space 2} 12.06481{col 37}{space 1}   -1.09{col 46}{space 3}0.277{col 54}{space 4}-36.76565{col 67}{space 3} 10.53779
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-12.86376{col 26}{space 2} 12.13212{col 37}{space 1}   -1.06{col 46}{space 3}0.289{col 54}{space 4}-36.64743{col 67}{space 3} 10.91991
{txt}{space 9}MT  {c |}{col 14}{res}{space 2}-13.99752{col 26}{space 2} 12.12919{col 37}{space 1}   -1.15{col 46}{space 3}0.249{col 54}{space 4}-37.77545{col 67}{space 3} 9.780409
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-13.16449{col 26}{space 2} 12.05262{col 37}{space 1}   -1.09{col 46}{space 3}0.275{col 54}{space 4}-36.79231{col 67}{space 3} 10.46334
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-11.61312{col 26}{space 2} 12.26587{col 37}{space 1}   -0.95{col 46}{space 3}0.344{col 54}{space 4}  -35.659{col 67}{space 3} 12.43275
{txt}{space 9}NE  {c |}{col 14}{res}{space 2}-14.40636{col 26}{space 2} 12.05604{col 37}{space 1}   -1.19{col 46}{space 3}0.232{col 54}{space 4}-38.04088{col 67}{space 3}  9.22816
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-15.90463{col 26}{space 2}  12.0474{col 37}{space 1}   -1.32{col 46}{space 3}0.187{col 54}{space 4}-39.52221{col 67}{space 3} 7.712944
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-12.25812{col 26}{space 2} 12.06543{col 37}{space 1}   -1.02{col 46}{space 3}0.310{col 54}{space 4}-35.91104{col 67}{space 3}  11.3948
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-14.01991{col 26}{space 2} 12.14549{col 37}{space 1}   -1.15{col 46}{space 3}0.248{col 54}{space 4}-37.82978{col 67}{space 3} 9.789959
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}-10.62785{col 26}{space 2} 12.16913{col 37}{space 1}   -0.87{col 46}{space 3}0.383{col 54}{space 4}-34.48408{col 67}{space 3} 13.22838
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-13.16649{col 26}{space 2} 12.04819{col 37}{space 1}   -1.09{col 46}{space 3}0.275{col 54}{space 4}-36.78563{col 67}{space 3} 10.45265
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-12.83635{col 26}{space 2} 12.05212{col 37}{space 1}   -1.07{col 46}{space 3}0.287{col 54}{space 4}-36.46319{col 67}{space 3} 10.79049
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-10.46267{col 26}{space 2} 12.19881{col 37}{space 1}   -0.86{col 46}{space 3}0.391{col 54}{space 4}-34.37708{col 67}{space 3} 13.45175
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-14.44735{col 26}{space 2} 12.05369{col 37}{space 1}   -1.20{col 46}{space 3}0.231{col 54}{space 4}-38.07726{col 67}{space 3} 9.182558
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-13.33753{col 26}{space 2} 12.04466{col 37}{space 1}   -1.11{col 46}{space 3}0.268{col 54}{space 4}-36.94975{col 67}{space 3} 10.27468
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-8.704132{col 26}{space 2} 12.62517{col 37}{space 1}   -0.69{col 46}{space 3}0.491{col 54}{space 4}-33.45437{col 67}{space 3}  16.0461
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-11.17165{col 26}{space 2} 12.14099{col 37}{space 1}   -0.92{col 46}{space 3}0.358{col 54}{space 4} -34.9727{col 67}{space 3}  12.6294
{txt}{space 9}SD  {c |}{col 14}{res}{space 2}-14.43704{col 26}{space 2}  12.0948{col 37}{space 1}   -1.19{col 46}{space 3}0.233{col 54}{space 4}-38.14755{col 67}{space 3} 9.273467
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-10.31785{col 26}{space 2} 12.09564{col 37}{space 1}   -0.85{col 46}{space 3}0.394{col 54}{space 4}-34.02999{col 67}{space 3}  13.3943
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-11.48645{col 26}{space 2} 12.05236{col 37}{space 1}   -0.95{col 46}{space 3}0.341{col 54}{space 4}-35.11375{col 67}{space 3} 12.14085
{txt}{space 9}UT  {c |}{col 14}{res}{space 2} -12.6544{col 26}{space 2} 12.08787{col 37}{space 1}   -1.05{col 46}{space 3}0.295{col 54}{space 4}-36.35132{col 67}{space 3} 11.04253
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}-12.85884{col 26}{space 2} 12.06515{col 37}{space 1}   -1.07{col 46}{space 3}0.287{col 54}{space 4}-36.51123{col 67}{space 3} 10.79354
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}-15.49729{col 26}{space 2}  12.0521{col 37}{space 1}   -1.29{col 46}{space 3}0.199{col 54}{space 4}-39.12408{col 67}{space 3} 8.129501
{txt}{space 9}WA  {c |}{col 14}{res}{space 2} -13.5601{col 26}{space 2} 12.06295{col 37}{space 1}   -1.12{col 46}{space 3}0.261{col 54}{space 4}-37.20817{col 67}{space 3} 10.08798
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-12.51215{col 26}{space 2} 12.06337{col 37}{space 1}   -1.04{col 46}{space 3}0.300{col 54}{space 4}-36.16104{col 67}{space 3} 11.13674
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-12.85267{col 26}{space 2} 12.17792{col 37}{space 1}   -1.06{col 46}{space 3}0.291{col 54}{space 4}-36.72612{col 67}{space 3} 11.02078
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-13.66012{col 26}{space 2} 12.31577{col 37}{space 1}   -1.11{col 46}{space 3}0.267{col 54}{space 4}-37.80381{col 67}{space 3} 10.48357
{txt}{space 12} {c |}
{space 7}2.Q33 {c |}{col 14}{res}{space 2} 1.073591{col 26}{space 2} .2861611{col 37}{space 1}    3.75{col 46}{space 3}0.000{col 54}{space 4} .5126036{col 67}{space 3} 1.634577
{txt}{space 7}2.Q34 {c |}{col 14}{res}{space 2}-1.305474{col 26}{space 2} .6007165{col 37}{space 1}   -2.17{col 46}{space 3}0.030{col 54}{space 4}-2.483111{col 67}{space 3}-.1278358
{txt}{space 7}Q35_1 {c |}{col 14}{res}{space 2}-1.692421{col 26}{space 2} .8887177{col 37}{space 1}   -1.90{col 46}{space 3}0.057{col 54}{space 4}-3.434653{col 67}{space 3} .0498111
{txt}{space 7}Q35_2 {c |}{col 14}{res}{space 2} .8076704{col 26}{space 2} .9726622{col 37}{space 1}    0.83{col 46}{space 3}0.406{col 54}{space 4}-1.099125{col 67}{space 3} 2.714466
{txt}{space 7}Q35_3 {c |}{col 14}{res}{space 2} .2493535{col 26}{space 2}  1.10445{col 37}{space 1}    0.23{col 46}{space 3}0.821{col 54}{space 4}-1.915797{col 67}{space 3} 2.414504
{txt}{space 7}Q35_4 {c |}{col 14}{res}{space 2}-.7313094{col 26}{space 2} .9713145{col 37}{space 1}   -0.75{col 46}{space 3}0.452{col 54}{space 4}-2.635463{col 67}{space 3} 1.172844
{txt}{space 7}Q35_5 {c |}{col 14}{res}{space 2} 1.884613{col 26}{space 2}  2.99801{col 37}{space 1}    0.63{col 46}{space 3}0.530{col 54}{space 4}-3.992652{col 67}{space 3} 7.761877
{txt}{space 7}Q35_6 {c |}{col 14}{res}{space 2}-1.540859{col 26}{space 2} .9579022{col 37}{space 1}   -1.61{col 46}{space 3}0.108{col 54}{space 4} -3.41872{col 67}{space 3}  .337001
{txt}{space 7}Q4new {c |}{col 14}{res}{space 2} .0000807{col 26}{space 2} .0066093{col 37}{space 1}    0.01{col 46}{space 3}0.990{col 54}{space 4} -.012876{col 67}{space 3} .0130375
{txt}{space 7}Q6new {c |}{col 14}{res}{space 2}  .007698{col 26}{space 2} .0067034{col 37}{space 1}    1.15{col 46}{space 3}0.251{col 54}{space 4}-.0054433{col 67}{space 3} .0208393
{txt}{space 5}Q9_mean {c |}{col 14}{res}{space 2}-.0548656{col 26}{space 2} .0393045{col 37}{space 1}   -1.40{col 46}{space 3}0.163{col 54}{space 4}-.1319177{col 67}{space 3} .0221866
{txt}{space 6}Q13new {c |}{col 14}{res}{space 2} .0046324{col 26}{space 2} .0072328{col 37}{space 1}    0.64{col 46}{space 3}0.522{col 54}{space 4}-.0095467{col 67}{space 3} .0188116
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 22.10539{col 26}{space 2} 12.17257{col 37}{space 1}    1.82{col 46}{space 3}0.069{col 54}{space 4}-1.757588{col 67}{space 3} 45.96836
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est3{txt} stored)

Linear regression                                      Number of obs ={res}    7676
                                                       {txt}F( 63,  7612) ={res}    4.74
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0533
                                                       {txt}Root MSE      = {res} 4.3217

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     Q24_iqr{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2} .0418547{col 26}{space 2}   .27419{col 37}{space 1}    0.15{col 46}{space 3}0.879{col 54}{space 4}-.4956333{col 67}{space 3} .5793426
{txt}{space 8}Old  {c |}{col 14}{res}{space 2} .6214972{col 26}{space 2}  .435384{col 37}{space 1}    1.43{col 46}{space 3}0.153{col 54}{space 4}-.2319755{col 67}{space 3}  1.47497
{txt}{space 12} {c |}
{space 7}edu_g {c |}
{space 10}1  {c |}{col 14}{res}{space 2}-.9751023{col 26}{space 2} .2452878{col 37}{space 1}   -3.98{col 46}{space 3}0.000{col 54}{space 4}-1.455934{col 67}{space 3}-.4942706
{txt}{space 10}2  {c |}{col 14}{res}{space 2}-1.506208{col 26}{space 2} .2331371{col 37}{space 1}   -6.46{col 46}{space 3}0.000{col 54}{space 4}-1.963221{col 67}{space 3}-1.049195
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2}-1.354581{col 26}{space 2}  .171404{col 37}{space 1}   -7.90{col 46}{space 3}0.000{col 54}{space 4}-1.690581{col 67}{space 3}-1.018582
{txt}High Income  {c |}{col 14}{res}{space 2}-1.452886{col 26}{space 2} .1603275{col 37}{space 1}   -9.06{col 46}{space 3}0.000{col 54}{space 4}-1.767172{col 67}{space 3}  -1.1386
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2} .5903669{col 26}{space 2} .3413786{col 37}{space 1}    1.73{col 46}{space 3}0.084{col 54}{space 4}-.0788292{col 67}{space 3} 1.259563
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} 1.159584{col 26}{space 2} .4409936{col 37}{space 1}    2.63{col 46}{space 3}0.009{col 54}{space 4} .2951151{col 67}{space 3} 2.024053
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2} .1555295{col 26}{space 2} .1585767{col 37}{space 1}    0.98{col 46}{space 3}0.327{col 54}{space 4}-.1553245{col 67}{space 3} .4663834
{txt}{space 7}2015  {c |}{col 14}{res}{space 2} .1005103{col 26}{space 2} .1553929{col 37}{space 1}    0.65{col 46}{space 3}0.518{col 54}{space 4}-.2041026{col 67}{space 3} .4051232
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1656062{col 26}{space 2} .1590983{col 37}{space 1}    1.04{col 46}{space 3}0.298{col 54}{space 4}-.1462703{col 67}{space 3} .4774826
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1899739{col 26}{space 2} .1537993{col 37}{space 1}    1.24{col 46}{space 3}0.217{col 54}{space 4}-.1115151{col 67}{space 3}  .491463
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .2433266{col 26}{space 2} .2295629{col 37}{space 1}    1.06{col 46}{space 3}0.289{col 54}{space 4}  -.20668{col 67}{space 3} .6933332
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2}-2.617619{col 26}{space 2} 2.331048{col 37}{space 1}   -1.12{col 46}{space 3}0.261{col 54}{space 4}-7.187115{col 67}{space 3} 1.951877
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-3.962548{col 26}{space 2} 2.313392{col 37}{space 1}   -1.71{col 46}{space 3}0.087{col 54}{space 4}-8.497434{col 67}{space 3} .5723378
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-2.639787{col 26}{space 2} 2.312142{col 37}{space 1}   -1.14{col 46}{space 3}0.254{col 54}{space 4}-7.172222{col 67}{space 3} 1.892649
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-2.538352{col 26}{space 2} 2.286526{col 37}{space 1}   -1.11{col 46}{space 3}0.267{col 54}{space 4}-7.020573{col 67}{space 3} 1.943869
{txt}{space 9}CO  {c |}{col 14}{res}{space 2}-2.877524{col 26}{space 2} 2.301372{col 37}{space 1}   -1.25{col 46}{space 3}0.211{col 54}{space 4}-7.388847{col 67}{space 3} 1.633799
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-3.471518{col 26}{space 2} 2.297769{col 37}{space 1}   -1.51{col 46}{space 3}0.131{col 54}{space 4} -7.97578{col 67}{space 3} 1.032744
{txt}{space 9}DC  {c |}{col 14}{res}{space 2}-2.446572{col 26}{space 2}  2.44139{col 37}{space 1}   -1.00{col 46}{space 3}0.316{col 54}{space 4} -7.23237{col 67}{space 3} 2.339225
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-2.949246{col 26}{space 2}  2.54253{col 37}{space 1}   -1.16{col 46}{space 3}0.246{col 54}{space 4}-7.933305{col 67}{space 3} 2.034814
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-2.474203{col 26}{space 2} 2.295791{col 37}{space 1}   -1.08{col 46}{space 3}0.281{col 54}{space 4}-6.974587{col 67}{space 3}  2.02618
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-2.685096{col 26}{space 2} 2.300571{col 37}{space 1}   -1.17{col 46}{space 3}0.243{col 54}{space 4}-7.194849{col 67}{space 3} 1.824656
{txt}{space 9}HI  {c |}{col 14}{res}{space 2}-2.810514{col 26}{space 2}  2.42974{col 37}{space 1}   -1.16{col 46}{space 3}0.247{col 54}{space 4}-7.573475{col 67}{space 3} 1.952447
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-3.870406{col 26}{space 2} 2.317046{col 37}{space 1}   -1.67{col 46}{space 3}0.095{col 54}{space 4}-8.412454{col 67}{space 3} .6716423
{txt}{space 9}ID  {c |}{col 14}{res}{space 2}-3.992915{col 26}{space 2} 2.312412{col 37}{space 1}   -1.73{col 46}{space 3}0.084{col 54}{space 4}-8.525879{col 67}{space 3} .5400493
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-3.133954{col 26}{space 2} 2.292204{col 37}{space 1}   -1.37{col 46}{space 3}0.172{col 54}{space 4}-7.627306{col 67}{space 3} 1.359398
{txt}{space 9}IN  {c |}{col 14}{res}{space 2}-3.060119{col 26}{space 2} 2.303788{col 37}{space 1}   -1.33{col 46}{space 3}0.184{col 54}{space 4}-7.576178{col 67}{space 3}  1.45594
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-3.231724{col 26}{space 2} 2.321098{col 37}{space 1}   -1.39{col 46}{space 3}0.164{col 54}{space 4}-7.781716{col 67}{space 3} 1.318268
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-3.606478{col 26}{space 2} 2.313662{col 37}{space 1}   -1.56{col 46}{space 3}0.119{col 54}{space 4}-8.141893{col 67}{space 3} .9289381
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}  -1.0014{col 26}{space 2} 2.420876{col 37}{space 1}   -0.41{col 46}{space 3}0.679{col 54}{space 4}-5.746983{col 67}{space 3} 3.744184
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-2.855993{col 26}{space 2} 2.304263{col 37}{space 1}   -1.24{col 46}{space 3}0.215{col 54}{space 4}-7.372984{col 67}{space 3} 1.660998
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-2.849781{col 26}{space 2} 2.302598{col 37}{space 1}   -1.24{col 46}{space 3}0.216{col 54}{space 4}-7.363508{col 67}{space 3} 1.663945
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-3.255023{col 26}{space 2} 2.352479{col 37}{space 1}   -1.38{col 46}{space 3}0.167{col 54}{space 4} -7.86653{col 67}{space 3} 1.356484
{txt}{space 9}MI  {c |}{col 14}{res}{space 2}-3.321335{col 26}{space 2} 2.292518{col 37}{space 1}   -1.45{col 46}{space 3}0.147{col 54}{space 4}-7.815302{col 67}{space 3} 1.172633
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-3.323918{col 26}{space 2} 2.300648{col 37}{space 1}   -1.44{col 46}{space 3}0.149{col 54}{space 4}-7.833823{col 67}{space 3} 1.185986
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-3.244089{col 26}{space 2}  2.30145{col 37}{space 1}   -1.41{col 46}{space 3}0.159{col 54}{space 4}-7.755566{col 67}{space 3} 1.267388
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-1.906992{col 26}{space 2} 2.435163{col 37}{space 1}   -0.78{col 46}{space 3}0.434{col 54}{space 4}-6.680582{col 67}{space 3} 2.866598
{txt}{space 9}MT  {c |}{col 14}{res}{space 2}-3.784392{col 26}{space 2} 2.380195{col 37}{space 1}   -1.59{col 46}{space 3}0.112{col 54}{space 4}-8.450231{col 67}{space 3} .8814467
{txt}{space 9}NC  {c |}{col 14}{res}{space 2} -2.47083{col 26}{space 2} 2.301539{col 37}{space 1}   -1.07{col 46}{space 3}0.283{col 54}{space 4}-6.982481{col 67}{space 3} 2.040821
{txt}{space 9}ND  {c |}{col 14}{res}{space 2} -2.79443{col 26}{space 2} 2.398667{col 37}{space 1}   -1.16{col 46}{space 3}0.244{col 54}{space 4}-7.496477{col 67}{space 3} 1.907618
{txt}{space 9}NE  {c |}{col 14}{res}{space 2}-3.647841{col 26}{space 2} 2.308223{col 37}{space 1}   -1.58{col 46}{space 3}0.114{col 54}{space 4}-8.172594{col 67}{space 3} .8769121
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-4.051765{col 26}{space 2} 2.325548{col 37}{space 1}   -1.74{col 46}{space 3}0.081{col 54}{space 4} -8.61048{col 67}{space 3} .5069488
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-2.463381{col 26}{space 2}   2.2992{col 37}{space 1}   -1.07{col 46}{space 3}0.284{col 54}{space 4}-6.970446{col 67}{space 3} 2.043685
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-3.203441{col 26}{space 2} 2.386936{col 37}{space 1}   -1.34{col 46}{space 3}0.180{col 54}{space 4}-7.882493{col 67}{space 3}  1.47561
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}-2.813473{col 26}{space 2} 2.338632{col 37}{space 1}   -1.20{col 46}{space 3}0.229{col 54}{space 4}-7.397835{col 67}{space 3}  1.77089
{txt}{space 9}NY  {c |}{col 14}{res}{space 2} -2.76637{col 26}{space 2} 2.290152{col 37}{space 1}   -1.21{col 46}{space 3}0.227{col 54}{space 4}-7.255699{col 67}{space 3} 1.722959
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-3.415544{col 26}{space 2} 2.291741{col 37}{space 1}   -1.49{col 46}{space 3}0.136{col 54}{space 4}-7.907989{col 67}{space 3} 1.076901
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-1.068565{col 26}{space 2} 2.375255{col 37}{space 1}   -0.45{col 46}{space 3}0.653{col 54}{space 4}-5.724719{col 67}{space 3}  3.58759
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-3.702242{col 26}{space 2} 2.313176{col 37}{space 1}   -1.60{col 46}{space 3}0.110{col 54}{space 4}-8.236704{col 67}{space 3} .8322195
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-3.325726{col 26}{space 2} 2.289696{col 37}{space 1}   -1.45{col 46}{space 3}0.146{col 54}{space 4}-7.814161{col 67}{space 3}  1.16271
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-2.178777{col 26}{space 2} 2.437221{col 37}{space 1}   -0.89{col 46}{space 3}0.371{col 54}{space 4}-6.956403{col 67}{space 3} 2.598848
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-2.806591{col 26}{space 2} 2.313901{col 37}{space 1}   -1.21{col 46}{space 3}0.225{col 54}{space 4}-7.342475{col 67}{space 3} 1.729292
{txt}{space 9}SD  {c |}{col 14}{res}{space 2} -3.74922{col 26}{space 2} 2.332312{col 37}{space 1}   -1.61{col 46}{space 3}0.108{col 54}{space 4}-8.321194{col 67}{space 3} .8227539
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-3.089759{col 26}{space 2} 2.298297{col 37}{space 1}   -1.34{col 46}{space 3}0.179{col 54}{space 4}-7.595054{col 67}{space 3} 1.415537
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-2.226971{col 26}{space 2} 2.291721{col 37}{space 1}   -0.97{col 46}{space 3}0.331{col 54}{space 4}-6.719376{col 67}{space 3} 2.265434
{txt}{space 9}UT  {c |}{col 14}{res}{space 2}-3.033507{col 26}{space 2} 2.346582{col 37}{space 1}   -1.29{col 46}{space 3}0.196{col 54}{space 4}-7.633455{col 67}{space 3}  1.56644
{txt}{space 9}VA  {c |}{col 14}{res}{space 2} -2.59238{col 26}{space 2} 2.307709{col 37}{space 1}   -1.12{col 46}{space 3}0.261{col 54}{space 4}-7.116126{col 67}{space 3} 1.931365
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}-4.658418{col 26}{space 2} 2.308291{col 37}{space 1}   -2.02{col 46}{space 3}0.044{col 54}{space 4}-9.183306{col 67}{space 3}-.1335311
{txt}{space 9}WA  {c |}{col 14}{res}{space 2}-3.461829{col 26}{space 2} 2.296039{col 37}{space 1}   -1.51{col 46}{space 3}0.132{col 54}{space 4}-7.962699{col 67}{space 3} 1.039041
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-3.790329{col 26}{space 2}  2.29211{col 37}{space 1}   -1.65{col 46}{space 3}0.098{col 54}{space 4}-8.283497{col 67}{space 3} .7028393
{txt}{space 9}WV  {c |}{col 14}{res}{space 2} -3.50928{col 26}{space 2} 2.351932{col 37}{space 1}   -1.49{col 46}{space 3}0.136{col 54}{space 4}-8.119715{col 67}{space 3} 1.101154
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-4.308895{col 26}{space 2} 2.347614{col 37}{space 1}   -1.84{col 46}{space 3}0.066{col 54}{space 4}-8.910866{col 67}{space 3} .2930748
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 7.759787{col 26}{space 2} 2.333804{col 37}{space 1}    3.32{col 46}{space 3}0.001{col 54}{space 4} 3.184889{col 67}{space 3} 12.33469
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est4{txt} stored)

Linear regression                                      Number of obs ={res}    7674
                                                       {txt}F( 71,  7602) ={res}    5.21
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0756
                                                       {txt}Root MSE      = {res} 4.2731

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     Q24_iqr{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2} .0043212{col 26}{space 2}  .276152{col 37}{space 1}    0.02{col 46}{space 3}0.988{col 54}{space 4}-.5370129{col 67}{space 3} .5456554
{txt}{space 8}Old  {c |}{col 14}{res}{space 2} .5549264{col 26}{space 2} .4374053{col 37}{space 1}    1.27{col 46}{space 3}0.205{col 54}{space 4}-.3025087{col 67}{space 3} 1.412362
{txt}{space 12} {c |}
{space 7}edu_g {c |}
{space 10}1  {c |}{col 14}{res}{space 2}-.9481414{col 26}{space 2} .2411354{col 37}{space 1}   -3.93{col 46}{space 3}0.000{col 54}{space 4}-1.420833{col 67}{space 3}-.4754494
{txt}{space 10}2  {c |}{col 14}{res}{space 2}-1.421623{col 26}{space 2} .2286565{col 37}{space 1}   -6.22{col 46}{space 3}0.000{col 54}{space 4}-1.869853{col 67}{space 3}-.9733929
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2}-1.272953{col 26}{space 2} .1697025{col 37}{space 1}   -7.50{col 46}{space 3}0.000{col 54}{space 4}-1.605617{col 67}{space 3}-.9402891
{txt}High Income  {c |}{col 14}{res}{space 2}-1.297554{col 26}{space 2} .1605746{col 37}{space 1}   -8.08{col 46}{space 3}0.000{col 54}{space 4}-1.612324{col 67}{space 3}-.9827832
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2}  .456844{col 26}{space 2} .3404658{col 37}{space 1}    1.34{col 46}{space 3}0.180{col 54}{space 4}-.2105629{col 67}{space 3} 1.124251
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2}  .971089{col 26}{space 2}   .44142{col 37}{space 1}    2.20{col 46}{space 3}0.028{col 54}{space 4} .1057841{col 67}{space 3} 1.836394
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2} .0834141{col 26}{space 2} .1567741{col 37}{space 1}    0.53{col 46}{space 3}0.595{col 54}{space 4}-.2239064{col 67}{space 3} .3907345
{txt}{space 7}2015  {c |}{col 14}{res}{space 2} .0340535{col 26}{space 2} .1533108{col 37}{space 1}    0.22{col 46}{space 3}0.824{col 54}{space 4} -.266478{col 67}{space 3} .3345849
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0893062{col 26}{space 2} .1574213{col 37}{space 1}    0.57{col 46}{space 3}0.571{col 54}{space 4}-.2192829{col 67}{space 3} .3978953
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}  .124737{col 26}{space 2} .1524244{col 37}{space 1}    0.82{col 46}{space 3}0.413{col 54}{space 4} -.174057{col 67}{space 3} .4235309
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .2005657{col 26}{space 2} .2263955{col 37}{space 1}    0.89{col 46}{space 3}0.376{col 54}{space 4} -.243232{col 67}{space 3} .6443634
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2}-2.689313{col 26}{space 2} 2.223633{col 37}{space 1}   -1.21{col 46}{space 3}0.227{col 54}{space 4}-7.048249{col 67}{space 3} 1.669622
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-3.765458{col 26}{space 2} 2.208337{col 37}{space 1}   -1.71{col 46}{space 3}0.088{col 54}{space 4}-8.094409{col 67}{space 3} .5634927
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-2.496414{col 26}{space 2} 2.209214{col 37}{space 1}   -1.13{col 46}{space 3}0.259{col 54}{space 4}-6.827083{col 67}{space 3} 1.834256
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-2.498502{col 26}{space 2} 2.183284{col 37}{space 1}   -1.14{col 46}{space 3}0.253{col 54}{space 4}-6.778342{col 67}{space 3} 1.781338
{txt}{space 9}CO  {c |}{col 14}{res}{space 2} -2.58712{col 26}{space 2} 2.198695{col 37}{space 1}   -1.18{col 46}{space 3}0.239{col 54}{space 4}-6.897169{col 67}{space 3} 1.722928
{txt}{space 9}CT  {c |}{col 14}{res}{space 2} -3.30388{col 26}{space 2} 2.195171{col 37}{space 1}   -1.51{col 46}{space 3}0.132{col 54}{space 4}-7.607022{col 67}{space 3} .9992614
{txt}{space 9}DC  {c |}{col 14}{res}{space 2}-2.482628{col 26}{space 2} 2.331549{col 37}{space 1}   -1.06{col 46}{space 3}0.287{col 54}{space 4}-7.053107{col 67}{space 3} 2.087851
{txt}{space 9}DE  {c |}{col 14}{res}{space 2} -3.05593{col 26}{space 2} 2.424303{col 37}{space 1}   -1.26{col 46}{space 3}0.208{col 54}{space 4}-7.808234{col 67}{space 3} 1.696374
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-2.374984{col 26}{space 2} 2.191561{col 37}{space 1}   -1.08{col 46}{space 3}0.279{col 54}{space 4}-6.671048{col 67}{space 3} 1.921081
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-2.905375{col 26}{space 2} 2.197655{col 37}{space 1}   -1.32{col 46}{space 3}0.186{col 54}{space 4}-7.213386{col 67}{space 3} 1.402636
{txt}{space 9}HI  {c |}{col 14}{res}{space 2}-2.712205{col 26}{space 2} 2.337323{col 37}{space 1}   -1.16{col 46}{space 3}0.246{col 54}{space 4}-7.294003{col 67}{space 3} 1.869594
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-3.433431{col 26}{space 2} 2.213055{col 37}{space 1}   -1.55{col 46}{space 3}0.121{col 54}{space 4}-7.771629{col 67}{space 3} .9047674
{txt}{space 9}ID  {c |}{col 14}{res}{space 2}-3.546858{col 26}{space 2} 2.210308{col 37}{space 1}   -1.60{col 46}{space 3}0.109{col 54}{space 4}-7.879672{col 67}{space 3} .7859551
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-2.911328{col 26}{space 2} 2.189178{col 37}{space 1}   -1.33{col 46}{space 3}0.184{col 54}{space 4}-7.202721{col 67}{space 3} 1.380065
{txt}{space 9}IN  {c |}{col 14}{res}{space 2}-2.755115{col 26}{space 2} 2.201285{col 37}{space 1}   -1.25{col 46}{space 3}0.211{col 54}{space 4}-7.070241{col 67}{space 3} 1.560011
{txt}{space 9}KS  {c |}{col 14}{res}{space 2} -2.85617{col 26}{space 2} 2.217092{col 37}{space 1}   -1.29{col 46}{space 3}0.198{col 54}{space 4}-7.202283{col 67}{space 3} 1.489943
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-3.268736{col 26}{space 2}   2.2125{col 37}{space 1}   -1.48{col 46}{space 3}0.140{col 54}{space 4}-7.605848{col 67}{space 3} 1.068376
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-1.064165{col 26}{space 2} 2.312535{col 37}{space 1}   -0.46{col 46}{space 3}0.645{col 54}{space 4}-5.597372{col 67}{space 3} 3.469043
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-2.556276{col 26}{space 2} 2.200383{col 37}{space 1}   -1.16{col 46}{space 3}0.245{col 54}{space 4}-6.869633{col 67}{space 3} 1.757082
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-2.895625{col 26}{space 2} 2.200247{col 37}{space 1}   -1.32{col 46}{space 3}0.188{col 54}{space 4}-7.208718{col 67}{space 3} 1.417467
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-2.729371{col 26}{space 2} 2.253408{col 37}{space 1}   -1.21{col 46}{space 3}0.226{col 54}{space 4}-7.146672{col 67}{space 3}  1.68793
{txt}{space 9}MI  {c |}{col 14}{res}{space 2}-3.039488{col 26}{space 2} 2.188396{col 37}{space 1}   -1.39{col 46}{space 3}0.165{col 54}{space 4}-7.329348{col 67}{space 3} 1.250373
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-2.923382{col 26}{space 2} 2.196852{col 37}{space 1}   -1.33{col 46}{space 3}0.183{col 54}{space 4}-7.229819{col 67}{space 3} 1.383055
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-2.870448{col 26}{space 2} 2.198339{col 37}{space 1}   -1.31{col 46}{space 3}0.192{col 54}{space 4}-7.179799{col 67}{space 3} 1.438903
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-2.172236{col 26}{space 2} 2.330258{col 37}{space 1}   -0.93{col 46}{space 3}0.351{col 54}{space 4}-6.740185{col 67}{space 3} 2.395712
{txt}{space 9}MT  {c |}{col 14}{res}{space 2}-3.253091{col 26}{space 2} 2.278875{col 37}{space 1}   -1.43{col 46}{space 3}0.153{col 54}{space 4}-7.720315{col 67}{space 3} 1.214132
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-2.429564{col 26}{space 2} 2.197654{col 37}{space 1}   -1.11{col 46}{space 3}0.269{col 54}{space 4}-6.737574{col 67}{space 3} 1.878445
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-2.292694{col 26}{space 2} 2.293591{col 37}{space 1}   -1.00{col 46}{space 3}0.318{col 54}{space 4}-6.788766{col 67}{space 3} 2.203378
{txt}{space 9}NE  {c |}{col 14}{res}{space 2}-3.229157{col 26}{space 2} 2.207981{col 37}{space 1}   -1.46{col 46}{space 3}0.144{col 54}{space 4}-7.557409{col 67}{space 3} 1.099095
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-3.537255{col 26}{space 2} 2.224108{col 37}{space 1}   -1.59{col 46}{space 3}0.112{col 54}{space 4}-7.897122{col 67}{space 3} .8226106
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-2.387782{col 26}{space 2} 2.195987{col 37}{space 1}   -1.09{col 46}{space 3}0.277{col 54}{space 4}-6.692522{col 67}{space 3} 1.916958
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-2.948377{col 26}{space 2} 2.289547{col 37}{space 1}   -1.29{col 46}{space 3}0.198{col 54}{space 4}-7.436521{col 67}{space 3} 1.539766
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}-2.611126{col 26}{space 2} 2.229297{col 37}{space 1}   -1.17{col 46}{space 3}0.242{col 54}{space 4}-6.981165{col 67}{space 3} 1.758912
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-2.582449{col 26}{space 2} 2.186292{col 37}{space 1}   -1.18{col 46}{space 3}0.238{col 54}{space 4}-6.868186{col 67}{space 3} 1.703288
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-3.135361{col 26}{space 2} 2.187579{col 37}{space 1}   -1.43{col 46}{space 3}0.152{col 54}{space 4}-7.423621{col 67}{space 3} 1.152898
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-.7258315{col 26}{space 2} 2.270991{col 37}{space 1}   -0.32{col 46}{space 3}0.749{col 54}{space 4}-5.177601{col 67}{space 3} 3.725937
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-3.282295{col 26}{space 2}  2.21042{col 37}{space 1}   -1.48{col 46}{space 3}0.138{col 54}{space 4}-7.615329{col 67}{space 3} 1.050738
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-3.030133{col 26}{space 2} 2.186186{col 37}{space 1}   -1.39{col 46}{space 3}0.166{col 54}{space 4}-7.315661{col 67}{space 3} 1.255394
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-2.062888{col 26}{space 2} 2.333544{col 37}{space 1}   -0.88{col 46}{space 3}0.377{col 54}{space 4}-6.637279{col 67}{space 3} 2.511504
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-2.799968{col 26}{space 2} 2.213824{col 37}{space 1}   -1.26{col 46}{space 3}0.206{col 54}{space 4}-7.139673{col 67}{space 3} 1.539738
{txt}{space 9}SD  {c |}{col 14}{res}{space 2}-3.378714{col 26}{space 2} 2.229434{col 37}{space 1}   -1.52{col 46}{space 3}0.130{col 54}{space 4}-7.749019{col 67}{space 3} .9915917
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-2.869754{col 26}{space 2} 2.195502{col 37}{space 1}   -1.31{col 46}{space 3}0.191{col 54}{space 4}-7.173543{col 67}{space 3} 1.434036
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-2.153483{col 26}{space 2} 2.187964{col 37}{space 1}   -0.98{col 46}{space 3}0.325{col 54}{space 4}-6.442497{col 67}{space 3} 2.135531
{txt}{space 9}UT  {c |}{col 14}{res}{space 2} -2.59046{col 26}{space 2} 2.247117{col 37}{space 1}   -1.15{col 46}{space 3}0.249{col 54}{space 4}-6.995429{col 67}{space 3} 1.814509
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}-2.505418{col 26}{space 2} 2.204575{col 37}{space 1}   -1.14{col 46}{space 3}0.256{col 54}{space 4}-6.826993{col 67}{space 3} 1.816157
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}-4.194487{col 26}{space 2} 2.201504{col 37}{space 1}   -1.91{col 46}{space 3}0.057{col 54}{space 4}-8.510042{col 67}{space 3} .1210689
{txt}{space 9}WA  {c |}{col 14}{res}{space 2}-3.081375{col 26}{space 2} 2.192303{col 37}{space 1}   -1.41{col 46}{space 3}0.160{col 54}{space 4}-7.378895{col 67}{space 3} 1.216146
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-3.368993{col 26}{space 2} 2.187993{col 37}{space 1}   -1.54{col 46}{space 3}0.124{col 54}{space 4}-7.658063{col 67}{space 3} .9200768
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-3.118574{col 26}{space 2} 2.247856{col 37}{space 1}   -1.39{col 46}{space 3}0.165{col 54}{space 4}-7.524993{col 67}{space 3} 1.287844
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-3.791227{col 26}{space 2} 2.247059{col 37}{space 1}   -1.69{col 46}{space 3}0.092{col 54}{space 4}-8.196083{col 67}{space 3} .6136296
{txt}{space 12} {c |}
{space 7}2.Q33 {c |}{col 14}{res}{space 2} .3142341{col 26}{space 2} .0999621{col 37}{space 1}    3.14{col 46}{space 3}0.002{col 54}{space 4} .1182808{col 67}{space 3} .5101874
{txt}{space 7}2.Q34 {c |}{col 14}{res}{space 2}-.9698677{col 26}{space 2}   .23712{col 37}{space 1}   -4.09{col 46}{space 3}0.000{col 54}{space 4}-1.434688{col 67}{space 3}-.5050469
{txt}{space 7}Q35_1 {c |}{col 14}{res}{space 2}-.9489161{col 26}{space 2} .3333594{col 37}{space 1}   -2.85{col 46}{space 3}0.004{col 54}{space 4}-1.602392{col 67}{space 3}-.2954397
{txt}{space 7}Q35_2 {c |}{col 14}{res}{space 2}  1.16003{col 26}{space 2} .3624073{col 37}{space 1}    3.20{col 46}{space 3}0.001{col 54}{space 4} .4496119{col 67}{space 3} 1.870449
{txt}{space 7}Q35_3 {c |}{col 14}{res}{space 2} -.348914{col 26}{space 2} .3527972{col 37}{space 1}   -0.99{col 46}{space 3}0.323{col 54}{space 4}-1.040494{col 67}{space 3}  .342666
{txt}{space 7}Q35_4 {c |}{col 14}{res}{space 2}-.6732797{col 26}{space 2} .3647534{col 37}{space 1}   -1.85{col 46}{space 3}0.065{col 54}{space 4}-1.388297{col 67}{space 3} .0417376
{txt}{space 7}Q35_5 {c |}{col 14}{res}{space 2} .2906089{col 26}{space 2} .8314675{col 37}{space 1}    0.35{col 46}{space 3}0.727{col 54}{space 4}-1.339297{col 67}{space 3} 1.920515
{txt}{space 7}Q35_6 {c |}{col 14}{res}{space 2} -.221144{col 26}{space 2} .3825476{col 37}{space 1}   -0.58{col 46}{space 3}0.563{col 54}{space 4}-.9710429{col 67}{space 3}  .528755
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  9.06356{col 26}{space 2} 2.276258{col 37}{space 1}    3.98{col 46}{space 3}0.000{col 54}{space 4} 4.601466{col 67}{space 3} 13.52565
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est5{txt} stored)

Linear regression                                      Number of obs ={res}    6368
                                                       {txt}F( 75,  6292) ={res}    5.05
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.1031
                                                       {txt}Root MSE      = {res} 3.8527

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     Q24_iqr{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2} .1259737{col 26}{space 2} .2940027{col 37}{space 1}    0.43{col 46}{space 3}0.668{col 54}{space 4}-.4503718{col 67}{space 3} .7023193
{txt}{space 8}Old  {c |}{col 14}{res}{space 2}  .441371{col 26}{space 2} .4414236{col 37}{space 1}    1.00{col 46}{space 3}0.317{col 54}{space 4}-.4239698{col 67}{space 3} 1.306712
{txt}{space 12} {c |}
{space 7}edu_g {c |}
{space 10}1  {c |}{col 14}{res}{space 2}-.9125616{col 26}{space 2} .2496098{col 37}{space 1}   -3.66{col 46}{space 3}0.000{col 54}{space 4}-1.401882{col 67}{space 3}-.4232413
{txt}{space 10}2  {c |}{col 14}{res}{space 2}-1.578612{col 26}{space 2} .2375576{col 37}{space 1}   -6.65{col 46}{space 3}0.000{col 54}{space 4}-2.044306{col 67}{space 3}-1.112918
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2}-1.072035{col 26}{space 2} .1768905{col 37}{space 1}   -6.06{col 46}{space 3}0.000{col 54}{space 4}  -1.4188{col 67}{space 3}-.7252691
{txt}High Income  {c |}{col 14}{res}{space 2}-1.122256{col 26}{space 2} .1684865{col 37}{space 1}   -6.66{col 46}{space 3}0.000{col 54}{space 4}-1.452547{col 67}{space 3}-.7919647
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2} .5221492{col 26}{space 2} .3316759{col 37}{space 1}    1.57{col 46}{space 3}0.115{col 54}{space 4}-.1280486{col 67}{space 3} 1.172347
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2}  1.27218{col 26}{space 2} .4449697{col 37}{space 1}    2.86{col 46}{space 3}0.004{col 54}{space 4}  .399888{col 67}{space 3} 2.144473
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2}-.0375969{col 26}{space 2} .1552153{col 37}{space 1}   -0.24{col 46}{space 3}0.809{col 54}{space 4}-.3418719{col 67}{space 3} .2666781
{txt}{space 7}2015  {c |}{col 14}{res}{space 2}-.0603083{col 26}{space 2} .1561535{col 37}{space 1}   -0.39{col 46}{space 3}0.699{col 54}{space 4}-.3664225{col 67}{space 3} .2458059
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.1925543{col 26}{space 2} .1543864{col 37}{space 1}   -1.25{col 46}{space 3}0.212{col 54}{space 4}-.4952044{col 67}{space 3} .1100957
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0130855{col 26}{space 2} .1497876{col 37}{space 1}   -0.09{col 46}{space 3}0.930{col 54}{space 4}-.3067202{col 67}{space 3} .2805492
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0114944{col 26}{space 2} .2259087{col 37}{space 1}   -0.05{col 46}{space 3}0.959{col 54}{space 4}-.4543524{col 67}{space 3} .4313636
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2}-2.664953{col 26}{space 2} 2.877615{col 37}{space 1}   -0.93{col 46}{space 3}0.354{col 54}{space 4}-8.306061{col 67}{space 3} 2.976154
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-3.940939{col 26}{space 2}  2.86457{col 37}{space 1}   -1.38{col 46}{space 3}0.169{col 54}{space 4}-9.556472{col 67}{space 3} 1.674594
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-2.738638{col 26}{space 2} 2.862409{col 37}{space 1}   -0.96{col 46}{space 3}0.339{col 54}{space 4}-8.349935{col 67}{space 3} 2.872659
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-2.663485{col 26}{space 2} 2.847194{col 37}{space 1}   -0.94{col 46}{space 3}0.350{col 54}{space 4}-8.244957{col 67}{space 3} 2.917988
{txt}{space 9}CO  {c |}{col 14}{res}{space 2}-3.072632{col 26}{space 2} 2.852706{col 37}{space 1}   -1.08{col 46}{space 3}0.281{col 54}{space 4}-8.664909{col 67}{space 3} 2.519646
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-3.351683{col 26}{space 2} 2.852085{col 37}{space 1}   -1.18{col 46}{space 3}0.240{col 54}{space 4}-8.942742{col 67}{space 3} 2.239377
{txt}{space 9}DC  {c |}{col 14}{res}{space 2}-2.269971{col 26}{space 2}  2.96709{col 37}{space 1}   -0.77{col 46}{space 3}0.444{col 54}{space 4}-8.086481{col 67}{space 3} 3.546538
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-2.798987{col 26}{space 2} 3.055657{col 37}{space 1}   -0.92{col 46}{space 3}0.360{col 54}{space 4}-8.789117{col 67}{space 3} 3.191142
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-2.652676{col 26}{space 2} 2.851638{col 37}{space 1}   -0.93{col 46}{space 3}0.352{col 54}{space 4} -8.24286{col 67}{space 3} 2.937508
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-3.027641{col 26}{space 2} 2.855072{col 37}{space 1}   -1.06{col 46}{space 3}0.289{col 54}{space 4}-8.624556{col 67}{space 3} 2.569274
{txt}{space 9}HI  {c |}{col 14}{res}{space 2}-3.761531{col 26}{space 2} 2.909692{col 37}{space 1}   -1.29{col 46}{space 3}0.196{col 54}{space 4} -9.46552{col 67}{space 3} 1.942458
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-3.209204{col 26}{space 2} 2.868245{col 37}{space 1}   -1.12{col 46}{space 3}0.263{col 54}{space 4}-8.831943{col 67}{space 3} 2.413535
{txt}{space 9}ID  {c |}{col 14}{res}{space 2}-3.482727{col 26}{space 2} 2.869264{col 37}{space 1}   -1.21{col 46}{space 3}0.225{col 54}{space 4}-9.107463{col 67}{space 3} 2.142009
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-3.157084{col 26}{space 2} 2.849129{col 37}{space 1}   -1.11{col 46}{space 3}0.268{col 54}{space 4}-8.742349{col 67}{space 3} 2.428181
{txt}{space 9}IN  {c |}{col 14}{res}{space 2}-2.716726{col 26}{space 2} 2.863232{col 37}{space 1}   -0.95{col 46}{space 3}0.343{col 54}{space 4}-8.329638{col 67}{space 3} 2.896186
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-2.651564{col 26}{space 2} 2.876248{col 37}{space 1}   -0.92{col 46}{space 3}0.357{col 54}{space 4}-8.289992{col 67}{space 3} 2.986864
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-3.272427{col 26}{space 2} 2.870609{col 37}{space 1}   -1.14{col 46}{space 3}0.254{col 54}{space 4}  -8.8998{col 67}{space 3} 2.354946
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-1.608469{col 26}{space 2} 2.948433{col 37}{space 1}   -0.55{col 46}{space 3}0.585{col 54}{space 4}-7.388403{col 67}{space 3} 4.171465
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-2.594539{col 26}{space 2}  2.85802{col 37}{space 1}   -0.91{col 46}{space 3}0.364{col 54}{space 4}-8.197232{col 67}{space 3} 3.008154
{txt}{space 9}MD  {c |}{col 14}{res}{space 2} -2.97612{col 26}{space 2} 2.859844{col 37}{space 1}   -1.04{col 46}{space 3}0.298{col 54}{space 4} -8.58239{col 67}{space 3}  2.63015
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-3.000277{col 26}{space 2} 2.877524{col 37}{space 1}   -1.04{col 46}{space 3}0.297{col 54}{space 4}-8.641205{col 67}{space 3} 2.640652
{txt}{space 9}MI  {c |}{col 14}{res}{space 2}-2.995027{col 26}{space 2} 2.849476{col 37}{space 1}   -1.05{col 46}{space 3}0.293{col 54}{space 4}-8.580972{col 67}{space 3} 2.590917
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-3.237076{col 26}{space 2} 2.852938{col 37}{space 1}   -1.13{col 46}{space 3}0.257{col 54}{space 4}-8.829808{col 67}{space 3} 2.355655
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-3.180204{col 26}{space 2}  2.85715{col 37}{space 1}   -1.11{col 46}{space 3}0.266{col 54}{space 4}-8.781193{col 67}{space 3} 2.420784
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-2.332504{col 26}{space 2} 2.972724{col 37}{space 1}   -0.78{col 46}{space 3}0.433{col 54}{space 4}-8.160056{col 67}{space 3} 3.495049
{txt}{space 9}MT  {c |}{col 14}{res}{space 2}-3.241038{col 26}{space 2} 2.924778{col 37}{space 1}   -1.11{col 46}{space 3}0.268{col 54}{space 4}  -8.9746{col 67}{space 3} 2.492523
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-2.778322{col 26}{space 2} 2.855538{col 37}{space 1}   -0.97{col 46}{space 3}0.331{col 54}{space 4} -8.37615{col 67}{space 3} 2.819507
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-2.179484{col 26}{space 2} 2.945782{col 37}{space 1}   -0.74{col 46}{space 3}0.459{col 54}{space 4}-7.954221{col 67}{space 3} 3.595253
{txt}{space 9}NE  {c |}{col 14}{res}{space 2}-2.882155{col 26}{space 2} 2.866632{col 37}{space 1}   -1.01{col 46}{space 3}0.315{col 54}{space 4}-8.501732{col 67}{space 3} 2.737423
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-3.660872{col 26}{space 2} 2.876818{col 37}{space 1}   -1.27{col 46}{space 3}0.203{col 54}{space 4}-9.300417{col 67}{space 3} 1.978673
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-2.542546{col 26}{space 2} 2.857902{col 37}{space 1}   -0.89{col 46}{space 3}0.374{col 54}{space 4}-8.145008{col 67}{space 3} 3.059917
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-3.667885{col 26}{space 2} 2.905914{col 37}{space 1}   -1.26{col 46}{space 3}0.207{col 54}{space 4}-9.364467{col 67}{space 3} 2.028698
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}-2.492781{col 26}{space 2} 2.883429{col 37}{space 1}   -0.86{col 46}{space 3}0.387{col 54}{space 4}-8.145284{col 67}{space 3} 3.159723
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-2.900514{col 26}{space 2} 2.847241{col 37}{space 1}   -1.02{col 46}{space 3}0.308{col 54}{space 4}-8.482079{col 67}{space 3}  2.68105
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-3.199167{col 26}{space 2} 2.848071{col 37}{space 1}   -1.12{col 46}{space 3}0.261{col 54}{space 4}-8.782358{col 67}{space 3} 2.384025
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-1.172589{col 26}{space 2} 2.925607{col 37}{space 1}   -0.40{col 46}{space 3}0.689{col 54}{space 4}-6.907776{col 67}{space 3} 4.562598
{txt}{space 9}OR  {c |}{col 14}{res}{space 2} -3.80609{col 26}{space 2} 2.846226{col 37}{space 1}   -1.34{col 46}{space 3}0.181{col 54}{space 4}-9.385664{col 67}{space 3} 1.773484
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-3.092715{col 26}{space 2} 2.847766{col 37}{space 1}   -1.09{col 46}{space 3}0.278{col 54}{space 4}-8.675307{col 67}{space 3} 2.489878
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-1.917637{col 26}{space 2} 2.957594{col 37}{space 1}   -0.65{col 46}{space 3}0.517{col 54}{space 4} -7.71553{col 67}{space 3} 3.880256
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-3.281171{col 26}{space 2} 2.862979{col 37}{space 1}   -1.15{col 46}{space 3}0.252{col 54}{space 4}-8.893587{col 67}{space 3} 2.331244
{txt}{space 9}SD  {c |}{col 14}{res}{space 2}-3.668928{col 26}{space 2} 2.895526{col 37}{space 1}   -1.27{col 46}{space 3}0.205{col 54}{space 4}-9.345146{col 67}{space 3}  2.00729
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-2.901466{col 26}{space 2} 2.856193{col 37}{space 1}   -1.02{col 46}{space 3}0.310{col 54}{space 4}-8.500579{col 67}{space 3} 2.697647
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-2.480184{col 26}{space 2} 2.850159{col 37}{space 1}   -0.87{col 46}{space 3}0.384{col 54}{space 4}-8.067468{col 67}{space 3} 3.107101
{txt}{space 9}UT  {c |}{col 14}{res}{space 2}-2.605009{col 26}{space 2} 2.891518{col 37}{space 1}   -0.90{col 46}{space 3}0.368{col 54}{space 4}-8.273371{col 67}{space 3} 3.063352
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}-2.656504{col 26}{space 2} 2.859329{col 37}{space 1}   -0.93{col 46}{space 3}0.353{col 54}{space 4}-8.261765{col 67}{space 3} 2.948757
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}-3.824272{col 26}{space 2} 2.870566{col 37}{space 1}   -1.33{col 46}{space 3}0.183{col 54}{space 4}-9.451561{col 67}{space 3} 1.803017
{txt}{space 9}WA  {c |}{col 14}{res}{space 2}-3.252372{col 26}{space 2}  2.85209{col 37}{space 1}   -1.14{col 46}{space 3}0.254{col 54}{space 4}-8.843441{col 67}{space 3} 2.338696
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-3.254458{col 26}{space 2} 2.850333{col 37}{space 1}   -1.14{col 46}{space 3}0.254{col 54}{space 4}-8.842084{col 67}{space 3} 2.333167
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-2.842631{col 26}{space 2} 2.907248{col 37}{space 1}   -0.98{col 46}{space 3}0.328{col 54}{space 4}-8.541828{col 67}{space 3} 2.856565
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-3.898596{col 26}{space 2} 2.887835{col 37}{space 1}   -1.35{col 46}{space 3}0.177{col 54}{space 4}-9.559738{col 67}{space 3} 1.762546
{txt}{space 12} {c |}
{space 7}2.Q33 {c |}{col 14}{res}{space 2} .0967342{col 26}{space 2} .1015137{col 37}{space 1}    0.95{col 46}{space 3}0.341{col 54}{space 4}-.1022673{col 67}{space 3} .2957357
{txt}{space 7}2.Q34 {c |}{col 14}{res}{space 2}-.9704714{col 26}{space 2} .2356923{col 37}{space 1}   -4.12{col 46}{space 3}0.000{col 54}{space 4}-1.432509{col 67}{space 3}-.5084341
{txt}{space 7}Q35_1 {c |}{col 14}{res}{space 2}-1.318306{col 26}{space 2} .3132276{col 37}{space 1}   -4.21{col 46}{space 3}0.000{col 54}{space 4}-1.932339{col 67}{space 3}-.7042731
{txt}{space 7}Q35_2 {c |}{col 14}{res}{space 2} .8278985{col 26}{space 2} .3420822{col 37}{space 1}    2.42{col 46}{space 3}0.016{col 54}{space 4} .1573007{col 67}{space 3} 1.498496
{txt}{space 7}Q35_3 {c |}{col 14}{res}{space 2}  .057313{col 26}{space 2} .3753388{col 37}{space 1}    0.15{col 46}{space 3}0.879{col 54}{space 4}-.6784791{col 67}{space 3} .7931051
{txt}{space 7}Q35_4 {c |}{col 14}{res}{space 2}-.7401132{col 26}{space 2} .3574213{col 37}{space 1}   -2.07{col 46}{space 3}0.038{col 54}{space 4}-1.440781{col 67}{space 3}-.0394454
{txt}{space 7}Q35_5 {c |}{col 14}{res}{space 2}-.1015534{col 26}{space 2} .8161237{col 37}{space 1}   -0.12{col 46}{space 3}0.901{col 54}{space 4}-1.701434{col 67}{space 3} 1.498327
{txt}{space 7}Q35_6 {c |}{col 14}{res}{space 2}-.7464063{col 26}{space 2}  .350406{col 37}{space 1}   -2.13{col 46}{space 3}0.033{col 54}{space 4}-1.433322{col 67}{space 3}-.0594909
{txt}{space 7}Q4new {c |}{col 14}{res}{space 2} .0072716{col 26}{space 2} .0024977{col 37}{space 1}    2.91{col 46}{space 3}0.004{col 54}{space 4} .0023752{col 67}{space 3} .0121679
{txt}{space 7}Q6new {c |}{col 14}{res}{space 2} .0058291{col 26}{space 2} .0024458{col 37}{space 1}    2.38{col 46}{space 3}0.017{col 54}{space 4} .0010345{col 67}{space 3} .0106238
{txt}{space 5}Q9_mean {c |}{col 14}{res}{space 2}-.0889166{col 26}{space 2} .0133782{col 37}{space 1}   -6.65{col 46}{space 3}0.000{col 54}{space 4}-.1151425{col 67}{space 3}-.0626907
{txt}{space 6}Q13new {c |}{col 14}{res}{space 2} .0039636{col 26}{space 2} .0028167{col 37}{space 1}    1.41{col 46}{space 3}0.159{col 54}{space 4}-.0015582{col 67}{space 3} .0094854
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  8.85898{col 26}{space 2} 2.914592{col 37}{space 1}    3.04{col 46}{space 3}0.002{col 54}{space 4} 3.145386{col 67}{space 3} 14.57257
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est6{txt} stored)

Linear regression                                      Number of obs ={res}    6727
                                                       {txt}F( 63,  6663) ={res}    3.83
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0328
                                                       {txt}Root MSE      = {res} 2.4221

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}    Q24_mean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2}-.1732919{col 26}{space 2}  .158976{col 37}{space 1}   -1.09{col 46}{space 3}0.276{col 54}{space 4}-.4849358{col 67}{space 3} .1383521
{txt}{space 8}Old  {c |}{col 14}{res}{space 2}-.1382941{col 26}{space 2} .2331645{col 37}{space 1}   -0.59{col 46}{space 3}0.553{col 54}{space 4}-.5953712{col 67}{space 3}  .318783
{txt}{space 12} {c |}
{space 7}edu_g {c |}
{space 10}1  {c |}{col 14}{res}{space 2} -.008656{col 26}{space 2} .1134372{col 37}{space 1}   -0.08{col 46}{space 3}0.939{col 54}{space 4}-.2310293{col 67}{space 3} .2137173
{txt}{space 10}2  {c |}{col 14}{res}{space 2} .0778607{col 26}{space 2} .1105584{col 37}{space 1}    0.70{col 46}{space 3}0.481{col 54}{space 4}-.1388692{col 67}{space 3} .2945906
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2}-.1048402{col 26}{space 2} .0930626{col 37}{space 1}   -1.13{col 46}{space 3}0.260{col 54}{space 4}-.2872728{col 67}{space 3} .0775923
{txt}High Income  {c |}{col 14}{res}{space 2} .2494415{col 26}{space 2} .0919545{col 37}{space 1}    2.71{col 46}{space 3}0.007{col 54}{space 4} .0691812{col 67}{space 3} .4297018
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2} .0427292{col 26}{space 2} .1739954{col 37}{space 1}    0.25{col 46}{space 3}0.806{col 54}{space 4}-.2983574{col 67}{space 3} .3838159
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} .3955818{col 26}{space 2} .2400285{col 37}{space 1}    1.65{col 46}{space 3}0.099{col 54}{space 4}-.0749508{col 67}{space 3} .8661144
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2} .2742519{col 26}{space 2} .0974923{col 37}{space 1}    2.81{col 46}{space 3}0.005{col 54}{space 4} .0831357{col 67}{space 3}  .465368
{txt}{space 7}2015  {c |}{col 14}{res}{space 2} .2262488{col 26}{space 2} .0948994{col 37}{space 1}    2.38{col 46}{space 3}0.017{col 54}{space 4} .0402155{col 67}{space 3}  .412282
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1296128{col 26}{space 2}  .094269{col 37}{space 1}    1.37{col 46}{space 3}0.169{col 54}{space 4}-.0551846{col 67}{space 3} .3144102
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}  .313134{col 26}{space 2} .0950431{col 37}{space 1}    3.29{col 46}{space 3}0.001{col 54}{space 4} .1268191{col 67}{space 3} .4994488
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .2851835{col 26}{space 2} .1284879{col 37}{space 1}    2.22{col 46}{space 3}0.026{col 54}{space 4} .0333061{col 67}{space 3}  .537061
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2} .0501806{col 26}{space 2} 1.254591{col 37}{space 1}    0.04{col 46}{space 3}0.968{col 54}{space 4} -2.40922{col 67}{space 3} 2.509581
{txt}{space 9}AR  {c |}{col 14}{res}{space 2} .0150297{col 26}{space 2} 1.277871{col 37}{space 1}    0.01{col 46}{space 3}0.991{col 54}{space 4}-2.490006{col 67}{space 3} 2.520066
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}  .223147{col 26}{space 2}  1.24636{col 37}{space 1}    0.18{col 46}{space 3}0.858{col 54}{space 4}-2.220118{col 67}{space 3} 2.666412
{txt}{space 9}CA  {c |}{col 14}{res}{space 2} .3288438{col 26}{space 2} 1.229732{col 37}{space 1}    0.27{col 46}{space 3}0.789{col 54}{space 4}-2.081824{col 67}{space 3} 2.739512
{txt}{space 9}CO  {c |}{col 14}{res}{space 2} .1818542{col 26}{space 2} 1.242711{col 37}{space 1}    0.15{col 46}{space 3}0.884{col 54}{space 4}-2.254257{col 67}{space 3} 2.617965
{txt}{space 9}CT  {c |}{col 14}{res}{space 2} -.024447{col 26}{space 2} 1.253113{col 37}{space 1}   -0.02{col 46}{space 3}0.984{col 54}{space 4}-2.480949{col 67}{space 3} 2.432055
{txt}{space 9}DC  {c |}{col 14}{res}{space 2} .4879277{col 26}{space 2} 1.312798{col 37}{space 1}    0.37{col 46}{space 3}0.710{col 54}{space 4}-2.085577{col 67}{space 3} 3.061432
{txt}{space 9}DE  {c |}{col 14}{res}{space 2} .7799998{col 26}{space 2} 1.367939{col 37}{space 1}    0.57{col 46}{space 3}0.569{col 54}{space 4}-1.901599{col 67}{space 3} 3.461599
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-.0931065{col 26}{space 2} 1.231883{col 37}{space 1}   -0.08{col 46}{space 3}0.940{col 54}{space 4}-2.507991{col 67}{space 3} 2.321778
{txt}{space 9}GA  {c |}{col 14}{res}{space 2} .0178891{col 26}{space 2} 1.237838{col 37}{space 1}    0.01{col 46}{space 3}0.988{col 54}{space 4} -2.40867{col 67}{space 3} 2.444448
{txt}{space 9}HI  {c |}{col 14}{res}{space 2} .5864005{col 26}{space 2} 1.381671{col 37}{space 1}    0.42{col 46}{space 3}0.671{col 54}{space 4}-2.122116{col 67}{space 3} 3.294917
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-.3020508{col 26}{space 2} 1.244807{col 37}{space 1}   -0.24{col 46}{space 3}0.808{col 54}{space 4}-2.742272{col 67}{space 3}  2.13817
{txt}{space 9}ID  {c |}{col 14}{res}{space 2} .3755184{col 26}{space 2} 1.283952{col 37}{space 1}    0.29{col 46}{space 3}0.770{col 54}{space 4}-2.141439{col 67}{space 3} 2.892476
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-.0798297{col 26}{space 2} 1.231553{col 37}{space 1}   -0.06{col 46}{space 3}0.948{col 54}{space 4}-2.494068{col 67}{space 3} 2.334409
{txt}{space 9}IN  {c |}{col 14}{res}{space 2} .0383315{col 26}{space 2} 1.240535{col 37}{space 1}    0.03{col 46}{space 3}0.975{col 54}{space 4}-2.393513{col 67}{space 3} 2.470176
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-.4752033{col 26}{space 2} 1.254386{col 37}{space 1}   -0.38{col 46}{space 3}0.705{col 54}{space 4}-2.934201{col 67}{space 3} 1.983795
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-.5998899{col 26}{space 2} 1.247174{col 37}{space 1}   -0.48{col 46}{space 3}0.631{col 54}{space 4} -3.04475{col 67}{space 3} 1.844971
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-.0470097{col 26}{space 2} 1.263765{col 37}{space 1}   -0.04{col 46}{space 3}0.970{col 54}{space 4}-2.524394{col 67}{space 3} 2.430375
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}   .19756{col 26}{space 2} 1.236288{col 37}{space 1}    0.16{col 46}{space 3}0.873{col 54}{space 4} -2.22596{col 67}{space 3}  2.62108
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-.2293241{col 26}{space 2} 1.239364{col 37}{space 1}   -0.19{col 46}{space 3}0.853{col 54}{space 4}-2.658874{col 67}{space 3} 2.200226
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-.0967853{col 26}{space 2} 1.279908{col 37}{space 1}   -0.08{col 46}{space 3}0.940{col 54}{space 4}-2.605815{col 67}{space 3} 2.412244
{txt}{space 9}MI  {c |}{col 14}{res}{space 2} .0011522{col 26}{space 2} 1.235113{col 37}{space 1}    0.00{col 46}{space 3}0.999{col 54}{space 4}-2.420065{col 67}{space 3} 2.422369
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-.1082272{col 26}{space 2} 1.239298{col 37}{space 1}   -0.09{col 46}{space 3}0.930{col 54}{space 4}-2.537649{col 67}{space 3} 2.321194
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-.0422425{col 26}{space 2} 1.241532{col 37}{space 1}   -0.03{col 46}{space 3}0.973{col 54}{space 4}-2.476043{col 67}{space 3} 2.391558
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-.2652936{col 26}{space 2} 1.275568{col 37}{space 1}   -0.21{col 46}{space 3}0.835{col 54}{space 4}-2.765815{col 67}{space 3} 2.235228
{txt}{space 9}MT  {c |}{col 14}{res}{space 2} .1120563{col 26}{space 2}  1.35832{col 37}{space 1}    0.08{col 46}{space 3}0.934{col 54}{space 4}-2.550685{col 67}{space 3} 2.774798
{txt}{space 9}NC  {c |}{col 14}{res}{space 2} .2958365{col 26}{space 2} 1.238269{col 37}{space 1}    0.24{col 46}{space 3}0.811{col 54}{space 4}-2.131567{col 67}{space 3}  2.72324
{txt}{space 9}ND  {c |}{col 14}{res}{space 2} .2216058{col 26}{space 2} 1.384609{col 37}{space 1}    0.16{col 46}{space 3}0.873{col 54}{space 4}-2.492671{col 67}{space 3} 2.935882
{txt}{space 9}NE  {c |}{col 14}{res}{space 2} .1427132{col 26}{space 2} 1.257184{col 37}{space 1}    0.11{col 46}{space 3}0.910{col 54}{space 4}-2.321771{col 67}{space 3} 2.607197
{txt}{space 9}NH  {c |}{col 14}{res}{space 2} -.314905{col 26}{space 2} 1.276542{col 37}{space 1}   -0.25{col 46}{space 3}0.805{col 54}{space 4}-2.817336{col 67}{space 3} 2.187526
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-.2580835{col 26}{space 2} 1.234331{col 37}{space 1}   -0.21{col 46}{space 3}0.834{col 54}{space 4}-2.677767{col 67}{space 3}   2.1616
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-1.058516{col 26}{space 2} 1.286225{col 37}{space 1}   -0.82{col 46}{space 3}0.411{col 54}{space 4}-3.579927{col 67}{space 3} 1.462896
{txt}{space 9}NV  {c |}{col 14}{res}{space 2} .9253142{col 26}{space 2} 1.290755{col 37}{space 1}    0.72{col 46}{space 3}0.473{col 54}{space 4}-1.604978{col 67}{space 3} 3.455606
{txt}{space 9}NY  {c |}{col 14}{res}{space 2} .0047239{col 26}{space 2} 1.230947{col 37}{space 1}    0.00{col 46}{space 3}0.997{col 54}{space 4}-2.408326{col 67}{space 3} 2.417774
{txt}{space 9}OH  {c |}{col 14}{res}{space 2} .0511413{col 26}{space 2} 1.232648{col 37}{space 1}    0.04{col 46}{space 3}0.967{col 54}{space 4}-2.365244{col 67}{space 3} 2.467526
{txt}{space 9}OK  {c |}{col 14}{res}{space 2} .3044028{col 26}{space 2}   1.2735{col 37}{space 1}    0.24{col 46}{space 3}0.811{col 54}{space 4}-2.192065{col 67}{space 3} 2.800871
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-.1489258{col 26}{space 2} 1.242398{col 37}{space 1}   -0.12{col 46}{space 3}0.905{col 54}{space 4}-2.584424{col 67}{space 3} 2.286572
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-.3145928{col 26}{space 2}   1.2299{col 37}{space 1}   -0.26{col 46}{space 3}0.798{col 54}{space 4} -2.72559{col 67}{space 3} 2.096405
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-.1399922{col 26}{space 2} 1.303268{col 37}{space 1}   -0.11{col 46}{space 3}0.914{col 54}{space 4}-2.694815{col 67}{space 3} 2.414831
{txt}{space 9}SC  {c |}{col 14}{res}{space 2} .5020682{col 26}{space 2} 1.266574{col 37}{space 1}    0.40{col 46}{space 3}0.692{col 54}{space 4}-1.980822{col 67}{space 3} 2.984959
{txt}{space 9}SD  {c |}{col 14}{res}{space 2} 2.069557{col 26}{space 2} 1.441316{col 37}{space 1}    1.44{col 46}{space 3}0.151{col 54}{space 4}-.7558842{col 67}{space 3} 4.894999
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-.0406702{col 26}{space 2} 1.243926{col 37}{space 1}   -0.03{col 46}{space 3}0.974{col 54}{space 4}-2.479163{col 67}{space 3} 2.397823
{txt}{space 9}TX  {c |}{col 14}{res}{space 2} .3798952{col 26}{space 2} 1.230485{col 37}{space 1}    0.31{col 46}{space 3}0.758{col 54}{space 4} -2.03225{col 67}{space 3}  2.79204
{txt}{space 9}UT  {c |}{col 14}{res}{space 2} .2403412{col 26}{space 2} 1.270383{col 37}{space 1}    0.19{col 46}{space 3}0.850{col 54}{space 4}-2.250016{col 67}{space 3} 2.730698
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}-.0000995{col 26}{space 2}  1.23816{col 37}{space 1}   -0.00{col 46}{space 3}1.000{col 54}{space 4}-2.427289{col 67}{space 3}  2.42709
{txt}{space 9}VT  {c |}{col 14}{res}{space 2} .7902767{col 26}{space 2} 1.310396{col 37}{space 1}    0.60{col 46}{space 3}0.546{col 54}{space 4}-1.778518{col 67}{space 3} 3.359072
{txt}{space 9}WA  {c |}{col 14}{res}{space 2} .2185384{col 26}{space 2} 1.239908{col 37}{space 1}    0.18{col 46}{space 3}0.860{col 54}{space 4}-2.212078{col 67}{space 3} 2.649155
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-.0310408{col 26}{space 2} 1.240808{col 37}{space 1}   -0.03{col 46}{space 3}0.980{col 54}{space 4}-2.463422{col 67}{space 3}  2.40134
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-.0152829{col 26}{space 2} 1.320699{col 37}{space 1}   -0.01{col 46}{space 3}0.991{col 54}{space 4}-2.604275{col 67}{space 3} 2.573709
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-1.044332{col 26}{space 2} 1.269332{col 37}{space 1}   -0.82{col 46}{space 3}0.411{col 54}{space 4}-3.532629{col 67}{space 3} 1.443965
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.498446{col 26}{space 2} 1.252194{col 37}{space 1}    2.00{col 46}{space 3}0.046{col 54}{space 4} .0437441{col 67}{space 3} 4.953148
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est7{txt} stored)

Linear regression                                      Number of obs ={res}    6725
                                                       {txt}F( 71,  6653) ={res}    3.77
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0373
                                                       {txt}Root MSE      = {res} 2.4181

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}    Q24_mean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2}-.1925971{col 26}{space 2} .1580524{col 37}{space 1}   -1.22{col 46}{space 3}0.223{col 54}{space 4}-.5024304{col 67}{space 3} .1172362
{txt}{space 8}Old  {c |}{col 14}{res}{space 2}-.1936899{col 26}{space 2} .2335646{col 37}{space 1}   -0.83{col 46}{space 3}0.407{col 54}{space 4}-.6515514{col 67}{space 3} .2641716
{txt}{space 12} {c |}
{space 7}edu_g {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .0112103{col 26}{space 2} .1138366{col 37}{space 1}    0.10{col 46}{space 3}0.922{col 54}{space 4} -.211946{col 67}{space 3} .2343666
{txt}{space 10}2  {c |}{col 14}{res}{space 2} .0870215{col 26}{space 2} .1108398{col 37}{space 1}    0.79{col 46}{space 3}0.432{col 54}{space 4}  -.13026{col 67}{space 3} .3043031
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2}-.1272627{col 26}{space 2} .0931253{col 37}{space 1}   -1.37{col 46}{space 3}0.172{col 54}{space 4}-.3098182{col 67}{space 3} .0552928
{txt}High Income  {c |}{col 14}{res}{space 2} .1853048{col 26}{space 2} .0935315{col 37}{space 1}    1.98{col 46}{space 3}0.048{col 54}{space 4}  .001953{col 67}{space 3} .3686566
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2} .0334006{col 26}{space 2} .1749366{col 37}{space 1}    0.19{col 46}{space 3}0.849{col 54}{space 4}-.3095313{col 67}{space 3} .3763325
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} .3697166{col 26}{space 2} .2399965{col 37}{space 1}    1.54{col 46}{space 3}0.123{col 54}{space 4}-.1007536{col 67}{space 3} .8401867
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2}  .267166{col 26}{space 2} .0973894{col 37}{space 1}    2.74{col 46}{space 3}0.006{col 54}{space 4} .0762515{col 67}{space 3} .4580805
{txt}{space 7}2015  {c |}{col 14}{res}{space 2} .2324746{col 26}{space 2} .0947657{col 37}{space 1}    2.45{col 46}{space 3}0.014{col 54}{space 4} .0467034{col 67}{space 3} .4182459
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}  .138707{col 26}{space 2} .0942626{col 37}{space 1}    1.47{col 46}{space 3}0.141{col 54}{space 4}-.0460778{col 67}{space 3} .3234918
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .3183792{col 26}{space 2} .0951692{col 37}{space 1}    3.35{col 46}{space 3}0.001{col 54}{space 4} .1318171{col 67}{space 3} .5049412
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .2929416{col 26}{space 2}  .128001{col 37}{space 1}    2.29{col 46}{space 3}0.022{col 54}{space 4} .0420187{col 67}{space 3} .5438645
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2}  .136778{col 26}{space 2} 1.225665{col 37}{space 1}    0.11{col 46}{space 3}0.911{col 54}{space 4}-2.265919{col 67}{space 3} 2.539475
{txt}{space 9}AR  {c |}{col 14}{res}{space 2} .0908924{col 26}{space 2} 1.249031{col 37}{space 1}    0.07{col 46}{space 3}0.942{col 54}{space 4}-2.357608{col 67}{space 3} 2.539393
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2} .3325091{col 26}{space 2} 1.217103{col 37}{space 1}    0.27{col 46}{space 3}0.785{col 54}{space 4}-2.053402{col 67}{space 3}  2.71842
{txt}{space 9}CA  {c |}{col 14}{res}{space 2} .4025268{col 26}{space 2}  1.19974{col 37}{space 1}    0.34{col 46}{space 3}0.737{col 54}{space 4}-1.949348{col 67}{space 3} 2.754402
{txt}{space 9}CO  {c |}{col 14}{res}{space 2} .2568945{col 26}{space 2}  1.21277{col 37}{space 1}    0.21{col 46}{space 3}0.832{col 54}{space 4}-2.120523{col 67}{space 3} 2.634312
{txt}{space 9}CT  {c |}{col 14}{res}{space 2} .0783872{col 26}{space 2} 1.223338{col 37}{space 1}    0.06{col 46}{space 3}0.949{col 54}{space 4}-2.319748{col 67}{space 3} 2.476523
{txt}{space 9}DC  {c |}{col 14}{res}{space 2} .5813034{col 26}{space 2}   1.2862{col 37}{space 1}    0.45{col 46}{space 3}0.651{col 54}{space 4}-1.940061{col 67}{space 3} 3.102668
{txt}{space 9}DE  {c |}{col 14}{res}{space 2} .8518658{col 26}{space 2} 1.340333{col 37}{space 1}    0.64{col 46}{space 3}0.525{col 54}{space 4}-1.775616{col 67}{space 3} 3.479348
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-.0069966{col 26}{space 2} 1.201809{col 37}{space 1}   -0.01{col 46}{space 3}0.995{col 54}{space 4}-2.362927{col 67}{space 3} 2.348934
{txt}{space 9}GA  {c |}{col 14}{res}{space 2} .0786888{col 26}{space 2} 1.208888{col 37}{space 1}    0.07{col 46}{space 3}0.948{col 54}{space 4} -2.29112{col 67}{space 3} 2.448497
{txt}{space 9}HI  {c |}{col 14}{res}{space 2} .8366549{col 26}{space 2} 1.383964{col 37}{space 1}    0.60{col 46}{space 3}0.546{col 54}{space 4}-1.876357{col 67}{space 3} 3.549667
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-.2316091{col 26}{space 2} 1.214978{col 37}{space 1}   -0.19{col 46}{space 3}0.849{col 54}{space 4}-2.613355{col 67}{space 3} 2.150137
{txt}{space 9}ID  {c |}{col 14}{res}{space 2} .4460494{col 26}{space 2} 1.256162{col 37}{space 1}    0.36{col 46}{space 3}0.723{col 54}{space 4}-2.016431{col 67}{space 3}  2.90853
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-.0023361{col 26}{space 2} 1.201668{col 37}{space 1}   -0.00{col 46}{space 3}0.998{col 54}{space 4} -2.35799{col 67}{space 3} 2.353318
{txt}{space 9}IN  {c |}{col 14}{res}{space 2} .0949004{col 26}{space 2} 1.210947{col 37}{space 1}    0.08{col 46}{space 3}0.938{col 54}{space 4}-2.278943{col 67}{space 3} 2.468744
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-.3836898{col 26}{space 2} 1.225768{col 37}{space 1}   -0.31{col 46}{space 3}0.754{col 54}{space 4}-2.786587{col 67}{space 3} 2.019208
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-.5158963{col 26}{space 2} 1.217892{col 37}{space 1}   -0.42{col 46}{space 3}0.672{col 54}{space 4}-2.903355{col 67}{space 3} 1.871562
{txt}{space 9}LA  {c |}{col 14}{res}{space 2} .0162811{col 26}{space 2} 1.234812{col 37}{space 1}    0.01{col 46}{space 3}0.989{col 54}{space 4}-2.404347{col 67}{space 3} 2.436909
{txt}{space 9}MA  {c |}{col 14}{res}{space 2} .2928118{col 26}{space 2}  1.20644{col 37}{space 1}    0.24{col 46}{space 3}0.808{col 54}{space 4}-2.072198{col 67}{space 3} 2.657822
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-.1277201{col 26}{space 2} 1.209902{col 37}{space 1}   -0.11{col 46}{space 3}0.916{col 54}{space 4}-2.499516{col 67}{space 3} 2.244075
{txt}{space 9}ME  {c |}{col 14}{res}{space 2} .0000509{col 26}{space 2} 1.250357{col 37}{space 1}    0.00{col 46}{space 3}1.000{col 54}{space 4}-2.451049{col 67}{space 3} 2.451151
{txt}{space 9}MI  {c |}{col 14}{res}{space 2} .0631351{col 26}{space 2} 1.205308{col 37}{space 1}    0.05{col 46}{space 3}0.958{col 54}{space 4}-2.299654{col 67}{space 3} 2.425924
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-.0298036{col 26}{space 2} 1.209565{col 37}{space 1}   -0.02{col 46}{space 3}0.980{col 54}{space 4}-2.400939{col 67}{space 3} 2.341332
{txt}{space 9}MO  {c |}{col 14}{res}{space 2} .0522161{col 26}{space 2} 1.212043{col 37}{space 1}    0.04{col 46}{space 3}0.966{col 54}{space 4}-2.323777{col 67}{space 3} 2.428209
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-.1834209{col 26}{space 2} 1.246756{col 37}{space 1}   -0.15{col 46}{space 3}0.883{col 54}{space 4}-2.627463{col 67}{space 3} 2.260621
{txt}{space 9}MT  {c |}{col 14}{res}{space 2} .2156082{col 26}{space 2} 1.334611{col 37}{space 1}    0.16{col 46}{space 3}0.872{col 54}{space 4}-2.400657{col 67}{space 3} 2.831873
{txt}{space 9}NC  {c |}{col 14}{res}{space 2} .3725655{col 26}{space 2} 1.208543{col 37}{space 1}    0.31{col 46}{space 3}0.758{col 54}{space 4}-1.996567{col 67}{space 3} 2.741698
{txt}{space 9}ND  {c |}{col 14}{res}{space 2} .3198594{col 26}{space 2} 1.358191{col 37}{space 1}    0.24{col 46}{space 3}0.814{col 54}{space 4} -2.34263{col 67}{space 3} 2.982349
{txt}{space 9}NE  {c |}{col 14}{res}{space 2} .2319332{col 26}{space 2} 1.228083{col 37}{space 1}    0.19{col 46}{space 3}0.850{col 54}{space 4}-2.175504{col 67}{space 3}  2.63937
{txt}{space 9}NH  {c |}{col 14}{res}{space 2} -.202663{col 26}{space 2} 1.246714{col 37}{space 1}   -0.16{col 46}{space 3}0.871{col 54}{space 4}-2.646623{col 67}{space 3} 2.241297
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-.1880933{col 26}{space 2} 1.204567{col 37}{space 1}   -0.16{col 46}{space 3}0.876{col 54}{space 4} -2.54943{col 67}{space 3} 2.173244
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-.9722344{col 26}{space 2} 1.259195{col 37}{space 1}   -0.77{col 46}{space 3}0.440{col 54}{space 4} -3.44066{col 67}{space 3} 1.496191
{txt}{space 9}NV  {c |}{col 14}{res}{space 2} .9986827{col 26}{space 2} 1.261392{col 37}{space 1}    0.79{col 46}{space 3}0.429{col 54}{space 4} -1.47405{col 67}{space 3} 3.471415
{txt}{space 9}NY  {c |}{col 14}{res}{space 2} .0754594{col 26}{space 2} 1.200877{col 37}{space 1}    0.06{col 46}{space 3}0.950{col 54}{space 4}-2.278645{col 67}{space 3} 2.429564
{txt}{space 9}OH  {c |}{col 14}{res}{space 2} .1094225{col 26}{space 2} 1.202754{col 37}{space 1}    0.09{col 46}{space 3}0.928{col 54}{space 4} -2.24836{col 67}{space 3} 2.467205
{txt}{space 9}OK  {c |}{col 14}{res}{space 2} .3969591{col 26}{space 2} 1.244747{col 37}{space 1}    0.32{col 46}{space 3}0.750{col 54}{space 4}-2.043144{col 67}{space 3} 2.837062
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-.0533051{col 26}{space 2} 1.212546{col 37}{space 1}   -0.04{col 46}{space 3}0.965{col 54}{space 4}-2.430284{col 67}{space 3} 2.323674
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-.2260057{col 26}{space 2} 1.200091{col 37}{space 1}   -0.19{col 46}{space 3}0.851{col 54}{space 4}-2.578569{col 67}{space 3} 2.126558
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-.1078854{col 26}{space 2} 1.273976{col 37}{space 1}   -0.08{col 46}{space 3}0.933{col 54}{space 4}-2.605286{col 67}{space 3} 2.389515
{txt}{space 9}SC  {c |}{col 14}{res}{space 2} .5872445{col 26}{space 2} 1.237335{col 37}{space 1}    0.47{col 46}{space 3}0.635{col 54}{space 4}-1.838329{col 67}{space 3} 3.012818
{txt}{space 9}SD  {c |}{col 14}{res}{space 2} 2.123739{col 26}{space 2} 1.415764{col 37}{space 1}    1.50{col 46}{space 3}0.134{col 54}{space 4}-.6516127{col 67}{space 3} 4.899091
{txt}{space 9}TN  {c |}{col 14}{res}{space 2} .0302125{col 26}{space 2} 1.214386{col 37}{space 1}    0.02{col 46}{space 3}0.980{col 54}{space 4}-2.350374{col 67}{space 3} 2.410799
{txt}{space 9}TX  {c |}{col 14}{res}{space 2} .4770147{col 26}{space 2} 1.200858{col 37}{space 1}    0.40{col 46}{space 3}0.691{col 54}{space 4}-1.877052{col 67}{space 3} 2.831082
{txt}{space 9}UT  {c |}{col 14}{res}{space 2} .2950242{col 26}{space 2}  1.24138{col 37}{space 1}    0.24{col 46}{space 3}0.812{col 54}{space 4}-2.138478{col 67}{space 3} 2.728527
{txt}{space 9}VA  {c |}{col 14}{res}{space 2} .0640562{col 26}{space 2} 1.208375{col 37}{space 1}    0.05{col 46}{space 3}0.958{col 54}{space 4}-2.304745{col 67}{space 3} 2.432858
{txt}{space 9}VT  {c |}{col 14}{res}{space 2} .8703951{col 26}{space 2} 1.278258{col 37}{space 1}    0.68{col 46}{space 3}0.496{col 54}{space 4}-1.635401{col 67}{space 3} 3.376191
{txt}{space 9}WA  {c |}{col 14}{res}{space 2}  .292428{col 26}{space 2} 1.209398{col 37}{space 1}    0.24{col 46}{space 3}0.809{col 54}{space 4} -2.07838{col 67}{space 3} 2.663236
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}  .067276{col 26}{space 2} 1.210929{col 37}{space 1}    0.06{col 46}{space 3}0.956{col 54}{space 4}-2.306533{col 67}{space 3} 2.441085
{txt}{space 9}WV  {c |}{col 14}{res}{space 2} .0314211{col 26}{space 2} 1.289978{col 37}{space 1}    0.02{col 46}{space 3}0.981{col 54}{space 4} -2.49735{col 67}{space 3} 2.560192
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-.9748605{col 26}{space 2} 1.244843{col 37}{space 1}   -0.78{col 46}{space 3}0.434{col 54}{space 4}-3.415152{col 67}{space 3} 1.465431
{txt}{space 12} {c |}
{space 7}2.Q33 {c |}{col 14}{res}{space 2} .2987796{col 26}{space 2} .0607707{col 37}{space 1}    4.92{col 46}{space 3}0.000{col 54}{space 4} .1796496{col 67}{space 3} .4179097
{txt}{space 7}2.Q34 {c |}{col 14}{res}{space 2} .0223987{col 26}{space 2} .1223595{col 37}{space 1}    0.18{col 46}{space 3}0.855{col 54}{space 4}-.2174651{col 67}{space 3} .2622625
{txt}{space 7}Q35_1 {c |}{col 14}{res}{space 2} .2682735{col 26}{space 2} .1939087{col 37}{space 1}    1.38{col 46}{space 3}0.167{col 54}{space 4}-.1118496{col 67}{space 3} .6483967
{txt}{space 7}Q35_2 {c |}{col 14}{res}{space 2} .3266623{col 26}{space 2} .2018188{col 37}{space 1}    1.62{col 46}{space 3}0.106{col 54}{space 4}-.0689672{col 67}{space 3} .7222918
{txt}{space 7}Q35_3 {c |}{col 14}{res}{space 2} .1025192{col 26}{space 2} .2165831{col 37}{space 1}    0.47{col 46}{space 3}0.636{col 54}{space 4}-.3220531{col 67}{space 3} .5270914
{txt}{space 7}Q35_4 {c |}{col 14}{res}{space 2} .4714031{col 26}{space 2} .2269249{col 37}{space 1}    2.08{col 46}{space 3}0.038{col 54}{space 4} .0265576{col 67}{space 3} .9162486
{txt}{space 7}Q35_5 {c |}{col 14}{res}{space 2}-.6069856{col 26}{space 2} .3830848{col 37}{space 1}   -1.58{col 46}{space 3}0.113{col 54}{space 4}-1.357955{col 67}{space 3} .1439834
{txt}{space 7}Q35_6 {c |}{col 14}{res}{space 2} .3266098{col 26}{space 2} .2159059{col 37}{space 1}    1.51{col 46}{space 3}0.130{col 54}{space 4}-.0966349{col 67}{space 3} .7498545
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.008369{col 26}{space 2} 1.254243{col 37}{space 1}    1.60{col 46}{space 3}0.109{col 54}{space 4}-.4503496{col 67}{space 3} 4.467088
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est8{txt} stored)

Linear regression                                      Number of obs ={res}    5802
                                                       {txt}F( 75,  5726) ={res}    5.83
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0688
                                                       {txt}Root MSE      = {res} 2.2528

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}    Q24_mean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2}-.2508556{col 26}{space 2} .1628595{col 37}{space 1}   -1.54{col 46}{space 3}0.124{col 54}{space 4}-.5701218{col 67}{space 3} .0684106
{txt}{space 8}Old  {c |}{col 14}{res}{space 2}-.2514671{col 26}{space 2} .2447101{col 37}{space 1}   -1.03{col 46}{space 3}0.304{col 54}{space 4}-.7311915{col 67}{space 3} .2282573
{txt}{space 12} {c |}
{space 7}edu_g {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .0563441{col 26}{space 2} .1135453{col 37}{space 1}    0.50{col 46}{space 3}0.620{col 54}{space 4}-.1662476{col 67}{space 3} .2789358
{txt}{space 10}2  {c |}{col 14}{res}{space 2} .0869557{col 26}{space 2} .1098009{col 37}{space 1}    0.79{col 46}{space 3}0.428{col 54}{space 4}-.1282956{col 67}{space 3} .3022071
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2}-.1644347{col 26}{space 2} .0959849{col 37}{space 1}   -1.71{col 46}{space 3}0.087{col 54}{space 4}-.3526014{col 67}{space 3} .0237319
{txt}High Income  {c |}{col 14}{res}{space 2} .0929756{col 26}{space 2}   .09636{col 37}{space 1}    0.96{col 46}{space 3}0.335{col 54}{space 4}-.0959265{col 67}{space 3} .2818777
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2} .2069941{col 26}{space 2} .1834137{col 37}{space 1}    1.13{col 46}{space 3}0.259{col 54}{space 4}-.1525662{col 67}{space 3} .5665543
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} .5005948{col 26}{space 2} .2496897{col 37}{space 1}    2.00{col 46}{space 3}0.045{col 54}{space 4} .0111085{col 67}{space 3} .9900811
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2} .1437994{col 26}{space 2} .0979765{col 37}{space 1}    1.47{col 46}{space 3}0.142{col 54}{space 4}-.0482716{col 67}{space 3} .3358704
{txt}{space 7}2015  {c |}{col 14}{res}{space 2}   .16742{col 26}{space 2} .0951259{col 37}{space 1}    1.76{col 46}{space 3}0.078{col 54}{space 4}-.0190627{col 67}{space 3} .3539026
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1293388{col 26}{space 2} .0948759{col 37}{space 1}    1.36{col 46}{space 3}0.173{col 54}{space 4}-.0566539{col 67}{space 3} .3153314
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .2837798{col 26}{space 2} .0971389{col 37}{space 1}    2.92{col 46}{space 3}0.003{col 54}{space 4} .0933508{col 67}{space 3} .4742088
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1944466{col 26}{space 2} .1284194{col 37}{space 1}    1.51{col 46}{space 3}0.130{col 54}{space 4}-.0573041{col 67}{space 3} .4461973
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2} -2.38711{col 26}{space 2} .9833995{col 37}{space 1}   -2.43{col 46}{space 3}0.015{col 54}{space 4}-4.314945{col 67}{space 3}-.4592747
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-2.682333{col 26}{space 2} 1.019021{col 37}{space 1}   -2.63{col 46}{space 3}0.009{col 54}{space 4}    -4.68{col 67}{space 3}-.6846652
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-2.493827{col 26}{space 2} .9703438{col 37}{space 1}   -2.57{col 46}{space 3}0.010{col 54}{space 4}-4.396068{col 67}{space 3}-.5915862
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-2.386329{col 26}{space 2} .9503965{col 37}{space 1}   -2.51{col 46}{space 3}0.012{col 54}{space 4}-4.249466{col 67}{space 3}-.5231923
{txt}{space 9}CO  {c |}{col 14}{res}{space 2}-2.550826{col 26}{space 2} .9658457{col 37}{space 1}   -2.64{col 46}{space 3}0.008{col 54}{space 4}-4.444249{col 67}{space 3}-.6574031
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-2.638174{col 26}{space 2} .9726528{col 37}{space 1}   -2.71{col 46}{space 3}0.007{col 54}{space 4}-4.544942{col 67}{space 3} -.731407
{txt}{space 9}DC  {c |}{col 14}{res}{space 2}-2.174866{col 26}{space 2}  1.06489{col 37}{space 1}   -2.04{col 46}{space 3}0.041{col 54}{space 4}-4.262452{col 67}{space 3}-.0872796
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-2.112893{col 26}{space 2} 1.142331{col 37}{space 1}   -1.85{col 46}{space 3}0.064{col 54}{space 4}-4.352294{col 67}{space 3} .1265074
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-2.869865{col 26}{space 2} .9519157{col 37}{space 1}   -3.01{col 46}{space 3}0.003{col 54}{space 4} -4.73598{col 67}{space 3} -1.00375
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-2.647445{col 26}{space 2} .9589193{col 37}{space 1}   -2.76{col 46}{space 3}0.006{col 54}{space 4} -4.52729{col 67}{space 3}-.7676003
{txt}{space 9}HI  {c |}{col 14}{res}{space 2}-2.688202{col 26}{space 2} 1.113866{col 37}{space 1}   -2.41{col 46}{space 3}0.016{col 54}{space 4}  -4.8718{col 67}{space 3}-.5046035
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-2.860449{col 26}{space 2} .9701607{col 37}{space 1}   -2.95{col 46}{space 3}0.003{col 54}{space 4}-4.762331{col 67}{space 3}-.9585673
{txt}{space 9}ID  {c |}{col 14}{res}{space 2}-2.150598{col 26}{space 2} 1.017958{col 37}{space 1}   -2.11{col 46}{space 3}0.035{col 54}{space 4} -4.14618{col 67}{space 3} -.155016
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-2.735802{col 26}{space 2}  .950608{col 37}{space 1}   -2.88{col 46}{space 3}0.004{col 54}{space 4}-4.599354{col 67}{space 3}-.8722508
{txt}{space 9}IN  {c |}{col 14}{res}{space 2}-2.704784{col 26}{space 2} .9633635{col 37}{space 1}   -2.81{col 46}{space 3}0.005{col 54}{space 4}-4.593341{col 67}{space 3}-.8162268
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-2.924193{col 26}{space 2} .9844071{col 37}{space 1}   -2.97{col 46}{space 3}0.003{col 54}{space 4}-4.854004{col 67}{space 3}-.9943831
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-3.138541{col 26}{space 2} .9721023{col 37}{space 1}   -3.23{col 46}{space 3}0.001{col 54}{space 4}-5.044229{col 67}{space 3}-1.232853
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-2.853547{col 26}{space 2} .9903551{col 37}{space 1}   -2.88{col 46}{space 3}0.004{col 54}{space 4}-4.795018{col 67}{space 3}-.9120762
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-2.495796{col 26}{space 2}  .954361{col 37}{space 1}   -2.62{col 46}{space 3}0.009{col 54}{space 4}-4.366705{col 67}{space 3}-.6248875
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-2.895376{col 26}{space 2} .9619241{col 37}{space 1}   -3.01{col 46}{space 3}0.003{col 54}{space 4}-4.781111{col 67}{space 3}-1.009641
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-2.791904{col 26}{space 2} 1.004568{col 37}{space 1}   -2.78{col 46}{space 3}0.005{col 54}{space 4}-4.761238{col 67}{space 3}-.8225714
{txt}{space 9}MI  {c |}{col 14}{res}{space 2} -2.70864{col 26}{space 2} .9553158{col 37}{space 1}   -2.84{col 46}{space 3}0.005{col 54}{space 4}-4.581421{col 67}{space 3}-.8358599
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-2.841396{col 26}{space 2} .9624705{col 37}{space 1}   -2.95{col 46}{space 3}0.003{col 54}{space 4}-4.728203{col 67}{space 3}  -.95459
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-2.753039{col 26}{space 2} .9646866{col 37}{space 1}   -2.85{col 46}{space 3}0.004{col 54}{space 4} -4.64419{col 67}{space 3}-.8618886
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-3.152568{col 26}{space 2} .9810207{col 37}{space 1}   -3.21{col 46}{space 3}0.001{col 54}{space 4}-5.075739{col 67}{space 3}-1.229396
{txt}{space 9}MT  {c |}{col 14}{res}{space 2}-2.415259{col 26}{space 2} 1.145046{col 37}{space 1}   -2.11{col 46}{space 3}0.035{col 54}{space 4}-4.659983{col 67}{space 3}-.1705357
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-2.405903{col 26}{space 2} .9574765{col 37}{space 1}   -2.51{col 46}{space 3}0.012{col 54}{space 4}-4.282919{col 67}{space 3}-.5288864
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-2.459739{col 26}{space 2} 1.160003{col 37}{space 1}   -2.12{col 46}{space 3}0.034{col 54}{space 4}-4.733784{col 67}{space 3}-.1856947
{txt}{space 9}NE  {c |}{col 14}{res}{space 2}-2.640153{col 26}{space 2} .9843361{col 37}{space 1}   -2.68{col 46}{space 3}0.007{col 54}{space 4}-4.569825{col 67}{space 3}-.7104821
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-3.009846{col 26}{space 2} .9844932{col 37}{space 1}   -3.06{col 46}{space 3}0.002{col 54}{space 4}-4.939825{col 67}{space 3}-1.079867
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-2.900217{col 26}{space 2} .9563807{col 37}{space 1}   -3.03{col 46}{space 3}0.002{col 54}{space 4}-4.775085{col 67}{space 3}-1.025349
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-3.899273{col 26}{space 2} .9883274{col 37}{space 1}   -3.95{col 46}{space 3}0.000{col 54}{space 4}-5.836768{col 67}{space 3}-1.961777
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}-1.711431{col 26}{space 2} 1.031997{col 37}{space 1}   -1.66{col 46}{space 3}0.097{col 54}{space 4}-3.734535{col 67}{space 3} .3116725
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-2.692842{col 26}{space 2} .9504973{col 37}{space 1}   -2.83{col 46}{space 3}0.005{col 54}{space 4}-4.556176{col 67}{space 3}-.8295073
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-2.601746{col 26}{space 2} .9515324{col 37}{space 1}   -2.73{col 46}{space 3}0.006{col 54}{space 4} -4.46711{col 67}{space 3}-.7363827
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-2.426063{col 26}{space 2} 1.023897{col 37}{space 1}   -2.37{col 46}{space 3}0.018{col 54}{space 4}-4.433288{col 67}{space 3}-.4188372
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-2.863914{col 26}{space 2} .9639684{col 37}{space 1}   -2.97{col 46}{space 3}0.003{col 54}{space 4}-4.753657{col 67}{space 3}-.9741713
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-2.805298{col 26}{space 2} .9492874{col 37}{space 1}   -2.96{col 46}{space 3}0.003{col 54}{space 4}-4.666261{col 67}{space 3}-.9443358
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-2.657895{col 26}{space 2} 1.056693{col 37}{space 1}   -2.52{col 46}{space 3}0.012{col 54}{space 4}-4.729412{col 67}{space 3}-.5863777
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-2.394374{col 26}{space 2} .9967608{col 37}{space 1}   -2.40{col 46}{space 3}0.016{col 54}{space 4}-4.348403{col 67}{space 3}-.4403461
{txt}{space 9}SD  {c |}{col 14}{res}{space 2}-2.068812{col 26}{space 2} 1.177439{col 37}{space 1}   -1.76{col 46}{space 3}0.079{col 54}{space 4}-4.377037{col 67}{space 3} .2394137
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-2.654734{col 26}{space 2} .9680213{col 37}{space 1}   -2.74{col 46}{space 3}0.006{col 54}{space 4}-4.552422{col 67}{space 3}-.7570458
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-2.309094{col 26}{space 2}  .949727{col 37}{space 1}   -2.43{col 46}{space 3}0.015{col 54}{space 4}-4.170919{col 67}{space 3}  -.44727
{txt}{space 9}UT  {c |}{col 14}{res}{space 2}-2.477358{col 26}{space 2} .9955082{col 37}{space 1}   -2.49{col 46}{space 3}0.013{col 54}{space 4}-4.428931{col 67}{space 3}-.5257852
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}-2.601026{col 26}{space 2} .9629646{col 37}{space 1}   -2.70{col 46}{space 3}0.007{col 54}{space 4}-4.488801{col 67}{space 3}-.7132514
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}-1.662759{col 26}{space 2}  1.03901{col 37}{space 1}   -1.60{col 46}{space 3}0.110{col 54}{space 4}-3.699612{col 67}{space 3} .3740947
{txt}{space 9}WA  {c |}{col 14}{res}{space 2}-2.471644{col 26}{space 2} .9603011{col 37}{space 1}   -2.57{col 46}{space 3}0.010{col 54}{space 4}-4.354198{col 67}{space 3}-.5890909
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-2.528937{col 26}{space 2} .9639174{col 37}{space 1}   -2.62{col 46}{space 3}0.009{col 54}{space 4} -4.41858{col 67}{space 3}-.6392944
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-3.132252{col 26}{space 2}  .994423{col 37}{space 1}   -3.15{col 46}{space 3}0.002{col 54}{space 4}-5.081697{col 67}{space 3}-1.182807
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-3.750468{col 26}{space 2}  .992825{col 37}{space 1}   -3.78{col 46}{space 3}0.000{col 54}{space 4}-5.696781{col 67}{space 3}-1.804155
{txt}{space 12} {c |}
{space 7}2.Q33 {c |}{col 14}{res}{space 2} .2756245{col 26}{space 2} .0617577{col 37}{space 1}    4.46{col 46}{space 3}0.000{col 54}{space 4} .1545559{col 67}{space 3}  .396693
{txt}{space 7}2.Q34 {c |}{col 14}{res}{space 2} -.067354{col 26}{space 2}  .125406{col 37}{space 1}   -0.54{col 46}{space 3}0.591{col 54}{space 4}-.3131971{col 67}{space 3} .1784892
{txt}{space 7}Q35_1 {c |}{col 14}{res}{space 2} .2473375{col 26}{space 2} .2016486{col 37}{space 1}    1.23{col 46}{space 3}0.220{col 54}{space 4}  -.14797{col 67}{space 3} .6426451
{txt}{space 7}Q35_2 {c |}{col 14}{res}{space 2} .3000132{col 26}{space 2} .2073648{col 37}{space 1}    1.45{col 46}{space 3}0.148{col 54}{space 4}-.1065003{col 67}{space 3} .7065267
{txt}{space 7}Q35_3 {c |}{col 14}{res}{space 2} .2828287{col 26}{space 2}  .228513{col 37}{space 1}    1.24{col 46}{space 3}0.216{col 54}{space 4}-.1651433{col 67}{space 3} .7308008
{txt}{space 7}Q35_4 {c |}{col 14}{res}{space 2} .5573005{col 26}{space 2} .2346795{col 37}{space 1}    2.37{col 46}{space 3}0.018{col 54}{space 4} .0972399{col 67}{space 3} 1.017361
{txt}{space 7}Q35_5 {c |}{col 14}{res}{space 2}-.4639202{col 26}{space 2} .4363774{col 37}{space 1}   -1.06{col 46}{space 3}0.288{col 54}{space 4}-1.319385{col 67}{space 3} .3915446
{txt}{space 7}Q35_6 {c |}{col 14}{res}{space 2} .2137356{col 26}{space 2} .2217991{col 37}{space 1}    0.96{col 46}{space 3}0.335{col 54}{space 4}-.2210746{col 67}{space 3} .6485457
{txt}{space 7}Q4new {c |}{col 14}{res}{space 2}-.0050425{col 26}{space 2}  .001398{col 37}{space 1}   -3.61{col 46}{space 3}0.000{col 54}{space 4}-.0077832{col 67}{space 3}-.0023018
{txt}{space 7}Q6new {c |}{col 14}{res}{space 2} .0089841{col 26}{space 2} .0014363{col 37}{space 1}    6.26{col 46}{space 3}0.000{col 54}{space 4} .0061685{col 67}{space 3} .0117998
{txt}{space 5}Q9_mean {c |}{col 14}{res}{space 2} .0446554{col 26}{space 2} .0071006{col 37}{space 1}    6.29{col 46}{space 3}0.000{col 54}{space 4} .0307355{col 67}{space 3} .0585753
{txt}{space 6}Q13new {c |}{col 14}{res}{space 2}-.0118054{col 26}{space 2} .0015005{col 37}{space 1}   -7.87{col 46}{space 3}0.000{col 54}{space 4}-.0147469{col 67}{space 3}-.0088638
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 4.547331{col 26}{space 2} 1.015019{col 37}{space 1}    4.48{col 46}{space 3}0.000{col 54}{space 4} 2.557509{col 67}{space 3} 6.537153
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est9{txt} stored)

{com}. esttab using "${c -(}sum_table_folder{c )-}/mom_group.csv", ///
>              se r2 drop(0.age_g 0.edu_g 0.inc_g 0.cohort_g  *.year *state_id 1.Q33 1.Q34 _cons) ///
>                          label replace
{res}{txt}(output written to {browse  `"/Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/mom_group.csv"'})

{com}. 
. 
. log close 
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/Myworld/Dropbox/IncExpProject/WorkingFolder/indSCE_Est_log.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 2 Oct 2019, 15:36:30
{txt}{.-}
{smcl}
{txt}{sf}{ul off}