{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/Myworld/Dropbox/IncExpProject/WorkingFolder/indSCE_Est_log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}23 Apr 2021, 10:22:28
{txt}
{com}. 
. *********************************************************
. *** before working with SCE, clean the stock market data 
. ********************************************************
. 
. use "${c -(}mainfolder{c )-}/OtherData/sp500.dta",clear 
{txt}
{com}. 
. generate new_date = dofc(DATE)
{txt}
{com}. *format new_date %tm
. gen year = year(new_date)
{txt}
{com}. gen month = month(new_date)
{txt}
{com}. gen date_str = string(year)+ "m"+string(month)
{txt}
{com}. gen date = monthly(date_str,"YM")
{txt}
{com}. format date %tm
{txt}
{com}. drop DATE date_str year month new_date 
{txt}
{com}. label var sp500 "growth rate (%) of sp500 index from last month"
{txt}
{com}. save "${c -(}mainfolder{c )-}/OtherData/sp500M.dta",replace 
{txt}file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/OtherData/sp500M.dta saved

{com}. clear 
{txt}
{com}. 
. 
. ***************************
. **  Clean and Merge Data **
. ***************************
. 
. use "${c -(}folder{c )-}/SCE/IncExpSCEDstIndM",clear 
{txt}
{com}. 
. duplicates report year month userid

{p 0 4}{txt}Duplicates in terms of {res} year month userid{p_end}

{txt}{hline 10}{c TT}{hline 27}
   copies {c |} observations       surplus
{hline 10}{c +}{hline 27}
        1 {c |}        {res}98593             0
{txt}{hline 10}{c BT}{hline 27}

{com}. 
. ************************************************
. *** Merge with demographics and other moments **
. ************************************************
. 
. merge 1:1 year month userid using "${c -(}folder{c )-}/SCE/IncExpSCEProbIndM",keep(master match using) 
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}          98,593{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge hh_info_merge
{res}{txt}
{com}. 
. 
. ** format the date 
. drop date 
{txt}
{com}. gen date_str=string(year)+"m"+string(month) 
{txt}
{com}. gen date= monthly(date_str,"YM")
{txt}
{com}. format date %tm
{txt}
{com}. order userid date year month   
{txt}
{com}. 
. *************************************
. *** Merge with stock market data   **
. *************************************
. 
. merge m:1 date using "${c -(}mainfolder{c )-}/OtherData/sp500M.dta", keep(master match) 
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}          98,593{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge sp_merge
{res}{txt}
{com}. 
. *******************************
. **  Set Panel Data Structure **
. *******************************
. rename userid ID 
{res}{txt}
{com}. xtset ID date   /* this is not correct. ID is unique here.*/
{res}{txt}{col 8}panel variable:  {res}ID (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}date, 2013m6 to 2020m4, but with gaps
{txt}{col 17}delta:  {res}1 month
{txt}
{com}. sort ID year month 
{txt}
{com}. 
. *******************************
. ** Exclude extreme outliers 
. ******************************
. 
. keep if Q32 <= 65 & Q32 >= 20
{txt}(10376 observations deleted)

{com}. 
. *****************************************
. ****  Renaming so that more consistent **
. *****************************************
. 
. rename Q24_mean incmean
{res}{txt}
{com}. rename Q24_var incvar
{res}{txt}
{com}. rename Q24_iqr inciqr
{res}{txt}
{com}. rename IncSkew incskew 
{res}{txt}
{com}. rename Q24_rmean rincmean
{res}{txt}
{com}. rename Q24_rvar rincvar
{res}{txt}
{com}. 
. rename D6 HHinc 
{res}{txt}
{com}. rename Q32 age 
{res}{txt}
{com}. rename Q33 gender 
{res}{txt}
{com}. rename Q10_1 fulltime
{res}{txt}
{com}. rename Q10_2 parttime
{res}{txt}
{com}. rename Q12new selfemp
{res}{txt}
{com}. rename Q6new Stkprob
{res}{txt}
{com}. rename Q4new UEprobAgg
{res}{txt}
{com}. rename Q13new UEprobInd
{res}{txt}
{com}. rename Q26v2 spending_dum
{res}{txt}
{com}. rename Q26v2part2 spending 
{res}{txt}
{com}. 
. 
. ************************
. ** focus on non-zero skewness
. ****************************
. 
. replace incskew = . if incskew==0
{txt}(32933 real changes made, 32933 to missing)

{com}. 
. 
. *************************
. *** Exclude outliers *****
. *************************
. 
. local Moments incmean rincmean incvar rincvar inciqr incskew 
{txt}
{com}. 
. foreach var in `Moments'{c -(}
{txt}  2{com}.       egen `var'pl=pctile(`var'),p(1)
{txt}  3{com}.           egen `var'pu=pctile(`var'),p(99)
{txt}  4{com}.           replace `var' = . if `var' <`var'pl | (`var' >`var'pu & `var'!=.)
{txt}  5{com}. {c )-}
{txt}(1172 real changes made, 1172 to missing)
(1123 real changes made, 1123 to missing)
(3158 real changes made, 3158 to missing)
(831 real changes made, 831 to missing)
(1215 real changes made, 1215 to missing)
(588 real changes made, 588 to missing)

{com}. 
. /*
> * other thresholds 
> 
> foreach var in `Moments'{c -(}
>       egen `var'l_truc=pctile(`var'),p(8)
>           egen `var'u_truc=pctile(`var'),p(92)
>           replace `var' = . if `var' <`var'l_truc | (`var' >`var'u_truc & `var'!=.)
> {c )-}
> */
. 
. *****************************
. *** generate other vars *****
. *****************************
. 
. gen age_sq = age^2
{txt}
{com}. label var age_sq "Age-squared"
{txt}
{com}. 
. encode state, gen(state_id)
{txt}
{com}. label var state_id "state id"
{txt}
{com}. 
. *****************************
. *** generate group vars *****
. *****************************
. 
. *egen byear_g = cut(byear), group(4)
. 
. egen byear_5yr = cut(byear), ///
>      at(1945 1950 1955 1960 1965 1970 ///
>             1975 1980 1985 1990 1995 2000 ///
>                 2005 2010)
{txt}
{com}. label var byear_5yr "5-year cohort"
{txt}
{com}. 
. egen age_5yr = cut(age), ///
>      at(20 25 30 35 40 45 ///
>             50 55 60)
{txt}(15341 missing values generated)

{com}. label var age_5yr "5-year age"
{txt}
{com}. 
. gen byear_g = cond(byear>=1980,1,0)
{txt}
{com}. label define byearglb 0 "before 1980s" 1 "after 1980s"
{txt}
{com}. *label define byearglb 0 "1950s" 1 "1960s" 2 "1970s" 3 "1980s"
. label value byear_g byearlb
{txt}
{com}. 
. egen age_g = cut(age), group(3)  
{txt}
{com}. label var age_g "age group"
{txt}
{com}. label define agelb 0 "young" 1 "middle-age" 2 "old"
{txt}
{com}. label value age_g agelb
{txt}
{com}. 
. gen edu_g = . 
{txt}(88217 missing values generated)

{com}. replace edu_g = 1 if educ==1
{txt}(721 real changes made)

{com}. replace edu_g = 2 if educ==2 | educ ==3 | educ == 4
{txt}(38196 real changes made)

{com}. replace edu_g = 3 if educ <=9 & educ>4
{txt}(49300 real changes made)

{com}. 
. label var edu_g "education group"
{txt}
{com}. label define edu_glb 1 "HS dropout" 2 "HS graduate" 3 "College/above"
{txt}
{com}. label value edu_g edu_glb
{txt}
{com}. 
. label define gdlb 1 "Male" 2 "Female" 
{txt}
{com}. label value gender gdlb
{txt}
{com}. 
. egen HHinc_g = cut(HHinc), group(2)
{txt}(12278 missing values generated)

{com}. label var HHinc_g "Household income group"
{txt}
{com}. label define HHinc_glb 0 "low inc" 1 "high inc"
{txt}
{com}. label value HHinc_g HHinc_glb
{txt}
{com}. 
. label define gender_glb 1 "male" 2 "female"
{txt}
{com}. label value gender gender_glb
{txt}
{com}. 
. gen fbetter =cond(Q1>2,1,0)
{txt}
{com}. replace fbetter = . if Q1 ==3  
{txt}(39151 real changes made, 39151 to missing)

{com}. label var fbetter "finance better"
{txt}
{com}. 
. label define better_glb 0 "worse" 1 "better"
{txt}
{com}. label value fbetter better_glb
{txt}
{com}. 
. gen nlit_g = cond(nlit>=3,1,0) 
{txt}
{com}. replace nlit_g = . if nlit ==.
{txt}(30181 real changes made, 30181 to missing)

{com}. label var nlit_g "numeracy literacy score group"
{txt}
{com}. label define nlilb 0 "low" 1 "high" 
{txt}
{com}. label value nlit_g nlitlb
{txt}
{com}. 
. local group_vars byear_g age_g edu_g HHinc_g fbetter nlit_g
{txt}
{com}. 
. ddd
{err}unrecognized command:  ddd
{txt}{search r(199):r(199);}

end of do-file

{search r(199):r(199);}

{com}. reg incvar l11.incvar
{err}not sorted
{txt}{search r(5):r(5);}

{com}. do "/var/folders/k3/fzq0vzzx2b56ypvhsddgs7hr0000gn/T//SD82631.000000"
{txt}
{com}. clear
{txt}
{com}. global mainfolder "/Users/Myworld/Dropbox/IncExpProject/WorkingFolder"
{txt}
{com}. global folder "${c -(}mainfolder{c )-}/SurveyData/"
{txt}
{com}. global sum_graph_folder "${c -(}mainfolder{c )-}/Graphs/ind"
{txt}
{com}. global sum_table_folder "${c -(}mainfolder{c )-}/Tables"
{txt}
{com}. 
. cd ${c -(}folder{c )-}
{res}/Users/Myworld/Dropbox/IncExpProject/WorkingFolder/SurveyData
{txt}
{com}. pwd
{res}/Users/Myworld/Dropbox/IncExpProject/WorkingFolder/SurveyData
{txt}
{com}. set more off 
{txt}
{com}. capture log close
{smcl}
{com}{sf}{ul off}