{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/Myworld/Dropbox/IncExpProject/WorkingFolder/indSCE_Est_log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 7 Nov 2019, 13:53:19
{txt}
{com}. 
. 
. ***************************
. **  Clean and Merge Data **
. ***************************
. 
. use "${c -(}folder{c )-}/SCE/IncExpSCEDstIndM",clear 
{txt}
{com}. 
. duplicates report year month userid

{p 0 4}{txt}Duplicates in terms of {res} year month userid{p_end}

{txt}{hline 10}{c TT}{hline 27}
   copies {c |} observations       surplus
{hline 10}{c +}{hline 27}
        1 {c |}        {res}79064             0
{txt}{hline 10}{c BT}{hline 27}

{com}. 
. ******************************
. *** Merge with demographics **
. *****************************
. 
. merge 1:1 year month userid using "${c -(}folder{c )-}/SCE/IncExpSCEProbIndM",keep(master match) 
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}          79,064{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge hh_info_merge
{res}{txt}
{com}. 
. *******************************
. **  Set Panel Data Structure **
. *******************************
. rename userid ID 
{res}{txt}
{com}. xtset ID date   /* this is not correct. ID is unique here.*/
{res}{txt}{col 8}panel variable:  {res}ID (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}date, 01jun2013 00:00:00 to 01may2018 00:00:00
{col 25}but with gaps
{txt}{col 17}delta:  {res}.001 seconds
{txt}
{com}. sort ID year month 
{txt}
{com}. 
. *******************************
. ** Exclude extreme outliers 
. ******************************
. 
. *keep if Q32 < 100 & Q32 >= 10
. 
. drop if IncVar < 0
{txt}(0 observations deleted)

{com}. 
. 
. *************************
. *** Exclude outliers *****
. *************************
. 
. local Moments IncMean IncVar IncSkew IncKurt
{txt}
{com}. 
. foreach var in `Moments'{c -(}
{txt}  2{com}.       egen `var'pl=pctile(`var'),p(1)
{txt}  3{com}.           egen `var'pu=pctile(`var'),p(99)
{txt}  4{com}.           replace `var' = . if `var' <`var'pl | (`var' >`var'pu & `var'!=.)
{txt}  5{com}. {c )-}
{txt}(440 real changes made, 440 to missing)
(474 real changes made, 474 to missing)
(988 real changes made, 988 to missing)
(856 real changes made, 856 to missing)

{com}. 
. 
. *****************************
. *** generate other vars *****
. *****************************
. 
. gen age_sq = (Q32-30)^2
{txt}(67434 missing values generated)

{com}. label var age_sq "Age-squared"
{txt}
{com}. 
. encode _STATE, gen(state_id)
{txt}
{com}. label var state_id "state id"
{txt}
{com}. 
. *****************************
. *** generate group vars *****
. *****************************
. 
. gen cohort = year-Q32
{txt}(67434 missing values generated)

{com}. label var cohort "cohort by year of birth"
{txt}
{com}. egen cohort_g = cut(cohort), group(3)
{txt}(67434 missing values generated)

{com}. label define cohortlb 0 "1915-1956" 1 "1957-1972" 2 "1973-2000"
{txt}
{com}. label value cohort_g cohortlb
{txt}
{com}. 
. egen age_g = cut(Q32), group(3)  
{txt}(67434 missing values generated)

{com}. label var age_g "age group"
{txt}
{com}. label define agelb 0 "Young" 1 "Middle-age" 2 "Old"
{txt}
{com}. label value age_g agelb
{txt}
{com}. 
. egen edu_g = cut(Q36), group(3) 
{txt}(67406 missing values generated)

{com}. label var edu_g "education group"
{txt}
{com}. label define edulb 0 "Low Education" 1 "Medium Education" 2 "High Education"
{txt}
{com}. label value edu_g edulb
{txt}
{com}. 
. gen gender_g = Q33 
{txt}(67408 missing values generated)

{com}. label var gender_g "gender_grou"
{txt}
{com}. label define gdlb 0 "Male" 1 "Female" 
{txt}
{com}. label value gender_g gdlb
{txt}
{com}. 
. egen inc_g = cut(Q47), group(3)
{txt}(67541 missing values generated)

{com}. label var inc_g "income_g"
{txt}
{com}. label define inclb 0 "Low income" 1 "Middle Income" 2 "High Income"
{txt}
{com}. label value inc_g inclb
{txt}
{com}. 
. local group_vars age_g edu_g inc_g cohort_g
{txt}
{com}. 
. 
. **********************************
. *** tables and hists of Vars *****
. **********************************
. 
. 
. foreach gp in `group_vars' {c -(}
{txt}  2{com}. tabstat Q24_mean Q24_var Q24_iqr IncMean IncVar, st(p10 p50 p90) by(`gp')
{txt}  3{com}. {c )-}

{txt}Summary statistics: p10, p50, p90
  by categories of: age_g (age group)

{ralign 10:age_g} {...}
{c |}{...}
  Q24_mean   Q24_var   Q24_iqr   IncMean
{hline 11}{c +}{hline 40}
{ralign 10:Young} {...}
{c |}{...}
 {res} .7777428  .3333333  .9061641  .2389598
{txt}{space 10} {...}
{c |}{...}
 {res}  2.96196   1.64812         2  .6666667
{txt}{space 10} {...}
{c |}{...}
 {res} 6.809876  21.20652  10.19136         4
{txt}{hline 11}{c +}{hline 40}
{ralign 10:Middle-age} {...}
{c |}{...}
 {res} .4221108  .3333333  .8810234  .2389598
{txt}{space 10} {...}
{c |}{...}
 {res} 2.367884  1.056389  1.437962  .7127152
{txt}{space 10} {...}
{c |}{...}
 {res} 6.025575  17.71149  8.342402         3
{txt}{hline 11}{c +}{hline 40}
{ralign 10:Old} {...}
{c |}{...}
 {res} .7080645  .3333333  .9061639  .2577601
{txt}{space 10} {...}
{c |}{...}
 {res}        2  1.044458  1.391605         1
{txt}{space 10} {...}
{c |}{...}
 {res} 6.008746  22.44984    9.5219  4.381966
{txt}{hline 11}{c +}{hline 40}
{ralign 10:Total} {...}
{c |}{...}
 {res} .6104578  .3333333  .9061639   .242359
{txt}{space 10} {...}
{c |}{...}
 {res} 2.537525  1.333333  1.713396  .6666667
{txt}{space 10} {...}
{c |}{...}
 {res}  6.47924  20.05368  9.336226  3.632116
{txt}{hline 11}{c BT}{hline 40}

{ralign 10:age_g} {...}
{c |}{...}
    IncVar
{hline 11}{c +}{hline 10}
{ralign 10:Young} {...}
{c |}{...}
 {res} .0137465
{txt}{space 10} {...}
{c |}{...}
 {res} .0693832
{txt}{space 10} {...}
{c |}{...}
 {res} 1.333333
{txt}{hline 11}{c +}{hline 10}
{ralign 10:Middle-age} {...}
{c |}{...}
 {res} .0164512
{txt}{space 10} {...}
{c |}{...}
 {res} .3333333
{txt}{space 10} {...}
{c |}{...}
 {res} .8147773
{txt}{hline 11}{c +}{hline 10}
{ralign 10:Old} {...}
{c |}{...}
 {res}  .018795
{txt}{space 10} {...}
{c |}{...}
 {res} .3333333
{txt}{space 10} {...}
{c |}{...}
 {res} 1.333333
{txt}{hline 11}{c +}{hline 10}
{ralign 10:Total} {...}
{c |}{...}
 {res} .0161982
{txt}{space 10} {...}
{c |}{...}
 {res} .2764937
{txt}{space 10} {...}
{c |}{...}
 {res} 1.233755
{txt}{hline 11}{c BT}{hline 10}

Summary statistics: p10, p50, p90
  by categories of: edu_g (education group)

{ralign 16:edu_g} {...}
{c |}{...}
  Q24_mean   Q24_var   Q24_iqr
{hline 17}{c +}{hline 30}
{ralign 16:Low Education} {...}
{c |}{...}
 {res} 2.08e-08  .3333333         1
{txt}{space 16} {...}
{c |}{...}
 {res}        2  1.333333         2
{txt}{space 16} {...}
{c |}{...}
 {res} 6.558024    30.028        13
{txt}{hline 17}{c +}{hline 30}
{ralign 16:Medium Education} {...}
{c |}{...}
 {res} .1782963  .3333333  .9061641
{txt}{space 16} {...}
{c |}{...}
 {res} 2.453082  1.105975   1.57045
{txt}{space 16} {...}
{c |}{...}
 {res} 6.316294  20.84629  12.18417
{txt}{hline 17}{c +}{hline 30}
{ralign 16:High Education} {...}
{c |}{...}
 {res} .8121909  .3333333  .8566982
{txt}{space 16} {...}
{c |}{...}
 {res} 2.704531  1.333333  1.713398
{txt}{space 16} {...}
{c |}{...}
 {res} 6.486081  18.49858  7.423146
{txt}{hline 17}{c +}{hline 30}
{ralign 16:Total} {...}
{c |}{...}
 {res} .6069536  .3333333  .9061639
{txt}{space 16} {...}
{c |}{...}
 {res} 2.537525  1.333333  1.713396
{txt}{space 16} {...}
{c |}{...}
 {res}  6.47924  20.02004   9.36533
{txt}{hline 17}{c BT}{hline 30}

{ralign 16:edu_g} {...}
{c |}{...}
   IncMean    IncVar
{hline 17}{c +}{hline 20}
{ralign 16:Low Education} {...}
{c |}{...}
 {res} .2484386  .0257353
{txt}{space 16} {...}
{c |}{...}
 {res} .6943991  .3333333
{txt}{space 16} {...}
{c |}{...}
 {res} 4.381966  1.333333
{txt}{hline 17}{c +}{hline 20}
{ralign 16:Medium Education} {...}
{c |}{...}
 {res} .2506294  .0179772
{txt}{space 16} {...}
{c |}{...}
 {res} .8888889  .3333333
{txt}{space 16} {...}
{c |}{...}
 {res} 4.720759  1.333333
{txt}{hline 17}{c +}{hline 20}
{ralign 16:High Education} {...}
{c |}{...}
 {res} .2338288   .013815
{txt}{space 16} {...}
{c |}{...}
 {res} .6666667  .0940311
{txt}{space 16} {...}
{c |}{...}
 {res}        3  .8147773
{txt}{hline 17}{c +}{hline 20}
{ralign 16:Total} {...}
{c |}{...}
 {res} .2417595  .0161982
{txt}{space 16} {...}
{c |}{...}
 {res} .6666667  .2764937
{txt}{space 16} {...}
{c |}{...}
 {res} 3.632116  1.233755
{txt}{hline 17}{c BT}{hline 20}

Summary statistics: p10, p50, p90
  by categories of: inc_g (income_g)

{ralign 13:inc_g} {...}
{c |}{...}
  Q24_mean   Q24_var   Q24_iqr   IncMean
{hline 14}{c +}{hline 40}
{ralign 13:Low income} {...}
{c |}{...}
 {res} 2.08e-08  .3333333         1  .2506294
{txt}{space 13} {...}
{c |}{...}
 {res}        2  1.333333         2  .6666667
{txt}{space 13} {...}
{c |}{...}
 {res} 6.924951   31.6453        13         5
{txt}{hline 14}{c +}{hline 40}
{ralign 13:Middle Income} {...}
{c |}{...}
 {res} .5375247  .3333333  .9061639  .2308554
{txt}{space 13} {...}
{c |}{...}
 {res} 2.192116  1.127061  1.508995  .7127152
{txt}{space 13} {...}
{c |}{...}
 {res}        6  18.76865  8.725375         3
{txt}{hline 14}{c +}{hline 40}
{ralign 13:High Income} {...}
{c |}{...}
 {res}        1  .3333333   .856698  .2461167
{txt}{space 13} {...}
{c |}{...}
 {res} 2.793575  1.333333   1.64027  .6666667
{txt}{space 13} {...}
{c |}{...}
 {res} 6.599971  17.20418  7.173429  3.462475
{txt}{hline 14}{c +}{hline 40}
{ralign 13:Total} {...}
{c |}{...}
 {res} .6069536  .3333333  .9061639  .2413554
{txt}{space 13} {...}
{c |}{...}
 {res} 2.537525  1.333333  1.713396  .6666667
{txt}{space 13} {...}
{c |}{...}
 {res} 6.481738  20.21747   9.39088  3.577936
{txt}{hline 14}{c BT}{hline 40}

{ralign 13:inc_g} {...}
{c |}{...}
    IncVar
{hline 14}{c +}{hline 10}
{ralign 13:Low income} {...}
{c |}{...}
 {res} .0230559
{txt}{space 13} {...}
{c |}{...}
 {res} .3333333
{txt}{space 13} {...}
{c |}{...}
 {res} 1.333333
{txt}{hline 14}{c +}{hline 10}
{ralign 13:Middle Income} {...}
{c |}{...}
 {res} .0159816
{txt}{space 13} {...}
{c |}{...}
 {res} .3333333
{txt}{space 13} {...}
{c |}{...}
 {res} 1.233755
{txt}{hline 14}{c +}{hline 10}
{ralign 13:High Income} {...}
{c |}{...}
 {res} .0146505
{txt}{space 13} {...}
{c |}{...}
 {res} .1274406
{txt}{space 13} {...}
{c |}{...}
 {res} .8147773
{txt}{hline 14}{c +}{hline 10}
{ralign 13:Total} {...}
{c |}{...}
 {res} .0161982
{txt}{space 13} {...}
{c |}{...}
 {res} .2764937
{txt}{space 13} {...}
{c |}{...}
 {res} 1.233755
{txt}{hline 14}{c BT}{hline 10}

Summary statistics: p10, p50, p90
  by categories of: cohort_g 

{ralign 9:cohort_g} {...}
{c |}{...}
  Q24_mean   Q24_var   Q24_iqr   IncMean
{hline 10}{c +}{hline 40}
{ralign 9:1915-1956} {...}
{c |}{...}
 {res} .6228527  .3333333  .9061639  .2389598
{txt}{space 9} {...}
{c |}{...}
 {res}        2  .9753268  1.324268         1
{txt}{space 9} {...}
{c |}{...}
 {res}        6  21.60151   8.90799         4
{txt}{hline 10}{c +}{hline 40}
{ralign 9:1957-1972} {...}
{c |}{...}
 {res} .4477587  .3333333  .8566982  .2505147
{txt}{space 9} {...}
{c |}{...}
 {res} 2.280812  1.044458  1.435542   .725921
{txt}{space 9} {...}
{c |}{...}
 {res}        6  16.78715  8.509292         3
{txt}{hline 10}{c +}{hline 40}
{ralign 9:1973-2000} {...}
{c |}{...}
 {res} .7586042  .3333333  .9061641  .2396565
{txt}{space 9} {...}
{c |}{...}
 {res} 2.959499  1.632472         2  .6666667
{txt}{space 9} {...}
{c |}{...}
 {res} 6.868142  21.45051   10.2934  4.211032
{txt}{hline 10}{c +}{hline 40}
{ralign 9:Total} {...}
{c |}{...}
 {res} .6104578  .3333333  .9061639   .242359
{txt}{space 9} {...}
{c |}{...}
 {res} 2.537525  1.333333  1.713396  .6666667
{txt}{space 9} {...}
{c |}{...}
 {res}  6.47924  20.05368  9.336226  3.632116
{txt}{hline 10}{c BT}{hline 40}

{ralign 9:cohort_g} {...}
{c |}{...}
    IncVar
{hline 10}{c +}{hline 10}
{ralign 9:1915-1956} {...}
{c |}{...}
 {res} .0188465
{txt}{space 9} {...}
{c |}{...}
 {res} .3333333
{txt}{space 9} {...}
{c |}{...}
 {res} 1.333333
{txt}{hline 10}{c +}{hline 10}
{ralign 9:1957-1972} {...}
{c |}{...}
 {res}  .016755
{txt}{space 9} {...}
{c |}{...}
 {res} .3333333
{txt}{space 9} {...}
{c |}{...}
 {res} .8147773
{txt}{hline 10}{c +}{hline 10}
{ralign 9:1973-2000} {...}
{c |}{...}
 {res}  .013815
{txt}{space 9} {...}
{c |}{...}
 {res} .0708662
{txt}{space 9} {...}
{c |}{...}
 {res} 1.333333
{txt}{hline 10}{c +}{hline 10}
{ralign 9:Total} {...}
{c |}{...}
 {res} .0161982
{txt}{space 9} {...}
{c |}{...}
 {res} .2764937
{txt}{space 9} {...}
{c |}{...}
 {res} 1.233755
{txt}{hline 10}{c BT}{hline 10}

{com}. 
. 
. foreach gp in `group_vars' {c -(}
{txt}  2{com}. table `gp', c(median Q24_var) by(year)
{txt}  3{com}. {c )-}

{txt}{hline 11}{c TT}{hline 13}
year and   {c |}
age group  {c |} med(Q24_var)
{hline 11}{c +}{hline 13}
2013       {c |}
     Young {c |}    {res}1.4706578
{txt}Middle-age {c |}    {res}1.0504482
       {txt}Old {c |}    {res}.87410492
{txt}{hline 11}{c +}{hline 13}
2014       {c |}
     Young {c |}     {res}1.642285
{txt}Middle-age {c |}     {res}1.333333
       {txt}Old {c |}    {res}.87410492
{txt}{hline 11}{c +}{hline 13}
2015       {c |}
     Young {c |}    {res}1.7716688
{txt}Middle-age {c |}    {res}.87410492
       {txt}Old {c |}     {res}1.333333
{txt}{hline 11}{c +}{hline 13}
2016       {c |}
     Young {c |}    {res}1.6922234
{txt}Middle-age {c |}    {res}.86692697
       {txt}Old {c |}    {res}1.1862721
{txt}{hline 11}{c +}{hline 13}
2017       {c |}
     Young {c |}    {res}1.7856894
{txt}Middle-age {c |}    {res}.93161613
       {txt}Old {c |}    {res}.66666669
{txt}{hline 11}{c +}{hline 13}
2018       {c |}
     Young {c |}    {res}1.4911855
{txt}Middle-age {c |}    {res}.94059372
       {txt}Old {c |}    {res}1.0095498
{txt}{hline 11}{c BT}{hline 13}

{hline 17}{c TT}{hline 13}
year and         {c |}
education group  {c |} med(Q24_var)
{hline 17}{c +}{hline 13}
2013             {c |}
   Low Education {c |}     {res}1.105975
{txt}Medium Education {c |}    {res}.89902848
  {txt}High Education {c |}     {res}1.333333
{txt}{hline 17}{c +}{hline 13}
2014             {c |}
   Low Education {c |}     {res}1.425889
{txt}Medium Education {c |}     {res}1.333333
  {txt}High Education {c |}    {res}1.4992648
{txt}{hline 17}{c +}{hline 13}
2015             {c |}
   Low Education {c |}    {res}1.8824012
{txt}Medium Education {c |}    {res}.66863903
  {txt}High Education {c |}    {res}1.5146742
{txt}{hline 17}{c +}{hline 13}
2016             {c |}
   Low Education {c |}     {res}1.333333
{txt}Medium Education {c |}     {res}1.105975
  {txt}High Education {c |}     {res}1.333333
{txt}{hline 17}{c +}{hline 13}
2017             {c |}
   Low Education {c |}     {res}1.105975
{txt}Medium Education {c |}    {res}1.1185131
  {txt}High Education {c |}    {res}1.3586999
{txt}{hline 17}{c +}{hline 13}
2018             {c |}
   Low Education {c |}     {res}1.536028
{txt}Medium Education {c |}    {res}1.0006096
  {txt}High Education {c |}     {res}1.333333
{txt}{hline 17}{c BT}{hline 13}

{hline 14}{c TT}{hline 13}
year and      {c |}
income_g      {c |} med(Q24_var)
{hline 14}{c +}{hline 13}
2013          {c |}
   Low income {c |}    {res}1.9040942
{txt}Middle Income {c |}    {res}.66666669
  {txt}High Income {c |}     {res}1.333333
{txt}{hline 14}{c +}{hline 13}
2014          {c |}
   Low income {c |}    {res}1.6237009
{txt}Middle Income {c |}     {res}1.333333
  {txt}High Income {c |}    {res}1.3432762
{txt}{hline 14}{c +}{hline 13}
2015          {c |}
   Low income {c |}     {res}1.333333
{txt}Middle Income {c |}    {res}.99126315
  {txt}High Income {c |}    {res}1.4270498
{txt}{hline 14}{c +}{hline 13}
2016          {c |}
   Low income {c |}     {res}1.333333
{txt}Middle Income {c |}    {res}1.3262935
  {txt}High Income {c |}    {res}1.2031537
{txt}{hline 14}{c +}{hline 13}
2017          {c |}
   Low income {c |}     {res}1.333333
{txt}Middle Income {c |}     {res}1.333333
  {txt}High Income {c |}     {res}1.333333
{txt}{hline 14}{c +}{hline 13}
2018          {c |}
   Low income {c |}     {res}1.333333
{txt}Middle Income {c |}     {res}1.333333
  {txt}High Income {c |}    {res}1.3093832
{txt}{hline 14}{c BT}{hline 13}

{hline 10}{c TT}{hline 13}
year and  {c |}
cohort_g  {c |} med(Q24_var)
{hline 10}{c +}{hline 13}
2013      {c |}
1915-1956 {c |}    {res}.72505316
{txt}1957-1972 {c |}     {res}1.166442
{txt}1973-2000 {c |}     {res}1.646167
{txt}{hline 10}{c +}{hline 13}
2014      {c |}
1915-1956 {c |}    {res}.87410492
{txt}1957-1972 {c |}     {res}1.333333
{txt}1973-2000 {c |}     {res}1.642285
{txt}{hline 10}{c +}{hline 13}
2015      {c |}
1915-1956 {c |}     {res}1.333333
{txt}1957-1972 {c |}    {res}.84719852
{txt}1973-2000 {c |}    {res}1.7716688
{txt}{hline 10}{c +}{hline 13}
2016      {c |}
1915-1956 {c |}    {res}1.1651365
{txt}1957-1972 {c |}    {res}.93051246
{txt}1973-2000 {c |}    {res}1.5051229
{txt}{hline 10}{c +}{hline 13}
2017      {c |}
1915-1956 {c |}    {res}1.0609467
{txt}1957-1972 {c |}    {res}.81034333
{txt}1973-2000 {c |}    {res}1.7099483
{txt}{hline 10}{c +}{hline 13}
2018      {c |}
1915-1956 {c |}    {res}1.1888956
{txt}1957-1972 {c |}    {res}.66666669
{txt}1973-2000 {c |}    {res}1.4706577
{txt}{hline 10}{c BT}{hline 13}

{com}. 
. 
. /*
> 
> foreach mom in iqr var mean {c -(}
> 
> twoway (hist Q24_`mom',fcolor(ltblue) lcolor(none)), ///
>            ytitle("") ///
>            title("`mom'")
> graph export "${c -(}sum_graph_folder{c )-}/hist/hist_`mom'.png",as(png) replace  
> 
> {c )-}
> 
> foreach gp in `group_vars' {c -(}
> foreach mom in iqr var mean {c -(}
> 
> twoway (hist Q24_`mom' if `gp'==0,fcolor(gs15) lcolor("")) /// 
>        (hist Q24_`mom' if `gp'==1,fcolor(ltblue) lcolor("")) ///
>            (hist Q24_`mom' if `gp'==2,fcolor(red) lcolor("")), ///
>            xtitle("") ///
>            ytitle("") ///
>            title("`mom'") ///
>            legend(label(1 `gp'=0) label(2 `gp'=1) label(3 `gp'=2) col(1))
> 
> graph export "${c -(}sum_graph_folder{c )-}/hist/hist_`mom'_`gp'.png",as(png) replace  
> 
> {c )-}
> {c )-}
> 
> 
> */
. 
. foreach mom in Mean Var Skew Kurt{c -(}
{txt}  2{com}. 
. twoway (hist Inc`mom',fcolor(ltblue) lcolor(none)), ///
>            ytitle("") ///
>            title("`mom'")
{txt}  3{com}. graph export "${c -(}sum_graph_folder{c )-}/hist/hist_Inc`mom'.png",as(png) replace  
{txt}  4{com}. 
. {c )-}
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_IncMean.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_IncVar.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_IncSkew.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_IncKurt.png written in PNG format)

{com}. 
. foreach gp in `group_vars' {c -(}
{txt}  2{com}. foreach mom in Mean Var Skew Kurt{c -(}
{txt}  3{com}. 
. twoway (hist Inc`mom' if `gp'==0,fcolor(gs15) lcolor("")) /// 
>        (hist Inc`mom' if `gp'==1,fcolor(ltblue) lcolor("")) ///
>            (hist Inc`mom' if `gp'==2,fcolor(red) lcolor("")), ///
>            xtitle("") ///
>            ytitle("") ///
>            title("`mom'") ///
>            legend(label(1 `gp'=0) label(2 `gp'=1) label(3 `gp'=2) col(1))
{txt}  4{com}. 
. graph export "${c -(}sum_graph_folder{c )-}/hist/hist_Inc_`mom'_`gp'.png",as(png) replace  
{txt}  5{com}. 
. {c )-}
{txt}  6{com}. {c )-}
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_Inc_Mean_age_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_Inc_Var_age_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_Inc_Skew_age_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_Inc_Kurt_age_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_Inc_Mean_edu_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_Inc_Var_edu_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_Inc_Skew_edu_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_Inc_Kurt_edu_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_Inc_Mean_inc_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_Inc_Var_inc_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_Inc_Skew_inc_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_Inc_Kurt_inc_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_Inc_Mean_cohort_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_Inc_Var_cohort_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_Inc_Skew_cohort_g.png written in PNG format)
{res}{txt}(file /Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Graphs/ind/hist/hist_Inc_Kurt_cohort_g.png written in PNG format)

{com}. 
. ********************
. ** Regression ******
. ********************
. 
. global other_control i.Q33 i.Q34 Q35_1 Q35_2 Q35_3 Q35_4 Q35_5 Q35_6 
{txt}
{com}. global macro_ex_var Q4new Q6new Q9_mean Q13new
{txt}
{com}. 
. eststo clear
{txt}
{com}. 
. foreach mom in var iqr mean{c -(}
{txt}  2{com}. eststo: reg Q24_`mom' i.age_g i.edu_g i.inc_g i.cohort_g i.year i.state_id, robust 
{txt}  3{com}. eststo: reg Q24_`mom' i.age_g i.edu_g i.inc_g i.cohort_g i.year i.state_id ${c -(}other_control{c )-}, robust 
{txt}  4{com}. eststo: reg Q24_`mom' i.age_g i.edu_g i.inc_g i.cohort_g i.year i.state_id ${c -(}other_control{c )-} ${c -(}macro_ex_var{c )-}, robust 
{txt}  5{com}. {c )-}

{txt}Linear regression                                      Number of obs ={res}    6802
                                                       {txt}F( 63,  6738) ={res}    3.13
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0233
                                                       {txt}Root MSE      = {res} 12.078

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     Q24_var{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2} .5013103{col 26}{space 2} .8935141{col 37}{space 1}    0.56{col 46}{space 3}0.575{col 54}{space 4} -1.25026{col 67}{space 3}  2.25288
{txt}{space 8}Old  {c |}{col 14}{res}{space 2} 1.068757{col 26}{space 2} 1.252718{col 37}{space 1}    0.85{col 46}{space 3}0.394{col 54}{space 4}-1.386966{col 67}{space 3}  3.52448
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2}-1.339015{col 26}{space 2} .6262448{col 37}{space 1}   -2.14{col 46}{space 3}0.033{col 54}{space 4}-2.566652{col 67}{space 3}-.1113767
{txt}High Educ..  {c |}{col 14}{res}{space 2}-1.410317{col 26}{space 2} .6071532{col 37}{space 1}   -2.32{col 46}{space 3}0.020{col 54}{space 4}-2.600529{col 67}{space 3}-.2201045
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2} -2.60598{col 26}{space 2}  .489975{col 37}{space 1}   -5.32{col 46}{space 3}0.000{col 54}{space 4}-3.566486{col 67}{space 3}-1.645474
{txt}High Income  {c |}{col 14}{res}{space 2}  -2.4692{col 26}{space 2} .4821806{col 37}{space 1}   -5.12{col 46}{space 3}0.000{col 54}{space 4}-3.414426{col 67}{space 3}-1.523974
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2}-.2438989{col 26}{space 2} .8957575{col 37}{space 1}   -0.27{col 46}{space 3}0.785{col 54}{space 4}-1.999867{col 67}{space 3} 1.512069
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} 1.646699{col 26}{space 2} 1.286199{col 37}{space 1}    1.28{col 46}{space 3}0.200{col 54}{space 4}-.8746582{col 67}{space 3} 4.168055
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2}-.1614683{col 26}{space 2} .4586391{col 37}{space 1}   -0.35{col 46}{space 3}0.725{col 54}{space 4}-1.060546{col 67}{space 3} .7376093
{txt}{space 7}2015  {c |}{col 14}{res}{space 2} -.064091{col 26}{space 2} .4636829{col 37}{space 1}   -0.14{col 46}{space 3}0.890{col 54}{space 4} -.973056{col 67}{space 3}  .844874
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0581902{col 26}{space 2} .4714333{col 37}{space 1}   -0.12{col 46}{space 3}0.902{col 54}{space 4}-.9823485{col 67}{space 3} .8659681
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .6328755{col 26}{space 2}  .498568{col 37}{space 1}    1.27{col 46}{space 3}0.204{col 54}{space 4}-.3444754{col 67}{space 3} 1.610226
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0224539{col 26}{space 2} .6306419{col 37}{space 1}   -0.04{col 46}{space 3}0.972{col 54}{space 4}-1.258711{col 67}{space 3} 1.213804
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2}-7.732908{col 26}{space 2} 9.903271{col 37}{space 1}   -0.78{col 46}{space 3}0.435{col 54}{space 4}-27.14645{col 67}{space 3} 11.68063
{txt}{space 9}AR  {c |}{col 14}{res}{space 2} -8.72753{col 26}{space 2} 9.970417{col 37}{space 1}   -0.88{col 46}{space 3}0.381{col 54}{space 4} -28.2727{col 67}{space 3} 10.81764
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-8.375529{col 26}{space 2}  9.84867{col 37}{space 1}   -0.85{col 46}{space 3}0.395{col 54}{space 4}-27.68204{col 67}{space 3} 10.93098
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-6.714725{col 26}{space 2} 9.814619{col 37}{space 1}   -0.68{col 46}{space 3}0.494{col 54}{space 4}-25.95448{col 67}{space 3} 12.52503
{txt}{space 9}CO  {c |}{col 14}{res}{space 2}-8.166757{col 26}{space 2} 9.851097{col 37}{space 1}   -0.83{col 46}{space 3}0.407{col 54}{space 4}-27.47802{col 67}{space 3} 11.14451
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-9.799728{col 26}{space 2} 9.844344{col 37}{space 1}   -1.00{col 46}{space 3}0.320{col 54}{space 4}-29.09775{col 67}{space 3} 9.498298
{txt}{space 9}DC  {c |}{col 14}{res}{space 2}-8.538081{col 26}{space 2} 9.900897{col 37}{space 1}   -0.86{col 46}{space 3}0.389{col 54}{space 4}-27.94697{col 67}{space 3} 10.87081
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-9.227085{col 26}{space 2} 10.20283{col 37}{space 1}   -0.90{col 46}{space 3}0.366{col 54}{space 4}-29.22785{col 67}{space 3} 10.77368
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-7.623145{col 26}{space 2} 9.824207{col 37}{space 1}   -0.78{col 46}{space 3}0.438{col 54}{space 4} -26.8817{col 67}{space 3} 11.63541
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-8.370487{col 26}{space 2}  9.83403{col 37}{space 1}   -0.85{col 46}{space 3}0.395{col 54}{space 4}-27.64829{col 67}{space 3} 10.90732
{txt}{space 9}HI  {c |}{col 14}{res}{space 2}-6.835985{col 26}{space 2} 10.15476{col 37}{space 1}   -0.67{col 46}{space 3}0.501{col 54}{space 4}-26.74253{col 67}{space 3} 13.07056
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-12.49773{col 26}{space 2} 9.819729{col 37}{space 1}   -1.27{col 46}{space 3}0.203{col 54}{space 4} -31.7475{col 67}{space 3} 6.752045
{txt}{space 9}ID  {c |}{col 14}{res}{space 2}-9.803045{col 26}{space 2} 9.922939{col 37}{space 1}   -0.99{col 46}{space 3}0.323{col 54}{space 4}-29.25514{col 67}{space 3} 9.649052
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-9.622397{col 26}{space 2} 9.817044{col 37}{space 1}   -0.98{col 46}{space 3}0.327{col 54}{space 4}-28.86691{col 67}{space 3} 9.622112
{txt}{space 9}IN  {c |}{col 14}{res}{space 2}-8.007341{col 26}{space 2}  9.85952{col 37}{space 1}   -0.81{col 46}{space 3}0.417{col 54}{space 4}-27.33512{col 67}{space 3} 11.32044
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-9.252099{col 26}{space 2} 9.914779{col 37}{space 1}   -0.93{col 46}{space 3}0.351{col 54}{space 4} -28.6882{col 67}{space 3}   10.184
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-9.447715{col 26}{space 2} 9.897021{col 37}{space 1}   -0.95{col 46}{space 3}0.340{col 54}{space 4}-28.84901{col 67}{space 3} 9.953574
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-7.735845{col 26}{space 2}  9.92003{col 37}{space 1}   -0.78{col 46}{space 3}0.436{col 54}{space 4}-27.18224{col 67}{space 3} 11.71055
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-7.696428{col 26}{space 2} 9.852186{col 37}{space 1}   -0.78{col 46}{space 3}0.435{col 54}{space 4}-27.00983{col 67}{space 3} 11.61697
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-7.501647{col 26}{space 2} 9.859285{col 37}{space 1}   -0.76{col 46}{space 3}0.447{col 54}{space 4}-26.82896{col 67}{space 3} 11.82567
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-10.83043{col 26}{space 2} 9.864962{col 37}{space 1}   -1.10{col 46}{space 3}0.272{col 54}{space 4}-30.16888{col 67}{space 3} 8.508014
{txt}{space 9}MI  {c |}{col 14}{res}{space 2}-8.942332{col 26}{space 2} 9.819877{col 37}{space 1}   -0.91{col 46}{space 3}0.363{col 54}{space 4} -28.1924{col 67}{space 3} 10.30773
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-9.658923{col 26}{space 2} 9.827682{col 37}{space 1}   -0.98{col 46}{space 3}0.326{col 54}{space 4}-28.92429{col 67}{space 3} 9.606442
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-8.757581{col 26}{space 2} 9.841948{col 37}{space 1}   -0.89{col 46}{space 3}0.374{col 54}{space 4}-28.05091{col 67}{space 3} 10.53575
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-6.334786{col 26}{space 2} 10.01804{col 37}{space 1}   -0.63{col 46}{space 3}0.527{col 54}{space 4}-25.97332{col 67}{space 3} 13.30375
{txt}{space 9}MT  {c |}{col 14}{res}{space 2} -11.1137{col 26}{space 2} 9.893223{col 37}{space 1}   -1.12{col 46}{space 3}0.261{col 54}{space 4}-30.50754{col 67}{space 3} 8.280145
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-8.127127{col 26}{space 2} 9.832073{col 37}{space 1}   -0.83{col 46}{space 3}0.408{col 54}{space 4} -27.4011{col 67}{space 3} 11.14684
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-8.535393{col 26}{space 2}  10.0396{col 37}{space 1}   -0.85{col 46}{space 3}0.395{col 54}{space 4}-28.21618{col 67}{space 3}  11.1454
{txt}{space 9}NE  {c |}{col 14}{res}{space 2}-11.03031{col 26}{space 2} 9.841178{col 37}{space 1}   -1.12{col 46}{space 3}0.262{col 54}{space 4}-30.32213{col 67}{space 3} 8.261507
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}  -11.346{col 26}{space 2} 9.881534{col 37}{space 1}   -1.15{col 46}{space 3}0.251{col 54}{space 4}-30.71693{col 67}{space 3}  8.02493
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-7.888602{col 26}{space 2} 9.828362{col 37}{space 1}   -0.80{col 46}{space 3}0.422{col 54}{space 4} -27.1553{col 67}{space 3}  11.3781
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-9.636507{col 26}{space 2} 9.969706{col 37}{space 1}   -0.97{col 46}{space 3}0.334{col 54}{space 4}-29.18028{col 67}{space 3} 9.907269
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}-6.716772{col 26}{space 2} 9.963132{col 37}{space 1}   -0.67{col 46}{space 3}0.500{col 54}{space 4}-26.24766{col 67}{space 3} 12.81412
{txt}{space 9}NY  {c |}{col 14}{res}{space 2} -8.51689{col 26}{space 2} 9.813356{col 37}{space 1}   -0.87{col 46}{space 3}0.385{col 54}{space 4}-27.75417{col 67}{space 3} 10.72039
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-9.307214{col 26}{space 2} 9.821932{col 37}{space 1}   -0.95{col 46}{space 3}0.343{col 54}{space 4}-28.56131{col 67}{space 3} 9.946878
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-5.165713{col 26}{space 2} 10.01576{col 37}{space 1}   -0.52{col 46}{space 3}0.606{col 54}{space 4}-24.79978{col 67}{space 3} 14.46835
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-10.69639{col 26}{space 2}  9.83347{col 37}{space 1}   -1.09{col 46}{space 3}0.277{col 54}{space 4} -29.9731{col 67}{space 3}  8.58032
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-9.495917{col 26}{space 2}  9.81343{col 37}{space 1}   -0.97{col 46}{space 3}0.333{col 54}{space 4}-28.73334{col 67}{space 3} 9.741507
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-5.924742{col 26}{space 2} 10.46888{col 37}{space 1}   -0.57{col 46}{space 3}0.571{col 54}{space 4}-26.44707{col 67}{space 3} 14.59758
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-6.616601{col 26}{space 2} 9.908242{col 37}{space 1}   -0.67{col 46}{space 3}0.504{col 54}{space 4}-26.03989{col 67}{space 3} 12.80669
{txt}{space 9}SD  {c |}{col 14}{res}{space 2}-9.740637{col 26}{space 2} 9.921419{col 37}{space 1}   -0.98{col 46}{space 3}0.326{col 54}{space 4}-29.18975{col 67}{space 3} 9.708482
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-6.852218{col 26}{space 2} 9.864976{col 37}{space 1}   -0.69{col 46}{space 3}0.487{col 54}{space 4}-26.19069{col 67}{space 3} 12.48625
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-6.539331{col 26}{space 2} 9.822505{col 37}{space 1}   -0.67{col 46}{space 3}0.506{col 54}{space 4}-25.79454{col 67}{space 3} 12.71588
{txt}{space 9}UT  {c |}{col 14}{res}{space 2}-9.771687{col 26}{space 2} 9.854023{col 37}{space 1}   -0.99{col 46}{space 3}0.321{col 54}{space 4}-29.08869{col 67}{space 3} 9.545312
{txt}{space 9}VA  {c |}{col 14}{res}{space 2} -8.49302{col 26}{space 2}   9.8375{col 37}{space 1}   -0.86{col 46}{space 3}0.388{col 54}{space 4}-27.77763{col 67}{space 3} 10.79159
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}-12.89455{col 26}{space 2} 9.828576{col 37}{space 1}   -1.31{col 46}{space 3}0.190{col 54}{space 4}-32.16167{col 67}{space 3} 6.372561
{txt}{space 9}WA  {c |}{col 14}{res}{space 2}-9.115433{col 26}{space 2} 9.837808{col 37}{space 1}   -0.93{col 46}{space 3}0.354{col 54}{space 4}-28.40065{col 67}{space 3} 10.16978
{txt}{space 9}WI  {c |}{col 14}{res}{space 2} -8.85512{col 26}{space 2} 9.838687{col 37}{space 1}   -0.90{col 46}{space 3}0.368{col 54}{space 4}-28.14206{col 67}{space 3} 10.43182
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-10.01162{col 26}{space 2} 9.940422{col 37}{space 1}   -1.01{col 46}{space 3}0.314{col 54}{space 4}-29.49799{col 67}{space 3} 9.474748
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-10.23587{col 26}{space 2} 10.06168{col 37}{space 1}   -1.02{col 46}{space 3}0.309{col 54}{space 4}-29.95994{col 67}{space 3} 9.488213
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 17.06778{col 26}{space 2} 9.879954{col 37}{space 1}    1.73{col 46}{space 3}0.084{col 54}{space 4}-2.300058{col 67}{space 3} 36.43561
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est1{txt} stored)

Linear regression                                      Number of obs ={res}    6800
                                                       {txt}F( 71,  6728) ={res}    3.26
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0298
                                                       {txt}Root MSE      = {res} 12.047

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     Q24_var{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2} .3674875{col 26}{space 2} .8926639{col 37}{space 1}    0.41{col 46}{space 3}0.681{col 54}{space 4}-1.382416{col 67}{space 3} 2.117391
{txt}{space 8}Old  {c |}{col 14}{res}{space 2} .7397797{col 26}{space 2} 1.256815{col 37}{space 1}    0.59{col 46}{space 3}0.556{col 54}{space 4}-1.723976{col 67}{space 3} 3.203535
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2} -1.22686{col 26}{space 2} .6248067{col 37}{space 1}   -1.96{col 46}{space 3}0.050{col 54}{space 4}-2.451679{col 67}{space 3}-.0020414
{txt}High Educ..  {c |}{col 14}{res}{space 2}-1.293919{col 26}{space 2}  .606631{col 37}{space 1}   -2.13{col 46}{space 3}0.033{col 54}{space 4}-2.483108{col 67}{space 3}  -.10473
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2} -2.63863{col 26}{space 2} .4888632{col 37}{space 1}   -5.40{col 46}{space 3}0.000{col 54}{space 4}-3.596957{col 67}{space 3}-1.680304
{txt}High Income  {c |}{col 14}{res}{space 2}-2.589999{col 26}{space 2} .4888276{col 37}{space 1}   -5.30{col 46}{space 3}0.000{col 54}{space 4}-3.548256{col 67}{space 3}-1.631742
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2}-.4562235{col 26}{space 2} .8989149{col 37}{space 1}   -0.51{col 46}{space 3}0.612{col 54}{space 4}-2.218381{col 67}{space 3} 1.305934
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} 1.302835{col 26}{space 2} 1.289006{col 37}{space 1}    1.01{col 46}{space 3}0.312{col 54}{space 4}-1.224024{col 67}{space 3} 3.829694
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2} -.212289{col 26}{space 2} .4568399{col 37}{space 1}   -0.46{col 46}{space 3}0.642{col 54}{space 4} -1.10784{col 67}{space 3} .6832619
{txt}{space 7}2015  {c |}{col 14}{res}{space 2}-.1015344{col 26}{space 2} .4621686{col 37}{space 1}   -0.22{col 46}{space 3}0.826{col 54}{space 4}-1.007531{col 67}{space 3} .8044623
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0491804{col 26}{space 2} .4708741{col 37}{space 1}   -0.10{col 46}{space 3}0.917{col 54}{space 4}-.9722427{col 67}{space 3}  .873882
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .6404126{col 26}{space 2} .4970527{col 37}{space 1}    1.29{col 46}{space 3}0.198{col 54}{space 4}-.3339681{col 67}{space 3} 1.614793
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0067989{col 26}{space 2} .6300854{col 37}{space 1}    0.01{col 46}{space 3}0.991{col 54}{space 4}-1.228368{col 67}{space 3} 1.241966
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2}-7.858092{col 26}{space 2} 10.09037{col 37}{space 1}   -0.78{col 46}{space 3}0.436{col 54}{space 4}-27.63842{col 67}{space 3} 11.92224
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-8.697518{col 26}{space 2} 10.15245{col 37}{space 1}   -0.86{col 46}{space 3}0.392{col 54}{space 4}-28.59953{col 67}{space 3} 11.20449
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-8.367416{col 26}{space 2} 10.03669{col 37}{space 1}   -0.83{col 46}{space 3}0.404{col 54}{space 4} -28.0425{col 67}{space 3} 11.30767
{txt}{space 9}CA  {c |}{col 14}{res}{space 2} -6.81778{col 26}{space 2} 10.01521{col 37}{space 1}   -0.68{col 46}{space 3}0.496{col 54}{space 4}-26.45076{col 67}{space 3}  12.8152
{txt}{space 9}CO  {c |}{col 14}{res}{space 2}-8.035994{col 26}{space 2} 10.04133{col 37}{space 1}   -0.80{col 46}{space 3}0.424{col 54}{space 4}-27.72018{col 67}{space 3} 11.64819
{txt}{space 9}CT  {c |}{col 14}{res}{space 2} -9.67038{col 26}{space 2} 10.03552{col 37}{space 1}   -0.96{col 46}{space 3}0.335{col 54}{space 4}-29.34318{col 67}{space 3} 10.00242
{txt}{space 9}DC  {c |}{col 14}{res}{space 2}-8.576221{col 26}{space 2} 10.09361{col 37}{space 1}   -0.85{col 46}{space 3}0.396{col 54}{space 4} -28.3629{col 67}{space 3} 11.21045
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-9.400311{col 26}{space 2} 10.38939{col 37}{space 1}   -0.90{col 46}{space 3}0.366{col 54}{space 4} -29.7668{col 67}{space 3} 10.96617
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-7.619171{col 26}{space 2}   10.016{col 37}{space 1}   -0.76{col 46}{space 3}0.447{col 54}{space 4} -27.2537{col 67}{space 3} 12.01536
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-8.777496{col 26}{space 2} 10.02807{col 37}{space 1}   -0.88{col 46}{space 3}0.381{col 54}{space 4}-28.43569{col 67}{space 3} 10.88069
{txt}{space 9}HI  {c |}{col 14}{res}{space 2}-7.909304{col 26}{space 2} 10.37878{col 37}{space 1}   -0.76{col 46}{space 3}0.446{col 54}{space 4}-28.25499{col 67}{space 3} 12.43638
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-12.21529{col 26}{space 2} 10.00851{col 37}{space 1}   -1.22{col 46}{space 3}0.222{col 54}{space 4}-31.83515{col 67}{space 3} 7.404566
{txt}{space 9}ID  {c |}{col 14}{res}{space 2}-9.609289{col 26}{space 2} 10.11082{col 37}{space 1}   -0.95{col 46}{space 3}0.342{col 54}{space 4}-29.42969{col 67}{space 3} 10.21111
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-9.456118{col 26}{space 2} 10.01248{col 37}{space 1}   -0.94{col 46}{space 3}0.345{col 54}{space 4}-29.08375{col 67}{space 3} 10.17152
{txt}{space 9}IN  {c |}{col 14}{res}{space 2}-7.909122{col 26}{space 2} 10.04645{col 37}{space 1}   -0.79{col 46}{space 3}0.431{col 54}{space 4}-27.60335{col 67}{space 3} 11.78511
{txt}{space 9}KS  {c |}{col 14}{res}{space 2} -8.85982{col 26}{space 2} 10.10526{col 37}{space 1}   -0.88{col 46}{space 3}0.381{col 54}{space 4}-28.66932{col 67}{space 3} 10.94968
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-9.237799{col 26}{space 2} 10.08469{col 37}{space 1}   -0.92{col 46}{space 3}0.360{col 54}{space 4}-29.00698{col 67}{space 3} 10.53138
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-7.784244{col 26}{space 2} 10.10922{col 37}{space 1}   -0.77{col 46}{space 3}0.441{col 54}{space 4}-27.60151{col 67}{space 3} 12.03302
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-7.419389{col 26}{space 2} 10.04382{col 37}{space 1}   -0.74{col 46}{space 3}0.460{col 54}{space 4}-27.10846{col 67}{space 3} 12.26968
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-7.615122{col 26}{space 2} 10.05157{col 37}{space 1}   -0.76{col 46}{space 3}0.449{col 54}{space 4}-27.31939{col 67}{space 3} 12.08915
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-10.28094{col 26}{space 2} 10.05801{col 37}{space 1}   -1.02{col 46}{space 3}0.307{col 54}{space 4}-29.99783{col 67}{space 3} 9.435942
{txt}{space 9}MI  {c |}{col 14}{res}{space 2}   -8.832{col 26}{space 2} 10.00793{col 37}{space 1}   -0.88{col 46}{space 3}0.378{col 54}{space 4}-28.45071{col 67}{space 3} 10.78671
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-9.351961{col 26}{space 2} 10.01902{col 37}{space 1}   -0.93{col 46}{space 3}0.351{col 54}{space 4}-28.99242{col 67}{space 3}  10.2885
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-8.388564{col 26}{space 2} 10.03252{col 37}{space 1}   -0.84{col 46}{space 3}0.403{col 54}{space 4}-28.05548{col 67}{space 3} 11.27835
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-6.739534{col 26}{space 2} 10.19825{col 37}{space 1}   -0.66{col 46}{space 3}0.509{col 54}{space 4}-26.73133{col 67}{space 3} 13.25226
{txt}{space 9}MT  {c |}{col 14}{res}{space 2}-10.61745{col 26}{space 2} 10.08035{col 37}{space 1}   -1.05{col 46}{space 3}0.292{col 54}{space 4}-30.37812{col 67}{space 3}  9.14322
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-8.256616{col 26}{space 2}  10.0223{col 37}{space 1}   -0.82{col 46}{space 3}0.410{col 54}{space 4} -27.9035{col 67}{space 3} 11.39027
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-8.025308{col 26}{space 2} 10.22862{col 37}{space 1}   -0.78{col 46}{space 3}0.433{col 54}{space 4}-28.07663{col 67}{space 3} 12.02602
{txt}{space 9}NE  {c |}{col 14}{res}{space 2}-10.80294{col 26}{space 2} 10.02801{col 37}{space 1}   -1.08{col 46}{space 3}0.281{col 54}{space 4}-30.46102{col 67}{space 3} 8.855145
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-10.87008{col 26}{space 2} 10.07202{col 37}{space 1}   -1.08{col 46}{space 3}0.281{col 54}{space 4}-30.61444{col 67}{space 3}  8.87427
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2} -7.89811{col 26}{space 2} 10.02227{col 37}{space 1}   -0.79{col 46}{space 3}0.431{col 54}{space 4}-27.54494{col 67}{space 3} 11.74872
{txt}{space 9}NM  {c |}{col 14}{res}{space 2} -9.52573{col 26}{space 2} 10.15692{col 37}{space 1}   -0.94{col 46}{space 3}0.348{col 54}{space 4}-29.43652{col 67}{space 3} 10.38506
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}-6.501385{col 26}{space 2} 10.15279{col 37}{space 1}   -0.64{col 46}{space 3}0.522{col 54}{space 4}-26.40407{col 67}{space 3}  13.4013
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-8.425152{col 26}{space 2} 10.00903{col 37}{space 1}   -0.84{col 46}{space 3}0.400{col 54}{space 4}-28.04602{col 67}{space 3} 11.19571
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-9.204715{col 26}{space 2} 10.01052{col 37}{space 1}   -0.92{col 46}{space 3}0.358{col 54}{space 4} -28.8285{col 67}{space 3} 10.41907
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-4.842332{col 26}{space 2} 10.20004{col 37}{space 1}   -0.47{col 46}{space 3}0.635{col 54}{space 4}-24.83763{col 67}{space 3} 15.15297
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-10.32937{col 26}{space 2} 10.02441{col 37}{space 1}   -1.03{col 46}{space 3}0.303{col 54}{space 4}-29.98039{col 67}{space 3} 9.321644
{txt}{space 9}PA  {c |}{col 14}{res}{space 2} -9.27996{col 26}{space 2} 10.00426{col 37}{space 1}   -0.93{col 46}{space 3}0.354{col 54}{space 4}-28.89148{col 67}{space 3} 10.33156
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-5.979079{col 26}{space 2} 10.65016{col 37}{space 1}   -0.56{col 46}{space 3}0.575{col 54}{space 4}-26.85677{col 67}{space 3} 14.89861
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-6.678103{col 26}{space 2} 10.10353{col 37}{space 1}   -0.66{col 46}{space 3}0.509{col 54}{space 4}-26.48422{col 67}{space 3} 13.12802
{txt}{space 9}SD  {c |}{col 14}{res}{space 2}-9.636217{col 26}{space 2} 10.10498{col 37}{space 1}   -0.95{col 46}{space 3}0.340{col 54}{space 4}-29.44517{col 67}{space 3} 10.17274
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-6.758001{col 26}{space 2} 10.05295{col 37}{space 1}   -0.67{col 46}{space 3}0.501{col 54}{space 4}-26.46497{col 67}{space 3} 12.94896
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-6.530447{col 26}{space 2} 10.01658{col 37}{space 1}   -0.65{col 46}{space 3}0.514{col 54}{space 4}-26.16611{col 67}{space 3} 13.10522
{txt}{space 9}UT  {c |}{col 14}{res}{space 2} -9.62937{col 26}{space 2} 10.04389{col 37}{space 1}   -0.96{col 46}{space 3}0.338{col 54}{space 4}-29.31858{col 67}{space 3} 10.05984
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}  -8.5277{col 26}{space 2} 10.03394{col 37}{space 1}   -0.85{col 46}{space 3}0.395{col 54}{space 4} -28.1974{col 67}{space 3}   11.142
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}-12.57225{col 26}{space 2} 10.01314{col 37}{space 1}   -1.26{col 46}{space 3}0.209{col 54}{space 4}-32.20117{col 67}{space 3} 7.056681
{txt}{space 9}WA  {c |}{col 14}{res}{space 2}-8.810364{col 26}{space 2} 10.03361{col 37}{space 1}   -0.88{col 46}{space 3}0.380{col 54}{space 4}-28.47941{col 67}{space 3} 10.85868
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-8.544336{col 26}{space 2} 10.02558{col 37}{space 1}   -0.85{col 46}{space 3}0.394{col 54}{space 4}-28.19764{col 67}{space 3} 11.10897
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-9.921867{col 26}{space 2} 10.11562{col 37}{space 1}   -0.98{col 46}{space 3}0.327{col 54}{space 4}-29.75169{col 67}{space 3} 9.907951
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-9.895118{col 26}{space 2} 10.25314{col 37}{space 1}   -0.97{col 46}{space 3}0.335{col 54}{space 4}-29.99452{col 67}{space 3} 10.20428
{txt}{space 12} {c |}
{space 7}2.Q33 {c |}{col 14}{res}{space 2} 1.417677{col 26}{space 2} .3041928{col 37}{space 1}    4.66{col 46}{space 3}0.000{col 54}{space 4} .8213633{col 67}{space 3} 2.013992
{txt}{space 7}2.Q34 {c |}{col 14}{res}{space 2}-.9690662{col 26}{space 2} .6541274{col 37}{space 1}   -1.48{col 46}{space 3}0.139{col 54}{space 4}-2.251363{col 67}{space 3} .3132306
{txt}{space 7}Q35_1 {c |}{col 14}{res}{space 2}-1.356246{col 26}{space 2} .9911674{col 37}{space 1}   -1.37{col 46}{space 3}0.171{col 54}{space 4}-3.299248{col 67}{space 3} .5867557
{txt}{space 7}Q35_2 {c |}{col 14}{res}{space 2} 1.062918{col 26}{space 2} 1.066295{col 37}{space 1}    1.00{col 46}{space 3}0.319{col 54}{space 4}-1.027357{col 67}{space 3} 3.153194
{txt}{space 7}Q35_3 {c |}{col 14}{res}{space 2}-.6205916{col 26}{space 2} 1.095071{col 37}{space 1}   -0.57{col 46}{space 3}0.571{col 54}{space 4}-2.767277{col 67}{space 3} 1.526094
{txt}{space 7}Q35_4 {c |}{col 14}{res}{space 2}-.9844612{col 26}{space 2} 1.089451{col 37}{space 1}   -0.90{col 46}{space 3}0.366{col 54}{space 4}-3.120131{col 67}{space 3} 1.151208
{txt}{space 7}Q35_5 {c |}{col 14}{res}{space 2} 2.467797{col 26}{space 2} 3.367538{col 37}{space 1}    0.73{col 46}{space 3}0.464{col 54}{space 4}-4.133643{col 67}{space 3} 9.069237
{txt}{space 7}Q35_6 {c |}{col 14}{res}{space 2}-.0194969{col 26}{space 2} 1.073858{col 37}{space 1}   -0.02{col 46}{space 3}0.986{col 54}{space 4}-2.124598{col 67}{space 3} 2.085604
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 18.54381{col 26}{space 2} 10.17958{col 37}{space 1}    1.82{col 46}{space 3}0.069{col 54}{space 4}-1.411396{col 67}{space 3} 38.49902
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est2{txt} stored)

Linear regression                                      Number of obs ={res}    5667
                                                       {txt}F( 75,  5591) ={res}    3.20
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0374
                                                       {txt}Root MSE      = {res} 10.374

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     Q24_var{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2}-.0991212{col 26}{space 2} .8595684{col 37}{space 1}   -0.12{col 46}{space 3}0.908{col 54}{space 4}-1.784209{col 67}{space 3} 1.585967
{txt}{space 8}Old  {c |}{col 14}{res}{space 2} .1986492{col 26}{space 2} 1.226734{col 37}{space 1}    0.16{col 46}{space 3}0.871{col 54}{space 4}-2.206226{col 67}{space 3} 2.603525
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2}-1.367667{col 26}{space 2} .6318349{col 37}{space 1}   -2.16{col 46}{space 3}0.030{col 54}{space 4}-2.606309{col 67}{space 3} -.129025
{txt}High Educ..  {c |}{col 14}{res}{space 2}-1.936481{col 26}{space 2} .6014833{col 37}{space 1}   -3.22{col 46}{space 3}0.001{col 54}{space 4}-3.115622{col 67}{space 3}-.7573401
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2}-1.943197{col 26}{space 2} .4733545{col 37}{space 1}   -4.11{col 46}{space 3}0.000{col 54}{space 4}-2.871156{col 67}{space 3}-1.015238
{txt}High Income  {c |}{col 14}{res}{space 2}-1.928662{col 26}{space 2} .4653515{col 37}{space 1}   -4.14{col 46}{space 3}0.000{col 54}{space 4}-2.840932{col 67}{space 3}-1.016392
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2} .4972111{col 26}{space 2} .8863975{col 37}{space 1}    0.56{col 46}{space 3}0.575{col 54}{space 4}-1.240472{col 67}{space 3} 2.234894
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} 2.145721{col 26}{space 2} 1.258384{col 37}{space 1}    1.71{col 46}{space 3}0.088{col 54}{space 4}-.3211994{col 67}{space 3} 4.612642
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2}-.6394597{col 26}{space 2} .4355526{col 37}{space 1}   -1.47{col 46}{space 3}0.142{col 54}{space 4}-1.493312{col 67}{space 3} .2143925
{txt}{space 7}2015  {c |}{col 14}{res}{space 2}-.5107139{col 26}{space 2} .4481582{col 37}{space 1}   -1.14{col 46}{space 3}0.255{col 54}{space 4}-1.389278{col 67}{space 3} .3678502
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.6443843{col 26}{space 2}  .448799{col 37}{space 1}   -1.44{col 46}{space 3}0.151{col 54}{space 4}-1.524205{col 67}{space 3}  .235436
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .2750944{col 26}{space 2} .4821944{col 37}{space 1}    0.57{col 46}{space 3}0.568{col 54}{space 4}-.6701938{col 67}{space 3} 1.220383
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.7318265{col 26}{space 2} .5876646{col 37}{space 1}   -1.25{col 46}{space 3}0.213{col 54}{space 4}-1.883877{col 67}{space 3} .4202244
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2}-11.02025{col 26}{space 2} 12.12702{col 37}{space 1}   -0.91{col 46}{space 3}0.364{col 54}{space 4}-34.79391{col 67}{space 3} 12.75342
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-13.03281{col 26}{space 2} 12.17786{col 37}{space 1}   -1.07{col 46}{space 3}0.285{col 54}{space 4}-36.90615{col 67}{space 3} 10.84052
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-12.84985{col 26}{space 2} 12.06002{col 37}{space 1}   -1.07{col 46}{space 3}0.287{col 54}{space 4}-36.49217{col 67}{space 3} 10.79246
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-12.01999{col 26}{space 2} 12.05593{col 37}{space 1}   -1.00{col 46}{space 3}0.319{col 54}{space 4} -35.6543{col 67}{space 3} 11.61432
{txt}{space 9}CO  {c |}{col 14}{res}{space 2}-13.15853{col 26}{space 2} 12.06067{col 37}{space 1}   -1.09{col 46}{space 3}0.275{col 54}{space 4}-36.80212{col 67}{space 3} 10.48506
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-13.55464{col 26}{space 2} 12.06531{col 37}{space 1}   -1.12{col 46}{space 3}0.261{col 54}{space 4}-37.20734{col 67}{space 3} 10.09806
{txt}{space 9}DC  {c |}{col 14}{res}{space 2}-12.68472{col 26}{space 2} 12.09488{col 37}{space 1}   -1.05{col 46}{space 3}0.294{col 54}{space 4}-36.39538{col 67}{space 3} 11.02595
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-12.94679{col 26}{space 2} 12.44473{col 37}{space 1}   -1.04{col 46}{space 3}0.298{col 54}{space 4} -37.3433{col 67}{space 3} 11.44973
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-12.11886{col 26}{space 2} 12.05491{col 37}{space 1}   -1.01{col 46}{space 3}0.315{col 54}{space 4}-35.75116{col 67}{space 3} 11.51344
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-12.60849{col 26}{space 2} 12.05888{col 37}{space 1}   -1.05{col 46}{space 3}0.296{col 54}{space 4}-36.24858{col 67}{space 3} 11.03159
{txt}{space 9}HI  {c |}{col 14}{res}{space 2}  -14.163{col 26}{space 2} 12.23587{col 37}{space 1}   -1.16{col 46}{space 3}0.247{col 54}{space 4}-38.15006{col 67}{space 3}  9.82405
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-15.21695{col 26}{space 2} 12.04819{col 37}{space 1}   -1.26{col 46}{space 3}0.207{col 54}{space 4}-38.83608{col 67}{space 3}  8.40218
{txt}{space 9}ID  {c |}{col 14}{res}{space 2} -14.0524{col 26}{space 2} 12.14445{col 37}{space 1}   -1.16{col 46}{space 3}0.247{col 54}{space 4}-37.86024{col 67}{space 3} 9.755433
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-13.81027{col 26}{space 2} 12.04552{col 37}{space 1}   -1.15{col 46}{space 3}0.252{col 54}{space 4}-37.42417{col 67}{space 3} 9.803629
{txt}{space 9}IN  {c |}{col 14}{res}{space 2} -12.5483{col 26}{space 2} 12.07715{col 37}{space 1}   -1.04{col 46}{space 3}0.299{col 54}{space 4}-36.22419{col 67}{space 3}  11.1276
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-13.23624{col 26}{space 2} 12.10849{col 37}{space 1}   -1.09{col 46}{space 3}0.274{col 54}{space 4}-36.97358{col 67}{space 3} 10.50111
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-12.87774{col 26}{space 2} 12.11049{col 37}{space 1}   -1.06{col 46}{space 3}0.288{col 54}{space 4}  -36.619{col 67}{space 3} 10.86352
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-12.02944{col 26}{space 2} 12.14153{col 37}{space 1}   -0.99{col 46}{space 3}0.322{col 54}{space 4}-35.83156{col 67}{space 3} 11.77268
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-10.69728{col 26}{space 2} 12.08715{col 37}{space 1}   -0.89{col 46}{space 3}0.376{col 54}{space 4}-34.39279{col 67}{space 3} 12.99823
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-12.25147{col 26}{space 2}  12.0758{col 37}{space 1}   -1.01{col 46}{space 3}0.310{col 54}{space 4}-35.92472{col 67}{space 3} 11.42178
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-13.64106{col 26}{space 2} 12.09797{col 37}{space 1}   -1.13{col 46}{space 3}0.260{col 54}{space 4}-37.35778{col 67}{space 3} 10.07567
{txt}{space 9}MI  {c |}{col 14}{res}{space 2}-12.93677{col 26}{space 2}   12.048{col 37}{space 1}   -1.07{col 46}{space 3}0.283{col 54}{space 4}-36.55553{col 67}{space 3}   10.682
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-13.61785{col 26}{space 2} 12.05402{col 37}{space 1}   -1.13{col 46}{space 3}0.259{col 54}{space 4}-37.24842{col 67}{space 3} 10.01271
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-13.10941{col 26}{space 2} 12.06207{col 37}{space 1}   -1.09{col 46}{space 3}0.277{col 54}{space 4}-36.75576{col 67}{space 3} 10.53693
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-12.86081{col 26}{space 2} 12.12938{col 37}{space 1}   -1.06{col 46}{space 3}0.289{col 54}{space 4} -36.6391{col 67}{space 3} 10.91748
{txt}{space 9}MT  {c |}{col 14}{res}{space 2}-13.99271{col 26}{space 2} 12.12648{col 37}{space 1}   -1.15{col 46}{space 3}0.249{col 54}{space 4}-37.76533{col 67}{space 3} 9.779913
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-13.17765{col 26}{space 2}  12.0498{col 37}{space 1}   -1.09{col 46}{space 3}0.274{col 54}{space 4}-36.79994{col 67}{space 3} 10.44464
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-11.61059{col 26}{space 2} 12.26298{col 37}{space 1}   -0.95{col 46}{space 3}0.344{col 54}{space 4}-35.65078{col 67}{space 3} 12.42961
{txt}{space 9}NE  {c |}{col 14}{res}{space 2}-14.40171{col 26}{space 2} 12.05326{col 37}{space 1}   -1.19{col 46}{space 3}0.232{col 54}{space 4}-38.03079{col 67}{space 3} 9.227368
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-15.90217{col 26}{space 2} 12.04459{col 37}{space 1}   -1.32{col 46}{space 3}0.187{col 54}{space 4}-39.51424{col 67}{space 3} 7.709896
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-12.25496{col 26}{space 2} 12.06266{col 37}{space 1}   -1.02{col 46}{space 3}0.310{col 54}{space 4}-35.90247{col 67}{space 3} 11.39254
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-14.01263{col 26}{space 2} 12.14269{col 37}{space 1}   -1.15{col 46}{space 3}0.249{col 54}{space 4}-37.81701{col 67}{space 3} 9.791756
{txt}{space 9}NV  {c |}{col 14}{res}{space 2} -10.6245{col 26}{space 2} 12.16644{col 37}{space 1}   -0.87{col 46}{space 3}0.383{col 54}{space 4}-34.47546{col 67}{space 3} 13.22645
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-13.16182{col 26}{space 2} 12.04544{col 37}{space 1}   -1.09{col 46}{space 3}0.275{col 54}{space 4}-36.77557{col 67}{space 3} 10.45192
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-12.83222{col 26}{space 2} 12.04937{col 37}{space 1}   -1.06{col 46}{space 3}0.287{col 54}{space 4}-36.45366{col 67}{space 3} 10.78921
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-10.45566{col 26}{space 2} 12.19608{col 37}{space 1}   -0.86{col 46}{space 3}0.391{col 54}{space 4}-34.36471{col 67}{space 3} 13.45339
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-14.44372{col 26}{space 2} 12.05091{col 37}{space 1}   -1.20{col 46}{space 3}0.231{col 54}{space 4}-38.06818{col 67}{space 3}  9.18075
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-13.33442{col 26}{space 2}  12.0419{col 37}{space 1}   -1.11{col 46}{space 3}0.268{col 54}{space 4}-36.94121{col 67}{space 3} 10.27238
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-8.700723{col 26}{space 2} 12.62252{col 37}{space 1}   -0.69{col 46}{space 3}0.491{col 54}{space 4}-33.44577{col 67}{space 3} 16.04432
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-11.16718{col 26}{space 2} 12.13828{col 37}{space 1}   -0.92{col 46}{space 3}0.358{col 54}{space 4}-34.96292{col 67}{space 3} 12.62856
{txt}{space 9}SD  {c |}{col 14}{res}{space 2}-14.43364{col 26}{space 2} 12.09201{col 37}{space 1}   -1.19{col 46}{space 3}0.233{col 54}{space 4}-38.13868{col 67}{space 3} 9.271395
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-10.31299{col 26}{space 2} 12.09288{col 37}{space 1}   -0.85{col 46}{space 3}0.394{col 54}{space 4}-34.01973{col 67}{space 3} 13.39375
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-11.48332{col 26}{space 2} 12.04958{col 37}{space 1}   -0.95{col 46}{space 3}0.341{col 54}{space 4}-35.10519{col 67}{space 3} 12.13854
{txt}{space 9}UT  {c |}{col 14}{res}{space 2} -12.6517{col 26}{space 2}  12.0851{col 37}{space 1}   -1.05{col 46}{space 3}0.295{col 54}{space 4} -36.3432{col 67}{space 3}  11.0398
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}-12.85636{col 26}{space 2}  12.0624{col 37}{space 1}   -1.07{col 46}{space 3}0.287{col 54}{space 4}-36.50335{col 67}{space 3} 10.79062
{txt}{space 9}VT  {c |}{col 14}{res}{space 2} -15.4943{col 26}{space 2} 12.04933{col 37}{space 1}   -1.29{col 46}{space 3}0.199{col 54}{space 4}-39.11566{col 67}{space 3} 8.127062
{txt}{space 9}WA  {c |}{col 14}{res}{space 2}-13.55538{col 26}{space 2} 12.06019{col 37}{space 1}   -1.12{col 46}{space 3}0.261{col 54}{space 4}-37.19804{col 67}{space 3} 10.08728
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-12.50834{col 26}{space 2} 12.06061{col 37}{space 1}   -1.04{col 46}{space 3}0.300{col 54}{space 4}-36.15181{col 67}{space 3} 11.13514
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-12.84921{col 26}{space 2} 12.17519{col 37}{space 1}   -1.06{col 46}{space 3}0.291{col 54}{space 4}-36.71732{col 67}{space 3}  11.0189
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-13.65328{col 26}{space 2} 12.31293{col 37}{space 1}   -1.11{col 46}{space 3}0.268{col 54}{space 4}-37.79141{col 67}{space 3} 10.48485
{txt}{space 12} {c |}
{space 7}2.Q33 {c |}{col 14}{res}{space 2} 1.070974{col 26}{space 2}  .285995{col 37}{space 1}    3.74{col 46}{space 3}0.000{col 54}{space 4} .5103127{col 67}{space 3} 1.631635
{txt}{space 7}2.Q34 {c |}{col 14}{res}{space 2}-1.319892{col 26}{space 2} .6002101{col 37}{space 1}   -2.20{col 46}{space 3}0.028{col 54}{space 4}-2.496537{col 67}{space 3}-.1432474
{txt}{space 7}Q35_1 {c |}{col 14}{res}{space 2} -1.67957{col 26}{space 2} .8881165{col 37}{space 1}   -1.89{col 46}{space 3}0.059{col 54}{space 4}-3.420623{col 67}{space 3} .0614831
{txt}{space 7}Q35_2 {c |}{col 14}{res}{space 2} .8222342{col 26}{space 2} .9722264{col 37}{space 1}    0.85{col 46}{space 3}0.398{col 54}{space 4}-1.083707{col 67}{space 3} 2.728176
{txt}{space 7}Q35_3 {c |}{col 14}{res}{space 2} .2506799{col 26}{space 2} 1.104376{col 37}{space 1}    0.23{col 46}{space 3}0.820{col 54}{space 4}-1.914327{col 67}{space 3} 2.415686
{txt}{space 7}Q35_4 {c |}{col 14}{res}{space 2}-.7155254{col 26}{space 2} .9705535{col 37}{space 1}   -0.74{col 46}{space 3}0.461{col 54}{space 4}-2.618187{col 67}{space 3} 1.187136
{txt}{space 7}Q35_5 {c |}{col 14}{res}{space 2} 1.888517{col 26}{space 2} 2.999006{col 37}{space 1}    0.63{col 46}{space 3}0.529{col 54}{space 4}  -3.9907{col 67}{space 3} 7.767734
{txt}{space 7}Q35_6 {c |}{col 14}{res}{space 2}-1.569339{col 26}{space 2} .9567536{col 37}{space 1}   -1.64{col 46}{space 3}0.101{col 54}{space 4}-3.444948{col 67}{space 3} .3062693
{txt}{space 7}Q4new {c |}{col 14}{res}{space 2} .0000706{col 26}{space 2} .0066057{col 37}{space 1}    0.01{col 46}{space 3}0.991{col 54}{space 4}-.0128791{col 67}{space 3} .0130203
{txt}{space 7}Q6new {c |}{col 14}{res}{space 2} .0077218{col 26}{space 2}  .006703{col 37}{space 1}    1.15{col 46}{space 3}0.249{col 54}{space 4}-.0054187{col 67}{space 3} .0208623
{txt}{space 5}Q9_mean {c |}{col 14}{res}{space 2}-.0547353{col 26}{space 2} .0392993{col 37}{space 1}   -1.39{col 46}{space 3}0.164{col 54}{space 4}-.1317771{col 67}{space 3} .0223065
{txt}{space 6}Q13new {c |}{col 14}{res}{space 2} .0047148{col 26}{space 2} .0072319{col 37}{space 1}    0.65{col 46}{space 3}0.514{col 54}{space 4}-.0094625{col 67}{space 3} .0188921
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 22.08927{col 26}{space 2} 12.16978{col 37}{space 1}    1.82{col 46}{space 3}0.070{col 54}{space 4}-1.768226{col 67}{space 3} 45.94677
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est3{txt} stored)

Linear regression                                      Number of obs ={res}    7679
                                                       {txt}F( 63,  7615) ={res}    4.72
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0530
                                                       {txt}Root MSE      = {res} 4.3227

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     Q24_iqr{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2} .0422849{col 26}{space 2} .2742097{col 37}{space 1}    0.15{col 46}{space 3}0.877{col 54}{space 4}-.4952418{col 67}{space 3} .5798115
{txt}{space 8}Old  {c |}{col 14}{res}{space 2} .6230217{col 26}{space 2} .4354205{col 37}{space 1}    1.43{col 46}{space 3}0.153{col 54}{space 4}-.2305224{col 67}{space 3} 1.476566
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2}-.9771918{col 26}{space 2} .2452862{col 37}{space 1}   -3.98{col 46}{space 3}0.000{col 54}{space 4} -1.45802{col 67}{space 3}-.4963632
{txt}High Educ..  {c |}{col 14}{res}{space 2}-1.506393{col 26}{space 2} .2331523{col 37}{space 1}   -6.46{col 46}{space 3}0.000{col 54}{space 4}-1.963435{col 67}{space 3} -1.04935
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2}-1.352871{col 26}{space 2} .1713259{col 37}{space 1}   -7.90{col 46}{space 3}0.000{col 54}{space 4}-1.688717{col 67}{space 3}-1.017025
{txt}High Income  {c |}{col 14}{res}{space 2}-1.447345{col 26}{space 2} .1602556{col 37}{space 1}   -9.03{col 46}{space 3}0.000{col 54}{space 4} -1.76149{col 67}{space 3}  -1.1332
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2} .5857874{col 26}{space 2} .3414449{col 37}{space 1}    1.72{col 46}{space 3}0.086{col 54}{space 4}-.0835386{col 67}{space 3} 1.255113
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} 1.154169{col 26}{space 2} .4410631{col 37}{space 1}    2.62{col 46}{space 3}0.009{col 54}{space 4} .2895642{col 67}{space 3} 2.018775
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2} .1560307{col 26}{space 2} .1585767{col 37}{space 1}    0.98{col 46}{space 3}0.325{col 54}{space 4}-.1548234{col 67}{space 3} .4668848
{txt}{space 7}2015  {c |}{col 14}{res}{space 2} .1005679{col 26}{space 2}  .155383{col 37}{space 1}    0.65{col 46}{space 3}0.518{col 54}{space 4}-.2040257{col 67}{space 3} .4051615
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1723804{col 26}{space 2}  .159175{col 37}{space 1}    1.08{col 46}{space 3}0.279{col 54}{space 4}-.1396464{col 67}{space 3} .4844072
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}  .188118{col 26}{space 2} .1537121{col 37}{space 1}    1.22{col 46}{space 3}0.221{col 54}{space 4}-.1132001{col 67}{space 3}  .489436
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .2363508{col 26}{space 2} .2293825{col 37}{space 1}    1.03{col 46}{space 3}0.303{col 54}{space 4} -.213302{col 67}{space 3} .6860037
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2}-2.618124{col 26}{space 2} 2.331909{col 37}{space 1}   -1.12{col 46}{space 3}0.262{col 54}{space 4}-7.189308{col 67}{space 3} 1.953059
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-3.963737{col 26}{space 2} 2.314234{col 37}{space 1}   -1.71{col 46}{space 3}0.087{col 54}{space 4}-8.500273{col 67}{space 3} .5727993
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-2.641485{col 26}{space 2}  2.31301{col 37}{space 1}   -1.14{col 46}{space 3}0.253{col 54}{space 4}-7.175621{col 67}{space 3} 1.892651
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-2.545004{col 26}{space 2} 2.287399{col 37}{space 1}   -1.11{col 46}{space 3}0.266{col 54}{space 4}-7.028936{col 67}{space 3} 1.938928
{txt}{space 9}CO  {c |}{col 14}{res}{space 2} -2.87882{col 26}{space 2} 2.302246{col 37}{space 1}   -1.25{col 46}{space 3}0.211{col 54}{space 4}-7.391857{col 67}{space 3} 1.634217
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-3.473184{col 26}{space 2} 2.298644{col 37}{space 1}   -1.51{col 46}{space 3}0.131{col 54}{space 4} -7.97916{col 67}{space 3} 1.032791
{txt}{space 9}DC  {c |}{col 14}{res}{space 2}-2.447037{col 26}{space 2} 2.442184{col 37}{space 1}   -1.00{col 46}{space 3}0.316{col 54}{space 4} -7.23439{col 67}{space 3} 2.340315
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-2.949113{col 26}{space 2} 2.543188{col 37}{space 1}   -1.16{col 46}{space 3}0.246{col 54}{space 4}-7.934462{col 67}{space 3} 2.036237
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-2.474733{col 26}{space 2} 2.296666{col 37}{space 1}   -1.08{col 46}{space 3}0.281{col 54}{space 4}-6.976831{col 67}{space 3} 2.027366
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-2.685757{col 26}{space 2} 2.301439{col 37}{space 1}   -1.17{col 46}{space 3}0.243{col 54}{space 4}-7.197213{col 67}{space 3} 1.825698
{txt}{space 9}HI  {c |}{col 14}{res}{space 2}-2.811917{col 26}{space 2} 2.430568{col 37}{space 1}   -1.16{col 46}{space 3}0.247{col 54}{space 4}-7.576501{col 67}{space 3} 1.952667
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-3.871155{col 26}{space 2}  2.31792{col 37}{space 1}   -1.67{col 46}{space 3}0.095{col 54}{space 4}-8.414917{col 67}{space 3} .6726073
{txt}{space 9}ID  {c |}{col 14}{res}{space 2}-3.993425{col 26}{space 2} 2.313278{col 37}{space 1}   -1.73{col 46}{space 3}0.084{col 54}{space 4}-8.528087{col 67}{space 3} .5412378
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-3.135013{col 26}{space 2} 2.293078{col 37}{space 1}   -1.37{col 46}{space 3}0.172{col 54}{space 4}-7.630078{col 67}{space 3} 1.360052
{txt}{space 9}IN  {c |}{col 14}{res}{space 2}-3.059895{col 26}{space 2} 2.304664{col 37}{space 1}   -1.33{col 46}{space 3}0.184{col 54}{space 4}-7.577672{col 67}{space 3} 1.457882
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-3.232505{col 26}{space 2} 2.321953{col 37}{space 1}   -1.39{col 46}{space 3}0.164{col 54}{space 4}-7.784174{col 67}{space 3} 1.319163
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-3.608152{col 26}{space 2} 2.314519{col 37}{space 1}   -1.56{col 46}{space 3}0.119{col 54}{space 4}-8.145247{col 67}{space 3} .9289433
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-1.000874{col 26}{space 2} 2.421742{col 37}{space 1}   -0.41{col 46}{space 3}0.679{col 54}{space 4}-5.748156{col 67}{space 3} 3.746408
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-2.857379{col 26}{space 2} 2.305132{col 37}{space 1}   -1.24{col 46}{space 3}0.215{col 54}{space 4}-7.376073{col 67}{space 3} 1.661315
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-2.851087{col 26}{space 2} 2.303468{col 37}{space 1}   -1.24{col 46}{space 3}0.216{col 54}{space 4}-7.366518{col 67}{space 3} 1.664344
{txt}{space 9}ME  {c |}{col 14}{res}{space 2} -3.25583{col 26}{space 2} 2.353329{col 37}{space 1}   -1.38{col 46}{space 3}0.167{col 54}{space 4}-7.869003{col 67}{space 3} 1.357342
{txt}{space 9}MI  {c |}{col 14}{res}{space 2}-3.321987{col 26}{space 2}  2.29339{col 37}{space 1}   -1.45{col 46}{space 3}0.148{col 54}{space 4}-7.817663{col 67}{space 3} 1.173689
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-3.275772{col 26}{space 2} 2.301835{col 37}{space 1}   -1.42{col 46}{space 3}0.155{col 54}{space 4}-7.788002{col 67}{space 3} 1.236458
{txt}{space 9}MO  {c |}{col 14}{res}{space 2} -3.24444{col 26}{space 2} 2.302327{col 37}{space 1}   -1.41{col 46}{space 3}0.159{col 54}{space 4}-7.757635{col 67}{space 3} 1.268755
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-1.906799{col 26}{space 2} 2.435989{col 37}{space 1}   -0.78{col 46}{space 3}0.434{col 54}{space 4} -6.68201{col 67}{space 3} 2.868411
{txt}{space 9}MT  {c |}{col 14}{res}{space 2}-3.783932{col 26}{space 2} 2.381056{col 37}{space 1}   -1.59{col 46}{space 3}0.112{col 54}{space 4}-8.451457{col 67}{space 3} .8835932
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-2.481941{col 26}{space 2} 2.302282{col 37}{space 1}   -1.08{col 46}{space 3}0.281{col 54}{space 4}-6.995048{col 67}{space 3} 2.031166
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-2.794036{col 26}{space 2} 2.399495{col 37}{space 1}   -1.16{col 46}{space 3}0.244{col 54}{space 4}-7.497708{col 67}{space 3} 1.909636
{txt}{space 9}NE  {c |}{col 14}{res}{space 2}-3.648067{col 26}{space 2} 2.309093{col 37}{space 1}   -1.58{col 46}{space 3}0.114{col 54}{space 4}-8.174525{col 67}{space 3} .8783907
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-4.052743{col 26}{space 2} 2.326392{col 37}{space 1}   -1.74{col 46}{space 3}0.082{col 54}{space 4}-8.613113{col 67}{space 3} .5076275
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-2.465352{col 26}{space 2} 2.300075{col 37}{space 1}   -1.07{col 46}{space 3}0.284{col 54}{space 4}-6.974134{col 67}{space 3} 2.043429
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-3.204313{col 26}{space 2} 2.387746{col 37}{space 1}   -1.34{col 46}{space 3}0.180{col 54}{space 4}-7.884953{col 67}{space 3} 1.476327
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}-2.814077{col 26}{space 2} 2.339451{col 37}{space 1}   -1.20{col 46}{space 3}0.229{col 54}{space 4}-7.400045{col 67}{space 3} 1.771892
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-2.767451{col 26}{space 2} 2.291026{col 37}{space 1}   -1.21{col 46}{space 3}0.227{col 54}{space 4}-7.258494{col 67}{space 3} 1.723592
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-3.415775{col 26}{space 2} 2.292617{col 37}{space 1}   -1.49{col 46}{space 3}0.136{col 54}{space 4}-7.909935{col 67}{space 3} 1.078386
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-1.068665{col 26}{space 2} 2.376087{col 37}{space 1}   -0.45{col 46}{space 3}0.653{col 54}{space 4}-5.726451{col 67}{space 3} 3.589121
{txt}{space 9}OR  {c |}{col 14}{res}{space 2} -3.70367{col 26}{space 2} 2.314033{col 37}{space 1}   -1.60{col 46}{space 3}0.110{col 54}{space 4}-8.239813{col 67}{space 3} .8324724
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-3.327013{col 26}{space 2} 2.290568{col 37}{space 1}   -1.45{col 46}{space 3}0.146{col 54}{space 4}-7.817158{col 67}{space 3} 1.163132
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-2.181051{col 26}{space 2} 2.438113{col 37}{space 1}   -0.89{col 46}{space 3}0.371{col 54}{space 4}-6.960425{col 67}{space 3} 2.598322
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-2.806325{col 26}{space 2} 2.314776{col 37}{space 1}   -1.21{col 46}{space 3}0.225{col 54}{space 4}-7.343924{col 67}{space 3} 1.731274
{txt}{space 9}SD  {c |}{col 14}{res}{space 2}-3.749686{col 26}{space 2} 2.333189{col 37}{space 1}   -1.61{col 46}{space 3}0.108{col 54}{space 4}-8.323379{col 67}{space 3} .8240072
{txt}{space 9}TN  {c |}{col 14}{res}{space 2} -3.09008{col 26}{space 2} 2.299167{col 37}{space 1}   -1.34{col 46}{space 3}0.179{col 54}{space 4}-7.597081{col 67}{space 3} 1.416921
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-2.227913{col 26}{space 2} 2.292597{col 37}{space 1}   -0.97{col 46}{space 3}0.331{col 54}{space 4}-6.722035{col 67}{space 3} 2.266209
{txt}{space 9}UT  {c |}{col 14}{res}{space 2}-3.034712{col 26}{space 2} 2.347469{col 37}{space 1}   -1.29{col 46}{space 3}0.196{col 54}{space 4}-7.636397{col 67}{space 3} 1.566974
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}-2.593389{col 26}{space 2} 2.308584{col 37}{space 1}   -1.12{col 46}{space 3}0.261{col 54}{space 4} -7.11885{col 67}{space 3} 1.932071
{txt}{space 9}VT  {c |}{col 14}{res}{space 2} -4.66065{col 26}{space 2} 2.309105{col 37}{space 1}   -2.02{col 46}{space 3}0.044{col 54}{space 4}-9.187133{col 67}{space 3}-.1341665
{txt}{space 9}WA  {c |}{col 14}{res}{space 2} -3.46287{col 26}{space 2} 2.296915{col 37}{space 1}   -1.51{col 46}{space 3}0.132{col 54}{space 4}-7.965456{col 67}{space 3} 1.039716
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-3.790545{col 26}{space 2} 2.292983{col 37}{space 1}   -1.65{col 46}{space 3}0.098{col 54}{space 4}-8.285424{col 67}{space 3} .7043348
{txt}{space 9}WV  {c |}{col 14}{res}{space 2} -3.50951{col 26}{space 2} 2.352837{col 37}{space 1}   -1.49{col 46}{space 3}0.136{col 54}{space 4}-8.121719{col 67}{space 3} 1.102698
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-4.309087{col 26}{space 2} 2.348374{col 37}{space 1}   -1.83{col 46}{space 3}0.067{col 54}{space 4}-8.912547{col 67}{space 3} .2943741
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 7.761387{col 26}{space 2}  2.33467{col 37}{space 1}    3.32{col 46}{space 3}0.001{col 54}{space 4} 3.184791{col 67}{space 3} 12.33798
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est4{txt} stored)

Linear regression                                      Number of obs ={res}    7677
                                                       {txt}F( 71,  7605) ={res}    5.20
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0755
                                                       {txt}Root MSE      = {res} 4.2739

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     Q24_iqr{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2} .0045774{col 26}{space 2} .2761624{col 37}{space 1}    0.02{col 46}{space 3}0.987{col 54}{space 4}-.5367771{col 67}{space 3} .5459319
{txt}{space 8}Old  {c |}{col 14}{res}{space 2} .5563672{col 26}{space 2} .4374311{col 37}{space 1}    1.27{col 46}{space 3}0.203{col 54}{space 4}-.3011185{col 67}{space 3} 1.413853
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2}-.9497873{col 26}{space 2} .2411271{col 37}{space 1}   -3.94{col 46}{space 3}0.000{col 54}{space 4}-1.422463{col 67}{space 3}-.4771115
{txt}High Educ..  {c |}{col 14}{res}{space 2}-1.421638{col 26}{space 2} .2286757{col 37}{space 1}   -6.22{col 46}{space 3}0.000{col 54}{space 4}-1.869905{col 67}{space 3}-.9733704
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2}-1.270713{col 26}{space 2} .1696121{col 37}{space 1}   -7.49{col 46}{space 3}0.000{col 54}{space 4}-1.603199{col 67}{space 3}-.9382265
{txt}High Income  {c |}{col 14}{res}{space 2}-1.291359{col 26}{space 2} .1605028{col 37}{space 1}   -8.05{col 46}{space 3}0.000{col 54}{space 4}-1.605989{col 67}{space 3}-.9767296
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2}  .452298{col 26}{space 2} .3405215{col 37}{space 1}    1.33{col 46}{space 3}0.184{col 54}{space 4}-.2152181{col 67}{space 3} 1.119814
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} .9653935{col 26}{space 2} .4414708{col 37}{space 1}    2.19{col 46}{space 3}0.029{col 54}{space 4} .0999889{col 67}{space 3} 1.830798
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2} .0839247{col 26}{space 2} .1567718{col 37}{space 1}    0.54{col 46}{space 3}0.592{col 54}{space 4}-.2233913{col 67}{space 3} .3912407
{txt}{space 7}2015  {c |}{col 14}{res}{space 2} .0340731{col 26}{space 2} .1533015{col 37}{space 1}    0.22{col 46}{space 3}0.824{col 54}{space 4}-.2664401{col 67}{space 3} .3345863
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0953294{col 26}{space 2} .1574801{col 37}{space 1}    0.61{col 46}{space 3}0.545{col 54}{space 4} -.213375{col 67}{space 3} .4040337
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1234763{col 26}{space 2}  .152336{col 37}{space 1}    0.81{col 46}{space 3}0.418{col 54}{space 4}-.1751443{col 67}{space 3}  .422097
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1931311{col 26}{space 2} .2262237{col 37}{space 1}    0.85{col 46}{space 3}0.393{col 54}{space 4}-.2503299{col 67}{space 3} .6365921
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2}-2.686532{col 26}{space 2} 2.224978{col 37}{space 1}   -1.21{col 46}{space 3}0.227{col 54}{space 4}-7.048104{col 67}{space 3} 1.675039
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-3.763599{col 26}{space 2} 2.209685{col 37}{space 1}   -1.70{col 46}{space 3}0.089{col 54}{space 4}-8.095191{col 67}{space 3} .5679936
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-2.495476{col 26}{space 2} 2.210572{col 37}{space 1}   -1.13{col 46}{space 3}0.259{col 54}{space 4}-6.828806{col 67}{space 3} 1.837854
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-2.503709{col 26}{space 2}  2.18464{col 37}{space 1}   -1.15{col 46}{space 3}0.252{col 54}{space 4}-6.786207{col 67}{space 3} 1.778788
{txt}{space 9}CO  {c |}{col 14}{res}{space 2}-2.585423{col 26}{space 2} 2.200069{col 37}{space 1}   -1.18{col 46}{space 3}0.240{col 54}{space 4}-6.898165{col 67}{space 3} 1.727319
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-3.302105{col 26}{space 2} 2.196546{col 37}{space 1}   -1.50{col 46}{space 3}0.133{col 54}{space 4}-7.607942{col 67}{space 3} 1.003732
{txt}{space 9}DC  {c |}{col 14}{res}{space 2}-2.480672{col 26}{space 2} 2.332822{col 37}{space 1}   -1.06{col 46}{space 3}0.288{col 54}{space 4}-7.053647{col 67}{space 3} 2.092304
{txt}{space 9}DE  {c |}{col 14}{res}{space 2} -3.05333{col 26}{space 2}  2.42535{col 37}{space 1}   -1.26{col 46}{space 3}0.208{col 54}{space 4}-7.807685{col 67}{space 3} 1.701024
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-2.372119{col 26}{space 2} 2.192934{col 37}{space 1}   -1.08{col 46}{space 3}0.279{col 54}{space 4}-6.670874{col 67}{space 3} 1.926636
{txt}{space 9}GA  {c |}{col 14}{res}{space 2} -2.90313{col 26}{space 2} 2.199019{col 37}{space 1}   -1.32{col 46}{space 3}0.187{col 54}{space 4}-7.213814{col 67}{space 3} 1.407554
{txt}{space 9}HI  {c |}{col 14}{res}{space 2}-2.712582{col 26}{space 2}  2.33863{col 37}{space 1}   -1.16{col 46}{space 3}0.246{col 54}{space 4}-7.296943{col 67}{space 3} 1.871779
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-3.430023{col 26}{space 2}  2.21443{col 37}{space 1}   -1.55{col 46}{space 3}0.121{col 54}{space 4}-7.770917{col 67}{space 3}   .91087
{txt}{space 9}ID  {c |}{col 14}{res}{space 2}-3.543473{col 26}{space 2} 2.211654{col 37}{space 1}   -1.60{col 46}{space 3}0.109{col 54}{space 4}-7.878924{col 67}{space 3} .7919784
{txt}{space 9}IL  {c |}{col 14}{res}{space 2} -2.90884{col 26}{space 2} 2.190546{col 37}{space 1}   -1.33{col 46}{space 3}0.184{col 54}{space 4}-7.202914{col 67}{space 3} 1.385234
{txt}{space 9}IN  {c |}{col 14}{res}{space 2}-2.751661{col 26}{space 2} 2.202655{col 37}{space 1}   -1.25{col 46}{space 3}0.212{col 54}{space 4}-7.069473{col 67}{space 3} 1.566151
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-2.853095{col 26}{space 2} 2.218445{col 37}{space 1}   -1.29{col 46}{space 3}0.198{col 54}{space 4}-7.201859{col 67}{space 3} 1.495669
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-3.266492{col 26}{space 2} 2.213853{col 37}{space 1}   -1.48{col 46}{space 3}0.140{col 54}{space 4}-7.606255{col 67}{space 3} 1.073271
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-1.060716{col 26}{space 2} 2.313864{col 37}{space 1}   -0.46{col 46}{space 3}0.647{col 54}{space 4}-5.596528{col 67}{space 3} 3.475096
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-2.553829{col 26}{space 2} 2.201741{col 37}{space 1}   -1.16{col 46}{space 3}0.246{col 54}{space 4} -6.86985{col 67}{space 3} 1.762191
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-2.894233{col 26}{space 2} 2.201618{col 37}{space 1}   -1.31{col 46}{space 3}0.189{col 54}{space 4}-7.210012{col 67}{space 3} 1.421545
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-2.726088{col 26}{space 2} 2.254756{col 37}{space 1}   -1.21{col 46}{space 3}0.227{col 54}{space 4}-7.146032{col 67}{space 3} 1.693855
{txt}{space 9}MI  {c |}{col 14}{res}{space 2}-3.036294{col 26}{space 2} 2.189765{col 37}{space 1}   -1.39{col 46}{space 3}0.166{col 54}{space 4}-7.328837{col 67}{space 3} 1.256249
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-2.876141{col 26}{space 2} 2.198513{col 37}{space 1}   -1.31{col 46}{space 3}0.191{col 54}{space 4}-7.185834{col 67}{space 3} 1.433552
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}  -2.8668{col 26}{space 2} 2.199713{col 37}{space 1}   -1.30{col 46}{space 3}0.193{col 54}{space 4}-7.178845{col 67}{space 3} 1.445246
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-2.169362{col 26}{space 2} 2.331534{col 37}{space 1}   -0.93{col 46}{space 3}0.352{col 54}{space 4}-6.739813{col 67}{space 3} 2.401089
{txt}{space 9}MT  {c |}{col 14}{res}{space 2}-3.247983{col 26}{space 2} 2.280216{col 37}{space 1}   -1.42{col 46}{space 3}0.154{col 54}{space 4}-7.717836{col 67}{space 3}  1.22187
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-2.434879{col 26}{space 2} 2.198885{col 37}{space 1}   -1.11{col 46}{space 3}0.268{col 54}{space 4}  -6.7453{col 67}{space 3} 1.875542
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-2.287912{col 26}{space 2} 2.294911{col 37}{space 1}   -1.00{col 46}{space 3}0.319{col 54}{space 4}-6.786571{col 67}{space 3} 2.210746
{txt}{space 9}NE  {c |}{col 14}{res}{space 2}-3.225566{col 26}{space 2} 2.209351{col 37}{space 1}   -1.46{col 46}{space 3}0.144{col 54}{space 4}-7.556505{col 67}{space 3} 1.105372
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-3.533997{col 26}{space 2} 2.225443{col 37}{space 1}   -1.59{col 46}{space 3}0.112{col 54}{space 4} -7.89648{col 67}{space 3} .8284853
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-2.387041{col 26}{space 2} 2.197353{col 37}{space 1}   -1.09{col 46}{space 3}0.277{col 54}{space 4}-6.694459{col 67}{space 3} 1.920378
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-2.947878{col 26}{space 2} 2.290853{col 37}{space 1}   -1.29{col 46}{space 3}0.198{col 54}{space 4}-7.438582{col 67}{space 3} 1.542827
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}-2.608286{col 26}{space 2} 2.230569{col 37}{space 1}   -1.17{col 46}{space 3}0.242{col 54}{space 4}-6.980818{col 67}{space 3} 1.764245
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-2.580482{col 26}{space 2} 2.187662{col 37}{space 1}   -1.18{col 46}{space 3}0.238{col 54}{space 4}-6.868902{col 67}{space 3} 1.707939
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-3.131987{col 26}{space 2} 2.188953{col 37}{space 1}   -1.43{col 46}{space 3}0.153{col 54}{space 4}-7.422939{col 67}{space 3} 1.158964
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-.7225007{col 26}{space 2}   2.2723{col 37}{space 1}   -0.32{col 46}{space 3}0.751{col 54}{space 4}-5.176837{col 67}{space 3} 3.731835
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-3.280243{col 26}{space 2} 2.211758{col 37}{space 1}   -1.48{col 46}{space 3}0.138{col 54}{space 4}  -7.6159{col 67}{space 3} 1.055413
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-3.027615{col 26}{space 2} 2.187555{col 37}{space 1}   -1.38{col 46}{space 3}0.166{col 54}{space 4}-7.315827{col 67}{space 3} 1.260597
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-2.062093{col 26}{space 2} 2.334952{col 37}{space 1}   -0.88{col 46}{space 3}0.377{col 54}{space 4}-6.639244{col 67}{space 3} 2.515058
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-2.796582{col 26}{space 2} 2.215205{col 37}{space 1}   -1.26{col 46}{space 3}0.207{col 54}{space 4}-7.138996{col 67}{space 3} 1.545832
{txt}{space 9}SD  {c |}{col 14}{res}{space 2}-3.375373{col 26}{space 2} 2.230818{col 37}{space 1}   -1.51{col 46}{space 3}0.130{col 54}{space 4}-7.748393{col 67}{space 3} .9976463
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-2.866328{col 26}{space 2} 2.196871{col 37}{space 1}   -1.30{col 46}{space 3}0.192{col 54}{space 4}-7.172801{col 67}{space 3} 1.440146
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-2.151228{col 26}{space 2} 2.189332{col 37}{space 1}   -0.98{col 46}{space 3}0.326{col 54}{space 4}-6.442923{col 67}{space 3} 2.140467
{txt}{space 9}UT  {c |}{col 14}{res}{space 2}-2.587708{col 26}{space 2} 2.248469{col 37}{space 1}   -1.15{col 46}{space 3}0.250{col 54}{space 4}-6.995328{col 67}{space 3} 1.819913
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}-2.502942{col 26}{space 2} 2.205932{col 37}{space 1}   -1.13{col 46}{space 3}0.257{col 54}{space 4}-6.827177{col 67}{space 3} 1.821294
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}-4.192372{col 26}{space 2} 2.202813{col 37}{space 1}   -1.90{col 46}{space 3}0.057{col 54}{space 4}-8.510494{col 67}{space 3} .1257494
{txt}{space 9}WA  {c |}{col 14}{res}{space 2}-3.079171{col 26}{space 2} 2.193676{col 37}{space 1}   -1.40{col 46}{space 3}0.160{col 54}{space 4}-7.379381{col 67}{space 3} 1.221038
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-3.365078{col 26}{space 2} 2.189365{col 37}{space 1}   -1.54{col 46}{space 3}0.124{col 54}{space 4}-7.656838{col 67}{space 3} .9266818
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-3.114469{col 26}{space 2} 2.249258{col 37}{space 1}   -1.38{col 46}{space 3}0.166{col 54}{space 4}-7.523636{col 67}{space 3} 1.294698
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-3.787014{col 26}{space 2} 2.248284{col 37}{space 1}   -1.68{col 46}{space 3}0.092{col 54}{space 4}-8.194271{col 67}{space 3} .6202435
{txt}{space 12} {c |}
{space 7}2.Q33 {c |}{col 14}{res}{space 2} .3146347{col 26}{space 2} .0999486{col 37}{space 1}    3.15{col 46}{space 3}0.002{col 54}{space 4} .1187077{col 67}{space 3} .5105616
{txt}{space 7}2.Q34 {c |}{col 14}{res}{space 2}-.9683602{col 26}{space 2} .2370362{col 37}{space 1}   -4.09{col 46}{space 3}0.000{col 54}{space 4}-1.433016{col 67}{space 3}-.5037039
{txt}{space 7}Q35_1 {c |}{col 14}{res}{space 2}-.9560771{col 26}{space 2} .3332814{col 37}{space 1}   -2.87{col 46}{space 3}0.004{col 54}{space 4}-1.609401{col 67}{space 3}-.3027535
{txt}{space 7}Q35_2 {c |}{col 14}{res}{space 2} 1.156448{col 26}{space 2} .3622983{col 37}{space 1}    3.19{col 46}{space 3}0.001{col 54}{space 4} .4462435{col 67}{space 3} 1.866653
{txt}{space 7}Q35_3 {c |}{col 14}{res}{space 2}-.3493115{col 26}{space 2} .3527432{col 37}{space 1}   -0.99{col 46}{space 3}0.322{col 54}{space 4}-1.040786{col 67}{space 3} .3421625
{txt}{space 7}Q35_4 {c |}{col 14}{res}{space 2}-.6773891{col 26}{space 2} .3646049{col 37}{space 1}   -1.86{col 46}{space 3}0.063{col 54}{space 4}-1.392115{col 67}{space 3}  .037337
{txt}{space 7}Q35_5 {c |}{col 14}{res}{space 2} .2928149{col 26}{space 2} .8311866{col 37}{space 1}    0.35{col 46}{space 3}0.725{col 54}{space 4} -1.33654{col 67}{space 3}  1.92217
{txt}{space 7}Q35_6 {c |}{col 14}{res}{space 2}-.2092204{col 26}{space 2} .3823736{col 37}{space 1}   -0.55{col 46}{space 3}0.584{col 54}{space 4}-.9587781{col 67}{space 3} .5403373
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 9.065807{col 26}{space 2} 2.277581{col 37}{space 1}    3.98{col 46}{space 3}0.000{col 54}{space 4}  4.60112{col 67}{space 3} 13.53049
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est5{txt} stored)

Linear regression                                      Number of obs ={res}    6370
                                                       {txt}F( 75,  6294) ={res}    5.04
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.1030
                                                       {txt}Root MSE      = {res} 3.8524

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     Q24_iqr{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2} .1284143{col 26}{space 2} .2940017{col 37}{space 1}    0.44{col 46}{space 3}0.662{col 54}{space 4}-.4479292{col 67}{space 3} .7047579
{txt}{space 8}Old  {c |}{col 14}{res}{space 2} .4449915{col 26}{space 2} .4414131{col 37}{space 1}    1.01{col 46}{space 3}0.313{col 54}{space 4}-.4203286{col 67}{space 3} 1.310312
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2}-.9139357{col 26}{space 2} .2496115{col 37}{space 1}   -3.66{col 46}{space 3}0.000{col 54}{space 4}-1.403259{col 67}{space 3}-.4246121
{txt}High Educ..  {c |}{col 14}{res}{space 2}-1.580783{col 26}{space 2} .2375842{col 37}{space 1}   -6.65{col 46}{space 3}0.000{col 54}{space 4}-2.046529{col 67}{space 3}-1.115038
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2}-1.069396{col 26}{space 2}  .176772{col 37}{space 1}   -6.05{col 46}{space 3}0.000{col 54}{space 4}-1.415929{col 67}{space 3}-.7228628
{txt}High Income  {c |}{col 14}{res}{space 2}-1.118272{col 26}{space 2} .1683709{col 37}{space 1}   -6.64{col 46}{space 3}0.000{col 54}{space 4}-1.448337{col 67}{space 3}-.7882079
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2} .5251492{col 26}{space 2} .3316455{col 37}{space 1}    1.58{col 46}{space 3}0.113{col 54}{space 4}-.1249891{col 67}{space 3} 1.175287
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} 1.276837{col 26}{space 2} .4449393{col 37}{space 1}    2.87{col 46}{space 3}0.004{col 54}{space 4} .4046046{col 67}{space 3}  2.14907
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2}-.0377079{col 26}{space 2} .1552111{col 37}{space 1}   -0.24{col 46}{space 3}0.808{col 54}{space 4}-.3419746{col 67}{space 3} .2665588
{txt}{space 7}2015  {c |}{col 14}{res}{space 2} -.060367{col 26}{space 2} .1561541{col 37}{space 1}   -0.39{col 46}{space 3}0.699{col 54}{space 4}-.3664823{col 67}{space 3} .2457482
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.1928465{col 26}{space 2} .1543831{col 37}{space 1}   -1.25{col 46}{space 3}0.212{col 54}{space 4}  -.49549{col 67}{space 3}  .109797
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0152907{col 26}{space 2} .1496765{col 37}{space 1}   -0.10{col 46}{space 3}0.919{col 54}{space 4}-.3087077{col 67}{space 3} .2781263
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0196372{col 26}{space 2} .2256651{col 37}{space 1}   -0.09{col 46}{space 3}0.931{col 54}{space 4}-.4620177{col 67}{space 3} .4227434
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2} -2.66341{col 26}{space 2}  2.87656{col 37}{space 1}   -0.93{col 46}{space 3}0.355{col 54}{space 4}-8.302448{col 67}{space 3} 2.975627
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-3.938123{col 26}{space 2} 2.863508{col 37}{space 1}   -1.38{col 46}{space 3}0.169{col 54}{space 4}-9.551575{col 67}{space 3}  1.67533
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-2.737348{col 26}{space 2} 2.861352{col 37}{space 1}   -0.96{col 46}{space 3}0.339{col 54}{space 4}-8.346574{col 67}{space 3} 2.871877
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-2.667915{col 26}{space 2} 2.846112{col 37}{space 1}   -0.94{col 46}{space 3}0.349{col 54}{space 4}-8.247264{col 67}{space 3} 2.911434
{txt}{space 9}CO  {c |}{col 14}{res}{space 2}-3.070949{col 26}{space 2} 2.851645{col 37}{space 1}   -1.08{col 46}{space 3}0.282{col 54}{space 4}-8.661146{col 67}{space 3} 2.519248
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-3.350495{col 26}{space 2} 2.851025{col 37}{space 1}   -1.18{col 46}{space 3}0.240{col 54}{space 4}-8.939476{col 67}{space 3} 2.238486
{txt}{space 9}DC  {c |}{col 14}{res}{space 2}-2.268508{col 26}{space 2} 2.966044{col 37}{space 1}   -0.76{col 46}{space 3}0.444{col 54}{space 4}-8.082965{col 67}{space 3} 3.545949
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-2.797327{col 26}{space 2} 3.054626{col 37}{space 1}   -0.92{col 46}{space 3}0.360{col 54}{space 4}-8.785437{col 67}{space 3} 3.190782
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-2.651616{col 26}{space 2} 2.850578{col 37}{space 1}   -0.93{col 46}{space 3}0.352{col 54}{space 4}-8.239722{col 67}{space 3} 2.936489
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-3.026683{col 26}{space 2} 2.854014{col 37}{space 1}   -1.06{col 46}{space 3}0.289{col 54}{space 4}-8.621524{col 67}{space 3} 2.568159
{txt}{space 9}HI  {c |}{col 14}{res}{space 2}-3.761508{col 26}{space 2} 2.908633{col 37}{space 1}   -1.29{col 46}{space 3}0.196{col 54}{space 4} -9.46342{col 67}{space 3} 1.940404
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-3.207195{col 26}{space 2} 2.867186{col 37}{space 1}   -1.12{col 46}{space 3}0.263{col 54}{space 4}-8.827857{col 67}{space 3} 2.413466
{txt}{space 9}ID  {c |}{col 14}{res}{space 2}-3.481523{col 26}{space 2}  2.86822{col 37}{space 1}   -1.21{col 46}{space 3}0.225{col 54}{space 4}-9.104213{col 67}{space 3} 2.141167
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-3.155594{col 26}{space 2} 2.848073{col 37}{space 1}   -1.11{col 46}{space 3}0.268{col 54}{space 4}-8.738789{col 67}{space 3}   2.4276
{txt}{space 9}IN  {c |}{col 14}{res}{space 2}-2.714179{col 26}{space 2}  2.86219{col 37}{space 1}   -0.95{col 46}{space 3}0.343{col 54}{space 4}-8.325047{col 67}{space 3} 2.896688
{txt}{space 9}KS  {c |}{col 14}{res}{space 2} -2.64953{col 26}{space 2} 2.875177{col 37}{space 1}   -0.92{col 46}{space 3}0.357{col 54}{space 4}-8.285856{col 67}{space 3} 2.986797
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-3.270312{col 26}{space 2} 2.869558{col 37}{space 1}   -1.14{col 46}{space 3}0.254{col 54}{space 4}-8.895623{col 67}{space 3} 2.354999
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-1.606446{col 26}{space 2} 2.947415{col 37}{space 1}   -0.55{col 46}{space 3}0.586{col 54}{space 4}-7.384384{col 67}{space 3} 4.171492
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-2.593076{col 26}{space 2} 2.856967{col 37}{space 1}   -0.91{col 46}{space 3}0.364{col 54}{space 4}-8.193706{col 67}{space 3} 3.007554
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-2.975188{col 26}{space 2} 2.858787{col 37}{space 1}   -1.04{col 46}{space 3}0.298{col 54}{space 4}-8.579385{col 67}{space 3} 2.629009
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-2.998262{col 26}{space 2} 2.876479{col 37}{space 1}   -1.04{col 46}{space 3}0.297{col 54}{space 4}-8.637142{col 67}{space 3} 2.640618
{txt}{space 9}MI  {c |}{col 14}{res}{space 2}-2.993409{col 26}{space 2} 2.848421{col 37}{space 1}   -1.05{col 46}{space 3}0.293{col 54}{space 4}-8.577285{col 67}{space 3} 2.590466
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-3.235245{col 26}{space 2}  2.85188{col 37}{space 1}   -1.13{col 46}{space 3}0.257{col 54}{space 4}-8.825903{col 67}{space 3} 2.355413
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-3.178298{col 26}{space 2} 2.856094{col 37}{space 1}   -1.11{col 46}{space 3}0.266{col 54}{space 4}-8.777216{col 67}{space 3}  2.42062
{txt}{space 9}MS  {c |}{col 14}{res}{space 2} -2.33123{col 26}{space 2} 2.971693{col 37}{space 1}   -0.78{col 46}{space 3}0.433{col 54}{space 4} -8.15676{col 67}{space 3} 3.494301
{txt}{space 9}MT  {c |}{col 14}{res}{space 2} -3.23911{col 26}{space 2} 2.923719{col 37}{space 1}   -1.11{col 46}{space 3}0.268{col 54}{space 4}-8.970596{col 67}{space 3} 2.492375
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-2.784651{col 26}{space 2} 2.854424{col 37}{space 1}   -0.98{col 46}{space 3}0.329{col 54}{space 4}-8.380296{col 67}{space 3} 2.810993
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-2.177784{col 26}{space 2} 2.944774{col 37}{space 1}   -0.74{col 46}{space 3}0.460{col 54}{space 4}-7.950546{col 67}{space 3} 3.594977
{txt}{space 9}NE  {c |}{col 14}{res}{space 2} -2.88019{col 26}{space 2} 2.865576{col 37}{space 1}   -1.01{col 46}{space 3}0.315{col 54}{space 4}-8.497696{col 67}{space 3} 2.737317
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-3.659687{col 26}{space 2} 2.875756{col 37}{space 1}   -1.27{col 46}{space 3}0.203{col 54}{space 4}-9.297149{col 67}{space 3} 1.977774
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-2.541233{col 26}{space 2}  2.85685{col 37}{space 1}   -0.89{col 46}{space 3}0.374{col 54}{space 4}-8.141634{col 67}{space 3} 3.059167
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-3.664294{col 26}{space 2} 2.904931{col 37}{space 1}   -1.26{col 46}{space 3}0.207{col 54}{space 4}-9.358949{col 67}{space 3} 2.030362
{txt}{space 9}NV  {c |}{col 14}{res}{space 2} -2.49145{col 26}{space 2} 2.882388{col 37}{space 1}   -0.86{col 46}{space 3}0.387{col 54}{space 4}-8.141913{col 67}{space 3} 3.159013
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-2.898489{col 26}{space 2} 2.846186{col 37}{space 1}   -1.02{col 46}{space 3}0.309{col 54}{space 4}-8.477985{col 67}{space 3} 2.681007
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-3.197374{col 26}{space 2} 2.847015{col 37}{space 1}   -1.12{col 46}{space 3}0.261{col 54}{space 4}-8.778494{col 67}{space 3} 2.383747
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-1.169848{col 26}{space 2} 2.924577{col 37}{space 1}   -0.40{col 46}{space 3}0.689{col 54}{space 4}-6.903016{col 67}{space 3}  4.56332
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-3.804557{col 26}{space 2} 2.845164{col 37}{space 1}   -1.34{col 46}{space 3}0.181{col 54}{space 4}-9.382047{col 67}{space 3} 1.772934
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-3.091446{col 26}{space 2} 2.846708{col 37}{space 1}   -1.09{col 46}{space 3}0.278{col 54}{space 4}-8.671963{col 67}{space 3} 2.489071
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-1.916048{col 26}{space 2} 2.956559{col 37}{space 1}   -0.65{col 46}{space 3}0.517{col 54}{space 4}-7.711911{col 67}{space 3} 3.879816
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-3.279244{col 26}{space 2} 2.861932{col 37}{space 1}   -1.15{col 46}{space 3}0.252{col 54}{space 4}-8.889606{col 67}{space 3} 2.331118
{txt}{space 9}SD  {c |}{col 14}{res}{space 2}-3.666945{col 26}{space 2} 2.894401{col 37}{space 1}   -1.27{col 46}{space 3}0.205{col 54}{space 4}-9.340958{col 67}{space 3} 2.007067
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-2.899341{col 26}{space 2} 2.855138{col 37}{space 1}   -1.02{col 46}{space 3}0.310{col 54}{space 4}-8.496385{col 67}{space 3} 2.697703
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-2.478813{col 26}{space 2}   2.8491{col 37}{space 1}   -0.87{col 46}{space 3}0.384{col 54}{space 4} -8.06402{col 67}{space 3} 3.106395
{txt}{space 9}UT  {c |}{col 14}{res}{space 2}-2.603817{col 26}{space 2} 2.890472{col 37}{space 1}   -0.90{col 46}{space 3}0.368{col 54}{space 4}-8.270126{col 67}{space 3} 3.062493
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}-2.655366{col 26}{space 2} 2.858282{col 37}{space 1}   -0.93{col 46}{space 3}0.353{col 54}{space 4}-8.258573{col 67}{space 3} 2.947841
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}-3.822942{col 26}{space 2} 2.869518{col 37}{space 1}   -1.33{col 46}{space 3}0.183{col 54}{space 4}-9.448176{col 67}{space 3} 1.802292
{txt}{space 9}WA  {c |}{col 14}{res}{space 2} -3.25019{col 26}{space 2} 2.851034{col 37}{space 1}   -1.14{col 46}{space 3}0.254{col 54}{space 4}-8.839189{col 67}{space 3} 2.338809
{txt}{space 9}WI  {c |}{col 14}{res}{space 2} -3.25295{col 26}{space 2} 2.849275{col 37}{space 1}   -1.14{col 46}{space 3}0.254{col 54}{space 4}-8.838501{col 67}{space 3} 2.332601
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-2.840931{col 26}{space 2} 2.906237{col 37}{space 1}   -0.98{col 46}{space 3}0.328{col 54}{space 4}-8.538146{col 67}{space 3} 2.856284
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-3.895656{col 26}{space 2} 2.886734{col 37}{space 1}   -1.35{col 46}{space 3}0.177{col 54}{space 4}-9.554639{col 67}{space 3} 1.763328
{txt}{space 12} {c |}
{space 7}2.Q33 {c |}{col 14}{res}{space 2} .0956973{col 26}{space 2} .1014864{col 37}{space 1}    0.94{col 46}{space 3}0.346{col 54}{space 4}-.1032507{col 67}{space 3} .2946454
{txt}{space 7}2.Q34 {c |}{col 14}{res}{space 2}-.9762946{col 26}{space 2} .2355407{col 37}{space 1}   -4.14{col 46}{space 3}0.000{col 54}{space 4}-1.438035{col 67}{space 3}-.5145546
{txt}{space 7}Q35_1 {c |}{col 14}{res}{space 2}-1.313222{col 26}{space 2} .3130019{col 37}{space 1}   -4.20{col 46}{space 3}0.000{col 54}{space 4}-1.926813{col 67}{space 3}-.6996318
{txt}{space 7}Q35_2 {c |}{col 14}{res}{space 2} .8338085{col 26}{space 2}  .341889{col 37}{space 1}    2.44{col 46}{space 3}0.015{col 54}{space 4} .1635895{col 67}{space 3} 1.504028
{txt}{space 7}Q35_3 {c |}{col 14}{res}{space 2}  .058096{col 26}{space 2}  .375295{col 37}{space 1}    0.15{col 46}{space 3}0.877{col 54}{space 4}-.6776102{col 67}{space 3} .7938022
{txt}{space 7}Q35_4 {c |}{col 14}{res}{space 2}-.7338841{col 26}{space 2} .3571281{col 37}{space 1}   -2.05{col 46}{space 3}0.040{col 54}{space 4}-1.433977{col 67}{space 3}-.0337913
{txt}{space 7}Q35_5 {c |}{col 14}{res}{space 2}-.0993084{col 26}{space 2} .8161017{col 37}{space 1}   -0.12{col 46}{space 3}0.903{col 54}{space 4}-1.699146{col 67}{space 3} 1.500529
{txt}{space 7}Q35_6 {c |}{col 14}{res}{space 2}-.7579858{col 26}{space 2} .3498886{col 37}{space 1}   -2.17{col 46}{space 3}0.030{col 54}{space 4}-1.443887{col 67}{space 3}-.0720849
{txt}{space 7}Q4new {c |}{col 14}{res}{space 2}  .007268{col 26}{space 2} .0024971{col 37}{space 1}    2.91{col 46}{space 3}0.004{col 54}{space 4} .0023729{col 67}{space 3} .0121631
{txt}{space 7}Q6new {c |}{col 14}{res}{space 2} .0058392{col 26}{space 2} .0024459{col 37}{space 1}    2.39{col 46}{space 3}0.017{col 54}{space 4} .0010444{col 67}{space 3}  .010634
{txt}{space 5}Q9_mean {c |}{col 14}{res}{space 2}-.0888615{col 26}{space 2} .0133758{col 37}{space 1}   -6.64{col 46}{space 3}0.000{col 54}{space 4}-.1150826{col 67}{space 3}-.0626405
{txt}{space 6}Q13new {c |}{col 14}{res}{space 2} .0039984{col 26}{space 2} .0028163{col 37}{space 1}    1.42{col 46}{space 3}0.156{col 54}{space 4}-.0015225{col 67}{space 3} .0095193
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 8.852545{col 26}{space 2} 2.913524{col 37}{space 1}    3.04{col 46}{space 3}0.002{col 54}{space 4} 3.141045{col 67}{space 3} 14.56405
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est6{txt} stored)

Linear regression                                      Number of obs ={res}    6730
                                                       {txt}F( 63,  6666) ={res}    3.84
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0328
                                                       {txt}Root MSE      = {res} 2.4218

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}    Q24_mean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2} -.172547{col 26}{space 2} .1589614{col 37}{space 1}   -1.09{col 46}{space 3}0.278{col 54}{space 4}-.4841621{col 67}{space 3} .1390681
{txt}{space 8}Old  {c |}{col 14}{res}{space 2}-.1375003{col 26}{space 2} .2331615{col 37}{space 1}   -0.59{col 46}{space 3}0.555{col 54}{space 4}-.5945714{col 67}{space 3} .3195707
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2}-.0084713{col 26}{space 2} .1134231{col 37}{space 1}   -0.07{col 46}{space 3}0.940{col 54}{space 4}-.2308169{col 67}{space 3} .2138742
{txt}High Educ..  {c |}{col 14}{res}{space 2} .0770321{col 26}{space 2} .1105475{col 37}{space 1}    0.70{col 46}{space 3}0.486{col 54}{space 4}-.1396765{col 67}{space 3} .2937406
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2}-.1043046{col 26}{space 2} .0929891{col 37}{space 1}   -1.12{col 46}{space 3}0.262{col 54}{space 4} -.286593{col 67}{space 3} .0779839
{txt}High Income  {c |}{col 14}{res}{space 2} .2493363{col 26}{space 2} .0918699{col 37}{space 1}    2.71{col 46}{space 3}0.007{col 54}{space 4} .0692419{col 67}{space 3} .4294307
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2} .0451398{col 26}{space 2} .1739716{col 37}{space 1}    0.26{col 46}{space 3}0.795{col 54}{space 4}-.2959003{col 67}{space 3} .3861798
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2}  .398746{col 26}{space 2} .2399843{col 37}{space 1}    1.66{col 46}{space 3}0.097{col 54}{space 4}   -.0717{col 67}{space 3} .8691921
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2} .2741382{col 26}{space 2} .0974902{col 37}{space 1}    2.81{col 46}{space 3}0.005{col 54}{space 4} .0830262{col 67}{space 3} .4652501
{txt}{space 7}2015  {c |}{col 14}{res}{space 2} .2262578{col 26}{space 2} .0948991{col 37}{space 1}    2.38{col 46}{space 3}0.017{col 54}{space 4} .0402251{col 67}{space 3} .4122905
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1275214{col 26}{space 2} .0942517{col 37}{space 1}    1.35{col 46}{space 3}0.176{col 54}{space 4}-.0572421{col 67}{space 3}  .312285
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .3131218{col 26}{space 2} .0949752{col 37}{space 1}    3.30{col 46}{space 3}0.001{col 54}{space 4} .1269399{col 67}{space 3} .4993036
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .2838435{col 26}{space 2} .1283034{col 37}{space 1}    2.21{col 46}{space 3}0.027{col 54}{space 4} .0323278{col 67}{space 3} .5353593
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2} .0503061{col 26}{space 2} 1.254679{col 37}{space 1}    0.04{col 46}{space 3}0.968{col 54}{space 4}-2.409266{col 67}{space 3} 2.509878
{txt}{space 9}AR  {c |}{col 14}{res}{space 2} .0154575{col 26}{space 2} 1.277965{col 37}{space 1}    0.01{col 46}{space 3}0.990{col 54}{space 4}-2.489763{col 67}{space 3} 2.520678
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2} .2234955{col 26}{space 2} 1.246452{col 37}{space 1}    0.18{col 46}{space 3}0.858{col 54}{space 4} -2.21995{col 67}{space 3} 2.666941
{txt}{space 9}CA  {c |}{col 14}{res}{space 2} .3282547{col 26}{space 2} 1.229813{col 37}{space 1}    0.27{col 46}{space 3}0.790{col 54}{space 4}-2.082573{col 67}{space 3} 2.739082
{txt}{space 9}CO  {c |}{col 14}{res}{space 2} .1822512{col 26}{space 2} 1.242803{col 37}{space 1}    0.15{col 46}{space 3}0.883{col 54}{space 4}-2.254041{col 67}{space 3} 2.618543
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-.0240551{col 26}{space 2} 1.253206{col 37}{space 1}   -0.02{col 46}{space 3}0.985{col 54}{space 4}-2.480739{col 67}{space 3} 2.432629
{txt}{space 9}DC  {c |}{col 14}{res}{space 2} .4878607{col 26}{space 2} 1.312891{col 37}{space 1}    0.37{col 46}{space 3}0.710{col 54}{space 4}-2.085826{col 67}{space 3} 3.061547
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}   .78003{col 26}{space 2} 1.368051{col 37}{space 1}    0.57{col 46}{space 3}0.569{col 54}{space 4}-1.901788{col 67}{space 3} 3.461848
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-.0927906{col 26}{space 2} 1.231978{col 37}{space 1}   -0.08{col 46}{space 3}0.940{col 54}{space 4}-2.507861{col 67}{space 3}  2.32228
{txt}{space 9}GA  {c |}{col 14}{res}{space 2} .0180231{col 26}{space 2} 1.237934{col 37}{space 1}    0.01{col 46}{space 3}0.988{col 54}{space 4}-2.408723{col 67}{space 3} 2.444769
{txt}{space 9}HI  {c |}{col 14}{res}{space 2} .5868101{col 26}{space 2}   1.3818{col 37}{space 1}    0.42{col 46}{space 3}0.671{col 54}{space 4}-2.121961{col 67}{space 3} 3.295581
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-.3017597{col 26}{space 2} 1.244899{col 37}{space 1}   -0.24{col 46}{space 3}0.808{col 54}{space 4} -2.74216{col 67}{space 3} 2.138641
{txt}{space 9}ID  {c |}{col 14}{res}{space 2} .3754559{col 26}{space 2} 1.284032{col 37}{space 1}    0.29{col 46}{space 3}0.770{col 54}{space 4}-2.141658{col 67}{space 3}  2.89257
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-.0795401{col 26}{space 2} 1.231647{col 37}{space 1}   -0.06{col 46}{space 3}0.949{col 54}{space 4}-2.493963{col 67}{space 3} 2.334882
{txt}{space 9}IN  {c |}{col 14}{res}{space 2} .0383898{col 26}{space 2} 1.240628{col 37}{space 1}    0.03{col 46}{space 3}0.975{col 54}{space 4}-2.393639{col 67}{space 3} 2.470418
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-.4747811{col 26}{space 2} 1.254487{col 37}{space 1}   -0.38{col 46}{space 3}0.705{col 54}{space 4}-2.933976{col 67}{space 3} 1.984414
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-.5993169{col 26}{space 2} 1.247268{col 37}{space 1}   -0.48{col 46}{space 3}0.631{col 54}{space 4}-3.044361{col 67}{space 3} 1.845727
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-.0469422{col 26}{space 2} 1.263852{col 37}{space 1}   -0.04{col 46}{space 3}0.970{col 54}{space 4}-2.524496{col 67}{space 3} 2.430612
{txt}{space 9}MA  {c |}{col 14}{res}{space 2} .1979263{col 26}{space 2} 1.236382{col 37}{space 1}    0.16{col 46}{space 3}0.873{col 54}{space 4}-2.225777{col 67}{space 3}  2.62163
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-.2291241{col 26}{space 2} 1.239457{col 37}{space 1}   -0.18{col 46}{space 3}0.853{col 54}{space 4}-2.658857{col 67}{space 3} 2.200609
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-.0964024{col 26}{space 2} 1.280009{col 37}{space 1}   -0.08{col 46}{space 3}0.940{col 54}{space 4}-2.605629{col 67}{space 3} 2.412825
{txt}{space 9}MI  {c |}{col 14}{res}{space 2} .0012699{col 26}{space 2} 1.235208{col 37}{space 1}    0.00{col 46}{space 3}0.999{col 54}{space 4}-2.420132{col 67}{space 3} 2.422672
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-.1231582{col 26}{space 2} 1.239327{col 37}{space 1}   -0.10{col 46}{space 3}0.921{col 54}{space 4}-2.552635{col 67}{space 3} 2.306318
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-.0419476{col 26}{space 2} 1.241625{col 37}{space 1}   -0.03{col 46}{space 3}0.973{col 54}{space 4}-2.475929{col 67}{space 3} 2.392034
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-.2653011{col 26}{space 2} 1.275646{col 37}{space 1}   -0.21{col 46}{space 3}0.835{col 54}{space 4}-2.765976{col 67}{space 3} 2.235373
{txt}{space 9}MT  {c |}{col 14}{res}{space 2} .1124245{col 26}{space 2} 1.358359{col 37}{space 1}    0.08{col 46}{space 3}0.934{col 54}{space 4}-2.550394{col 67}{space 3} 2.775243
{txt}{space 9}NC  {c |}{col 14}{res}{space 2} .2967141{col 26}{space 2} 1.238239{col 37}{space 1}    0.24{col 46}{space 3}0.811{col 54}{space 4} -2.13063{col 67}{space 3} 2.724058
{txt}{space 9}ND  {c |}{col 14}{res}{space 2} .2213667{col 26}{space 2} 1.384664{col 37}{space 1}    0.16{col 46}{space 3}0.873{col 54}{space 4}-2.493018{col 67}{space 3} 2.935751
{txt}{space 9}NE  {c |}{col 14}{res}{space 2} .1426811{col 26}{space 2}  1.25727{col 37}{space 1}    0.11{col 46}{space 3}0.910{col 54}{space 4}-2.321971{col 67}{space 3} 2.607333
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-.3147707{col 26}{space 2}  1.27664{col 37}{space 1}   -0.25{col 46}{space 3}0.805{col 54}{space 4}-2.817393{col 67}{space 3} 2.187852
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-.2575955{col 26}{space 2} 1.234425{col 37}{space 1}   -0.21{col 46}{space 3}0.835{col 54}{space 4}-2.677464{col 67}{space 3} 2.162273
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-1.058199{col 26}{space 2} 1.286309{col 37}{space 1}   -0.82{col 46}{space 3}0.411{col 54}{space 4}-3.579776{col 67}{space 3} 1.463378
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}  .925298{col 26}{space 2}  1.29085{col 37}{space 1}    0.72{col 46}{space 3}0.474{col 54}{space 4} -1.60518{col 67}{space 3} 3.455776
{txt}{space 9}NY  {c |}{col 14}{res}{space 2} .0051546{col 26}{space 2} 1.231041{col 37}{space 1}    0.00{col 46}{space 3}0.997{col 54}{space 4}-2.408079{col 67}{space 3} 2.418388
{txt}{space 9}OH  {c |}{col 14}{res}{space 2} .0512712{col 26}{space 2} 1.232743{col 37}{space 1}    0.04{col 46}{space 3}0.967{col 54}{space 4}  -2.3653{col 67}{space 3} 2.467842
{txt}{space 9}OK  {c |}{col 14}{res}{space 2} .3046555{col 26}{space 2} 1.273592{col 37}{space 1}    0.24{col 46}{space 3}0.811{col 54}{space 4}-2.191993{col 67}{space 3} 2.801304
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-.1485296{col 26}{space 2} 1.242491{col 37}{space 1}   -0.12{col 46}{space 3}0.905{col 54}{space 4}-2.584209{col 67}{space 3}  2.28715
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-.3143317{col 26}{space 2} 1.229995{col 37}{space 1}   -0.26{col 46}{space 3}0.798{col 54}{space 4}-2.725515{col 67}{space 3} 2.096851
{txt}{space 9}RI  {c |}{col 14}{res}{space 2} -.139552{col 26}{space 2} 1.303369{col 37}{space 1}   -0.11{col 46}{space 3}0.915{col 54}{space 4}-2.694572{col 67}{space 3} 2.415467
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}  .502215{col 26}{space 2} 1.266664{col 37}{space 1}    0.40{col 46}{space 3}0.692{col 54}{space 4}-1.980851{col 67}{space 3} 2.985281
{txt}{space 9}SD  {c |}{col 14}{res}{space 2} 2.069572{col 26}{space 2} 1.441431{col 37}{space 1}    1.44{col 46}{space 3}0.151{col 54}{space 4}-.7560932{col 67}{space 3} 4.895237
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-.0403748{col 26}{space 2} 1.244022{col 37}{space 1}   -0.03{col 46}{space 3}0.974{col 54}{space 4}-2.479057{col 67}{space 3} 2.398307
{txt}{space 9}TX  {c |}{col 14}{res}{space 2} .3802114{col 26}{space 2}  1.23058{col 37}{space 1}    0.31{col 46}{space 3}0.757{col 54}{space 4}-2.032119{col 67}{space 3} 2.792542
{txt}{space 9}UT  {c |}{col 14}{res}{space 2} .2405667{col 26}{space 2} 1.270477{col 37}{space 1}    0.19{col 46}{space 3}0.850{col 54}{space 4}-2.249975{col 67}{space 3} 2.731108
{txt}{space 9}VA  {c |}{col 14}{res}{space 2} .0001949{col 26}{space 2} 1.238254{col 37}{space 1}    0.00{col 46}{space 3}1.000{col 54}{space 4}-2.427179{col 67}{space 3} 2.427569
{txt}{space 9}VT  {c |}{col 14}{res}{space 2} .7907942{col 26}{space 2} 1.310405{col 37}{space 1}    0.60{col 46}{space 3}0.546{col 54}{space 4}-1.778019{col 67}{space 3} 3.359607
{txt}{space 9}WA  {c |}{col 14}{res}{space 2} .2189385{col 26}{space 2} 1.240001{col 37}{space 1}    0.18{col 46}{space 3}0.860{col 54}{space 4} -2.21186{col 67}{space 3} 2.649737
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-.0309327{col 26}{space 2} 1.240901{col 37}{space 1}   -0.02{col 46}{space 3}0.980{col 54}{space 4}-2.463496{col 67}{space 3}  2.40163
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-.0152544{col 26}{space 2} 1.320777{col 37}{space 1}   -0.01{col 46}{space 3}0.991{col 54}{space 4}  -2.6044{col 67}{space 3} 2.573891
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-1.044134{col 26}{space 2} 1.269414{col 37}{space 1}   -0.82{col 46}{space 3}0.411{col 54}{space 4}-3.532592{col 67}{space 3} 1.444324
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.496206{col 26}{space 2} 1.252285{col 37}{space 1}    1.99{col 46}{space 3}0.046{col 54}{space 4}  .041326{col 67}{space 3} 4.951085
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est7{txt} stored)

Linear regression                                      Number of obs ={res}    6728
                                                       {txt}F( 71,  6656) ={res}    3.77
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0373
                                                       {txt}Root MSE      = {res} 2.4178

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}    Q24_mean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2}-.1914726{col 26}{space 2} .1580688{col 37}{space 1}   -1.21{col 46}{space 3}0.226{col 54}{space 4}-.5013381{col 67}{space 3} .1183929
{txt}{space 8}Old  {c |}{col 14}{res}{space 2}-.1923164{col 26}{space 2} .2335862{col 37}{space 1}   -0.82{col 46}{space 3}0.410{col 54}{space 4}-.6502202{col 67}{space 3} .2655874
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2} .0113953{col 26}{space 2} .1138265{col 37}{space 1}    0.10{col 46}{space 3}0.920{col 54}{space 4}-.2117412{col 67}{space 3} .2345317
{txt}High Educ..  {c |}{col 14}{res}{space 2} .0858066{col 26}{space 2} .1108262{col 37}{space 1}    0.77{col 46}{space 3}0.439{col 54}{space 4}-.1314483{col 67}{space 3} .3030615
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2}-.1262883{col 26}{space 2} .0930472{col 37}{space 1}   -1.36{col 46}{space 3}0.175{col 54}{space 4}-.3086906{col 67}{space 3} .0561141
{txt}High Income  {c |}{col 14}{res}{space 2} .1854068{col 26}{space 2} .0934425{col 37}{space 1}    1.98{col 46}{space 3}0.047{col 54}{space 4} .0022294{col 67}{space 3} .3685841
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2} .0359183{col 26}{space 2} .1749234{col 37}{space 1}    0.21{col 46}{space 3}0.837{col 54}{space 4}-.3069877{col 67}{space 3} .3788242
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} .3732838{col 26}{space 2} .2399847{col 37}{space 1}    1.56{col 46}{space 3}0.120{col 54}{space 4} -.097163{col 67}{space 3} .8437307
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2} .2670041{col 26}{space 2} .0973898{col 37}{space 1}    2.74{col 46}{space 3}0.006{col 54}{space 4} .0760888{col 67}{space 3} .4579193
{txt}{space 7}2015  {c |}{col 14}{res}{space 2} .2324739{col 26}{space 2} .0947655{col 37}{space 1}    2.45{col 46}{space 3}0.014{col 54}{space 4} .0467031{col 67}{space 3} .4182447
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1365792{col 26}{space 2} .0942518{col 37}{space 1}    1.45{col 46}{space 3}0.147{col 54}{space 4}-.0481845{col 67}{space 3}  .321343
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .3182893{col 26}{space 2} .0951019{col 37}{space 1}    3.35{col 46}{space 3}0.001{col 54}{space 4} .1318591{col 67}{space 3} .5047195
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}  .291003{col 26}{space 2} .1278211{col 37}{space 1}    2.28{col 46}{space 3}0.023{col 54}{space 4} .0404326{col 67}{space 3} .5415734
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2} .1340286{col 26}{space 2} 1.225506{col 37}{space 1}    0.11{col 46}{space 3}0.913{col 54}{space 4}-2.268355{col 67}{space 3} 2.536412
{txt}{space 9}AR  {c |}{col 14}{res}{space 2} .0891589{col 26}{space 2} 1.248882{col 37}{space 1}    0.07{col 46}{space 3}0.943{col 54}{space 4} -2.35905{col 67}{space 3} 2.537368
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}   .33055{col 26}{space 2} 1.216939{col 37}{space 1}    0.27{col 46}{space 3}0.786{col 54}{space 4} -2.05504{col 67}{space 3}  2.71614
{txt}{space 9}CA  {c |}{col 14}{res}{space 2} .3995477{col 26}{space 2} 1.199557{col 37}{space 1}    0.33{col 46}{space 3}0.739{col 54}{space 4}-1.951968{col 67}{space 3} 2.751063
{txt}{space 9}CO  {c |}{col 14}{res}{space 2} .2550496{col 26}{space 2} 1.212623{col 37}{space 1}    0.21{col 46}{space 3}0.833{col 54}{space 4} -2.12208{col 67}{space 3} 2.632179
{txt}{space 9}CT  {c |}{col 14}{res}{space 2} .0759738{col 26}{space 2} 1.223183{col 37}{space 1}    0.06{col 46}{space 3}0.950{col 54}{space 4}-2.321858{col 67}{space 3} 2.473805
{txt}{space 9}DC  {c |}{col 14}{res}{space 2} .5790821{col 26}{space 2} 1.286072{col 37}{space 1}    0.45{col 46}{space 3}0.653{col 54}{space 4}-1.942032{col 67}{space 3} 3.100196
{txt}{space 9}DE  {c |}{col 14}{res}{space 2} .8493894{col 26}{space 2} 1.340196{col 37}{space 1}    0.63{col 46}{space 3}0.526{col 54}{space 4}-1.777825{col 67}{space 3} 3.476604
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-.0096619{col 26}{space 2} 1.201649{col 37}{space 1}   -0.01{col 46}{space 3}0.994{col 54}{space 4}-2.365279{col 67}{space 3} 2.345955
{txt}{space 9}GA  {c |}{col 14}{res}{space 2} .0762456{col 26}{space 2} 1.208733{col 37}{space 1}    0.06{col 46}{space 3}0.950{col 54}{space 4}-2.293258{col 67}{space 3} 2.445749
{txt}{space 9}HI  {c |}{col 14}{res}{space 2} .8351575{col 26}{space 2} 1.383998{col 37}{space 1}    0.60{col 46}{space 3}0.546{col 54}{space 4}-1.877922{col 67}{space 3} 3.548237
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-.2343073{col 26}{space 2} 1.214812{col 37}{space 1}   -0.19{col 46}{space 3}0.847{col 54}{space 4}-2.615729{col 67}{space 3} 2.147114
{txt}{space 9}ID  {c |}{col 14}{res}{space 2} .4427521{col 26}{space 2} 1.256004{col 37}{space 1}    0.35{col 46}{space 3}0.724{col 54}{space 4}-2.019419{col 67}{space 3} 2.904923
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-.0049479{col 26}{space 2} 1.201508{col 37}{space 1}   -0.00{col 46}{space 3}0.997{col 54}{space 4}-2.360289{col 67}{space 3} 2.350393
{txt}{space 9}IN  {c |}{col 14}{res}{space 2} .0928005{col 26}{space 2} 1.210785{col 37}{space 1}    0.08{col 46}{space 3}0.939{col 54}{space 4}-2.280727{col 67}{space 3} 2.466327
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-.3861386{col 26}{space 2} 1.225618{col 37}{space 1}   -0.32{col 46}{space 3}0.753{col 54}{space 4}-2.788742{col 67}{space 3} 2.016465
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-.5180532{col 26}{space 2} 1.217731{col 37}{space 1}   -0.43{col 46}{space 3}0.671{col 54}{space 4}-2.905197{col 67}{space 3}  1.86909
{txt}{space 9}LA  {c |}{col 14}{res}{space 2} .0139845{col 26}{space 2} 1.234657{col 37}{space 1}    0.01{col 46}{space 3}0.991{col 54}{space 4}-2.406338{col 67}{space 3} 2.434307
{txt}{space 9}MA  {c |}{col 14}{res}{space 2} .2901776{col 26}{space 2}  1.20628{col 37}{space 1}    0.24{col 46}{space 3}0.810{col 54}{space 4}-2.074518{col 67}{space 3} 2.654874
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-.1299506{col 26}{space 2} 1.209745{col 37}{space 1}   -0.11{col 46}{space 3}0.914{col 54}{space 4}-2.501438{col 67}{space 3} 2.241537
{txt}{space 9}ME  {c |}{col 14}{res}{space 2} -.002567{col 26}{space 2} 1.250222{col 37}{space 1}   -0.00{col 46}{space 3}0.998{col 54}{space 4}-2.453402{col 67}{space 3} 2.448268
{txt}{space 9}MI  {c |}{col 14}{res}{space 2} .0604204{col 26}{space 2} 1.205148{col 37}{space 1}    0.05{col 46}{space 3}0.960{col 54}{space 4}-2.302057{col 67}{space 3} 2.422898
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-.0481159{col 26}{space 2} 1.209319{col 37}{space 1}   -0.04{col 46}{space 3}0.968{col 54}{space 4}-2.418769{col 67}{space 3} 2.322537
{txt}{space 9}MO  {c |}{col 14}{res}{space 2} .0495195{col 26}{space 2} 1.211881{col 37}{space 1}    0.04{col 46}{space 3}0.967{col 54}{space 4}-2.326156{col 67}{space 3} 2.425195
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-.1860737{col 26}{space 2}  1.24661{col 37}{space 1}   -0.15{col 46}{space 3}0.881{col 54}{space 4}-2.629828{col 67}{space 3} 2.257681
{txt}{space 9}MT  {c |}{col 14}{res}{space 2} .2126357{col 26}{space 2} 1.334421{col 37}{space 1}    0.16{col 46}{space 3}0.873{col 54}{space 4}-2.403258{col 67}{space 3} 2.828529
{txt}{space 9}NC  {c |}{col 14}{res}{space 2} .3714121{col 26}{space 2} 1.208261{col 37}{space 1}    0.31{col 46}{space 3}0.759{col 54}{space 4}-1.997167{col 67}{space 3} 2.739991
{txt}{space 9}ND  {c |}{col 14}{res}{space 2} .3163337{col 26}{space 2} 1.358044{col 37}{space 1}    0.23{col 46}{space 3}0.816{col 54}{space 4}-2.345867{col 67}{space 3} 2.978535
{txt}{space 9}NE  {c |}{col 14}{res}{space 2} .2290996{col 26}{space 2} 1.227925{col 37}{space 1}    0.19{col 46}{space 3}0.852{col 54}{space 4}-2.178026{col 67}{space 3} 2.636225
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-.2057405{col 26}{space 2} 1.246564{col 37}{space 1}   -0.17{col 46}{space 3}0.869{col 54}{space 4}-2.649406{col 67}{space 3} 2.237925
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-.1900401{col 26}{space 2} 1.204411{col 37}{space 1}   -0.16{col 46}{space 3}0.875{col 54}{space 4}-2.551073{col 67}{space 3} 2.170992
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-.9724715{col 26}{space 2} 1.259199{col 37}{space 1}   -0.77{col 46}{space 3}0.440{col 54}{space 4}-3.440905{col 67}{space 3} 1.495962
{txt}{space 9}NV  {c |}{col 14}{res}{space 2} .9955267{col 26}{space 2} 1.261293{col 37}{space 1}    0.79{col 46}{space 3}0.430{col 54}{space 4}-1.477011{col 67}{space 3} 3.468064
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}  .073566{col 26}{space 2}  1.20072{col 37}{space 1}    0.06{col 46}{space 3}0.951{col 54}{space 4} -2.28023{col 67}{space 3} 2.427362
{txt}{space 9}OH  {c |}{col 14}{res}{space 2} .1068022{col 26}{space 2} 1.202594{col 37}{space 1}    0.09{col 46}{space 3}0.929{col 54}{space 4}-2.250668{col 67}{space 3} 2.464273
{txt}{space 9}OK  {c |}{col 14}{res}{space 2} .3945715{col 26}{space 2} 1.244597{col 37}{space 1}    0.32{col 46}{space 3}0.751{col 54}{space 4}-2.045237{col 67}{space 3}  2.83438
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-.0557965{col 26}{space 2} 1.212388{col 37}{space 1}   -0.05{col 46}{space 3}0.963{col 54}{space 4}-2.432465{col 67}{space 3} 2.320872
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-.2286308{col 26}{space 2} 1.199931{col 37}{space 1}   -0.19{col 46}{space 3}0.849{col 54}{space 4} -2.58088{col 67}{space 3} 2.123619
{txt}{space 9}RI  {c |}{col 14}{res}{space 2} -.109537{col 26}{space 2} 1.273855{col 37}{space 1}   -0.09{col 46}{space 3}0.931{col 54}{space 4}-2.606701{col 67}{space 3} 2.387627
{txt}{space 9}SC  {c |}{col 14}{res}{space 2} .5846425{col 26}{space 2} 1.237183{col 37}{space 1}    0.47{col 46}{space 3}0.637{col 54}{space 4}-1.840633{col 67}{space 3} 3.009918
{txt}{space 9}SD  {c |}{col 14}{res}{space 2} 2.120888{col 26}{space 2} 1.415615{col 37}{space 1}    1.50{col 46}{space 3}0.134{col 54}{space 4}-.6541717{col 67}{space 3} 4.895948
{txt}{space 9}TN  {c |}{col 14}{res}{space 2} .0277098{col 26}{space 2} 1.214229{col 37}{space 1}    0.02{col 46}{space 3}0.982{col 54}{space 4}-2.352568{col 67}{space 3} 2.407988
{txt}{space 9}TX  {c |}{col 14}{res}{space 2} .4744421{col 26}{space 2} 1.200699{col 37}{space 1}    0.40{col 46}{space 3}0.693{col 54}{space 4}-1.879313{col 67}{space 3} 2.828197
{txt}{space 9}UT  {c |}{col 14}{res}{space 2} .2923184{col 26}{space 2} 1.241225{col 37}{space 1}    0.24{col 46}{space 3}0.814{col 54}{space 4}-2.140881{col 67}{space 3} 2.725518
{txt}{space 9}VA  {c |}{col 14}{res}{space 2} .0613438{col 26}{space 2} 1.208216{col 37}{space 1}    0.05{col 46}{space 3}0.960{col 54}{space 4}-2.307146{col 67}{space 3} 2.429834
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}   .86792{col 26}{space 2} 1.278037{col 37}{space 1}    0.68{col 46}{space 3}0.497{col 54}{space 4}-1.637442{col 67}{space 3} 3.373282
{txt}{space 9}WA  {c |}{col 14}{res}{space 2} .2905288{col 26}{space 2} 1.209238{col 37}{space 1}    0.24{col 46}{space 3}0.810{col 54}{space 4}-2.079965{col 67}{space 3} 2.661023
{txt}{space 9}WI  {c |}{col 14}{res}{space 2} .0643472{col 26}{space 2} 1.210768{col 37}{space 1}    0.05{col 46}{space 3}0.958{col 54}{space 4}-2.309146{col 67}{space 3} 2.437841
{txt}{space 9}WV  {c |}{col 14}{res}{space 2} .0282765{col 26}{space 2} 1.289821{col 37}{space 1}    0.02{col 46}{space 3}0.983{col 54}{space 4}-2.500186{col 67}{space 3} 2.556739
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-.9776926{col 26}{space 2} 1.244675{col 37}{space 1}   -0.79{col 46}{space 3}0.432{col 54}{space 4}-3.417654{col 67}{space 3} 1.462268
{txt}{space 12} {c |}
{space 7}2.Q33 {c |}{col 14}{res}{space 2} .2978249{col 26}{space 2} .0607368{col 37}{space 1}    4.90{col 46}{space 3}0.000{col 54}{space 4} .1787614{col 67}{space 3} .4168885
{txt}{space 7}2.Q34 {c |}{col 14}{res}{space 2} .0183688{col 26}{space 2} .1222606{col 37}{space 1}    0.15{col 46}{space 3}0.881{col 54}{space 4}-.2213012{col 67}{space 3} .2580387
{txt}{space 7}Q35_1 {c |}{col 14}{res}{space 2} .2741189{col 26}{space 2} .1938692{col 37}{space 1}    1.41{col 46}{space 3}0.157{col 54}{space 4} -.105927{col 67}{space 3} .6541647
{txt}{space 7}Q35_2 {c |}{col 14}{res}{space 2} .3312436{col 26}{space 2} .2017941{col 37}{space 1}    1.64{col 46}{space 3}0.101{col 54}{space 4}-.0643374{col 67}{space 3} .7268246
{txt}{space 7}Q35_3 {c |}{col 14}{res}{space 2} .1031871{col 26}{space 2} .2165437{col 37}{space 1}    0.48{col 46}{space 3}0.634{col 54}{space 4}-.3213079{col 67}{space 3}  .527682
{txt}{space 7}Q35_4 {c |}{col 14}{res}{space 2} .4769522{col 26}{space 2} .2268991{col 37}{space 1}    2.10{col 46}{space 3}0.036{col 54}{space 4} .0321573{col 67}{space 3} .9217472
{txt}{space 7}Q35_5 {c |}{col 14}{res}{space 2} -.607178{col 26}{space 2} .3835297{col 37}{space 1}   -1.58{col 46}{space 3}0.113{col 54}{space 4}-1.359019{col 67}{space 3} .1446632
{txt}{space 7}Q35_6 {c |}{col 14}{res}{space 2} .3155322{col 26}{space 2} .2155912{col 37}{space 1}    1.46{col 46}{space 3}0.143{col 54}{space 4}-.1070957{col 67}{space 3}   .73816
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.007432{col 26}{space 2}  1.25412{col 37}{space 1}    1.60{col 46}{space 3}0.109{col 54}{space 4}-.4510447{col 67}{space 3} 4.465908
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est8{txt} stored)

Linear regression                                      Number of obs ={res}    5804
                                                       {txt}F( 75,  5728) ={res}    5.83
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0688
                                                       {txt}Root MSE      = {res} 2.2525

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}    Q24_mean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2}-.2505912{col 26}{space 2} .1628562{col 37}{space 1}   -1.54{col 46}{space 3}0.124{col 54}{space 4}-.5698509{col 67}{space 3} .0686685
{txt}{space 8}Old  {c |}{col 14}{res}{space 2}-.2510555{col 26}{space 2} .2447017{col 37}{space 1}   -1.03{col 46}{space 3}0.305{col 54}{space 4}-.7307635{col 67}{space 3} .2286524
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2} .0564526{col 26}{space 2} .1135265{col 37}{space 1}    0.50{col 46}{space 3}0.619{col 54}{space 4}-.1661023{col 67}{space 3} .2790075
{txt}High Educ..  {c |}{col 14}{res}{space 2} .0865673{col 26}{space 2} .1097779{col 37}{space 1}    0.79{col 46}{space 3}0.430{col 54}{space 4}-.1286388{col 67}{space 3} .3017734
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2}-.1635735{col 26}{space 2} .0958906{col 37}{space 1}   -1.71{col 46}{space 3}0.088{col 54}{space 4}-.3515553{col 67}{space 3} .0244083
{txt}High Income  {c |}{col 14}{res}{space 2} .0938046{col 26}{space 2} .0962509{col 37}{space 1}    0.97{col 46}{space 3}0.330{col 54}{space 4}-.0948837{col 67}{space 3} .2824928
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2} .2067101{col 26}{space 2} .1833672{col 37}{space 1}    1.13{col 46}{space 3}0.260{col 54}{space 4} -.152759{col 67}{space 3} .5661792
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} .5003964{col 26}{space 2} .2496409{col 37}{space 1}    2.00{col 46}{space 3}0.045{col 54}{space 4} .0110057{col 67}{space 3}  .989787
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2} .1438625{col 26}{space 2} .0979743{col 37}{space 1}    1.47{col 46}{space 3}0.142{col 54}{space 4}-.0482043{col 67}{space 3} .3359292
{txt}{space 7}2015  {c |}{col 14}{res}{space 2} .1674731{col 26}{space 2} .0951237{col 37}{space 1}    1.76{col 46}{space 3}0.078{col 54}{space 4}-.0190053{col 67}{space 3} .3539515
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1294138{col 26}{space 2} .0948727{col 37}{space 1}    1.36{col 46}{space 3}0.173{col 54}{space 4}-.0565726{col 67}{space 3} .3154002
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .2840897{col 26}{space 2} .0970582{col 37}{space 1}    2.93{col 46}{space 3}0.003{col 54}{space 4} .0938189{col 67}{space 3} .4743606
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1931594{col 26}{space 2} .1282061{col 37}{space 1}    1.51{col 46}{space 3}0.132{col 54}{space 4} -.058173{col 67}{space 3} .4444917
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2}-2.387091{col 26}{space 2} .9836724{col 37}{space 1}   -2.43{col 46}{space 3}0.015{col 54}{space 4}-4.315461{col 67}{space 3} -.458721
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-2.682166{col 26}{space 2} 1.019289{col 37}{space 1}   -2.63{col 46}{space 3}0.009{col 54}{space 4}-4.680358{col 67}{space 3}-.6839738
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-2.493872{col 26}{space 2} .9706189{col 37}{space 1}   -2.57{col 46}{space 3}0.010{col 54}{space 4}-4.396652{col 67}{space 3} -.591092
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-2.387358{col 26}{space 2} .9506647{col 37}{space 1}   -2.51{col 46}{space 3}0.012{col 54}{space 4} -4.25102{col 67}{space 3}-.5236955
{txt}{space 9}CO  {c |}{col 14}{res}{space 2}-2.550742{col 26}{space 2} .9661288{col 37}{space 1}   -2.64{col 46}{space 3}0.008{col 54}{space 4} -4.44472{col 67}{space 3}-.6567642
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-2.638268{col 26}{space 2} .9729321{col 37}{space 1}   -2.71{col 46}{space 3}0.007{col 54}{space 4}-4.545583{col 67}{space 3}-.7309531
{txt}{space 9}DC  {c |}{col 14}{res}{space 2}-2.174863{col 26}{space 2} 1.065155{col 37}{space 1}   -2.04{col 46}{space 3}0.041{col 54}{space 4}-4.262971{col 67}{space 3}-.0867558
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-2.112843{col 26}{space 2} 1.142557{col 37}{space 1}   -1.85{col 46}{space 3}0.064{col 54}{space 4}-4.352686{col 67}{space 3} .1270004
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-2.869941{col 26}{space 2} .9521991{col 37}{space 1}   -3.01{col 46}{space 3}0.003{col 54}{space 4}-4.736611{col 67}{space 3} -1.00327
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-2.647454{col 26}{space 2} .9592015{col 37}{space 1}   -2.76{col 46}{space 3}0.006{col 54}{space 4}-4.527852{col 67}{space 3} -.767056
{txt}{space 9}HI  {c |}{col 14}{res}{space 2}-2.688427{col 26}{space 2}  1.11415{col 37}{space 1}   -2.41{col 46}{space 3}0.016{col 54}{space 4}-4.872582{col 67}{space 3}-.5042716
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-2.860434{col 26}{space 2} .9704369{col 37}{space 1}   -2.95{col 46}{space 3}0.003{col 54}{space 4}-4.762857{col 67}{space 3}-.9580106
{txt}{space 9}ID  {c |}{col 14}{res}{space 2}-2.150637{col 26}{space 2} 1.018219{col 37}{space 1}   -2.11{col 46}{space 3}0.035{col 54}{space 4}-4.146731{col 67}{space 3}-.1545426
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-2.735808{col 26}{space 2} .9508924{col 37}{space 1}   -2.88{col 46}{space 3}0.004{col 54}{space 4}-4.599917{col 67}{space 3}-.8716991
{txt}{space 9}IN  {c |}{col 14}{res}{space 2}-2.704618{col 26}{space 2} .9636405{col 37}{space 1}   -2.81{col 46}{space 3}0.005{col 54}{space 4}-4.593717{col 67}{space 3}-.8155178
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-2.924213{col 26}{space 2} .9846832{col 37}{space 1}   -2.97{col 46}{space 3}0.003{col 54}{space 4}-4.854565{col 67}{space 3}-.9938616
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-3.138426{col 26}{space 2} .9723801{col 37}{space 1}   -3.23{col 46}{space 3}0.001{col 54}{space 4}-5.044659{col 67}{space 3}-1.232194
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-2.853395{col 26}{space 2} .9906271{col 37}{space 1}   -2.88{col 46}{space 3}0.004{col 54}{space 4}-4.795399{col 67}{space 3}-.9113915
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-2.495821{col 26}{space 2} .9546444{col 37}{space 1}   -2.61{col 46}{space 3}0.009{col 54}{space 4}-4.367285{col 67}{space 3}-.6243567
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-2.895446{col 26}{space 2} .9622049{col 37}{space 1}   -3.01{col 46}{space 3}0.003{col 54}{space 4}-4.781732{col 67}{space 3}-1.009161
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-2.791981{col 26}{space 2} 1.004832{col 37}{space 1}   -2.78{col 46}{space 3}0.005{col 54}{space 4}-4.761832{col 67}{space 3}-.8221309
{txt}{space 9}MI  {c |}{col 14}{res}{space 2}-2.708615{col 26}{space 2} .9555986{col 37}{space 1}   -2.83{col 46}{space 3}0.005{col 54}{space 4} -4.58195{col 67}{space 3}-.8352805
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-2.841404{col 26}{space 2} .9627495{col 37}{space 1}   -2.95{col 46}{space 3}0.003{col 54}{space 4}-4.728757{col 67}{space 3}-.9540506
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-2.753029{col 26}{space 2} .9649662{col 37}{space 1}   -2.85{col 46}{space 3}0.004{col 54}{space 4}-4.644728{col 67}{space 3}-.8613301
{txt}{space 9}MS  {c |}{col 14}{res}{space 2} -3.15253{col 26}{space 2} .9813014{col 37}{space 1}   -3.21{col 46}{space 3}0.001{col 54}{space 4}-5.076252{col 67}{space 3}-1.228808
{txt}{space 9}MT  {c |}{col 14}{res}{space 2}-2.415294{col 26}{space 2} 1.145259{col 37}{space 1}   -2.11{col 46}{space 3}0.035{col 54}{space 4}-4.660434{col 67}{space 3} -.170153
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-2.404122{col 26}{space 2} .9576225{col 37}{space 1}   -2.51{col 46}{space 3}0.012{col 54}{space 4}-4.281424{col 67}{space 3}-.5268198
{txt}{space 9}ND  {c |}{col 14}{res}{space 2} -2.45974{col 26}{space 2}  1.16022{col 37}{space 1}   -2.12{col 46}{space 3}0.034{col 54}{space 4} -4.73421{col 67}{space 3}-.1852698
{txt}{space 9}NE  {c |}{col 14}{res}{space 2}-2.640172{col 26}{space 2} .9846068{col 37}{space 1}   -2.68{col 46}{space 3}0.007{col 54}{space 4}-4.570374{col 67}{space 3}-.7099703
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}  -3.0101{col 26}{space 2} .9847611{col 37}{space 1}   -3.06{col 46}{space 3}0.002{col 54}{space 4}-4.940604{col 67}{space 3}-1.079595
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-2.900226{col 26}{space 2} .9566647{col 37}{space 1}   -3.03{col 46}{space 3}0.002{col 54}{space 4} -4.77565{col 67}{space 3}-1.024801
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-3.898906{col 26}{space 2} .9886352{col 37}{space 1}   -3.94{col 46}{space 3}0.000{col 54}{space 4}-5.837005{col 67}{space 3}-1.960807
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}-1.711609{col 26}{space 2} 1.032267{col 37}{space 1}   -1.66{col 46}{space 3}0.097{col 54}{space 4}-3.735242{col 67}{space 3} .3120235
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-2.692703{col 26}{space 2} .9507816{col 37}{space 1}   -2.83{col 46}{space 3}0.005{col 54}{space 4}-4.556595{col 67}{space 3}-.8288115
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-2.601686{col 26}{space 2} .9518172{col 37}{space 1}   -2.73{col 46}{space 3}0.006{col 54}{space 4}-4.467608{col 67}{space 3}-.7357643
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-2.425896{col 26}{space 2} 1.024161{col 37}{space 1}   -2.37{col 46}{space 3}0.018{col 54}{space 4}-4.433639{col 67}{space 3}-.4181534
{txt}{space 9}OR  {c |}{col 14}{res}{space 2} -2.86405{col 26}{space 2} .9642463{col 37}{space 1}   -2.97{col 46}{space 3}0.003{col 54}{space 4}-4.754337{col 67}{space 3}-.9737624
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-2.805306{col 26}{space 2} .9495732{col 37}{space 1}   -2.95{col 46}{space 3}0.003{col 54}{space 4}-4.666829{col 67}{space 3}-.9437838
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-2.657801{col 26}{space 2} 1.056962{col 37}{space 1}   -2.51{col 46}{space 3}0.012{col 54}{space 4}-4.729846{col 67}{space 3}-.5857555
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-2.394327{col 26}{space 2}  .997035{col 37}{space 1}   -2.40{col 46}{space 3}0.016{col 54}{space 4}-4.348893{col 67}{space 3}-.4397614
{txt}{space 9}SD  {c |}{col 14}{res}{space 2}-2.068711{col 26}{space 2} 1.177635{col 37}{space 1}   -1.76{col 46}{space 3}0.079{col 54}{space 4} -4.37732{col 67}{space 3} .2398989
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-2.654693{col 26}{space 2} .9682979{col 37}{space 1}   -2.74{col 46}{space 3}0.006{col 54}{space 4}-4.552923{col 67}{space 3}-.7564627
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-2.309148{col 26}{space 2}  .950012{col 37}{space 1}   -2.43{col 46}{space 3}0.015{col 54}{space 4}-4.171531{col 67}{space 3}-.4467654
{txt}{space 9}UT  {c |}{col 14}{res}{space 2}-2.477361{col 26}{space 2} .9957798{col 37}{space 1}   -2.49{col 46}{space 3}0.013{col 54}{space 4}-4.429466{col 67}{space 3}-.5252561
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}-2.601047{col 26}{space 2}  .963247{col 37}{space 1}   -2.70{col 46}{space 3}0.007{col 54}{space 4}-4.489375{col 67}{space 3}-.7127184
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}-1.662807{col 26}{space 2} 1.039296{col 37}{space 1}   -1.60{col 46}{space 3}0.110{col 54}{space 4}-3.700221{col 67}{space 3} .3746072
{txt}{space 9}WA  {c |}{col 14}{res}{space 2}-2.471563{col 26}{space 2} .9605803{col 37}{space 1}   -2.57{col 46}{space 3}0.010{col 54}{space 4}-4.354664{col 67}{space 3}-.5884621
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-2.528988{col 26}{space 2} .9641972{col 37}{space 1}   -2.62{col 46}{space 3}0.009{col 54}{space 4}-4.419179{col 67}{space 3}-.6387966
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-3.132287{col 26}{space 2} .9946984{col 37}{space 1}   -3.15{col 46}{space 3}0.002{col 54}{space 4}-5.082272{col 67}{space 3}-1.182301
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-3.750326{col 26}{space 2} .9930737{col 37}{space 1}   -3.78{col 46}{space 3}0.000{col 54}{space 4}-5.697126{col 67}{space 3}-1.803526
{txt}{space 12} {c |}
{space 7}2.Q33 {c |}{col 14}{res}{space 2} .2751555{col 26}{space 2}   .06171{col 37}{space 1}    4.46{col 46}{space 3}0.000{col 54}{space 4} .1541805{col 67}{space 3} .3961304
{txt}{space 7}2.Q34 {c |}{col 14}{res}{space 2}-.0683579{col 26}{space 2} .1252718{col 37}{space 1}   -0.55{col 46}{space 3}0.585{col 54}{space 4} -.313938{col 67}{space 3} .1772222
{txt}{space 7}Q35_1 {c |}{col 14}{res}{space 2} .2482892{col 26}{space 2} .2015925{col 37}{space 1}    1.23{col 46}{space 3}0.218{col 54}{space 4}-.1469082{col 67}{space 3} .6434867
{txt}{space 7}Q35_2 {c |}{col 14}{res}{space 2} .3008183{col 26}{space 2} .2073109{col 37}{space 1}    1.45{col 46}{space 3}0.147{col 54}{space 4}-.1055895{col 67}{space 3}  .707226
{txt}{space 7}Q35_3 {c |}{col 14}{res}{space 2}   .28299{col 26}{space 2} .2284972{col 37}{space 1}    1.24{col 46}{space 3}0.216{col 54}{space 4} -.164951{col 67}{space 3} .7309309
{txt}{space 7}Q35_4 {c |}{col 14}{res}{space 2} .5585041{col 26}{space 2} .2346008{col 37}{space 1}    2.38{col 46}{space 3}0.017{col 54}{space 4} .0985978{col 67}{space 3}  1.01841
{txt}{space 7}Q35_5 {c |}{col 14}{res}{space 2} -.463845{col 26}{space 2} .4363875{col 37}{space 1}   -1.06{col 46}{space 3}0.288{col 54}{space 4}-1.319329{col 67}{space 3} .3916395
{txt}{space 7}Q35_6 {c |}{col 14}{res}{space 2} .2116533{col 26}{space 2} .2215137{col 37}{space 1}    0.96{col 46}{space 3}0.339{col 54}{space 4}-.2225973{col 67}{space 3} .6459039
{txt}{space 7}Q4new {c |}{col 14}{res}{space 2}-.0050494{col 26}{space 2} .0013975{col 37}{space 1}   -3.61{col 46}{space 3}0.000{col 54}{space 4} -.007789{col 67}{space 3}-.0023097
{txt}{space 7}Q6new {c |}{col 14}{res}{space 2}  .008989{col 26}{space 2} .0014361{col 37}{space 1}    6.26{col 46}{space 3}0.000{col 54}{space 4} .0061738{col 67}{space 3} .0118042
{txt}{space 5}Q9_mean {c |}{col 14}{res}{space 2} .0446411{col 26}{space 2} .0070996{col 37}{space 1}    6.29{col 46}{space 3}0.000{col 54}{space 4} .0307231{col 67}{space 3} .0585591
{txt}{space 6}Q13new {c |}{col 14}{res}{space 2}-.0118023{col 26}{space 2} .0015002{col 37}{space 1}   -7.87{col 46}{space 3}0.000{col 54}{space 4}-.0147433{col 67}{space 3}-.0088614
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 4.547237{col 26}{space 2} 1.015269{col 37}{space 1}    4.48{col 46}{space 3}0.000{col 54}{space 4} 2.556925{col 67}{space 3} 6.537548
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est9{txt} stored)

{com}. foreach mom in Mean Var Skew Kurt{c -(}
{txt}  2{com}. eststo: reg Inc`mom' i.age_g i.edu_g i.inc_g i.cohort_g i.year i.state_id, robust 
{txt}  3{com}. eststo: reg Inc`mom' i.age_g i.edu_g i.inc_g i.cohort_g i.year i.state_id ${c -(}other_control{c )-}, robust 
{txt}  4{com}. eststo: reg Inc`mom' i.age_g i.edu_g i.inc_g i.cohort_g i.year i.state_id ${c -(}other_control{c )-} ${c -(}macro_ex_var{c )-}, robust 
{txt}  5{com}. 
. {c )-}

{txt}Linear regression                                      Number of obs ={res}    6663
                                                       {txt}F( 63,  6599) ={res}    1.55
                                                       {txt}Prob > F      = {res} 0.0035
                                                       {txt}R-squared     = {res} 0.0153
                                                       {txt}Root MSE      = {res} 2.7506

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     IncMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2}  .080322{col 26}{space 2} .1895052{col 37}{space 1}    0.42{col 46}{space 3}0.672{col 54}{space 4}-.2911695{col 67}{space 3} .4518136
{txt}{space 8}Old  {c |}{col 14}{res}{space 2} .2458482{col 26}{space 2} .2631837{col 37}{space 1}    0.93{col 46}{space 3}0.350{col 54}{space 4} -.270077{col 67}{space 3} .7617734
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2} .0891506{col 26}{space 2} .1307356{col 37}{space 1}    0.68{col 46}{space 3}0.495{col 54}{space 4}-.1671335{col 67}{space 3} .3454347
{txt}High Educ..  {c |}{col 14}{res}{space 2}-.2053889{col 26}{space 2} .1270123{col 37}{space 1}   -1.62{col 46}{space 3}0.106{col 54}{space 4}-.4543741{col 67}{space 3} .0435963
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2}-.2819951{col 26}{space 2} .1104425{col 37}{space 1}   -2.55{col 46}{space 3}0.011{col 54}{space 4}-.4984981{col 67}{space 3} -.065492
{txt}High Income  {c |}{col 14}{res}{space 2}-.1861648{col 26}{space 2} .1127907{col 37}{space 1}   -1.65{col 46}{space 3}0.099{col 54}{space 4}-.4072711{col 67}{space 3} .0349416
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2}-.1270368{col 26}{space 2} .1895605{col 37}{space 1}   -0.67{col 46}{space 3}0.503{col 54}{space 4}-.4986367{col 67}{space 3}  .244563
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} .0844109{col 26}{space 2} .2724389{col 37}{space 1}    0.31{col 46}{space 3}0.757{col 54}{space 4}-.4496575{col 67}{space 3} .6184794
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2} .0747528{col 26}{space 2} .1030262{col 37}{space 1}    0.73{col 46}{space 3}0.468{col 54}{space 4}-.1272119{col 67}{space 3} .2767175
{txt}{space 7}2015  {c |}{col 14}{res}{space 2}  .160401{col 26}{space 2} .1051328{col 37}{space 1}    1.53{col 46}{space 3}0.127{col 54}{space 4}-.0456933{col 67}{space 3} .3664953
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}  .117904{col 26}{space 2} .1046191{col 37}{space 1}    1.13{col 46}{space 3}0.260{col 54}{space 4}-.0871834{col 67}{space 3} .3229913
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .3871449{col 26}{space 2} .1132315{col 37}{space 1}    3.42{col 46}{space 3}0.001{col 54}{space 4} .1651745{col 67}{space 3} .6091153
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .4803304{col 26}{space 2} .1605426{col 37}{space 1}    2.99{col 46}{space 3}0.003{col 54}{space 4} .1656149{col 67}{space 3} .7950459
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2} -2.32259{col 26}{space 2} 2.705574{col 37}{space 1}   -0.86{col 46}{space 3}0.391{col 54}{space 4} -7.62639{col 67}{space 3} 2.981211
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-2.062247{col 26}{space 2} 2.729261{col 37}{space 1}   -0.76{col 46}{space 3}0.450{col 54}{space 4}-7.412481{col 67}{space 3} 3.287987
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-2.461284{col 26}{space 2} 2.694931{col 37}{space 1}   -0.91{col 46}{space 3}0.361{col 54}{space 4} -7.74422{col 67}{space 3} 2.821652
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-2.270592{col 26}{space 2} 2.691289{col 37}{space 1}   -0.84{col 46}{space 3}0.399{col 54}{space 4}-7.546389{col 67}{space 3} 3.005206
{txt}{space 9}CO  {c |}{col 14}{res}{space 2} -2.67117{col 26}{space 2} 2.693836{col 37}{space 1}   -0.99{col 46}{space 3}0.321{col 54}{space 4}-7.951959{col 67}{space 3}  2.60962
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-2.733897{col 26}{space 2} 2.694287{col 37}{space 1}   -1.01{col 46}{space 3}0.310{col 54}{space 4}-8.015571{col 67}{space 3} 2.547778
{txt}{space 9}DC  {c |}{col 14}{res}{space 2}-2.692334{col 26}{space 2} 2.726334{col 37}{space 1}   -0.99{col 46}{space 3}0.323{col 54}{space 4}-8.036831{col 67}{space 3} 2.652164
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-2.551399{col 26}{space 2} 2.728102{col 37}{space 1}   -0.94{col 46}{space 3}0.350{col 54}{space 4}-7.899362{col 67}{space 3} 2.796564
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-2.225125{col 26}{space 2} 2.693184{col 37}{space 1}   -0.83{col 46}{space 3}0.409{col 54}{space 4}-7.504637{col 67}{space 3} 3.054386
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-2.318492{col 26}{space 2}  2.69584{col 37}{space 1}   -0.86{col 46}{space 3}0.390{col 54}{space 4} -7.60321{col 67}{space 3} 2.966226
{txt}{space 9}HI  {c |}{col 14}{res}{space 2}-2.069515{col 26}{space 2} 2.759022{col 37}{space 1}   -0.75{col 46}{space 3}0.453{col 54}{space 4}-7.478091{col 67}{space 3} 3.339061
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-2.754526{col 26}{space 2} 2.691548{col 37}{space 1}   -1.02{col 46}{space 3}0.306{col 54}{space 4}-8.030832{col 67}{space 3} 2.521779
{txt}{space 9}ID  {c |}{col 14}{res}{space 2}-2.051158{col 26}{space 2} 2.732941{col 37}{space 1}   -0.75{col 46}{space 3}0.453{col 54}{space 4}-7.408605{col 67}{space 3}  3.30629
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-2.629701{col 26}{space 2} 2.690395{col 37}{space 1}   -0.98{col 46}{space 3}0.328{col 54}{space 4}-7.903744{col 67}{space 3} 2.644343
{txt}{space 9}IN  {c |}{col 14}{res}{space 2}-2.312194{col 26}{space 2}   2.6998{col 37}{space 1}   -0.86{col 46}{space 3}0.392{col 54}{space 4}-7.604676{col 67}{space 3} 2.980288
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-2.252809{col 26}{space 2} 2.714888{col 37}{space 1}   -0.83{col 46}{space 3}0.407{col 54}{space 4}-7.574869{col 67}{space 3}  3.06925
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-2.550207{col 26}{space 2}  2.70265{col 37}{space 1}   -0.94{col 46}{space 3}0.345{col 54}{space 4}-7.848275{col 67}{space 3} 2.747862
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-3.004086{col 26}{space 2} 2.701277{col 37}{space 1}   -1.11{col 46}{space 3}0.266{col 54}{space 4}-8.299462{col 67}{space 3}  2.29129
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-2.229454{col 26}{space 2} 2.697863{col 37}{space 1}   -0.83{col 46}{space 3}0.409{col 54}{space 4}-7.518138{col 67}{space 3}  3.05923
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-2.519914{col 26}{space 2} 2.699199{col 37}{space 1}   -0.93{col 46}{space 3}0.351{col 54}{space 4}-7.811217{col 67}{space 3} 2.771388
{txt}{space 9}ME  {c |}{col 14}{res}{space 2} -2.65968{col 26}{space 2}  2.69615{col 37}{space 1}   -0.99{col 46}{space 3}0.324{col 54}{space 4}-7.945006{col 67}{space 3} 2.625647
{txt}{space 9}MI  {c |}{col 14}{res}{space 2}-2.794561{col 26}{space 2} 2.689936{col 37}{space 1}   -1.04{col 46}{space 3}0.299{col 54}{space 4}-8.067706{col 67}{space 3} 2.478584
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-2.704074{col 26}{space 2} 2.694248{col 37}{space 1}   -1.00{col 46}{space 3}0.316{col 54}{space 4}-7.985671{col 67}{space 3} 2.577523
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-2.426136{col 26}{space 2} 2.697631{col 37}{space 1}   -0.90{col 46}{space 3}0.368{col 54}{space 4}-7.714366{col 67}{space 3} 2.862093
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-2.673715{col 26}{space 2}  2.71279{col 37}{space 1}   -0.99{col 46}{space 3}0.324{col 54}{space 4}-7.991661{col 67}{space 3} 2.644232
{txt}{space 9}MT  {c |}{col 14}{res}{space 2}-2.143692{col 26}{space 2} 2.750065{col 37}{space 1}   -0.78{col 46}{space 3}0.436{col 54}{space 4}-7.534709{col 67}{space 3} 3.247325
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-2.372528{col 26}{space 2} 2.694049{col 37}{space 1}   -0.88{col 46}{space 3}0.379{col 54}{space 4}-7.653736{col 67}{space 3} 2.908679
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-2.541108{col 26}{space 2} 2.736579{col 37}{space 1}   -0.93{col 46}{space 3}0.353{col 54}{space 4}-7.905688{col 67}{space 3} 2.823472
{txt}{space 9}NE  {c |}{col 14}{res}{space 2}-2.742962{col 26}{space 2} 2.700925{col 37}{space 1}   -1.02{col 46}{space 3}0.310{col 54}{space 4}-8.037647{col 67}{space 3} 2.551724
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-2.358768{col 26}{space 2} 2.715845{col 37}{space 1}   -0.87{col 46}{space 3}0.385{col 54}{space 4}-7.682702{col 67}{space 3} 2.965167
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-2.664376{col 26}{space 2} 2.693083{col 37}{space 1}   -0.99{col 46}{space 3}0.323{col 54}{space 4} -7.94369{col 67}{space 3} 2.614937
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-2.924089{col 26}{space 2} 2.710112{col 37}{space 1}   -1.08{col 46}{space 3}0.281{col 54}{space 4}-8.236785{col 67}{space 3} 2.388606
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}-1.887059{col 26}{space 2} 2.731831{col 37}{space 1}   -0.69{col 46}{space 3}0.490{col 54}{space 4}-7.242333{col 67}{space 3} 3.468214
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-2.255957{col 26}{space 2} 2.691171{col 37}{space 1}   -0.84{col 46}{space 3}0.402{col 54}{space 4}-7.531522{col 67}{space 3} 3.019609
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-2.388443{col 26}{space 2} 2.691954{col 37}{space 1}   -0.89{col 46}{space 3}0.375{col 54}{space 4}-7.665543{col 67}{space 3} 2.888657
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-2.305612{col 26}{space 2}  2.72089{col 37}{space 1}   -0.85{col 46}{space 3}0.397{col 54}{space 4}-7.639437{col 67}{space 3} 3.028212
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-2.622285{col 26}{space 2} 2.694192{col 37}{space 1}   -0.97{col 46}{space 3}0.330{col 54}{space 4}-7.903772{col 67}{space 3} 2.659203
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-2.510938{col 26}{space 2} 2.690796{col 37}{space 1}   -0.93{col 46}{space 3}0.351{col 54}{space 4}-7.785768{col 67}{space 3} 2.763893
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-1.904661{col 26}{space 2} 2.781674{col 37}{space 1}   -0.68{col 46}{space 3}0.494{col 54}{space 4}-7.357642{col 67}{space 3}  3.54832
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-2.302036{col 26}{space 2} 2.709278{col 37}{space 1}   -0.85{col 46}{space 3}0.396{col 54}{space 4}-7.613097{col 67}{space 3} 3.009025
{txt}{space 9}SD  {c |}{col 14}{res}{space 2}-1.590261{col 26}{space 2} 2.782092{col 37}{space 1}   -0.57{col 46}{space 3}0.568{col 54}{space 4}-7.044062{col 67}{space 3}  3.86354
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-2.311383{col 26}{space 2} 2.703705{col 37}{space 1}   -0.85{col 46}{space 3}0.393{col 54}{space 4}-7.611519{col 67}{space 3} 2.988753
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-2.324885{col 26}{space 2} 2.692185{col 37}{space 1}   -0.86{col 46}{space 3}0.388{col 54}{space 4}-7.602439{col 67}{space 3}  2.95267
{txt}{space 9}UT  {c |}{col 14}{res}{space 2}-2.577569{col 26}{space 2} 2.706745{col 37}{space 1}   -0.95{col 46}{space 3}0.341{col 54}{space 4}-7.883664{col 67}{space 3} 2.728527
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}-2.401934{col 26}{space 2} 2.695297{col 37}{space 1}   -0.89{col 46}{space 3}0.373{col 54}{space 4}-7.685588{col 67}{space 3}  2.88172
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}-1.107105{col 26}{space 2} 2.757903{col 37}{space 1}   -0.40{col 46}{space 3}0.688{col 54}{space 4}-6.513488{col 67}{space 3} 4.299277
{txt}{space 9}WA  {c |}{col 14}{res}{space 2} -2.34738{col 26}{space 2} 2.698882{col 37}{space 1}   -0.87{col 46}{space 3}0.384{col 54}{space 4}-7.638062{col 67}{space 3} 2.943302
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-2.494501{col 26}{space 2} 2.696966{col 37}{space 1}   -0.92{col 46}{space 3}0.355{col 54}{space 4}-7.781428{col 67}{space 3} 2.792426
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-2.851869{col 26}{space 2} 2.715307{col 37}{space 1}   -1.05{col 46}{space 3}0.294{col 54}{space 4}-8.174749{col 67}{space 3} 2.471012
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-2.895105{col 26}{space 2} 2.710598{col 37}{space 1}   -1.07{col 46}{space 3}0.286{col 54}{space 4}-8.208754{col 67}{space 3} 2.418543
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 4.164526{col 26}{space 2} 2.699702{col 37}{space 1}    1.54{col 46}{space 3}0.123{col 54}{space 4}-1.127764{col 67}{space 3} 9.456816
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est10{txt} stored)

Linear regression                                      Number of obs ={res}    6661
                                                       {txt}F( 71,  6589) ={res}    1.78
                                                       {txt}Prob > F      = {res} 0.0001
                                                       {txt}R-squared     = {res} 0.0193
                                                       {txt}Root MSE      = {res}  2.747

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     IncMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2} .0769266{col 26}{space 2} .1899395{col 37}{space 1}    0.41{col 46}{space 3}0.685{col 54}{space 4}-.2954165{col 67}{space 3} .4492696
{txt}{space 8}Old  {c |}{col 14}{res}{space 2}  .253114{col 26}{space 2}  .264385{col 37}{space 1}    0.96{col 46}{space 3}0.338{col 54}{space 4}-.2651662{col 67}{space 3} .7713943
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2} .0691607{col 26}{space 2} .1312957{col 37}{space 1}    0.53{col 46}{space 3}0.598{col 54}{space 4}-.1882214{col 67}{space 3} .3265428
{txt}High Educ..  {c |}{col 14}{res}{space 2}-.2046274{col 26}{space 2} .1270809{col 37}{space 1}   -1.61{col 46}{space 3}0.107{col 54}{space 4}-.4537471{col 67}{space 3} .0444923
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2}-.2505794{col 26}{space 2} .1105926{col 37}{space 1}   -2.27{col 46}{space 3}0.023{col 54}{space 4}-.4673767{col 67}{space 3}-.0337821
{txt}High Income  {c |}{col 14}{res}{space 2}-.0974135{col 26}{space 2} .1144049{col 37}{space 1}   -0.85{col 46}{space 3}0.395{col 54}{space 4}-.3216843{col 67}{space 3} .1268572
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2}-.1492823{col 26}{space 2} .1907584{col 37}{space 1}   -0.78{col 46}{space 3}0.434{col 54}{space 4}-.5232306{col 67}{space 3}  .224666
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} .0555912{col 26}{space 2} .2745114{col 37}{space 1}    0.20{col 46}{space 3}0.840{col 54}{space 4}-.4825402{col 67}{space 3} .5937226
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2} .0686477{col 26}{space 2} .1021935{col 37}{space 1}    0.67{col 46}{space 3}0.502{col 54}{space 4}-.1316848{col 67}{space 3} .2689801
{txt}{space 7}2015  {c |}{col 14}{res}{space 2} .1512505{col 26}{space 2} .1048754{col 37}{space 1}    1.44{col 46}{space 3}0.149{col 54}{space 4}-.0543393{col 67}{space 3} .3568403
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0973411{col 26}{space 2} .1048964{col 37}{space 1}    0.93{col 46}{space 3}0.353{col 54}{space 4}-.1082898{col 67}{space 3} .3029719
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .3767189{col 26}{space 2} .1130648{col 37}{space 1}    3.33{col 46}{space 3}0.001{col 54}{space 4} .1550752{col 67}{space 3} .5983626
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}  .472721{col 26}{space 2}  .160331{col 37}{space 1}    2.95{col 46}{space 3}0.003{col 54}{space 4} .1584203{col 67}{space 3} .7870217
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2}-2.327437{col 26}{space 2}  2.73303{col 37}{space 1}   -0.85{col 46}{space 3}0.394{col 54}{space 4}-7.685061{col 67}{space 3} 3.030188
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-2.015299{col 26}{space 2} 2.756536{col 37}{space 1}   -0.73{col 46}{space 3}0.465{col 54}{space 4}-7.419003{col 67}{space 3} 3.388405
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-2.401454{col 26}{space 2} 2.723071{col 37}{space 1}   -0.88{col 46}{space 3}0.378{col 54}{space 4}-7.739556{col 67}{space 3} 2.936648
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-2.214372{col 26}{space 2} 2.722953{col 37}{space 1}   -0.81{col 46}{space 3}0.416{col 54}{space 4}-7.552242{col 67}{space 3} 3.123498
{txt}{space 9}CO  {c |}{col 14}{res}{space 2}-2.599887{col 26}{space 2} 2.722947{col 37}{space 1}   -0.95{col 46}{space 3}0.340{col 54}{space 4}-7.937746{col 67}{space 3} 2.737971
{txt}{space 9}CT  {c |}{col 14}{res}{space 2} -2.69394{col 26}{space 2} 2.722374{col 37}{space 1}   -0.99{col 46}{space 3}0.322{col 54}{space 4}-8.030677{col 67}{space 3} 2.642796
{txt}{space 9}DC  {c |}{col 14}{res}{space 2}-2.709555{col 26}{space 2} 2.756161{col 37}{space 1}   -0.98{col 46}{space 3}0.326{col 54}{space 4}-8.112523{col 67}{space 3} 2.693413
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-2.537833{col 26}{space 2} 2.756175{col 37}{space 1}   -0.92{col 46}{space 3}0.357{col 54}{space 4}-7.940829{col 67}{space 3} 2.865164
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-2.163148{col 26}{space 2}   2.7218{col 37}{space 1}   -0.79{col 46}{space 3}0.427{col 54}{space 4}-7.498759{col 67}{space 3} 3.172462
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-2.303761{col 26}{space 2} 2.723985{col 37}{space 1}   -0.85{col 46}{space 3}0.398{col 54}{space 4}-7.643654{col 67}{space 3} 3.036133
{txt}{space 9}HI  {c |}{col 14}{res}{space 2} -1.61529{col 26}{space 2} 2.811838{col 37}{space 1}   -0.57{col 46}{space 3}0.566{col 54}{space 4}-7.127404{col 67}{space 3} 3.896823
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-2.634904{col 26}{space 2} 2.719715{col 37}{space 1}   -0.97{col 46}{space 3}0.333{col 54}{space 4}-7.966426{col 67}{space 3} 2.696619
{txt}{space 9}ID  {c |}{col 14}{res}{space 2}-1.916884{col 26}{space 2} 2.761303{col 37}{space 1}   -0.69{col 46}{space 3}0.488{col 54}{space 4}-7.329933{col 67}{space 3} 3.496165
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-2.558842{col 26}{space 2} 2.719944{col 37}{space 1}   -0.94{col 46}{space 3}0.347{col 54}{space 4}-7.890814{col 67}{space 3} 2.773129
{txt}{space 9}IN  {c |}{col 14}{res}{space 2}-2.217689{col 26}{space 2}  2.72792{col 37}{space 1}   -0.81{col 46}{space 3}0.416{col 54}{space 4}-7.565296{col 67}{space 3} 3.129918
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-2.159388{col 26}{space 2} 2.742895{col 37}{space 1}   -0.79{col 46}{space 3}0.431{col 54}{space 4}-7.536351{col 67}{space 3} 3.217575
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-2.469406{col 26}{space 2} 2.730335{col 37}{space 1}   -0.90{col 46}{space 3}0.366{col 54}{space 4}-7.821749{col 67}{space 3} 2.882936
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-3.011247{col 26}{space 2} 2.728959{col 37}{space 1}   -1.10{col 46}{space 3}0.270{col 54}{space 4} -8.36089{col 67}{space 3} 2.338396
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-2.164496{col 26}{space 2} 2.726729{col 37}{space 1}   -0.79{col 46}{space 3}0.427{col 54}{space 4}-7.509768{col 67}{space 3} 3.180776
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-2.502264{col 26}{space 2}  2.72812{col 37}{space 1}   -0.92{col 46}{space 3}0.359{col 54}{space 4}-7.850264{col 67}{space 3} 2.845736
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-2.569231{col 26}{space 2} 2.724965{col 37}{space 1}   -0.94{col 46}{space 3}0.346{col 54}{space 4}-7.911047{col 67}{space 3} 2.772584
{txt}{space 9}MI  {c |}{col 14}{res}{space 2}-2.697678{col 26}{space 2} 2.717967{col 37}{space 1}   -0.99{col 46}{space 3}0.321{col 54}{space 4}-8.025774{col 67}{space 3} 2.630417
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-2.600071{col 26}{space 2} 2.723644{col 37}{space 1}   -0.95{col 46}{space 3}0.340{col 54}{space 4}-7.939296{col 67}{space 3} 2.739154
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-2.330645{col 26}{space 2} 2.726052{col 37}{space 1}   -0.85{col 46}{space 3}0.393{col 54}{space 4} -7.67459{col 67}{space 3} 3.013299
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-2.700811{col 26}{space 2} 2.740405{col 37}{space 1}   -0.99{col 46}{space 3}0.324{col 54}{space 4}-8.072893{col 67}{space 3}  2.67127
{txt}{space 9}MT  {c |}{col 14}{res}{space 2}-2.046379{col 26}{space 2} 2.775194{col 37}{space 1}   -0.74{col 46}{space 3}0.461{col 54}{space 4}-7.486659{col 67}{space 3} 3.393901
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-2.303159{col 26}{space 2} 2.722161{col 37}{space 1}   -0.85{col 46}{space 3}0.398{col 54}{space 4}-7.639476{col 67}{space 3} 3.033159
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-2.426445{col 26}{space 2} 2.765638{col 37}{space 1}   -0.88{col 46}{space 3}0.380{col 54}{space 4}-7.847992{col 67}{space 3} 2.995103
{txt}{space 9}NE  {c |}{col 14}{res}{space 2}-2.642804{col 26}{space 2} 2.728766{col 37}{space 1}   -0.97{col 46}{space 3}0.333{col 54}{space 4}-7.992069{col 67}{space 3} 2.706461
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-2.258746{col 26}{space 2} 2.743982{col 37}{space 1}   -0.82{col 46}{space 3}0.410{col 54}{space 4} -7.63784{col 67}{space 3} 3.120348
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-2.593574{col 26}{space 2} 2.722409{col 37}{space 1}   -0.95{col 46}{space 3}0.341{col 54}{space 4}-7.930378{col 67}{space 3} 2.743231
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-2.880417{col 26}{space 2} 2.737784{col 37}{space 1}   -1.05{col 46}{space 3}0.293{col 54}{space 4} -8.24736{col 67}{space 3} 2.486526
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}-1.810863{col 26}{space 2} 2.759825{col 37}{space 1}   -0.66{col 46}{space 3}0.512{col 54}{space 4}-7.221015{col 67}{space 3} 3.599289
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-2.181534{col 26}{space 2} 2.720871{col 37}{space 1}   -0.80{col 46}{space 3}0.423{col 54}{space 4}-7.515324{col 67}{space 3} 3.152256
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-2.288032{col 26}{space 2} 2.720277{col 37}{space 1}   -0.84{col 46}{space 3}0.400{col 54}{space 4}-7.620657{col 67}{space 3} 3.044592
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-2.218886{col 26}{space 2}  2.74878{col 37}{space 1}   -0.81{col 46}{space 3}0.420{col 54}{space 4}-7.607385{col 67}{space 3} 3.169612
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-2.535332{col 26}{space 2} 2.722883{col 37}{space 1}   -0.93{col 46}{space 3}0.352{col 54}{space 4}-7.873064{col 67}{space 3} 2.802401
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-2.428614{col 26}{space 2} 2.719204{col 37}{space 1}   -0.89{col 46}{space 3}0.372{col 54}{space 4}-7.759136{col 67}{space 3} 2.901908
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-1.818484{col 26}{space 2} 2.809811{col 37}{space 1}   -0.65{col 46}{space 3}0.518{col 54}{space 4}-7.326625{col 67}{space 3} 3.689657
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-2.267803{col 26}{space 2}  2.73827{col 37}{space 1}   -0.83{col 46}{space 3}0.408{col 54}{space 4}-7.635699{col 67}{space 3} 3.100093
{txt}{space 9}SD  {c |}{col 14}{res}{space 2}-1.460521{col 26}{space 2} 2.808126{col 37}{space 1}   -0.52{col 46}{space 3}0.603{col 54}{space 4}-6.965359{col 67}{space 3} 4.044317
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-2.236337{col 26}{space 2} 2.730972{col 37}{space 1}   -0.82{col 46}{space 3}0.413{col 54}{space 4}-7.589928{col 67}{space 3} 3.117254
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-2.263685{col 26}{space 2} 2.721314{col 37}{space 1}   -0.83{col 46}{space 3}0.406{col 54}{space 4}-7.598342{col 67}{space 3} 3.070973
{txt}{space 9}UT  {c |}{col 14}{res}{space 2}-2.415108{col 26}{space 2} 2.735133{col 37}{space 1}   -0.88{col 46}{space 3}0.377{col 54}{space 4}-7.776855{col 67}{space 3} 2.946638
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}-2.346295{col 26}{space 2} 2.724868{col 37}{space 1}   -0.86{col 46}{space 3}0.389{col 54}{space 4}-7.687918{col 67}{space 3} 2.995329
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}-.9832094{col 26}{space 2}  2.78647{col 37}{space 1}   -0.35{col 46}{space 3}0.724{col 54}{space 4}-6.445593{col 67}{space 3} 4.479175
{txt}{space 9}WA  {c |}{col 14}{res}{space 2}-2.253295{col 26}{space 2}  2.72935{col 37}{space 1}   -0.83{col 46}{space 3}0.409{col 54}{space 4}-7.603706{col 67}{space 3} 3.097115
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-2.392859{col 26}{space 2} 2.724646{col 37}{space 1}   -0.88{col 46}{space 3}0.380{col 54}{space 4}-7.734048{col 67}{space 3} 2.948329
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-2.720627{col 26}{space 2} 2.742718{col 37}{space 1}   -0.99{col 46}{space 3}0.321{col 54}{space 4}-8.097242{col 67}{space 3} 2.655989
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-2.754497{col 26}{space 2} 2.736425{col 37}{space 1}   -1.01{col 46}{space 3}0.314{col 54}{space 4}-8.118776{col 67}{space 3} 2.609782
{txt}{space 12} {c |}
{space 7}2.Q33 {c |}{col 14}{res}{space 2}-.2236258{col 26}{space 2} .0698424{col 37}{space 1}   -3.20{col 46}{space 3}0.001{col 54}{space 4}-.3605395{col 67}{space 3} -.086712
{txt}{space 7}2.Q34 {c |}{col 14}{res}{space 2} .0584931{col 26}{space 2} .1414455{col 37}{space 1}    0.41{col 46}{space 3}0.679{col 54}{space 4}-.2187858{col 67}{space 3} .3357721
{txt}{space 7}Q35_1 {c |}{col 14}{res}{space 2}-.2543614{col 26}{space 2} .1857209{col 37}{space 1}   -1.37{col 46}{space 3}0.171{col 54}{space 4}-.6184346{col 67}{space 3} .1097117
{txt}{space 7}Q35_2 {c |}{col 14}{res}{space 2} .1004324{col 26}{space 2} .2029253{col 37}{space 1}    0.49{col 46}{space 3}0.621{col 54}{space 4}-.2973669{col 67}{space 3} .4982317
{txt}{space 7}Q35_3 {c |}{col 14}{res}{space 2}-.1619915{col 26}{space 2} .2321771{col 37}{space 1}   -0.70{col 46}{space 3}0.485{col 54}{space 4}-.6171339{col 67}{space 3}  .293151
{txt}{space 7}Q35_4 {c |}{col 14}{res}{space 2}-.3787415{col 26}{space 2} .2027928{col 37}{space 1}   -1.87{col 46}{space 3}0.062{col 54}{space 4} -.776281{col 67}{space 3} .0187981
{txt}{space 7}Q35_5 {c |}{col 14}{res}{space 2}-.5342451{col 26}{space 2} .3289582{col 37}{space 1}   -1.62{col 46}{space 3}0.104{col 54}{space 4} -1.17911{col 67}{space 3} .1106195
{txt}{space 7}Q35_6 {c |}{col 14}{res}{space 2} .1715699{col 26}{space 2} .2244063{col 37}{space 1}    0.76{col 46}{space 3}0.445{col 54}{space 4}-.2683391{col 67}{space 3} .6114789
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 4.354741{col 26}{space 2} 2.754591{col 37}{space 1}    1.58{col 46}{space 3}0.114{col 54}{space 4}-1.045149{col 67}{space 3} 9.754632
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est11{txt} stored)

Linear regression                                      Number of obs ={res}    5590
                                                       {txt}F( 75,  5514) ={res}    2.23
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0391
                                                       {txt}Root MSE      = {res} 2.3294

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     IncMean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2} .0964426{col 26}{space 2} .1902977{col 37}{space 1}    0.51{col 46}{space 3}0.612{col 54}{space 4}-.2766159{col 67}{space 3} .4695012
{txt}{space 8}Old  {c |}{col 14}{res}{space 2} .2105706{col 26}{space 2} .2556146{col 37}{space 1}    0.82{col 46}{space 3}0.410{col 54}{space 4}-.2905348{col 67}{space 3}  .711676
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2}  .035828{col 26}{space 2}   .12931{col 37}{space 1}    0.28{col 46}{space 3}0.782{col 54}{space 4}-.2176706{col 67}{space 3} .2893266
{txt}High Educ..  {c |}{col 14}{res}{space 2} -.213005{col 26}{space 2} .1228275{col 37}{space 1}   -1.73{col 46}{space 3}0.083{col 54}{space 4}-.4537954{col 67}{space 3} .0277855
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2}-.1989792{col 26}{space 2} .1054255{col 37}{space 1}   -1.89{col 46}{space 3}0.059{col 54}{space 4}-.4056547{col 67}{space 3} .0076962
{txt}High Income  {c |}{col 14}{res}{space 2}-.1109437{col 26}{space 2} .1075028{col 37}{space 1}   -1.03{col 46}{space 3}0.302{col 54}{space 4}-.3216917{col 67}{space 3} .0998043
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2}-.0210127{col 26}{space 2} .1752796{col 37}{space 1}   -0.12{col 46}{space 3}0.905{col 54}{space 4}-.3646299{col 67}{space 3} .3226045
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} .1945898{col 26}{space 2} .2649819{col 37}{space 1}    0.73{col 46}{space 3}0.463{col 54}{space 4}-.3248792{col 67}{space 3} .7140588
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2} .0045356{col 26}{space 2} .0946362{col 37}{space 1}    0.05{col 46}{space 3}0.962{col 54}{space 4}-.1809887{col 67}{space 3} .1900599
{txt}{space 7}2015  {c |}{col 14}{res}{space 2} .1739697{col 26}{space 2} .1009202{col 37}{space 1}    1.72{col 46}{space 3}0.085{col 54}{space 4}-.0238737{col 67}{space 3} .3718131
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0960008{col 26}{space 2} .0975078{col 37}{space 1}    0.98{col 46}{space 3}0.325{col 54}{space 4}-.0951529{col 67}{space 3} .2871545
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .3026201{col 26}{space 2} .1048329{col 37}{space 1}    2.89{col 46}{space 3}0.004{col 54}{space 4} .0971063{col 67}{space 3}  .508134
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .3704318{col 26}{space 2} .1461971{col 37}{space 1}    2.53{col 46}{space 3}0.011{col 54}{space 4} .0838278{col 67}{space 3} .6570357
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2}-4.876179{col 26}{space 2} 3.402471{col 37}{space 1}   -1.43{col 46}{space 3}0.152{col 54}{space 4}-11.54636{col 67}{space 3} 1.794006
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-4.763174{col 26}{space 2} 3.418422{col 37}{space 1}   -1.39{col 46}{space 3}0.164{col 54}{space 4}-11.46463{col 67}{space 3}  1.93828
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-5.148726{col 26}{space 2} 3.392274{col 37}{space 1}   -1.52{col 46}{space 3}0.129{col 54}{space 4}-11.79892{col 67}{space 3} 1.501468
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-5.096877{col 26}{space 2} 3.389751{col 37}{space 1}   -1.50{col 46}{space 3}0.133{col 54}{space 4}-11.74212{col 67}{space 3} 1.548371
{txt}{space 9}CO  {c |}{col 14}{res}{space 2}-5.322483{col 26}{space 2} 3.389151{col 37}{space 1}   -1.57{col 46}{space 3}0.116{col 54}{space 4}-11.96655{col 67}{space 3} 1.321589
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-5.286539{col 26}{space 2}  3.39016{col 37}{space 1}   -1.56{col 46}{space 3}0.119{col 54}{space 4}-11.93259{col 67}{space 3} 1.359512
{txt}{space 9}DC  {c |}{col 14}{res}{space 2}-5.215656{col 26}{space 2} 3.424509{col 37}{space 1}   -1.52{col 46}{space 3}0.128{col 54}{space 4}-11.92904{col 67}{space 3} 1.497731
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-5.079164{col 26}{space 2} 3.427108{col 37}{space 1}   -1.48{col 46}{space 3}0.138{col 54}{space 4}-11.79765{col 67}{space 3} 1.639318
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-4.985412{col 26}{space 2} 3.390548{col 37}{space 1}   -1.47{col 46}{space 3}0.142{col 54}{space 4}-11.63222{col 67}{space 3} 1.661399
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-5.062917{col 26}{space 2} 3.391865{col 37}{space 1}   -1.49{col 46}{space 3}0.136{col 54}{space 4}-11.71231{col 67}{space 3} 1.586476
{txt}{space 9}HI  {c |}{col 14}{res}{space 2}-5.022352{col 26}{space 2} 3.411926{col 37}{space 1}   -1.47{col 46}{space 3}0.141{col 54}{space 4}-11.71107{col 67}{space 3} 1.666369
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-5.278732{col 26}{space 2}  3.38982{col 37}{space 1}   -1.56{col 46}{space 3}0.119{col 54}{space 4}-11.92412{col 67}{space 3} 1.366652
{txt}{space 9}ID  {c |}{col 14}{res}{space 2}-4.329029{col 26}{space 2} 3.436379{col 37}{space 1}   -1.26{col 46}{space 3}0.208{col 54}{space 4}-11.06569{col 67}{space 3} 2.407629
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-5.131645{col 26}{space 2} 3.388557{col 37}{space 1}   -1.51{col 46}{space 3}0.130{col 54}{space 4}-11.77455{col 67}{space 3} 1.511261
{txt}{space 9}IN  {c |}{col 14}{res}{space 2}-5.005125{col 26}{space 2}  3.39575{col 37}{space 1}   -1.47{col 46}{space 3}0.141{col 54}{space 4}-11.66213{col 67}{space 3} 1.651884
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-5.213159{col 26}{space 2} 3.399108{col 37}{space 1}   -1.53{col 46}{space 3}0.125{col 54}{space 4}-11.87675{col 67}{space 3} 1.450432
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-5.083582{col 26}{space 2}  3.40162{col 37}{space 1}   -1.49{col 46}{space 3}0.135{col 54}{space 4} -11.7521{col 67}{space 3} 1.584934
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-5.468296{col 26}{space 2} 3.401683{col 37}{space 1}   -1.61{col 46}{space 3}0.108{col 54}{space 4}-12.13694{col 67}{space 3} 1.200345
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-4.851583{col 26}{space 2} 3.393539{col 37}{space 1}   -1.43{col 46}{space 3}0.153{col 54}{space 4}-11.50426{col 67}{space 3} 1.801091
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-5.263557{col 26}{space 2}  3.39369{col 37}{space 1}   -1.55{col 46}{space 3}0.121{col 54}{space 4}-11.91653{col 67}{space 3} 1.389415
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-5.170071{col 26}{space 2} 3.396155{col 37}{space 1}   -1.52{col 46}{space 3}0.128{col 54}{space 4}-11.82787{col 67}{space 3} 1.487733
{txt}{space 9}MI  {c |}{col 14}{res}{space 2}-5.398628{col 26}{space 2} 3.387856{col 37}{space 1}   -1.59{col 46}{space 3}0.111{col 54}{space 4}-12.04016{col 67}{space 3} 1.242906
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-5.262227{col 26}{space 2} 3.390816{col 37}{space 1}   -1.55{col 46}{space 3}0.121{col 54}{space 4}-11.90956{col 67}{space 3} 1.385109
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-5.077621{col 26}{space 2}  3.39363{col 37}{space 1}   -1.50{col 46}{space 3}0.135{col 54}{space 4}-11.73047{col 67}{space 3} 1.575232
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-5.535018{col 26}{space 2} 3.390342{col 37}{space 1}   -1.63{col 46}{space 3}0.103{col 54}{space 4}-12.18142{col 67}{space 3} 1.111388
{txt}{space 9}MT  {c |}{col 14}{res}{space 2} -4.42766{col 26}{space 2} 3.455952{col 37}{space 1}   -1.28{col 46}{space 3}0.200{col 54}{space 4}-11.20269{col 67}{space 3} 2.347367
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-5.096187{col 26}{space 2} 3.390778{col 37}{space 1}   -1.50{col 46}{space 3}0.133{col 54}{space 4}-11.74345{col 67}{space 3} 1.551075
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-5.076289{col 26}{space 2} 3.432077{col 37}{space 1}   -1.48{col 46}{space 3}0.139{col 54}{space 4}-11.80451{col 67}{space 3} 1.651935
{txt}{space 9}NE  {c |}{col 14}{res}{space 2}-5.326787{col 26}{space 2}  3.39874{col 37}{space 1}   -1.57{col 46}{space 3}0.117{col 54}{space 4}-11.98966{col 67}{space 3} 1.336084
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-5.084072{col 26}{space 2} 3.395795{col 37}{space 1}   -1.50{col 46}{space 3}0.134{col 54}{space 4}-11.74117{col 67}{space 3} 1.573026
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-5.203724{col 26}{space 2} 3.391081{col 37}{space 1}   -1.53{col 46}{space 3}0.125{col 54}{space 4}-11.85158{col 67}{space 3} 1.444132
{txt}{space 9}NM  {c |}{col 14}{res}{space 2} -5.65281{col 26}{space 2} 3.393387{col 37}{space 1}   -1.67{col 46}{space 3}0.096{col 54}{space 4}-12.30519{col 67}{space 3} .9995663
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}-4.700555{col 26}{space 2} 3.418471{col 37}{space 1}   -1.38{col 46}{space 3}0.169{col 54}{space 4}-11.40211{col 67}{space 3} 2.000997
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-5.077606{col 26}{space 2} 3.388141{col 37}{space 1}   -1.50{col 46}{space 3}0.134{col 54}{space 4} -11.7197{col 67}{space 3} 1.564486
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-4.892623{col 26}{space 2} 3.389703{col 37}{space 1}   -1.44{col 46}{space 3}0.149{col 54}{space 4}-11.53778{col 67}{space 3} 1.752532
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-5.384782{col 26}{space 2} 3.407157{col 37}{space 1}   -1.58{col 46}{space 3}0.114{col 54}{space 4}-12.06415{col 67}{space 3} 1.294589
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-5.220298{col 26}{space 2}  3.39278{col 37}{space 1}   -1.54{col 46}{space 3}0.124{col 54}{space 4}-11.87149{col 67}{space 3} 1.430889
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-5.083515{col 26}{space 2} 3.388194{col 37}{space 1}   -1.50{col 46}{space 3}0.134{col 54}{space 4}-11.72571{col 67}{space 3} 1.558681
{txt}{space 9}RI  {c |}{col 14}{res}{space 2} -4.34508{col 26}{space 2} 3.473837{col 37}{space 1}   -1.25{col 46}{space 3}0.211{col 54}{space 4}-11.15517{col 67}{space 3}  2.46501
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-4.749128{col 26}{space 2} 3.410903{col 37}{space 1}   -1.39{col 46}{space 3}0.164{col 54}{space 4}-11.43584{col 67}{space 3} 1.937586
{txt}{space 9}SD  {c |}{col 14}{res}{space 2}-4.384551{col 26}{space 2} 3.472467{col 37}{space 1}   -1.26{col 46}{space 3}0.207{col 54}{space 4}-11.19196{col 67}{space 3} 2.422854
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-5.214155{col 26}{space 2} 3.397156{col 37}{space 1}   -1.53{col 46}{space 3}0.125{col 54}{space 4}-11.87392{col 67}{space 3}  1.44561
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-5.096402{col 26}{space 2}  3.38863{col 37}{space 1}   -1.50{col 46}{space 3}0.133{col 54}{space 4}-11.73945{col 67}{space 3} 1.546648
{txt}{space 9}UT  {c |}{col 14}{res}{space 2}-5.287328{col 26}{space 2} 3.399625{col 37}{space 1}   -1.56{col 46}{space 3}0.120{col 54}{space 4}-11.95193{col 67}{space 3} 1.377277
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}-5.172732{col 26}{space 2} 3.392172{col 37}{space 1}   -1.52{col 46}{space 3}0.127{col 54}{space 4}-11.82273{col 67}{space 3} 1.477262
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}-3.512022{col 26}{space 2} 3.438166{col 37}{space 1}   -1.02{col 46}{space 3}0.307{col 54}{space 4}-10.25218{col 67}{space 3} 3.228138
{txt}{space 9}WA  {c |}{col 14}{res}{space 2}-5.206331{col 26}{space 2} 3.392907{col 37}{space 1}   -1.53{col 46}{space 3}0.125{col 54}{space 4}-11.85777{col 67}{space 3} 1.445104
{txt}{space 9}WI  {c |}{col 14}{res}{space 2} -5.20229{col 26}{space 2} 3.392224{col 37}{space 1}   -1.53{col 46}{space 3}0.125{col 54}{space 4}-11.85239{col 67}{space 3} 1.447808
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-5.597957{col 26}{space 2} 3.393552{col 37}{space 1}   -1.65{col 46}{space 3}0.099{col 54}{space 4}-12.25066{col 67}{space 3} 1.054744
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-5.417718{col 26}{space 2} 3.401597{col 37}{space 1}   -1.59{col 46}{space 3}0.111{col 54}{space 4}-12.08619{col 67}{space 3} 1.250754
{txt}{space 12} {c |}
{space 7}2.Q33 {c |}{col 14}{res}{space 2}-.1275371{col 26}{space 2} .0643116{col 37}{space 1}   -1.98{col 46}{space 3}0.047{col 54}{space 4}-.2536132{col 67}{space 3}-.0014609
{txt}{space 7}2.Q34 {c |}{col 14}{res}{space 2} .1207812{col 26}{space 2} .1227031{col 37}{space 1}    0.98{col 46}{space 3}0.325{col 54}{space 4}-.1197652{col 67}{space 3} .3613276
{txt}{space 7}Q35_1 {c |}{col 14}{res}{space 2}-.0165473{col 26}{space 2} .1757008{col 37}{space 1}   -0.09{col 46}{space 3}0.925{col 54}{space 4}-.3609901{col 67}{space 3} .3278956
{txt}{space 7}Q35_2 {c |}{col 14}{res}{space 2} .1883073{col 26}{space 2} .1924894{col 37}{space 1}    0.98{col 46}{space 3}0.328{col 54}{space 4}-.1890478{col 67}{space 3} .5656625
{txt}{space 7}Q35_3 {c |}{col 14}{res}{space 2} .0919017{col 26}{space 2} .2737963{col 37}{space 1}    0.34{col 46}{space 3}0.737{col 54}{space 4} -.444847{col 67}{space 3} .6286504
{txt}{space 7}Q35_4 {c |}{col 14}{res}{space 2}-.2008341{col 26}{space 2} .1822848{col 37}{space 1}   -1.10{col 46}{space 3}0.271{col 54}{space 4}-.5581842{col 67}{space 3}  .156516
{txt}{space 7}Q35_5 {c |}{col 14}{res}{space 2}-.6024636{col 26}{space 2} .2317448{col 37}{space 1}   -2.60{col 46}{space 3}0.009{col 54}{space 4}-1.056775{col 67}{space 3}-.1481523
{txt}{space 7}Q35_6 {c |}{col 14}{res}{space 2} .2324148{col 26}{space 2} .2029458{col 37}{space 1}    1.15{col 46}{space 3}0.252{col 54}{space 4} -.165439{col 67}{space 3} .6302686
{txt}{space 7}Q4new {c |}{col 14}{res}{space 2}-.0048308{col 26}{space 2} .0015134{col 37}{space 1}   -3.19{col 46}{space 3}0.001{col 54}{space 4}-.0077976{col 67}{space 3}-.0018639
{txt}{space 7}Q6new {c |}{col 14}{res}{space 2} .0007278{col 26}{space 2} .0015923{col 37}{space 1}    0.46{col 46}{space 3}0.648{col 54}{space 4}-.0023938{col 67}{space 3} .0038493
{txt}{space 5}Q9_mean {c |}{col 14}{res}{space 2} .0487112{col 26}{space 2} .0094956{col 37}{space 1}    5.13{col 46}{space 3}0.000{col 54}{space 4}  .030096{col 67}{space 3} .0673264
{txt}{space 6}Q13new {c |}{col 14}{res}{space 2}-.0099207{col 26}{space 2} .0015434{col 37}{space 1}   -6.43{col 46}{space 3}0.000{col 54}{space 4}-.0129463{col 67}{space 3}-.0068951
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 6.707433{col 26}{space 2} 3.415211{col 37}{space 1}    1.96{col 46}{space 3}0.050{col 54}{space 4} .0122725{col 67}{space 3} 13.40259
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est12{txt} stored)

Linear regression                                      Number of obs ={res}    6646
                                                       {txt}F( 63,  6582) ={res}    1.43
                                                       {txt}Prob > F      = {res} 0.0149
                                                       {txt}R-squared     = {res} 0.0128
                                                       {txt}Root MSE      = {res} .87023

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}      IncVar{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2} .0227378{col 26}{space 2} .0581942{col 37}{space 1}    0.39{col 46}{space 3}0.696{col 54}{space 4}-.0913417{col 67}{space 3} .1368172
{txt}{space 8}Old  {c |}{col 14}{res}{space 2} .0800341{col 26}{space 2} .0820333{col 37}{space 1}    0.98{col 46}{space 3}0.329{col 54}{space 4}-.0807779{col 67}{space 3}  .240846
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2} .0395157{col 26}{space 2} .0397322{col 37}{space 1}    0.99{col 46}{space 3}0.320{col 54}{space 4}-.0383722{col 67}{space 3} .1174037
{txt}High Educ..  {c |}{col 14}{res}{space 2}-.0229751{col 26}{space 2} .0382967{col 37}{space 1}   -0.60{col 46}{space 3}0.549{col 54}{space 4}-.0980492{col 67}{space 3} .0520989
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2}-.1038795{col 26}{space 2} .0344901{col 37}{space 1}   -3.01{col 46}{space 3}0.003{col 54}{space 4}-.1714912{col 67}{space 3}-.0362677
{txt}High Income  {c |}{col 14}{res}{space 2}-.0888737{col 26}{space 2}  .035384{col 37}{space 1}   -2.51{col 46}{space 3}0.012{col 54}{space 4}-.1582378{col 67}{space 3}-.0195095
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2}-.0304736{col 26}{space 2} .0594379{col 37}{space 1}   -0.51{col 46}{space 3}0.608{col 54}{space 4}-.1469912{col 67}{space 3}  .086044
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} .0086926{col 26}{space 2} .0844693{col 37}{space 1}    0.10{col 46}{space 3}0.918{col 54}{space 4}-.1568947{col 67}{space 3} .1742799
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2}-.0053292{col 26}{space 2} .0320536{col 37}{space 1}   -0.17{col 46}{space 3}0.868{col 54}{space 4}-.0681647{col 67}{space 3} .0575062
{txt}{space 7}2015  {c |}{col 14}{res}{space 2} .0090598{col 26}{space 2} .0332855{col 37}{space 1}    0.27{col 46}{space 3}0.785{col 54}{space 4}-.0561906{col 67}{space 3} .0743102
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0176114{col 26}{space 2} .0335562{col 37}{space 1}    0.52{col 46}{space 3}0.600{col 54}{space 4}-.0481697{col 67}{space 3} .0833925
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0688826{col 26}{space 2} .0362526{col 37}{space 1}    1.90{col 46}{space 3}0.057{col 54}{space 4}-.0021843{col 67}{space 3} .1399494
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1047353{col 26}{space 2} .0508359{col 37}{space 1}    2.06{col 46}{space 3}0.039{col 54}{space 4} .0050804{col 67}{space 3} .2043903
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2}-.9296184{col 26}{space 2} .8049661{col 37}{space 1}   -1.15{col 46}{space 3}0.248{col 54}{space 4}-2.507613{col 67}{space 3} .6483763
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-.7648405{col 26}{space 2} .8143441{col 37}{space 1}   -0.94{col 46}{space 3}0.348{col 54}{space 4}-2.361219{col 67}{space 3} .8315383
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-.9341759{col 26}{space 2} .8020832{col 37}{space 1}   -1.16{col 46}{space 3}0.244{col 54}{space 4}-2.506519{col 67}{space 3} .6381674
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-.8470737{col 26}{space 2} .8016398{col 37}{space 1}   -1.06{col 46}{space 3}0.291{col 54}{space 4}-2.418548{col 67}{space 3} .7244004
{txt}{space 9}CO  {c |}{col 14}{res}{space 2}-1.038173{col 26}{space 2} .8018361{col 37}{space 1}   -1.29{col 46}{space 3}0.195{col 54}{space 4}-2.610032{col 67}{space 3} .5336858
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-1.014193{col 26}{space 2} .8018827{col 37}{space 1}   -1.26{col 46}{space 3}0.206{col 54}{space 4}-2.586143{col 67}{space 3} .5577574
{txt}{space 9}DC  {c |}{col 14}{res}{space 2}-.9869716{col 26}{space 2} .8142981{col 37}{space 1}   -1.21{col 46}{space 3}0.226{col 54}{space 4} -2.58326{col 67}{space 3} .6093169
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-1.094476{col 26}{space 2} .8039655{col 37}{space 1}   -1.36{col 46}{space 3}0.173{col 54}{space 4}-2.670509{col 67}{space 3} .4815569
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-.8372635{col 26}{space 2} .8021082{col 37}{space 1}   -1.04{col 46}{space 3}0.297{col 54}{space 4}-2.409656{col 67}{space 3} .7351289
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-.8592351{col 26}{space 2} .8031794{col 37}{space 1}   -1.07{col 46}{space 3}0.285{col 54}{space 4}-2.433727{col 67}{space 3} .7152572
{txt}{space 9}HI  {c |}{col 14}{res}{space 2}-.9533282{col 26}{space 2} .8085315{col 37}{space 1}   -1.18{col 46}{space 3}0.238{col 54}{space 4}-2.538312{col 67}{space 3} .6316558
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-1.001752{col 26}{space 2} .8016314{col 37}{space 1}   -1.25{col 46}{space 3}0.211{col 54}{space 4} -2.57321{col 67}{space 3} .5697053
{txt}{space 9}ID  {c |}{col 14}{res}{space 2}-.7430069{col 26}{space 2} .8168904{col 37}{space 1}   -0.91{col 46}{space 3}0.363{col 54}{space 4}-2.344377{col 67}{space 3} .8583634
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-.9798829{col 26}{space 2} .8012166{col 37}{space 1}   -1.22{col 46}{space 3}0.221{col 54}{space 4}-2.550527{col 67}{space 3} .5907616
{txt}{space 9}IN  {c |}{col 14}{res}{space 2}-.8649696{col 26}{space 2}  .804749{col 37}{space 1}   -1.07{col 46}{space 3}0.282{col 54}{space 4}-2.442539{col 67}{space 3} .7125995
{txt}{space 9}KS  {c |}{col 14}{res}{space 2} -.796589{col 26}{space 2} .8110034{col 37}{space 1}   -0.98{col 46}{space 3}0.326{col 54}{space 4}-2.386419{col 67}{space 3} .7932407
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-.8646871{col 26}{space 2} .8078094{col 37}{space 1}   -1.07{col 46}{space 3}0.284{col 54}{space 4}-2.448256{col 67}{space 3} .7188815
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-1.003379{col 26}{space 2} .8051724{col 37}{space 1}   -1.25{col 46}{space 3}0.213{col 54}{space 4}-2.581778{col 67}{space 3} .5750207
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-.8549323{col 26}{space 2}  .803828{col 37}{space 1}   -1.06{col 46}{space 3}0.288{col 54}{space 4}-2.430696{col 67}{space 3} .7208313
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-.9107406{col 26}{space 2} .8043211{col 37}{space 1}   -1.13{col 46}{space 3}0.258{col 54}{space 4}-2.487471{col 67}{space 3} .6659897
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-.8738101{col 26}{space 2} .8057127{col 37}{space 1}   -1.08{col 46}{space 3}0.278{col 54}{space 4}-2.453268{col 67}{space 3} .7056483
{txt}{space 9}MI  {c |}{col 14}{res}{space 2}-.9956895{col 26}{space 2}  .801127{col 37}{space 1}   -1.24{col 46}{space 3}0.214{col 54}{space 4}-2.566158{col 67}{space 3} .5747793
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-.9949216{col 26}{space 2} .8024503{col 37}{space 1}   -1.24{col 46}{space 3}0.215{col 54}{space 4}-2.567985{col 67}{space 3} .5781415
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-.9399933{col 26}{space 2} .8030259{col 37}{space 1}   -1.17{col 46}{space 3}0.242{col 54}{space 4}-2.514185{col 67}{space 3}  .634198
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-.9748775{col 26}{space 2} .8094294{col 37}{space 1}   -1.20{col 46}{space 3}0.228{col 54}{space 4}-2.561622{col 67}{space 3} .6118667
{txt}{space 9}MT  {c |}{col 14}{res}{space 2}-.8883287{col 26}{space 2} .8089363{col 37}{space 1}   -1.10{col 46}{space 3}0.272{col 54}{space 4}-2.474106{col 67}{space 3} .6974489
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-.8729251{col 26}{space 2} .8028783{col 37}{space 1}   -1.09{col 46}{space 3}0.277{col 54}{space 4}-2.446827{col 67}{space 3} .7009768
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-.8891036{col 26}{space 2} .8198464{col 37}{space 1}   -1.08{col 46}{space 3}0.278{col 54}{space 4}-2.496268{col 67}{space 3} .7180613
{txt}{space 9}NE  {c |}{col 14}{res}{space 2}-.9692231{col 26}{space 2}  .807827{col 37}{space 1}   -1.20{col 46}{space 3}0.230{col 54}{space 4}-2.552826{col 67}{space 3}   .61438
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-.8446151{col 26}{space 2} .8097609{col 37}{space 1}   -1.04{col 46}{space 3}0.297{col 54}{space 4}-2.432009{col 67}{space 3}  .742779
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-.9658173{col 26}{space 2} .8024767{col 37}{space 1}   -1.20{col 46}{space 3}0.229{col 54}{space 4}-2.538932{col 67}{space 3} .6072974
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-1.069322{col 26}{space 2} .8027063{col 37}{space 1}   -1.33{col 46}{space 3}0.183{col 54}{space 4}-2.642887{col 67}{space 3} .5042425
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}-.8041427{col 26}{space 2}   .81412{col 37}{space 1}   -0.99{col 46}{space 3}0.323{col 54}{space 4}-2.400082{col 67}{space 3} .7917966
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-.8843747{col 26}{space 2} .8015655{col 37}{space 1}   -1.10{col 46}{space 3}0.270{col 54}{space 4}-2.455703{col 67}{space 3} .6869538
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-.8966775{col 26}{space 2} .8020444{col 37}{space 1}   -1.12{col 46}{space 3}0.264{col 54}{space 4}-2.468945{col 67}{space 3} .6755898
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-.8537376{col 26}{space 2} .8126095{col 37}{space 1}   -1.05{col 46}{space 3}0.293{col 54}{space 4}-2.446716{col 67}{space 3} .7392407
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-.9766255{col 26}{space 2} .8018576{col 37}{space 1}   -1.22{col 46}{space 3}0.223{col 54}{space 4}-2.548527{col 67}{space 3} .5952755
{txt}{space 9}PA  {c |}{col 14}{res}{space 2} -.914974{col 26}{space 2} .8014077{col 37}{space 1}   -1.14{col 46}{space 3}0.254{col 54}{space 4}-2.485993{col 67}{space 3} .6560452
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-.8299894{col 26}{space 2} .8346061{col 37}{space 1}   -0.99{col 46}{space 3}0.320{col 54}{space 4}-2.466088{col 67}{space 3} .8061093
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-.9019247{col 26}{space 2} .8064367{col 37}{space 1}   -1.12{col 46}{space 3}0.263{col 54}{space 4}-2.482802{col 67}{space 3} .6789529
{txt}{space 9}SD  {c |}{col 14}{res}{space 2} -.856873{col 26}{space 2} .8162482{col 37}{space 1}   -1.05{col 46}{space 3}0.294{col 54}{space 4}-2.456984{col 67}{space 3} .7432383
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-.8218023{col 26}{space 2} .8062468{col 37}{space 1}   -1.02{col 46}{space 3}0.308{col 54}{space 4}-2.402308{col 67}{space 3} .7587029
{txt}{space 9}TX  {c |}{col 14}{res}{space 2} -.880096{col 26}{space 2} .8018853{col 37}{space 1}   -1.10{col 46}{space 3}0.272{col 54}{space 4}-2.452051{col 67}{space 3} .6918594
{txt}{space 9}UT  {c |}{col 14}{res}{space 2}-.9322665{col 26}{space 2} .8051304{col 37}{space 1}   -1.16{col 46}{space 3}0.247{col 54}{space 4}-2.510583{col 67}{space 3} .6460504
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}-.8707259{col 26}{space 2} .8034177{col 37}{space 1}   -1.08{col 46}{space 3}0.279{col 54}{space 4}-2.445685{col 67}{space 3} .7042335
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}-.5219583{col 26}{space 2} .8300925{col 37}{space 1}   -0.63{col 46}{space 3}0.530{col 54}{space 4}-2.149209{col 67}{space 3} 1.105292
{txt}{space 9}WA  {c |}{col 14}{res}{space 2}-.8774304{col 26}{space 2} .8036936{col 37}{space 1}   -1.09{col 46}{space 3}0.275{col 54}{space 4}-2.452931{col 67}{space 3}   .69807
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-.9645961{col 26}{space 2} .8029942{col 37}{space 1}   -1.20{col 46}{space 3}0.230{col 54}{space 4}-2.538725{col 67}{space 3}  .609533
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-1.073219{col 26}{space 2} .8028058{col 37}{space 1}   -1.34{col 46}{space 3}0.181{col 54}{space 4}-2.646979{col 67}{space 3} .5005409
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-.9996428{col 26}{space 2} .8037878{col 37}{space 1}   -1.24{col 46}{space 3}0.214{col 54}{space 4}-2.575328{col 67}{space 3} .5760421
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.388059{col 26}{space 2}  .803558{col 37}{space 1}    1.73{col 46}{space 3}0.084{col 54}{space 4}-.1871754{col 67}{space 3} 2.963293
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est13{txt} stored)

Linear regression                                      Number of obs ={res}    6644
                                                       {txt}F( 71,  6572) ={res}    1.48
                                                       {txt}Prob > F      = {res} 0.0058
                                                       {txt}R-squared     = {res} 0.0153
                                                       {txt}Root MSE      = {res} .86979

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}      IncVar{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2} .0221813{col 26}{space 2} .0583312{col 37}{space 1}    0.38{col 46}{space 3}0.704{col 54}{space 4}-.0921668{col 67}{space 3} .1365294
{txt}{space 8}Old  {c |}{col 14}{res}{space 2} .0847137{col 26}{space 2} .0823428{col 37}{space 1}    1.03{col 46}{space 3}0.304{col 54}{space 4}-.0767049{col 67}{space 3} .2461323
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2} .0348827{col 26}{space 2} .0399417{col 37}{space 1}    0.87{col 46}{space 3}0.383{col 54}{space 4} -.043416{col 67}{space 3} .1131813
{txt}High Educ..  {c |}{col 14}{res}{space 2}-.0217507{col 26}{space 2} .0384523{col 37}{space 1}   -0.57{col 46}{space 3}0.572{col 54}{space 4}-.0971298{col 67}{space 3} .0536284
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2} -.097393{col 26}{space 2} .0344487{col 37}{space 1}   -2.83{col 46}{space 3}0.005{col 54}{space 4}-.1649237{col 67}{space 3}-.0298623
{txt}High Income  {c |}{col 14}{res}{space 2}-.0685168{col 26}{space 2}  .035812{col 37}{space 1}   -1.91{col 46}{space 3}0.056{col 54}{space 4}  -.13872{col 67}{space 3} .0016864
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2}-.0319705{col 26}{space 2} .0598772{col 37}{space 1}   -0.53{col 46}{space 3}0.593{col 54}{space 4}-.1493493{col 67}{space 3} .0854084
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} .0067941{col 26}{space 2} .0852417{col 37}{space 1}    0.08{col 46}{space 3}0.936{col 54}{space 4}-.1603074{col 67}{space 3} .1738956
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2}-.0054277{col 26}{space 2} .0318144{col 37}{space 1}   -0.17{col 46}{space 3}0.865{col 54}{space 4}-.0677942{col 67}{space 3} .0569389
{txt}{space 7}2015  {c |}{col 14}{res}{space 2} .0070793{col 26}{space 2} .0332151{col 37}{space 1}    0.21{col 46}{space 3}0.831{col 54}{space 4}-.0580331{col 67}{space 3} .0721917
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0130024{col 26}{space 2} .0336867{col 37}{space 1}    0.39{col 46}{space 3}0.700{col 54}{space 4}-.0530346{col 67}{space 3} .0790393
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0672944{col 26}{space 2} .0362309{col 37}{space 1}    1.86{col 46}{space 3}0.063{col 54}{space 4}-.0037299{col 67}{space 3} .1383187
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1031165{col 26}{space 2} .0507546{col 37}{space 1}    2.03{col 46}{space 3}0.042{col 54}{space 4}  .003621{col 67}{space 3} .2026119
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2}-.9272913{col 26}{space 2} .8060937{col 37}{space 1}   -1.15{col 46}{space 3}0.250{col 54}{space 4}-2.507497{col 67}{space 3} .6529144
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-.7553214{col 26}{space 2} .8154642{col 37}{space 1}   -0.93{col 46}{space 3}0.354{col 54}{space 4}-2.353896{col 67}{space 3} .8432535
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-.9238619{col 26}{space 2} .8032934{col 37}{space 1}   -1.15{col 46}{space 3}0.250{col 54}{space 4}-2.498578{col 67}{space 3} .6508543
{txt}{space 9}CA  {c |}{col 14}{res}{space 2} -.834625{col 26}{space 2} .8040463{col 37}{space 1}   -1.04{col 46}{space 3}0.299{col 54}{space 4}-2.410817{col 67}{space 3} .7415672
{txt}{space 9}CO  {c |}{col 14}{res}{space 2}-1.024619{col 26}{space 2} .8035684{col 37}{space 1}   -1.28{col 46}{space 3}0.202{col 54}{space 4}-2.599874{col 67}{space 3} .5506366
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-1.005786{col 26}{space 2} .8031819{col 37}{space 1}   -1.25{col 46}{space 3}0.211{col 54}{space 4}-2.580284{col 67}{space 3} .5687114
{txt}{space 9}DC  {c |}{col 14}{res}{space 2}-.9837021{col 26}{space 2} .8157889{col 37}{space 1}   -1.21{col 46}{space 3}0.228{col 54}{space 4}-2.582913{col 67}{space 3} .6155092
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-1.086389{col 26}{space 2} .8054899{col 37}{space 1}   -1.35{col 46}{space 3}0.177{col 54}{space 4}-2.665411{col 67}{space 3} .4926329
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-.8229589{col 26}{space 2} .8036598{col 37}{space 1}   -1.02{col 46}{space 3}0.306{col 54}{space 4}-2.398393{col 67}{space 3} .7524756
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-.8529467{col 26}{space 2} .8043528{col 37}{space 1}   -1.06{col 46}{space 3}0.289{col 54}{space 4} -2.42974{col 67}{space 3} .7238462
{txt}{space 9}HI  {c |}{col 14}{res}{space 2} -.836133{col 26}{space 2} .8143645{col 37}{space 1}   -1.03{col 46}{space 3}0.305{col 54}{space 4}-2.432552{col 67}{space 3} .7602862
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-.9767758{col 26}{space 2} .8029658{col 37}{space 1}   -1.22{col 46}{space 3}0.224{col 54}{space 4} -2.55085{col 67}{space 3}  .597298
{txt}{space 9}ID  {c |}{col 14}{res}{space 2}-.7176681{col 26}{space 2} .8184051{col 37}{space 1}   -0.88{col 46}{space 3}0.381{col 54}{space 4}-2.322008{col 67}{space 3} .8866719
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-.9650106{col 26}{space 2} .8029945{col 37}{space 1}   -1.20{col 46}{space 3}0.229{col 54}{space 4}-2.539141{col 67}{space 3} .6091196
{txt}{space 9}IN  {c |}{col 14}{res}{space 2}-.8452622{col 26}{space 2} .8058582{col 37}{space 1}   -1.05{col 46}{space 3}0.294{col 54}{space 4}-2.425006{col 67}{space 3} .7344817
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-.7762232{col 26}{space 2} .8124537{col 37}{space 1}   -0.96{col 46}{space 3}0.339{col 54}{space 4}-2.368897{col 67}{space 3} .8164501
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-.8482967{col 26}{space 2} .8089623{col 37}{space 1}   -1.05{col 46}{space 3}0.294{col 54}{space 4}-2.434126{col 67}{space 3} .7375323
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-1.000732{col 26}{space 2} .8064787{col 37}{space 1}   -1.24{col 46}{space 3}0.215{col 54}{space 4}-2.581693{col 67}{space 3} .5802281
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-.8424281{col 26}{space 2} .8054165{col 37}{space 1}   -1.05{col 46}{space 3}0.296{col 54}{space 4}-2.421306{col 67}{space 3} .7364499
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-.9049135{col 26}{space 2} .8058184{col 37}{space 1}   -1.12{col 46}{space 3}0.261{col 54}{space 4}-2.484579{col 67}{space 3} .6747524
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-.8575036{col 26}{space 2} .8075465{col 37}{space 1}   -1.06{col 46}{space 3}0.288{col 54}{space 4}-2.440557{col 67}{space 3}   .72555
{txt}{space 9}MI  {c |}{col 14}{res}{space 2}-.9752487{col 26}{space 2} .8023811{col 37}{space 1}   -1.22{col 46}{space 3}0.224{col 54}{space 4}-2.548176{col 67}{space 3}  .597679
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-.9736161{col 26}{space 2} .8041184{col 37}{space 1}   -1.21{col 46}{space 3}0.226{col 54}{space 4} -2.54995{col 67}{space 3} .6027173
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-.9216591{col 26}{space 2} .8044424{col 37}{space 1}   -1.15{col 46}{space 3}0.252{col 54}{space 4}-2.498628{col 67}{space 3} .6553095
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-.9755694{col 26}{space 2}  .810688{col 37}{space 1}   -1.20{col 46}{space 3}0.229{col 54}{space 4}-2.564781{col 67}{space 3} .6136426
{txt}{space 9}MT  {c |}{col 14}{res}{space 2} -.869029{col 26}{space 2} .8098185{col 37}{space 1}   -1.07{col 46}{space 3}0.283{col 54}{space 4}-2.456536{col 67}{space 3} .7184786
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-.8565739{col 26}{space 2} .8041111{col 37}{space 1}   -1.07{col 46}{space 3}0.287{col 54}{space 4}-2.432893{col 67}{space 3} .7197452
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-.8673318{col 26}{space 2} .8215208{col 37}{space 1}   -1.06{col 46}{space 3}0.291{col 54}{space 4} -2.47778{col 67}{space 3} .7431159
{txt}{space 9}NE  {c |}{col 14}{res}{space 2}-.9498646{col 26}{space 2} .8090018{col 37}{space 1}   -1.17{col 46}{space 3}0.240{col 54}{space 4}-2.535771{col 67}{space 3} .6360418
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-.8268085{col 26}{space 2} .8109588{col 37}{space 1}   -1.02{col 46}{space 3}0.308{col 54}{space 4}-2.416551{col 67}{space 3} .7629344
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-.9497616{col 26}{space 2} .8041886{col 37}{space 1}   -1.18{col 46}{space 3}0.238{col 54}{space 4}-2.526233{col 67}{space 3} .6267094
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-1.067163{col 26}{space 2} .8041676{col 37}{space 1}   -1.33{col 46}{space 3}0.185{col 54}{space 4}-2.643592{col 67}{space 3} .5092673
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}-.7856938{col 26}{space 2} .8158165{col 37}{space 1}   -0.96{col 46}{space 3}0.336{col 54}{space 4}-2.384959{col 67}{space 3} .8135717
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-.8675208{col 26}{space 2} .8034159{col 37}{space 1}   -1.08{col 46}{space 3}0.280{col 54}{space 4}-2.442477{col 67}{space 3} .7074354
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-.8739854{col 26}{space 2} .8034256{col 37}{space 1}   -1.09{col 46}{space 3}0.277{col 54}{space 4}-2.448961{col 67}{space 3} .7009899
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-.8409845{col 26}{space 2}  .813905{col 37}{space 1}   -1.03{col 46}{space 3}0.302{col 54}{space 4}-2.436503{col 67}{space 3} .7545339
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-.9622328{col 26}{space 2} .8032976{col 37}{space 1}   -1.20{col 46}{space 3}0.231{col 54}{space 4}-2.536957{col 67}{space 3} .6124917
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-.8994832{col 26}{space 2} .8027769{col 37}{space 1}   -1.12{col 46}{space 3}0.263{col 54}{space 4}-2.473187{col 67}{space 3} .6742204
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-.8107702{col 26}{space 2} .8359084{col 37}{space 1}   -0.97{col 46}{space 3}0.332{col 54}{space 4}-2.449422{col 67}{space 3} .8278819
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-.8938454{col 26}{space 2} .8079246{col 37}{space 1}   -1.11{col 46}{space 3}0.269{col 54}{space 4} -2.47764{col 67}{space 3} .6899493
{txt}{space 9}SD  {c |}{col 14}{res}{space 2}-.8340912{col 26}{space 2} .8175199{col 37}{space 1}   -1.02{col 46}{space 3}0.308{col 54}{space 4}-2.436696{col 67}{space 3} .7685136
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-.8048162{col 26}{space 2} .8073087{col 37}{space 1}   -1.00{col 46}{space 3}0.319{col 54}{space 4}-2.387404{col 67}{space 3} .7777712
{txt}{space 9}TX  {c |}{col 14}{res}{space 2} -.867522{col 26}{space 2} .8035077{col 37}{space 1}   -1.08{col 46}{space 3}0.280{col 54}{space 4}-2.442658{col 67}{space 3} .7076143
{txt}{space 9}UT  {c |}{col 14}{res}{space 2}-.8967658{col 26}{space 2} .8065965{col 37}{space 1}   -1.11{col 46}{space 3}0.266{col 54}{space 4}-2.477957{col 67}{space 3} .6844255
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}-.8544712{col 26}{space 2} .8052062{col 37}{space 1}   -1.06{col 46}{space 3}0.289{col 54}{space 4}-2.432937{col 67}{space 3} .7239947
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}-.4975183{col 26}{space 2} .8314714{col 37}{space 1}   -0.60{col 46}{space 3}0.550{col 54}{space 4}-2.127472{col 67}{space 3} 1.132436
{txt}{space 9}WA  {c |}{col 14}{res}{space 2} -.858933{col 26}{space 2} .8057759{col 37}{space 1}   -1.07{col 46}{space 3}0.286{col 54}{space 4}-2.438516{col 67}{space 3} .7206497
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-.9447126{col 26}{space 2} .8041976{col 37}{space 1}   -1.17{col 46}{space 3}0.240{col 54}{space 4}-2.521201{col 67}{space 3} .6317762
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-1.042326{col 26}{space 2} .8039416{col 37}{space 1}   -1.30{col 46}{space 3}0.195{col 54}{space 4}-2.618313{col 67}{space 3} .5336604
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-.9721656{col 26}{space 2} .8048045{col 37}{space 1}   -1.21{col 46}{space 3}0.227{col 54}{space 4}-2.549844{col 67}{space 3} .6055127
{txt}{space 12} {c |}
{space 7}2.Q33 {c |}{col 14}{res}{space 2}-.0638175{col 26}{space 2} .0219095{col 37}{space 1}   -2.91{col 46}{space 3}0.004{col 54}{space 4}-.1067673{col 67}{space 3}-.0208678
{txt}{space 7}2.Q34 {c |}{col 14}{res}{space 2} .0185311{col 26}{space 2} .0441588{col 37}{space 1}    0.42{col 46}{space 3}0.675{col 54}{space 4}-.0680344{col 67}{space 3} .1050967
{txt}{space 7}Q35_1 {c |}{col 14}{res}{space 2}-.1070458{col 26}{space 2} .0547729{col 37}{space 1}   -1.95{col 46}{space 3}0.051{col 54}{space 4}-.2144185{col 67}{space 3} .0003269
{txt}{space 7}Q35_2 {c |}{col 14}{res}{space 2}-.0537776{col 26}{space 2} .0595551{col 37}{space 1}   -0.90{col 46}{space 3}0.367{col 54}{space 4} -.170525{col 67}{space 3} .0629698
{txt}{space 7}Q35_3 {c |}{col 14}{res}{space 2}-.0265938{col 26}{space 2} .0797092{col 37}{space 1}   -0.33{col 46}{space 3}0.739{col 54}{space 4}-.1828497{col 67}{space 3} .1296622
{txt}{space 7}Q35_4 {c |}{col 14}{res}{space 2}-.1533492{col 26}{space 2} .0615589{col 37}{space 1}   -2.49{col 46}{space 3}0.013{col 54}{space 4}-.2740245{col 67}{space 3}-.0326738
{txt}{space 7}Q35_5 {c |}{col 14}{res}{space 2}-.1367024{col 26}{space 2} .0912721{col 37}{space 1}   -1.50{col 46}{space 3}0.134{col 54}{space 4}-.3156255{col 67}{space 3} .0422206
{txt}{space 7}Q35_6 {c |}{col 14}{res}{space 2} .0012002{col 26}{space 2} .0667817{col 37}{space 1}    0.02{col 46}{space 3}0.986{col 54}{space 4}-.1297136{col 67}{space 3} .1321139
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1.48207{col 26}{space 2} .8093101{col 37}{space 1}    1.83{col 46}{space 3}0.067{col 54}{space 4}-.1044407{col 67}{space 3} 3.068581
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est14{txt} stored)

Linear regression                                      Number of obs ={res}    5560
                                                       {txt}F( 75,  5484) ={res}    1.80
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0254
                                                       {txt}Root MSE      = {res}  .7306

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}      IncVar{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2} .0277416{col 26}{space 2} .0568717{col 37}{space 1}    0.49{col 46}{space 3}0.626{col 54}{space 4}-.0837496{col 67}{space 3} .1392327
{txt}{space 8}Old  {c |}{col 14}{res}{space 2} .0643824{col 26}{space 2} .0769285{col 37}{space 1}    0.84{col 46}{space 3}0.403{col 54}{space 4} -.086428{col 67}{space 3} .2151928
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2} .0273846{col 26}{space 2} .0395551{col 37}{space 1}    0.69{col 46}{space 3}0.489{col 54}{space 4}-.0501591{col 67}{space 3} .1049284
{txt}High Educ..  {c |}{col 14}{res}{space 2}-.0251835{col 26}{space 2} .0369209{col 37}{space 1}   -0.68{col 46}{space 3}0.495{col 54}{space 4} -.097563{col 67}{space 3} .0471961
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2}-.0872241{col 26}{space 2} .0323475{col 37}{space 1}   -2.70{col 46}{space 3}0.007{col 54}{space 4} -.150638{col 67}{space 3}-.0238101
{txt}High Income  {c |}{col 14}{res}{space 2}-.0692325{col 26}{space 2} .0328754{col 37}{space 1}   -2.11{col 46}{space 3}0.035{col 54}{space 4}-.1336814{col 67}{space 3}-.0047836
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2}-.0071396{col 26}{space 2} .0533425{col 37}{space 1}   -0.13{col 46}{space 3}0.894{col 54}{space 4}-.1117121{col 67}{space 3} .0974328
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} .0365749{col 26}{space 2}  .079792{col 37}{space 1}    0.46{col 46}{space 3}0.647{col 54}{space 4} -.119849{col 67}{space 3} .1929988
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2}  -.00622{col 26}{space 2} .0298405{col 37}{space 1}   -0.21{col 46}{space 3}0.835{col 54}{space 4}-.0647193{col 67}{space 3} .0522792
{txt}{space 7}2015  {c |}{col 14}{res}{space 2} .0228632{col 26}{space 2} .0319173{col 37}{space 1}    0.72{col 46}{space 3}0.474{col 54}{space 4}-.0397073{col 67}{space 3} .0854337
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0157217{col 26}{space 2} .0306523{col 37}{space 1}    0.51{col 46}{space 3}0.608{col 54}{space 4} -.044369{col 67}{space 3} .0758125
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0407362{col 26}{space 2} .0329632{col 37}{space 1}    1.24{col 46}{space 3}0.217{col 54}{space 4}-.0238847{col 67}{space 3}  .105357
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0750711{col 26}{space 2} .0443236{col 37}{space 1}    1.69{col 46}{space 3}0.090{col 54}{space 4}-.0118207{col 67}{space 3}  .161963
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2}-1.540263{col 26}{space 2} .9719515{col 37}{space 1}   -1.58{col 46}{space 3}0.113{col 54}{space 4}-3.445674{col 67}{space 3} .3651471
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-1.445708{col 26}{space 2} .9777881{col 37}{space 1}   -1.48{col 46}{space 3}0.139{col 54}{space 4} -3.36256{col 67}{space 3} .4711444
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2} -1.59595{col 26}{space 2} .9687432{col 37}{space 1}   -1.65{col 46}{space 3}0.100{col 54}{space 4}-3.495071{col 67}{space 3} .3031706
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-1.559732{col 26}{space 2} .9691374{col 37}{space 1}   -1.61{col 46}{space 3}0.108{col 54}{space 4}-3.459626{col 67}{space 3} .3401615
{txt}{space 9}CO  {c |}{col 14}{res}{space 2}-1.683059{col 26}{space 2}  .967916{col 37}{space 1}   -1.74{col 46}{space 3}0.082{col 54}{space 4}-3.580558{col 67}{space 3} .2144403
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-1.631951{col 26}{space 2} .9686283{col 37}{space 1}   -1.68{col 46}{space 3}0.092{col 54}{space 4}-3.530846{col 67}{space 3} .2669452
{txt}{space 9}DC  {c |}{col 14}{res}{space 2}-1.607851{col 26}{space 2} .9805575{col 37}{space 1}   -1.64{col 46}{space 3}0.101{col 54}{space 4}-3.530133{col 67}{space 3} .3144302
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-1.704018{col 26}{space 2} .9717292{col 37}{space 1}   -1.75{col 46}{space 3}0.080{col 54}{space 4}-3.608993{col 67}{space 3} .2009568
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-1.504276{col 26}{space 2} .9688773{col 37}{space 1}   -1.55{col 46}{space 3}0.121{col 54}{space 4} -3.40366{col 67}{space 3} .3951079
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-1.525278{col 26}{space 2} .9694319{col 37}{space 1}   -1.57{col 46}{space 3}0.116{col 54}{space 4} -3.42575{col 67}{space 3} .3751927
{txt}{space 9}HI  {c |}{col 14}{res}{space 2}-1.571737{col 26}{space 2} .9734159{col 37}{space 1}   -1.61{col 46}{space 3}0.106{col 54}{space 4}-3.480018{col 67}{space 3}  .336544
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-1.635071{col 26}{space 2} .9687341{col 37}{space 1}   -1.69{col 46}{space 3}0.091{col 54}{space 4}-3.534174{col 67}{space 3} .2640321
{txt}{space 9}ID  {c |}{col 14}{res}{space 2} -1.27617{col 26}{space 2} .9889749{col 37}{space 1}   -1.29{col 46}{space 3}0.197{col 54}{space 4}-3.214954{col 67}{space 3} .6626128
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-1.592494{col 26}{space 2} .9683724{col 37}{space 1}   -1.64{col 46}{space 3}0.100{col 54}{space 4}-3.490889{col 67}{space 3} .3058996
{txt}{space 9}IN  {c |}{col 14}{res}{space 2}-1.549132{col 26}{space 2} .9700551{col 37}{space 1}   -1.60{col 46}{space 3}0.110{col 54}{space 4}-3.450825{col 67}{space 3} .3525604
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-1.567059{col 26}{space 2} .9728899{col 37}{space 1}   -1.61{col 46}{space 3}0.107{col 54}{space 4}-3.474309{col 67}{space 3}  .340191
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-1.461467{col 26}{space 2} .9756156{col 37}{space 1}   -1.50{col 46}{space 3}0.134{col 54}{space 4}-3.374061{col 67}{space 3} .4511263
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-1.566971{col 26}{space 2} .9730514{col 37}{space 1}   -1.61{col 46}{space 3}0.107{col 54}{space 4}-3.474538{col 67}{space 3} .3405955
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-1.498485{col 26}{space 2} .9705744{col 37}{space 1}   -1.54{col 46}{space 3}0.123{col 54}{space 4}-3.401196{col 67}{space 3} .4042256
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-1.572127{col 26}{space 2} .9701504{col 37}{space 1}   -1.62{col 46}{space 3}0.105{col 54}{space 4}-3.474007{col 67}{space 3} .3297526
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-1.464269{col 26}{space 2} .9737935{col 37}{space 1}   -1.50{col 46}{space 3}0.133{col 54}{space 4}-3.373291{col 67}{space 3} .4447523
{txt}{space 9}MI  {c |}{col 14}{res}{space 2}-1.633331{col 26}{space 2} .9680794{col 37}{space 1}   -1.69{col 46}{space 3}0.092{col 54}{space 4}-3.531151{col 67}{space 3} .2644887
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-1.606979{col 26}{space 2} .9693767{col 37}{space 1}   -1.66{col 46}{space 3}0.097{col 54}{space 4}-3.507342{col 67}{space 3} .2933833
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-1.573934{col 26}{space 2} .9692732{col 37}{space 1}   -1.62{col 46}{space 3}0.104{col 54}{space 4}-3.474094{col 67}{space 3}  .326226
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-1.688684{col 26}{space 2} .9687744{col 37}{space 1}   -1.74{col 46}{space 3}0.081{col 54}{space 4}-3.587866{col 67}{space 3}  .210498
{txt}{space 9}MT  {c |}{col 14}{res}{space 2}-1.440168{col 26}{space 2} .9771769{col 37}{space 1}   -1.47{col 46}{space 3}0.141{col 54}{space 4}-3.355822{col 67}{space 3} .4754865
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-1.538278{col 26}{space 2} .9692939{col 37}{space 1}   -1.59{col 46}{space 3}0.113{col 54}{space 4}-3.438479{col 67}{space 3} .3619224
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-1.482746{col 26}{space 2} .9865138{col 37}{space 1}   -1.50{col 46}{space 3}0.133{col 54}{space 4}-3.416705{col 67}{space 3} .4512119
{txt}{space 9}NE  {c |}{col 14}{res}{space 2}-1.582936{col 26}{space 2} .9752863{col 37}{space 1}   -1.62{col 46}{space 3}0.105{col 54}{space 4}-3.494884{col 67}{space 3} .3290121
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-1.549393{col 26}{space 2} .9698093{col 37}{space 1}   -1.60{col 46}{space 3}0.110{col 54}{space 4}-3.450604{col 67}{space 3}  .351818
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2} -1.56943{col 26}{space 2} .9699455{col 37}{space 1}   -1.62{col 46}{space 3}0.106{col 54}{space 4}-3.470908{col 67}{space 3} .3320484
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-1.670523{col 26}{space 2} .9690163{col 37}{space 1}   -1.72{col 46}{space 3}0.085{col 54}{space 4}-3.570179{col 67}{space 3} .2291335
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}-1.514011{col 26}{space 2} .9773302{col 37}{space 1}   -1.55{col 46}{space 3}0.121{col 54}{space 4}-3.429966{col 67}{space 3} .4019435
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-1.578601{col 26}{space 2} .9682974{col 37}{space 1}   -1.63{col 46}{space 3}0.103{col 54}{space 4}-3.476848{col 67}{space 3} .3196461
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-1.506623{col 26}{space 2} .9690419{col 37}{space 1}   -1.55{col 46}{space 3}0.120{col 54}{space 4} -3.40633{col 67}{space 3} .3930831
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-1.619663{col 26}{space 2} .9745777{col 37}{space 1}   -1.66{col 46}{space 3}0.097{col 54}{space 4}-3.530222{col 67}{space 3} .2908955
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-1.608898{col 26}{space 2}  .969068{col 37}{space 1}   -1.66{col 46}{space 3}0.097{col 54}{space 4}-3.508656{col 67}{space 3} .2908594
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-1.546314{col 26}{space 2} .9682738{col 37}{space 1}   -1.60{col 46}{space 3}0.110{col 54}{space 4}-3.444514{col 67}{space 3} .3518871
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-1.434468{col 26}{space 2} 1.000775{col 37}{space 1}   -1.43{col 46}{space 3}0.152{col 54}{space 4}-3.396385{col 67}{space 3} .5274479
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-1.509536{col 26}{space 2} .9742155{col 37}{space 1}   -1.55{col 46}{space 3}0.121{col 54}{space 4}-3.419385{col 67}{space 3} .4003126
{txt}{space 9}SD  {c |}{col 14}{res}{space 2}-1.442841{col 26}{space 2} .9906219{col 37}{space 1}   -1.46{col 46}{space 3}0.145{col 54}{space 4}-3.384853{col 67}{space 3} .4991705
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-1.533527{col 26}{space 2} .9719954{col 37}{space 1}   -1.58{col 46}{space 3}0.115{col 54}{space 4}-3.439024{col 67}{space 3} .3719694
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-1.564254{col 26}{space 2} .9684147{col 37}{space 1}   -1.62{col 46}{space 3}0.106{col 54}{space 4}-3.462731{col 67}{space 3} .3342229
{txt}{space 9}UT  {c |}{col 14}{res}{space 2}-1.558534{col 26}{space 2}  .971929{col 37}{space 1}   -1.60{col 46}{space 3}0.109{col 54}{space 4}  -3.4639{col 67}{space 3} .3468324
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}-1.547978{col 26}{space 2} .9701723{col 37}{space 1}   -1.60{col 46}{space 3}0.111{col 54}{space 4}-3.449901{col 67}{space 3} .3539444
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}-1.114524{col 26}{space 2}  .993456{col 37}{space 1}   -1.12{col 46}{space 3}0.262{col 54}{space 4}-3.062092{col 67}{space 3} .8330441
{txt}{space 9}WA  {c |}{col 14}{res}{space 2}-1.594366{col 26}{space 2} .9696881{col 37}{space 1}   -1.64{col 46}{space 3}0.100{col 54}{space 4}-3.495339{col 67}{space 3} .3066073
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-1.646604{col 26}{space 2} .9689913{col 37}{space 1}   -1.70{col 46}{space 3}0.089{col 54}{space 4}-3.546212{col 67}{space 3} .2530032
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-1.748534{col 26}{space 2} .9690678{col 37}{space 1}   -1.80{col 46}{space 3}0.071{col 54}{space 4}-3.648291{col 67}{space 3} .1512231
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-1.612776{col 26}{space 2} .9706804{col 37}{space 1}   -1.66{col 46}{space 3}0.097{col 54}{space 4}-3.515695{col 67}{space 3} .2901425
{txt}{space 12} {c |}
{space 7}2.Q33 {c |}{col 14}{res}{space 2}-.0357971{col 26}{space 2} .0199014{col 37}{space 1}   -1.80{col 46}{space 3}0.072{col 54}{space 4}-.0748117{col 67}{space 3} .0032175
{txt}{space 7}2.Q34 {c |}{col 14}{res}{space 2} .0505256{col 26}{space 2} .0361537{col 37}{space 1}    1.40{col 46}{space 3}0.162{col 54}{space 4}  -.02035{col 67}{space 3} .1214011
{txt}{space 7}Q35_1 {c |}{col 14}{res}{space 2} -.032574{col 26}{space 2} .0490731{col 37}{space 1}   -0.66{col 46}{space 3}0.507{col 54}{space 4}-.1287767{col 67}{space 3} .0636288
{txt}{space 7}Q35_2 {c |}{col 14}{res}{space 2}-.0265871{col 26}{space 2} .0535724{col 37}{space 1}   -0.50{col 46}{space 3}0.620{col 54}{space 4}-.1316102{col 67}{space 3}  .078436
{txt}{space 7}Q35_3 {c |}{col 14}{res}{space 2} .0684094{col 26}{space 2} .0946384{col 37}{space 1}    0.72{col 46}{space 3}0.470{col 54}{space 4}-.1171193{col 67}{space 3} .2539382
{txt}{space 7}Q35_4 {c |}{col 14}{res}{space 2}-.1026023{col 26}{space 2} .0527638{col 37}{space 1}   -1.94{col 46}{space 3}0.052{col 54}{space 4}-.2060403{col 67}{space 3} .0008357
{txt}{space 7}Q35_5 {c |}{col 14}{res}{space 2}-.1903277{col 26}{space 2} .0639624{col 37}{space 1}   -2.98{col 46}{space 3}0.003{col 54}{space 4}-.3157194{col 67}{space 3} -.064936
{txt}{space 7}Q35_6 {c |}{col 14}{res}{space 2} .0286056{col 26}{space 2} .0563716{col 37}{space 1}    0.51{col 46}{space 3}0.612{col 54}{space 4}-.0819051{col 67}{space 3} .1391162
{txt}{space 7}Q4new {c |}{col 14}{res}{space 2}-.0010327{col 26}{space 2} .0004702{col 37}{space 1}   -2.20{col 46}{space 3}0.028{col 54}{space 4}-.0019545{col 67}{space 3}-.0001109
{txt}{space 7}Q6new {c |}{col 14}{res}{space 2}-.0003407{col 26}{space 2} .0004932{col 37}{space 1}   -0.69{col 46}{space 3}0.490{col 54}{space 4}-.0013076{col 67}{space 3} .0006262
{txt}{space 5}Q9_mean {c |}{col 14}{res}{space 2} .0104727{col 26}{space 2} .0029201{col 37}{space 1}    3.59{col 46}{space 3}0.000{col 54}{space 4} .0047482{col 67}{space 3} .0161973
{txt}{space 6}Q13new {c |}{col 14}{res}{space 2}-.0018773{col 26}{space 2} .0004652{col 37}{space 1}   -4.04{col 46}{space 3}0.000{col 54}{space 4}-.0027893{col 67}{space 3}-.0009654
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.033778{col 26}{space 2} .9710709{col 37}{space 1}    2.09{col 46}{space 3}0.036{col 54}{space 4} .1300937{col 67}{space 3} 3.937462
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est15{txt} stored)

Linear regression                                      Number of obs ={res}    6571
                                                       {txt}F( 63,  6507) ={res}    3.55
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0323
                                                       {txt}Root MSE      = {res} .33706

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     IncSkew{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2} .0021467{col 26}{space 2} .0217644{col 37}{space 1}    0.10{col 46}{space 3}0.921{col 54}{space 4}-.0405186{col 67}{space 3} .0448121
{txt}{space 8}Old  {c |}{col 14}{res}{space 2} -.010014{col 26}{space 2} .0305138{col 37}{space 1}   -0.33{col 46}{space 3}0.743{col 54}{space 4}-.0698311{col 67}{space 3}  .049803
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2} .0114872{col 26}{space 2}  .015904{col 37}{space 1}    0.72{col 46}{space 3}0.470{col 54}{space 4}-.0196897{col 67}{space 3} .0426642
{txt}High Educ..  {c |}{col 14}{res}{space 2} .0676993{col 26}{space 2} .0156926{col 37}{space 1}    4.31{col 46}{space 3}0.000{col 54}{space 4} .0369367{col 67}{space 3}  .098462
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2} .0600649{col 26}{space 2} .0123758{col 37}{space 1}    4.85{col 46}{space 3}0.000{col 54}{space 4} .0358043{col 67}{space 3} .0843255
{txt}High Income  {c |}{col 14}{res}{space 2}  .078109{col 26}{space 2} .0116826{col 37}{space 1}    6.69{col 46}{space 3}0.000{col 54}{space 4} .0552073{col 67}{space 3} .1010108
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2}-.0134377{col 26}{space 2} .0216226{col 37}{space 1}   -0.62{col 46}{space 3}0.534{col 54}{space 4} -.055825{col 67}{space 3} .0289496
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2}  .037427{col 26}{space 2} .0312292{col 37}{space 1}    1.20{col 46}{space 3}0.231{col 54}{space 4}-.0237924{col 67}{space 3} .0986464
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2}-.0017515{col 26}{space 2} .0133731{col 37}{space 1}   -0.13{col 46}{space 3}0.896{col 54}{space 4}-.0279673{col 67}{space 3} .0244642
{txt}{space 7}2015  {c |}{col 14}{res}{space 2} .0023355{col 26}{space 2} .0132953{col 37}{space 1}    0.18{col 46}{space 3}0.861{col 54}{space 4}-.0237276{col 67}{space 3} .0283987
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0160462{col 26}{space 2}  .013321{col 37}{space 1}   -1.20{col 46}{space 3}0.228{col 54}{space 4}-.0421597{col 67}{space 3} .0100674
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0000925{col 26}{space 2} .0138148{col 37}{space 1}    0.01{col 46}{space 3}0.995{col 54}{space 4}-.0269889{col 67}{space 3}  .027174
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} -.005422{col 26}{space 2} .0176416{col 37}{space 1}   -0.31{col 46}{space 3}0.759{col 54}{space 4}-.0400053{col 67}{space 3} .0291612
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2}-.0280383{col 26}{space 2} .1370899{col 37}{space 1}   -0.20{col 46}{space 3}0.838{col 54}{space 4}-.2967795{col 67}{space 3} .2407029
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-.0306154{col 26}{space 2} .1366485{col 37}{space 1}   -0.22{col 46}{space 3}0.823{col 54}{space 4}-.2984914{col 67}{space 3} .2372607
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-.1042937{col 26}{space 2} .1344481{col 37}{space 1}   -0.78{col 46}{space 3}0.438{col 54}{space 4}-.3678561{col 67}{space 3} .1592686
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-.0497766{col 26}{space 2}  .132648{col 37}{space 1}   -0.38{col 46}{space 3}0.707{col 54}{space 4}-.3098101{col 67}{space 3}  .210257
{txt}{space 9}CO  {c |}{col 14}{res}{space 2} .0025471{col 26}{space 2} .1356666{col 37}{space 1}    0.02{col 46}{space 3}0.985{col 54}{space 4} -.263404{col 67}{space 3} .2684982
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-.0290733{col 26}{space 2} .1351815{col 37}{space 1}   -0.22{col 46}{space 3}0.830{col 54}{space 4}-.2940735{col 67}{space 3} .2359268
{txt}{space 9}DC  {c |}{col 14}{res}{space 2} .0605567{col 26}{space 2} .1570524{col 37}{space 1}    0.39{col 46}{space 3}0.700{col 54}{space 4}-.2473176{col 67}{space 3}  .368431
{txt}{space 9}DE  {c |}{col 14}{res}{space 2} .0181708{col 26}{space 2} .1453888{col 37}{space 1}    0.12{col 46}{space 3}0.901{col 54}{space 4}-.2668391{col 67}{space 3} .3031807
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-.0389202{col 26}{space 2} .1330783{col 37}{space 1}   -0.29{col 46}{space 3}0.770{col 54}{space 4}-.2997975{col 67}{space 3}  .221957
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-.0643168{col 26}{space 2}  .134238{col 37}{space 1}   -0.48{col 46}{space 3}0.632{col 54}{space 4}-.3274673{col 67}{space 3} .1988338
{txt}{space 9}HI  {c |}{col 14}{res}{space 2}  .080584{col 26}{space 2} .1664194{col 37}{space 1}    0.48{col 46}{space 3}0.628{col 54}{space 4}-.2456527{col 67}{space 3} .4068207
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-.0064419{col 26}{space 2} .1353825{col 37}{space 1}   -0.05{col 46}{space 3}0.962{col 54}{space 4} -.271836{col 67}{space 3} .2589523
{txt}{space 9}ID  {c |}{col 14}{res}{space 2} .0337478{col 26}{space 2}  .136059{col 37}{space 1}    0.25{col 46}{space 3}0.804{col 54}{space 4}-.2329724{col 67}{space 3} .3004681
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-.0386653{col 26}{space 2} .1332547{col 37}{space 1}   -0.29{col 46}{space 3}0.772{col 54}{space 4}-.2998882{col 67}{space 3} .2225577
{txt}{space 9}IN  {c |}{col 14}{res}{space 2} -.014616{col 26}{space 2} .1353772{col 37}{space 1}   -0.11{col 46}{space 3}0.914{col 54}{space 4}-.2799997{col 67}{space 3} .2507678
{txt}{space 9}KS  {c |}{col 14}{res}{space 2} .0012312{col 26}{space 2} .1384647{col 37}{space 1}    0.01{col 46}{space 3}0.993{col 54}{space 4}-.2702051{col 67}{space 3} .2726675
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-.0169001{col 26}{space 2} .1356113{col 37}{space 1}   -0.12{col 46}{space 3}0.901{col 54}{space 4}-.2827428{col 67}{space 3} .2489425
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-.0653916{col 26}{space 2} .1395995{col 37}{space 1}   -0.47{col 46}{space 3}0.639{col 54}{space 4}-.3390526{col 67}{space 3} .2082693
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-.0290558{col 26}{space 2} .1346438{col 37}{space 1}   -0.22{col 46}{space 3}0.829{col 54}{space 4}-.2930018{col 67}{space 3} .2348902
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-.0127933{col 26}{space 2} .1357177{col 37}{space 1}   -0.09{col 46}{space 3}0.925{col 54}{space 4}-.2788447{col 67}{space 3}  .253258
{txt}{space 9}ME  {c |}{col 14}{res}{space 2} .0265253{col 26}{space 2} .1414781{col 37}{space 1}    0.19{col 46}{space 3}0.851{col 54}{space 4}-.2508183{col 67}{space 3} .3038689
{txt}{space 9}MI  {c |}{col 14}{res}{space 2}-.0562883{col 26}{space 2}  .134037{col 37}{space 1}   -0.42{col 46}{space 3}0.675{col 54}{space 4}-.3190448{col 67}{space 3} .2064682
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-.0180993{col 26}{space 2} .1338726{col 37}{space 1}   -0.14{col 46}{space 3}0.892{col 54}{space 4}-.2805336{col 67}{space 3} .2443351
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-.0720781{col 26}{space 2} .1351418{col 37}{space 1}   -0.53{col 46}{space 3}0.594{col 54}{space 4}-.3370004{col 67}{space 3} .1928442
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-.0472865{col 26}{space 2} .1442768{col 37}{space 1}   -0.33{col 46}{space 3}0.743{col 54}{space 4}-.3301165{col 67}{space 3} .2355435
{txt}{space 9}MT  {c |}{col 14}{res}{space 2}-.0068988{col 26}{space 2} .1508455{col 37}{space 1}   -0.05{col 46}{space 3}0.964{col 54}{space 4}-.3026055{col 67}{space 3}  .288808
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-.0262884{col 26}{space 2} .1341511{col 37}{space 1}   -0.20{col 46}{space 3}0.845{col 54}{space 4}-.2892687{col 67}{space 3} .2366919
{txt}{space 9}ND  {c |}{col 14}{res}{space 2} .0452792{col 26}{space 2} .1521612{col 37}{space 1}    0.30{col 46}{space 3}0.766{col 54}{space 4}-.2530068{col 67}{space 3} .3435651
{txt}{space 9}NE  {c |}{col 14}{res}{space 2} .0698448{col 26}{space 2} .1420664{col 37}{space 1}    0.49{col 46}{space 3}0.623{col 54}{space 4} -.208652{col 67}{space 3} .3483415
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-.0227992{col 26}{space 2}  .134979{col 37}{space 1}   -0.17{col 46}{space 3}0.866{col 54}{space 4}-.2874024{col 67}{space 3} .2418041
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-.0473372{col 26}{space 2} .1339327{col 37}{space 1}   -0.35{col 46}{space 3}0.724{col 54}{space 4}-.3098893{col 67}{space 3} .2152149
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-.1023784{col 26}{space 2}  .138186{col 37}{space 1}   -0.74{col 46}{space 3}0.459{col 54}{space 4}-.3732684{col 67}{space 3} .1685116
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}-.0195399{col 26}{space 2}   .14132{col 37}{space 1}   -0.14{col 46}{space 3}0.890{col 54}{space 4}-.2965736{col 67}{space 3} .2574938
{txt}{space 9}NY  {c |}{col 14}{res}{space 2} -.063311{col 26}{space 2} .1330564{col 37}{space 1}   -0.48{col 46}{space 3}0.634{col 54}{space 4}-.3241454{col 67}{space 3} .1975233
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-.0207448{col 26}{space 2} .1334388{col 37}{space 1}   -0.16{col 46}{space 3}0.876{col 54}{space 4}-.2823286{col 67}{space 3} .2408391
{txt}{space 9}OK  {c |}{col 14}{res}{space 2} -.044129{col 26}{space 2} .1396225{col 37}{space 1}   -0.32{col 46}{space 3}0.752{col 54}{space 4}-.3178349{col 67}{space 3} .2295769
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-.0346179{col 26}{space 2} .1367108{col 37}{space 1}   -0.25{col 46}{space 3}0.800{col 54}{space 4} -.302616{col 67}{space 3} .2333803
{txt}{space 9}PA  {c |}{col 14}{res}{space 2} -.037797{col 26}{space 2} .1331208{col 37}{space 1}   -0.28{col 46}{space 3}0.776{col 54}{space 4}-.2987576{col 67}{space 3} .2231636
{txt}{space 9}RI  {c |}{col 14}{res}{space 2} .0646103{col 26}{space 2} .1502156{col 37}{space 1}    0.43{col 46}{space 3}0.667{col 54}{space 4}-.2298616{col 67}{space 3} .3590822
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-.0813339{col 26}{space 2} .1383284{col 37}{space 1}   -0.59{col 46}{space 3}0.557{col 54}{space 4}-.3525031{col 67}{space 3} .1898353
{txt}{space 9}SD  {c |}{col 14}{res}{space 2}-.0201743{col 26}{space 2} .1558107{col 37}{space 1}   -0.13{col 46}{space 3}0.897{col 54}{space 4}-.3256146{col 67}{space 3} .2852659
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-.0253492{col 26}{space 2} .1364115{col 37}{space 1}   -0.19{col 46}{space 3}0.853{col 54}{space 4}-.2927606{col 67}{space 3} .2420623
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-.0348462{col 26}{space 2} .1329554{col 37}{space 1}   -0.26{col 46}{space 3}0.793{col 54}{space 4}-.2954826{col 67}{space 3} .2257901
{txt}{space 9}UT  {c |}{col 14}{res}{space 2} .0088282{col 26}{space 2} .1429636{col 37}{space 1}    0.06{col 46}{space 3}0.951{col 54}{space 4}-.2714274{col 67}{space 3} .2890839
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}-.0201401{col 26}{space 2} .1344354{col 37}{space 1}   -0.15{col 46}{space 3}0.881{col 54}{space 4}-.2836777{col 67}{space 3} .2433976
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}-.0440474{col 26}{space 2} .1436284{col 37}{space 1}   -0.31{col 46}{space 3}0.759{col 54}{space 4}-.3256062{col 67}{space 3} .2375114
{txt}{space 9}WA  {c |}{col 14}{res}{space 2} .0132254{col 26}{space 2} .1346251{col 37}{space 1}    0.10{col 46}{space 3}0.922{col 54}{space 4} -.250684{col 67}{space 3} .2771349
{txt}{space 9}WI  {c |}{col 14}{res}{space 2} .0173093{col 26}{space 2} .1351761{col 37}{space 1}    0.13{col 46}{space 3}0.898{col 54}{space 4}-.2476803{col 67}{space 3} .2822989
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-.1216856{col 26}{space 2} .1537663{col 37}{space 1}   -0.79{col 46}{space 3}0.429{col 54}{space 4} -.423118{col 67}{space 3} .1797468
{txt}{space 9}WY  {c |}{col 14}{res}{space 2} .0584916{col 26}{space 2} .1585884{col 37}{space 1}    0.37{col 46}{space 3}0.712{col 54}{space 4}-.2523937{col 67}{space 3} .3693769
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0366876{col 26}{space 2} .1361287{col 37}{space 1}   -0.27{col 46}{space 3}0.788{col 54}{space 4}-.3035445{col 67}{space 3} .2301693
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est16{txt} stored)

Linear regression                                      Number of obs ={res}    6569
                                                       {txt}F( 71,  6497) ={res}    4.03
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0430
                                                       {txt}Root MSE      = {res} .33545

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     IncSkew{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2} .0018744{col 26}{space 2} .0220158{col 37}{space 1}    0.09{col 46}{space 3}0.932{col 54}{space 4}-.0412839{col 67}{space 3} .0450327
{txt}{space 8}Old  {c |}{col 14}{res}{space 2}-.0125921{col 26}{space 2} .0306724{col 37}{space 1}   -0.41{col 46}{space 3}0.681{col 54}{space 4}  -.07272{col 67}{space 3} .0475358
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2}  .012636{col 26}{space 2} .0157235{col 37}{space 1}    0.80{col 46}{space 3}0.422{col 54}{space 4}-.0181872{col 67}{space 3} .0434592
{txt}High Educ..  {c |}{col 14}{res}{space 2} .0637753{col 26}{space 2} .0155334{col 37}{space 1}    4.11{col 46}{space 3}0.000{col 54}{space 4} .0333247{col 67}{space 3}  .094226
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2} .0541795{col 26}{space 2} .0122824{col 37}{space 1}    4.41{col 46}{space 3}0.000{col 54}{space 4} .0301019{col 67}{space 3}  .078257
{txt}High Income  {c |}{col 14}{res}{space 2}  .063793{col 26}{space 2} .0117827{col 37}{space 1}    5.41{col 46}{space 3}0.000{col 54}{space 4} .0406951{col 67}{space 3} .0868909
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2}-.0074468{col 26}{space 2} .0215201{col 37}{space 1}   -0.35{col 46}{space 3}0.729{col 54}{space 4}-.0496334{col 67}{space 3} .0347398
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} .0446964{col 26}{space 2} .0313389{col 37}{space 1}    1.43{col 46}{space 3}0.154{col 54}{space 4}-.0167381{col 67}{space 3} .1061309
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2} .0019805{col 26}{space 2} .0133415{col 37}{space 1}    0.15{col 46}{space 3}0.882{col 54}{space 4}-.0241733{col 67}{space 3} .0281343
{txt}{space 7}2015  {c |}{col 14}{res}{space 2} .0062218{col 26}{space 2} .0132628{col 37}{space 1}    0.47{col 46}{space 3}0.639{col 54}{space 4}-.0197777{col 67}{space 3} .0322213
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0102096{col 26}{space 2}  .013343{col 37}{space 1}   -0.77{col 46}{space 3}0.444{col 54}{space 4}-.0363663{col 67}{space 3} .0159471
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0048153{col 26}{space 2} .0137306{col 37}{space 1}    0.35{col 46}{space 3}0.726{col 54}{space 4}-.0221012{col 67}{space 3} .0317318
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0020374{col 26}{space 2} .0176132{col 37}{space 1}   -0.12{col 46}{space 3}0.908{col 54}{space 4}-.0365651{col 67}{space 3} .0324903
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2}-.0220684{col 26}{space 2} .1237328{col 37}{space 1}   -0.18{col 46}{space 3}0.858{col 54}{space 4}-.2646253{col 67}{space 3} .2204886
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-.0387604{col 26}{space 2}  .123377{col 37}{space 1}   -0.31{col 46}{space 3}0.753{col 54}{space 4}-.2806199{col 67}{space 3} .2030991
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-.1069682{col 26}{space 2} .1208018{col 37}{space 1}   -0.89{col 46}{space 3}0.376{col 54}{space 4}-.3437796{col 67}{space 3} .1298431
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-.0478752{col 26}{space 2} .1188164{col 37}{space 1}   -0.40{col 46}{space 3}0.687{col 54}{space 4}-.2807945{col 67}{space 3} .1850442
{txt}{space 9}CO  {c |}{col 14}{res}{space 2}-.0076305{col 26}{space 2} .1222885{col 37}{space 1}   -0.06{col 46}{space 3}0.950{col 54}{space 4}-.2473562{col 67}{space 3} .2320951
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-.0309724{col 26}{space 2} .1218273{col 37}{space 1}   -0.25{col 46}{space 3}0.799{col 54}{space 4}-.2697939{col 67}{space 3} .2078492
{txt}{space 9}DC  {c |}{col 14}{res}{space 2} .0671795{col 26}{space 2} .1454023{col 37}{space 1}    0.46{col 46}{space 3}0.644{col 54}{space 4}-.2178569{col 67}{space 3} .3522158
{txt}{space 9}DE  {c |}{col 14}{res}{space 2} .0266851{col 26}{space 2} .1317689{col 37}{space 1}    0.20{col 46}{space 3}0.840{col 54}{space 4}-.2316253{col 67}{space 3} .2849955
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-.0395944{col 26}{space 2} .1194353{col 37}{space 1}   -0.33{col 46}{space 3}0.740{col 54}{space 4}-.2737269{col 67}{space 3} .1945381
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-.0571745{col 26}{space 2} .1207342{col 37}{space 1}   -0.47{col 46}{space 3}0.636{col 54}{space 4}-.2938532{col 67}{space 3} .1795042
{txt}{space 9}HI  {c |}{col 14}{res}{space 2} .0323914{col 26}{space 2} .1558009{col 37}{space 1}    0.21{col 46}{space 3}0.835{col 54}{space 4}-.2730297{col 67}{space 3} .3378124
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-.0284628{col 26}{space 2} .1219163{col 37}{space 1}   -0.23{col 46}{space 3}0.815{col 54}{space 4}-.2674589{col 67}{space 3} .2105332
{txt}{space 9}ID  {c |}{col 14}{res}{space 2} .0111805{col 26}{space 2} .1225818{col 37}{space 1}    0.09{col 46}{space 3}0.927{col 54}{space 4}-.2291201{col 67}{space 3} .2514811
{txt}{space 9}IL  {c |}{col 14}{res}{space 2} -.046756{col 26}{space 2} .1195274{col 37}{space 1}   -0.39{col 46}{space 3}0.696{col 54}{space 4}-.2810691{col 67}{space 3} .1875572
{txt}{space 9}IN  {c |}{col 14}{res}{space 2}-.0313273{col 26}{space 2}  .121803{col 37}{space 1}   -0.26{col 46}{space 3}0.797{col 54}{space 4}-.2701012{col 67}{space 3} .2074466
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-.0153216{col 26}{space 2} .1252624{col 37}{space 1}   -0.12{col 46}{space 3}0.903{col 54}{space 4}-.2608771{col 67}{space 3}  .230234
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-.0306454{col 26}{space 2} .1222375{col 37}{space 1}   -0.25{col 46}{space 3}0.802{col 54}{space 4}-.2702711{col 67}{space 3} .2089803
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-.0606907{col 26}{space 2} .1261629{col 37}{space 1}   -0.48{col 46}{space 3}0.630{col 54}{space 4}-.3080116{col 67}{space 3} .1866302
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-.0405741{col 26}{space 2} .1211208{col 37}{space 1}   -0.33{col 46}{space 3}0.738{col 54}{space 4}-.2780107{col 67}{space 3} .1968625
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-.0093057{col 26}{space 2} .1223211{col 37}{space 1}   -0.08{col 46}{space 3}0.939{col 54}{space 4}-.2490954{col 67}{space 3} .2304839
{txt}{space 9}ME  {c |}{col 14}{res}{space 2} .0061143{col 26}{space 2} .1282333{col 37}{space 1}    0.05{col 46}{space 3}0.962{col 54}{space 4}-.2452652{col 67}{space 3} .2574939
{txt}{space 9}MI  {c |}{col 14}{res}{space 2}-.0710647{col 26}{space 2} .1204316{col 37}{space 1}   -0.59{col 46}{space 3}0.555{col 54}{space 4}-.3071503{col 67}{space 3}  .165021
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-.0361776{col 26}{space 2}  .120236{col 37}{space 1}   -0.30{col 46}{space 3}0.764{col 54}{space 4}-.2718798{col 67}{space 3} .1995246
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-.0886844{col 26}{space 2} .1216424{col 37}{space 1}   -0.73{col 46}{space 3}0.466{col 54}{space 4}-.3271436{col 67}{space 3} .1497748
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-.0321146{col 26}{space 2} .1312385{col 37}{space 1}   -0.24{col 46}{space 3}0.807{col 54}{space 4}-.2893852{col 67}{space 3} .2251559
{txt}{space 9}MT  {c |}{col 14}{res}{space 2}-.0269325{col 26}{space 2}  .138927{col 37}{space 1}   -0.19{col 46}{space 3}0.846{col 54}{space 4}-.2992751{col 67}{space 3} .2454102
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-.0314403{col 26}{space 2} .1205748{col 37}{space 1}   -0.26{col 46}{space 3}0.794{col 54}{space 4}-.2678066{col 67}{space 3}  .204926
{txt}{space 9}ND  {c |}{col 14}{res}{space 2} .0240172{col 26}{space 2} .1407482{col 37}{space 1}    0.17{col 46}{space 3}0.865{col 54}{space 4}-.2518957{col 67}{space 3}   .29993
{txt}{space 9}NE  {c |}{col 14}{res}{space 2} .0514027{col 26}{space 2} .1293572{col 37}{space 1}    0.40{col 46}{space 3}0.691{col 54}{space 4}  -.20218{col 67}{space 3} .3049854
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-.0438646{col 26}{space 2} .1214585{col 37}{space 1}   -0.36{col 46}{space 3}0.718{col 54}{space 4}-.2819633{col 67}{space 3} .1942341
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2} -.049748{col 26}{space 2} .1203692{col 37}{space 1}   -0.41{col 46}{space 3}0.679{col 54}{space 4}-.2857112{col 67}{space 3} .1862152
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-.1101942{col 26}{space 2} .1242415{col 37}{space 1}   -0.89{col 46}{space 3}0.375{col 54}{space 4}-.3537485{col 67}{space 3} .1333601
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}-.0290806{col 26}{space 2} .1285256{col 37}{space 1}   -0.23{col 46}{space 3}0.821{col 54}{space 4} -.281033{col 67}{space 3} .2228718
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-.0719515{col 26}{space 2} .1192861{col 37}{space 1}   -0.60{col 46}{space 3}0.546{col 54}{space 4}-.3057915{col 67}{space 3} .1618886
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}  -.03652{col 26}{space 2} .1198199{col 37}{space 1}   -0.30{col 46}{space 3}0.761{col 54}{space 4}-.2714065{col 67}{space 3} .1983665
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-.0569593{col 26}{space 2} .1260394{col 37}{space 1}   -0.45{col 46}{space 3}0.651{col 54}{space 4} -.304038{col 67}{space 3} .1901193
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-.0505288{col 26}{space 2} .1233299{col 37}{space 1}   -0.41{col 46}{space 3}0.682{col 54}{space 4} -.292296{col 67}{space 3} .1912384
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-.0503201{col 26}{space 2} .1194245{col 37}{space 1}   -0.42{col 46}{space 3}0.674{col 54}{space 4}-.2844314{col 67}{space 3} .1837912
{txt}{space 9}RI  {c |}{col 14}{res}{space 2} .0529245{col 26}{space 2} .1406217{col 37}{space 1}    0.38{col 46}{space 3}0.707{col 54}{space 4}-.2227403{col 67}{space 3} .3285892
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-.0821975{col 26}{space 2}  .125246{col 37}{space 1}   -0.66{col 46}{space 3}0.512{col 54}{space 4}-.3277209{col 67}{space 3} .1633258
{txt}{space 9}SD  {c |}{col 14}{res}{space 2}-.0387717{col 26}{space 2} .1442658{col 37}{space 1}   -0.27{col 46}{space 3}0.788{col 54}{space 4}-.3215802{col 67}{space 3} .2440368
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-.0343617{col 26}{space 2} .1231072{col 37}{space 1}   -0.28{col 46}{space 3}0.780{col 54}{space 4}-.2756924{col 67}{space 3} .2069689
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-.0345655{col 26}{space 2} .1192623{col 37}{space 1}   -0.29{col 46}{space 3}0.772{col 54}{space 4}-.2683588{col 67}{space 3} .1992278
{txt}{space 9}UT  {c |}{col 14}{res}{space 2}-.0188134{col 26}{space 2} .1301508{col 37}{space 1}   -0.14{col 46}{space 3}0.885{col 54}{space 4}-.2739518{col 67}{space 3}  .236325
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}-.0235765{col 26}{space 2} .1209245{col 37}{space 1}   -0.19{col 46}{space 3}0.845{col 54}{space 4}-.2606282{col 67}{space 3} .2134753
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}-.0671967{col 26}{space 2} .1311402{col 37}{space 1}   -0.51{col 46}{space 3}0.608{col 54}{space 4}-.3242748{col 67}{space 3} .1898813
{txt}{space 9}WA  {c |}{col 14}{res}{space 2} -.004987{col 26}{space 2} .1209858{col 37}{space 1}   -0.04{col 46}{space 3}0.967{col 54}{space 4} -.242159{col 67}{space 3}  .232185
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-.0008083{col 26}{space 2} .1216856{col 37}{space 1}   -0.01{col 46}{space 3}0.995{col 54}{space 4}-.2393522{col 67}{space 3} .2377356
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-.1440281{col 26}{space 2} .1421172{col 37}{space 1}   -1.01{col 46}{space 3}0.311{col 54}{space 4}-.4226246{col 67}{space 3} .1345683
{txt}{space 9}WY  {c |}{col 14}{res}{space 2} .0312135{col 26}{space 2} .1469054{col 37}{space 1}    0.21{col 46}{space 3}0.832{col 54}{space 4}-.2567695{col 67}{space 3} .3191966
{txt}{space 12} {c |}
{space 7}2.Q33 {c |}{col 14}{res}{space 2} .0224499{col 26}{space 2} .0084335{col 37}{space 1}    2.66{col 46}{space 3}0.008{col 54}{space 4} .0059174{col 67}{space 3} .0389823
{txt}{space 7}2.Q34 {c |}{col 14}{res}{space 2} .0596914{col 26}{space 2} .0172611{col 37}{space 1}    3.46{col 46}{space 3}0.001{col 54}{space 4} .0258539{col 67}{space 3} .0935289
{txt}{space 7}Q35_1 {c |}{col 14}{res}{space 2} .0718761{col 26}{space 2} .0266914{col 37}{space 1}    2.69{col 46}{space 3}0.007{col 54}{space 4} .0195521{col 67}{space 3}    .1242
{txt}{space 7}Q35_2 {c |}{col 14}{res}{space 2}-.0254255{col 26}{space 2} .0279203{col 37}{space 1}   -0.91{col 46}{space 3}0.363{col 54}{space 4}-.0801584{col 67}{space 3} .0293074
{txt}{space 7}Q35_3 {c |}{col 14}{res}{space 2} .0288494{col 26}{space 2} .0321526{col 37}{space 1}    0.90{col 46}{space 3}0.370{col 54}{space 4}-.0341803{col 67}{space 3}  .091879
{txt}{space 7}Q35_4 {c |}{col 14}{res}{space 2} .0758112{col 26}{space 2} .0310835{col 37}{space 1}    2.44{col 46}{space 3}0.015{col 54}{space 4} .0148773{col 67}{space 3}  .136745
{txt}{space 7}Q35_5 {c |}{col 14}{res}{space 2} .0704779{col 26}{space 2} .0528588{col 37}{space 1}    1.33{col 46}{space 3}0.182{col 54}{space 4}-.0331427{col 67}{space 3} .1740985
{txt}{space 7}Q35_6 {c |}{col 14}{res}{space 2} .0340755{col 26}{space 2} .0297975{col 37}{space 1}    1.14{col 46}{space 3}0.253{col 54}{space 4}-.0243373{col 67}{space 3} .0924883
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.1557428{col 26}{space 2} .1256338{col 37}{space 1}   -1.24{col 46}{space 3}0.215{col 54}{space 4}-.4020264{col 67}{space 3} .0905408
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est17{txt} stored)

Linear regression                                      Number of obs ={res}    5504
                                                       {txt}F( 75,  5428) ={res}    3.86
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0525
                                                       {txt}Root MSE      = {res} .32974

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     IncSkew{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2} .0102271{col 26}{space 2} .0238023{col 37}{space 1}    0.43{col 46}{space 3}0.667{col 54}{space 4} -.036435{col 67}{space 3} .0568892
{txt}{space 8}Old  {c |}{col 14}{res}{space 2}-.0047948{col 26}{space 2} .0336042{col 37}{space 1}   -0.14{col 46}{space 3}0.887{col 54}{space 4}-.0706725{col 67}{space 3}  .061083
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2} .0195196{col 26}{space 2} .0166788{col 37}{space 1}    1.17{col 46}{space 3}0.242{col 54}{space 4}-.0131775{col 67}{space 3} .0522167
{txt}High Educ..  {c |}{col 14}{res}{space 2} .0727899{col 26}{space 2}  .016519{col 37}{space 1}    4.41{col 46}{space 3}0.000{col 54}{space 4} .0404061{col 67}{space 3} .1051738
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2} .0434012{col 26}{space 2} .0134764{col 37}{space 1}    3.22{col 46}{space 3}0.001{col 54}{space 4} .0169821{col 67}{space 3} .0698204
{txt}High Income  {c |}{col 14}{res}{space 2} .0463015{col 26}{space 2} .0130821{col 37}{space 1}    3.54{col 46}{space 3}0.000{col 54}{space 4} .0206554{col 67}{space 3} .0719477
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2}-.0152933{col 26}{space 2} .0239052{col 37}{space 1}   -0.64{col 46}{space 3}0.522{col 54}{space 4}-.0621571{col 67}{space 3} .0315705
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} .0472701{col 26}{space 2} .0342748{col 37}{space 1}    1.38{col 46}{space 3}0.168{col 54}{space 4}-.0199222{col 67}{space 3} .1144623
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2} .0007445{col 26}{space 2} .0144997{col 37}{space 1}    0.05{col 46}{space 3}0.959{col 54}{space 4}-.0276808{col 67}{space 3} .0291698
{txt}{space 7}2015  {c |}{col 14}{res}{space 2} .0088464{col 26}{space 2} .0143325{col 37}{space 1}    0.62{col 46}{space 3}0.537{col 54}{space 4} -.019251{col 67}{space 3} .0369437
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0011078{col 26}{space 2} .0144415{col 37}{space 1}    0.08{col 46}{space 3}0.939{col 54}{space 4}-.0272034{col 67}{space 3}  .029419
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0112572{col 26}{space 2} .0147888{col 37}{space 1}    0.76{col 46}{space 3}0.447{col 54}{space 4}-.0177348{col 67}{space 3} .0402492
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0039195{col 26}{space 2} .0188867{col 37}{space 1}   -0.21{col 46}{space 3}0.836{col 54}{space 4} -.040945{col 67}{space 3} .0331061
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2}-.0649692{col 26}{space 2} .1044176{col 37}{space 1}   -0.62{col 46}{space 3}0.534{col 54}{space 4}-.2696695{col 67}{space 3} .1397311
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-.0579985{col 26}{space 2} .1032018{col 37}{space 1}   -0.56{col 46}{space 3}0.574{col 54}{space 4}-.2603155{col 67}{space 3} .1443185
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2} -.143709{col 26}{space 2} .1001848{col 37}{space 1}   -1.43{col 46}{space 3}0.152{col 54}{space 4}-.3401114{col 67}{space 3} .0526934
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-.1026797{col 26}{space 2} .0974083{col 37}{space 1}   -1.05{col 46}{space 3}0.292{col 54}{space 4} -.293639{col 67}{space 3} .0882796
{txt}{space 9}CO  {c |}{col 14}{res}{space 2}-.0603202{col 26}{space 2} .1029748{col 37}{space 1}   -0.59{col 46}{space 3}0.558{col 54}{space 4}-.2621921{col 67}{space 3} .1415517
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-.0660847{col 26}{space 2} .1001345{col 37}{space 1}   -0.66{col 46}{space 3}0.509{col 54}{space 4}-.2623884{col 67}{space 3}  .130219
{txt}{space 9}DC  {c |}{col 14}{res}{space 2} .0036371{col 26}{space 2} .1333712{col 37}{space 1}    0.03{col 46}{space 3}0.978{col 54}{space 4}-.2578239{col 67}{space 3} .2650981
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-.0279295{col 26}{space 2} .1147548{col 37}{space 1}   -0.24{col 46}{space 3}0.808{col 54}{space 4}-.2528949{col 67}{space 3}  .197036
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-.0973094{col 26}{space 2} .0981653{col 37}{space 1}   -0.99{col 46}{space 3}0.322{col 54}{space 4}-.2897527{col 67}{space 3} .0951339
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-.0920867{col 26}{space 2} .1001569{col 37}{space 1}   -0.92{col 46}{space 3}0.358{col 54}{space 4}-.2884345{col 67}{space 3}  .104261
{txt}{space 9}HI  {c |}{col 14}{res}{space 2} .0395246{col 26}{space 2} .1492499{col 37}{space 1}    0.26{col 46}{space 3}0.791{col 54}{space 4}-.2530651{col 67}{space 3} .3321143
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-.0947999{col 26}{space 2}  .101334{col 37}{space 1}   -0.94{col 46}{space 3}0.350{col 54}{space 4}-.2934551{col 67}{space 3} .1038553
{txt}{space 9}ID  {c |}{col 14}{res}{space 2}-.0267952{col 26}{space 2} .1013396{col 37}{space 1}   -0.26{col 46}{space 3}0.791{col 54}{space 4}-.2254615{col 67}{space 3}  .171871
{txt}{space 9}IL  {c |}{col 14}{res}{space 2} -.087752{col 26}{space 2} .0983215{col 37}{space 1}   -0.89{col 46}{space 3}0.372{col 54}{space 4}-.2805015{col 67}{space 3} .1049976
{txt}{space 9}IN  {c |}{col 14}{res}{space 2}-.0703686{col 26}{space 2} .1021772{col 37}{space 1}   -0.69{col 46}{space 3}0.491{col 54}{space 4}-.2706769{col 67}{space 3} .1299397
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-.0718902{col 26}{space 2} .1072872{col 37}{space 1}   -0.67{col 46}{space 3}0.503{col 54}{space 4}-.2822161{col 67}{space 3} .1384357
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-.0789718{col 26}{space 2} .1022574{col 37}{space 1}   -0.77{col 46}{space 3}0.440{col 54}{space 4}-.2794373{col 67}{space 3} .1214938
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-.0842461{col 26}{space 2} .1080498{col 37}{space 1}   -0.78{col 46}{space 3}0.436{col 54}{space 4}-.2960671{col 67}{space 3} .1275748
{txt}{space 9}MA  {c |}{col 14}{res}{space 2} -.086258{col 26}{space 2} .1003004{col 37}{space 1}   -0.86{col 46}{space 3}0.390{col 54}{space 4}-.2828871{col 67}{space 3} .1103711
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-.0693962{col 26}{space 2} .1014743{col 37}{space 1}   -0.68{col 46}{space 3}0.494{col 54}{space 4}-.2683266{col 67}{space 3} .1295342
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-.0159546{col 26}{space 2} .1067868{col 37}{space 1}   -0.15{col 46}{space 3}0.881{col 54}{space 4}-.2252996{col 67}{space 3} .1933904
{txt}{space 9}MI  {c |}{col 14}{res}{space 2}-.1359188{col 26}{space 2} .0995087{col 37}{space 1}   -1.37{col 46}{space 3}0.172{col 54}{space 4}-.3309957{col 67}{space 3} .0591582
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-.1141492{col 26}{space 2} .0990877{col 37}{space 1}   -1.15{col 46}{space 3}0.249{col 54}{space 4}-.3084008{col 67}{space 3} .0801023
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-.1245367{col 26}{space 2} .1017457{col 37}{space 1}   -1.22{col 46}{space 3}0.221{col 54}{space 4}-.3239991{col 67}{space 3} .0749256
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-.0640583{col 26}{space 2} .1143511{col 37}{space 1}   -0.56{col 46}{space 3}0.575{col 54}{space 4}-.2882323{col 67}{space 3} .1601157
{txt}{space 9}MT  {c |}{col 14}{res}{space 2}-.1047116{col 26}{space 2} .1284359{col 37}{space 1}   -0.82{col 46}{space 3}0.415{col 54}{space 4}-.3564975{col 67}{space 3} .1470743
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-.0719434{col 26}{space 2} .0996269{col 37}{space 1}   -0.72{col 46}{space 3}0.470{col 54}{space 4}-.2672521{col 67}{space 3} .1233653
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-.0404696{col 26}{space 2} .1289292{col 37}{space 1}   -0.31{col 46}{space 3}0.754{col 54}{space 4}-.2932226{col 67}{space 3} .2122833
{txt}{space 9}NE  {c |}{col 14}{res}{space 2}-.0057754{col 26}{space 2} .1130347{col 37}{space 1}   -0.05{col 46}{space 3}0.959{col 54}{space 4}-.2273688{col 67}{space 3}  .215818
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-.1249367{col 26}{space 2} .1011666{col 37}{space 1}   -1.23{col 46}{space 3}0.217{col 54}{space 4}-.3232639{col 67}{space 3} .0733905
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-.1030715{col 26}{space 2}  .098959{col 37}{space 1}   -1.04{col 46}{space 3}0.298{col 54}{space 4}-.2970709{col 67}{space 3} .0909279
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-.1718976{col 26}{space 2} .1067851{col 37}{space 1}   -1.61{col 46}{space 3}0.108{col 54}{space 4}-.3812392{col 67}{space 3}  .037444
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}-.0814845{col 26}{space 2} .1130521{col 37}{space 1}   -0.72{col 46}{space 3}0.471{col 54}{space 4}-.3031119{col 67}{space 3} .1401429
{txt}{space 9}NY  {c |}{col 14}{res}{space 2} -.117208{col 26}{space 2} .0980176{col 37}{space 1}   -1.20{col 46}{space 3}0.232{col 54}{space 4}-.3093618{col 67}{space 3} .0749458
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-.0862259{col 26}{space 2} .0987532{col 37}{space 1}   -0.87{col 46}{space 3}0.383{col 54}{space 4}-.2798217{col 67}{space 3} .1073699
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-.1388775{col 26}{space 2} .1094067{col 37}{space 1}   -1.27{col 46}{space 3}0.204{col 54}{space 4}-.3533586{col 67}{space 3} .0756035
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-.1080578{col 26}{space 2} .1045938{col 37}{space 1}   -1.03{col 46}{space 3}0.302{col 54}{space 4}-.3131035{col 67}{space 3}  .096988
{txt}{space 9}PA  {c |}{col 14}{res}{space 2} -.090648{col 26}{space 2} .0981625{col 37}{space 1}   -0.92{col 46}{space 3}0.356{col 54}{space 4}-.2830858{col 67}{space 3} .1017898
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-.0611657{col 26}{space 2} .1144066{col 37}{space 1}   -0.53{col 46}{space 3}0.593{col 54}{space 4}-.2854485{col 67}{space 3} .1631172
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-.1129948{col 26}{space 2}  .105894{col 37}{space 1}   -1.07{col 46}{space 3}0.286{col 54}{space 4}-.3205895{col 67}{space 3} .0945999
{txt}{space 9}SD  {c |}{col 14}{res}{space 2}-.1871004{col 26}{space 2}  .118619{col 37}{space 1}   -1.58{col 46}{space 3}0.115{col 54}{space 4}-.4196412{col 67}{space 3} .0454404
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-.0901927{col 26}{space 2}  .103327{col 37}{space 1}   -0.87{col 46}{space 3}0.383{col 54}{space 4}-.2927551{col 67}{space 3} .1123697
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-.0592045{col 26}{space 2} .0981067{col 37}{space 1}   -0.60{col 46}{space 3}0.546{col 54}{space 4} -.251533{col 67}{space 3}  .133124
{txt}{space 9}UT  {c |}{col 14}{res}{space 2} -.063017{col 26}{space 2} .1129089{col 37}{space 1}   -0.56{col 46}{space 3}0.577{col 54}{space 4}-.2843637{col 67}{space 3} .1583298
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}-.0787436{col 26}{space 2} .0997727{col 37}{space 1}   -0.79{col 46}{space 3}0.430{col 54}{space 4}-.2743382{col 67}{space 3} .1168509
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}-.1342672{col 26}{space 2} .1151347{col 37}{space 1}   -1.17{col 46}{space 3}0.244{col 54}{space 4}-.3599773{col 67}{space 3}  .091443
{txt}{space 9}WA  {c |}{col 14}{res}{space 2} -.047389{col 26}{space 2} .1003934{col 37}{space 1}   -0.47{col 46}{space 3}0.637{col 54}{space 4}-.2442004{col 67}{space 3} .1494223
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-.0648769{col 26}{space 2} .1008617{col 37}{space 1}   -0.64{col 46}{space 3}0.520{col 54}{space 4}-.2626064{col 67}{space 3} .1328526
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-.2119498{col 26}{space 2} .1248309{col 37}{space 1}   -1.70{col 46}{space 3}0.090{col 54}{space 4}-.4566685{col 67}{space 3} .0327688
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-.0237677{col 26}{space 2} .1449377{col 37}{space 1}   -0.16{col 46}{space 3}0.870{col 54}{space 4}-.3079037{col 67}{space 3} .2603682
{txt}{space 12} {c |}
{space 7}2.Q33 {c |}{col 14}{res}{space 2} .0292891{col 26}{space 2}  .009269{col 37}{space 1}    3.16{col 46}{space 3}0.002{col 54}{space 4} .0111181{col 67}{space 3}   .04746
{txt}{space 7}2.Q34 {c |}{col 14}{res}{space 2} .0591321{col 26}{space 2}  .019323{col 37}{space 1}    3.06{col 46}{space 3}0.002{col 54}{space 4} .0212513{col 67}{space 3} .0970129
{txt}{space 7}Q35_1 {c |}{col 14}{res}{space 2} .0834663{col 26}{space 2} .0281045{col 37}{space 1}    2.97{col 46}{space 3}0.003{col 54}{space 4} .0283703{col 67}{space 3} .1385624
{txt}{space 7}Q35_2 {c |}{col 14}{res}{space 2}-.0230933{col 26}{space 2} .0295171{col 37}{space 1}   -0.78{col 46}{space 3}0.434{col 54}{space 4}-.0809586{col 67}{space 3}  .034772
{txt}{space 7}Q35_3 {c |}{col 14}{res}{space 2} .0274572{col 26}{space 2} .0362656{col 37}{space 1}    0.76{col 46}{space 3}0.449{col 54}{space 4}-.0436379{col 67}{space 3} .0985523
{txt}{space 7}Q35_4 {c |}{col 14}{res}{space 2} .0805311{col 26}{space 2} .0324703{col 37}{space 1}    2.48{col 46}{space 3}0.013{col 54}{space 4} .0168763{col 67}{space 3} .1441858
{txt}{space 7}Q35_5 {c |}{col 14}{res}{space 2} .0661591{col 26}{space 2}  .060449{col 37}{space 1}    1.09{col 46}{space 3}0.274{col 54}{space 4}-.0523453{col 67}{space 3} .1846634
{txt}{space 7}Q35_6 {c |}{col 14}{res}{space 2} .0269365{col 26}{space 2} .0314268{col 37}{space 1}    0.86{col 46}{space 3}0.391{col 54}{space 4}-.0346727{col 67}{space 3} .0885457
{txt}{space 7}Q4new {c |}{col 14}{res}{space 2}  -.00072{col 26}{space 2} .0001974{col 37}{space 1}   -3.65{col 46}{space 3}0.000{col 54}{space 4} -.001107{col 67}{space 3} -.000333
{txt}{space 7}Q6new {c |}{col 14}{res}{space 2} .0004011{col 26}{space 2} .0002032{col 37}{space 1}    1.97{col 46}{space 3}0.048{col 54}{space 4} 2.86e-06{col 67}{space 3} .0007994
{txt}{space 5}Q9_mean {c |}{col 14}{res}{space 2} .0021036{col 26}{space 2} .0007823{col 37}{space 1}    2.69{col 46}{space 3}0.007{col 54}{space 4} .0005699{col 67}{space 3} .0036372
{txt}{space 6}Q13new {c |}{col 14}{res}{space 2}-.0004445{col 26}{space 2}  .000203{col 37}{space 1}   -2.19{col 46}{space 3}0.029{col 54}{space 4}-.0008424{col 67}{space 3}-.0000465
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0994679{col 26}{space 2}  .106598{col 37}{space 1}   -0.93{col 46}{space 3}0.351{col 54}{space 4}-.3084427{col 67}{space 3} .1095069
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est18{txt} stored)

Linear regression                                      Number of obs ={res}    6584
                                                       {txt}F( 63,  6520) ={res}    2.59
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0226
                                                       {txt}Root MSE      = {res} .44541

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     IncKurt{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2}-.0435071{col 26}{space 2} .0295364{col 37}{space 1}   -1.47{col 46}{space 3}0.141{col 54}{space 4}-.1014081{col 67}{space 3} .0143939
{txt}{space 8}Old  {c |}{col 14}{res}{space 2}-.0748751{col 26}{space 2} .0371244{col 37}{space 1}   -2.02{col 46}{space 3}0.044{col 54}{space 4} -.147651{col 67}{space 3}-.0020991
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2} .0035891{col 26}{space 2}   .01974{col 37}{space 1}    0.18{col 46}{space 3}0.856{col 54}{space 4}-.0351078{col 67}{space 3}  .042286
{txt}High Educ..  {c |}{col 14}{res}{space 2} .0431491{col 26}{space 2} .0194022{col 37}{space 1}    2.22{col 46}{space 3}0.026{col 54}{space 4} .0051144{col 67}{space 3} .0811837
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2} .0532934{col 26}{space 2} .0159195{col 37}{space 1}    3.35{col 46}{space 3}0.001{col 54}{space 4}  .022086{col 67}{space 3} .0845008
{txt}High Income  {c |}{col 14}{res}{space 2}  .069045{col 26}{space 2} .0151539{col 37}{space 1}    4.56{col 46}{space 3}0.000{col 54}{space 4} .0393385{col 67}{space 3} .0987516
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2} .0149387{col 26}{space 2} .0230018{col 37}{space 1}    0.65{col 46}{space 3}0.516{col 54}{space 4}-.0301523{col 67}{space 3} .0600298
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} .0314416{col 26}{space 2} .0378836{col 37}{space 1}    0.83{col 46}{space 3}0.407{col 54}{space 4}-.0428227{col 67}{space 3}  .105706
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2}-.0184747{col 26}{space 2} .0183109{col 37}{space 1}   -1.01{col 46}{space 3}0.313{col 54}{space 4}  -.05437{col 67}{space 3} .0174207
{txt}{space 7}2015  {c |}{col 14}{res}{space 2}-.0143295{col 26}{space 2} .0170619{col 37}{space 1}   -0.84{col 46}{space 3}0.401{col 54}{space 4}-.0477765{col 67}{space 3} .0191174
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} -.011521{col 26}{space 2} .0173235{col 37}{space 1}   -0.67{col 46}{space 3}0.506{col 54}{space 4}-.0454808{col 67}{space 3} .0224387
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0054255{col 26}{space 2} .0190619{col 37}{space 1}    0.28{col 46}{space 3}0.776{col 54}{space 4} -.031942{col 67}{space 3}  .042793
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0224227{col 26}{space 2} .0223223{col 37}{space 1}   -1.00{col 46}{space 3}0.315{col 54}{space 4}-.0661818{col 67}{space 3} .0213364
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2}-.0803407{col 26}{space 2} .1212362{col 37}{space 1}   -0.66{col 46}{space 3}0.508{col 54}{space 4}-.3180034{col 67}{space 3} .1573219
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-.0650658{col 26}{space 2} .1218133{col 37}{space 1}   -0.53{col 46}{space 3}0.593{col 54}{space 4}-.3038598{col 67}{space 3} .1737282
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-.0583536{col 26}{space 2} .1215767{col 37}{space 1}   -0.48{col 46}{space 3}0.631{col 54}{space 4}-.2966838{col 67}{space 3} .1799767
{txt}{space 9}CA  {c |}{col 14}{res}{space 2} -.014634{col 26}{space 2} .1162637{col 37}{space 1}   -0.13{col 46}{space 3}0.900{col 54}{space 4}-.2425489{col 67}{space 3} .2132809
{txt}{space 9}CO  {c |}{col 14}{res}{space 2}-.0098976{col 26}{space 2} .1216672{col 37}{space 1}   -0.08{col 46}{space 3}0.935{col 54}{space 4}-.2484052{col 67}{space 3}   .22861
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-.0914517{col 26}{space 2} .1193883{col 37}{space 1}   -0.77{col 46}{space 3}0.444{col 54}{space 4}-.3254919{col 67}{space 3} .1425885
{txt}{space 9}DC  {c |}{col 14}{res}{space 2} .0576153{col 26}{space 2} .1464996{col 37}{space 1}    0.39{col 46}{space 3}0.694{col 54}{space 4} -.229572{col 67}{space 3} .3448026
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-.0680406{col 26}{space 2} .1351432{col 37}{space 1}   -0.50{col 46}{space 3}0.615{col 54}{space 4}-.3329655{col 67}{space 3} .1968843
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-.0196591{col 26}{space 2} .1176777{col 37}{space 1}   -0.17{col 46}{space 3}0.867{col 54}{space 4} -.250346{col 67}{space 3} .2110279
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-.0096237{col 26}{space 2} .1180986{col 37}{space 1}   -0.08{col 46}{space 3}0.935{col 54}{space 4}-.2411357{col 67}{space 3} .2218883
{txt}{space 9}HI  {c |}{col 14}{res}{space 2}-.0339968{col 26}{space 2} .1657191{col 37}{space 1}   -0.21{col 46}{space 3}0.837{col 54}{space 4}-.3588605{col 67}{space 3}  .290867
{txt}{space 9}IA  {c |}{col 14}{res}{space 2} .0179435{col 26}{space 2} .1291788{col 37}{space 1}    0.14{col 46}{space 3}0.890{col 54}{space 4}-.2352893{col 67}{space 3} .2711763
{txt}{space 9}ID  {c |}{col 14}{res}{space 2} .0628494{col 26}{space 2}  .144047{col 37}{space 1}    0.44{col 46}{space 3}0.663{col 54}{space 4}  -.21953{col 67}{space 3} .3452289
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-.0084468{col 26}{space 2} .1181539{col 37}{space 1}   -0.07{col 46}{space 3}0.943{col 54}{space 4}-.2400673{col 67}{space 3} .2231736
{txt}{space 9}IN  {c |}{col 14}{res}{space 2} .0280877{col 26}{space 2} .1249597{col 37}{space 1}    0.22{col 46}{space 3}0.822{col 54}{space 4}-.2168744{col 67}{space 3} .2730497
{txt}{space 9}KS  {c |}{col 14}{res}{space 2} .0437597{col 26}{space 2} .1374257{col 37}{space 1}    0.32{col 46}{space 3}0.750{col 54}{space 4}-.2256398{col 67}{space 3} .3131592
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-.0164446{col 26}{space 2} .1212411{col 37}{space 1}   -0.14{col 46}{space 3}0.892{col 54}{space 4}-.2541169{col 67}{space 3} .2212277
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-.0465069{col 26}{space 2} .1208354{col 37}{space 1}   -0.38{col 46}{space 3}0.700{col 54}{space 4}-.2833839{col 67}{space 3} .1903701
{txt}{space 9}MA  {c |}{col 14}{res}{space 2} .0020025{col 26}{space 2} .1226724{col 37}{space 1}    0.02{col 46}{space 3}0.987{col 54}{space 4}-.2384756{col 67}{space 3} .2424806
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-.0268192{col 26}{space 2} .1196015{col 37}{space 1}   -0.22{col 46}{space 3}0.823{col 54}{space 4}-.2612773{col 67}{space 3} .2076389
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-.0219564{col 26}{space 2} .1248764{col 37}{space 1}   -0.18{col 46}{space 3}0.860{col 54}{space 4}-.2667551{col 67}{space 3} .2228423
{txt}{space 9}MI  {c |}{col 14}{res}{space 2} .0152957{col 26}{space 2} .1192625{col 37}{space 1}    0.13{col 46}{space 3}0.898{col 54}{space 4}-.2184978{col 67}{space 3} .2490892
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-.0455058{col 26}{space 2}  .118108{col 37}{space 1}   -0.39{col 46}{space 3}0.700{col 54}{space 4}-.2770361{col 67}{space 3} .1860246
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-.0067622{col 26}{space 2} .1189736{col 37}{space 1}   -0.06{col 46}{space 3}0.955{col 54}{space 4}-.2399895{col 67}{space 3} .2264651
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-.0337993{col 26}{space 2} .1265404{col 37}{space 1}   -0.27{col 46}{space 3}0.789{col 54}{space 4}-.2818599{col 67}{space 3} .2142613
{txt}{space 9}MT  {c |}{col 14}{res}{space 2} .1186705{col 26}{space 2} .2248833{col 37}{space 1}    0.53{col 46}{space 3}0.598{col 54}{space 4}-.3221745{col 67}{space 3} .5595156
{txt}{space 9}NC  {c |}{col 14}{res}{space 2} .0417847{col 26}{space 2} .1196766{col 37}{space 1}    0.35{col 46}{space 3}0.727{col 54}{space 4}-.1928208{col 67}{space 3} .2763901
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-.0385645{col 26}{space 2} .1502594{col 37}{space 1}   -0.26{col 46}{space 3}0.797{col 54}{space 4}-.3331222{col 67}{space 3} .2559932
{txt}{space 9}NE  {c |}{col 14}{res}{space 2} .1584772{col 26}{space 2} .1398055{col 37}{space 1}    1.13{col 46}{space 3}0.257{col 54}{space 4}-.1155875{col 67}{space 3} .4325418
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-.1130282{col 26}{space 2} .1213116{col 37}{space 1}   -0.93{col 46}{space 3}0.352{col 54}{space 4}-.3508388{col 67}{space 3} .1247824
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-.0418665{col 26}{space 2} .1188029{col 37}{space 1}   -0.35{col 46}{space 3}0.725{col 54}{space 4}-.2747592{col 67}{space 3} .1910262
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-.0791463{col 26}{space 2} .1273453{col 37}{space 1}   -0.62{col 46}{space 3}0.534{col 54}{space 4}-.3287848{col 67}{space 3} .1704923
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}-.0241183{col 26}{space 2} .1354873{col 37}{space 1}   -0.18{col 46}{space 3}0.859{col 54}{space 4}-.2897178{col 67}{space 3} .2414812
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-.0598768{col 26}{space 2} .1165855{col 37}{space 1}   -0.51{col 46}{space 3}0.608{col 54}{space 4}-.2884227{col 67}{space 3}  .168669
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-.0334617{col 26}{space 2} .1175466{col 37}{space 1}   -0.28{col 46}{space 3}0.776{col 54}{space 4}-.2638916{col 67}{space 3} .1969682
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-.0054892{col 26}{space 2}  .125647{col 37}{space 1}   -0.04{col 46}{space 3}0.965{col 54}{space 4}-.2517984{col 67}{space 3} .2408201
{txt}{space 9}OR  {c |}{col 14}{res}{space 2} .0205421{col 26}{space 2} .1209524{col 37}{space 1}    0.17{col 46}{space 3}0.865{col 54}{space 4}-.2165643{col 67}{space 3} .2576484
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-.0015976{col 26}{space 2} .1178342{col 37}{space 1}   -0.01{col 46}{space 3}0.989{col 54}{space 4}-.2325913{col 67}{space 3} .2293961
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-.0884601{col 26}{space 2} .1427289{col 37}{space 1}   -0.62{col 46}{space 3}0.535{col 54}{space 4}-.3682556{col 67}{space 3} .1913354
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-.0624806{col 26}{space 2} .1187422{col 37}{space 1}   -0.53{col 46}{space 3}0.599{col 54}{space 4}-.2952542{col 67}{space 3}  .170293
{txt}{space 9}SD  {c |}{col 14}{res}{space 2} .0029924{col 26}{space 2} .1870692{col 37}{space 1}    0.02{col 46}{space 3}0.987{col 54}{space 4}-.3637246{col 67}{space 3} .3697094
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-.0752079{col 26}{space 2} .1187298{col 37}{space 1}   -0.63{col 46}{space 3}0.526{col 54}{space 4}-.3079572{col 67}{space 3} .1575415
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-.0241335{col 26}{space 2}   .11693{col 37}{space 1}   -0.21{col 46}{space 3}0.836{col 54}{space 4}-.2533547{col 67}{space 3} .2050877
{txt}{space 9}UT  {c |}{col 14}{res}{space 2} .0268472{col 26}{space 2} .1247544{col 37}{space 1}    0.22{col 46}{space 3}0.830{col 54}{space 4}-.2177124{col 67}{space 3} .2714067
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}-.0090675{col 26}{space 2} .1184308{col 37}{space 1}   -0.08{col 46}{space 3}0.939{col 54}{space 4}-.2412306{col 67}{space 3} .2230956
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}-.0783826{col 26}{space 2} .1297053{col 37}{space 1}   -0.60{col 46}{space 3}0.546{col 54}{space 4}-.3326474{col 67}{space 3} .1758823
{txt}{space 9}WA  {c |}{col 14}{res}{space 2}    .0268{col 26}{space 2} .1189255{col 37}{space 1}    0.23{col 46}{space 3}0.822{col 54}{space 4} -.206333{col 67}{space 3}  .259933
{txt}{space 9}WI  {c |}{col 14}{res}{space 2} .0371794{col 26}{space 2}  .123395{col 37}{space 1}    0.30{col 46}{space 3}0.763{col 54}{space 4}-.2047153{col 67}{space 3} .2790741
{txt}{space 9}WV  {c |}{col 14}{res}{space 2} .0798291{col 26}{space 2} .1704515{col 37}{space 1}    0.47{col 46}{space 3}0.640{col 54}{space 4}-.2543117{col 67}{space 3} .4139699
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-.0037929{col 26}{space 2} .1707655{col 37}{space 1}   -0.02{col 46}{space 3}0.982{col 54}{space 4}-.3385492{col 67}{space 3} .3309634
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.5764361{col 26}{space 2} .1214193{col 37}{space 1}   -4.75{col 46}{space 3}0.000{col 54}{space 4}-.8144577{col 67}{space 3}-.3384144
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est19{txt} stored)

Linear regression                                      Number of obs ={res}    6582
                                                       {txt}F( 71,  6510) ={res}    2.94
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0277
                                                       {txt}Root MSE      = {res} .44458

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     IncKurt{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2}-.0464233{col 26}{space 2} .0295413{col 37}{space 1}   -1.57{col 46}{space 3}0.116{col 54}{space 4}-.1043339{col 67}{space 3} .0114874
{txt}{space 8}Old  {c |}{col 14}{res}{space 2}-.0808707{col 26}{space 2} .0371034{col 37}{space 1}   -2.18{col 46}{space 3}0.029{col 54}{space 4}-.1536055{col 67}{space 3}-.0081358
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2}  .008849{col 26}{space 2} .0196631{col 37}{space 1}    0.45{col 46}{space 3}0.653{col 54}{space 4}-.0296971{col 67}{space 3} .0473951
{txt}High Educ..  {c |}{col 14}{res}{space 2} .0463953{col 26}{space 2} .0193566{col 37}{space 1}    2.40{col 46}{space 3}0.017{col 54}{space 4} .0084501{col 67}{space 3} .0843406
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2} .0457044{col 26}{space 2} .0159094{col 37}{space 1}    2.87{col 46}{space 3}0.004{col 54}{space 4} .0145169{col 67}{space 3}  .076892
{txt}High Income  {c |}{col 14}{res}{space 2} .0516288{col 26}{space 2} .0153315{col 37}{space 1}    3.37{col 46}{space 3}0.001{col 54}{space 4} .0215741{col 67}{space 3} .0816836
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2} .0187296{col 26}{space 2} .0229166{col 37}{space 1}    0.82{col 46}{space 3}0.414{col 54}{space 4}-.0261945{col 67}{space 3} .0636537
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2} .0328665{col 26}{space 2} .0378295{col 37}{space 1}    0.87{col 46}{space 3}0.385{col 54}{space 4}-.0412916{col 67}{space 3} .1070247
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2}-.0172898{col 26}{space 2} .0183218{col 37}{space 1}   -0.94{col 46}{space 3}0.345{col 54}{space 4}-.0532067{col 67}{space 3}  .018627
{txt}{space 7}2015  {c |}{col 14}{res}{space 2}-.0118653{col 26}{space 2} .0168764{col 37}{space 1}   -0.70{col 46}{space 3}0.482{col 54}{space 4}-.0449485{col 67}{space 3} .0212179
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0079542{col 26}{space 2} .0172895{col 37}{space 1}   -0.46{col 46}{space 3}0.645{col 54}{space 4}-.0418473{col 67}{space 3} .0259388
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0084565{col 26}{space 2} .0188208{col 37}{space 1}    0.45{col 46}{space 3}0.653{col 54}{space 4}-.0284384{col 67}{space 3} .0453514
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0193607{col 26}{space 2} .0222332{col 37}{space 1}   -0.87{col 46}{space 3}0.384{col 54}{space 4} -.062945{col 67}{space 3} .0242237
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2}  -.07278{col 26}{space 2} .1167037{col 37}{space 1}   -0.62{col 46}{space 3}0.533{col 54}{space 4}-.3015575{col 67}{space 3} .1559976
{txt}{space 9}AR  {c |}{col 14}{res}{space 2}-.0701383{col 26}{space 2} .1169562{col 37}{space 1}   -0.60{col 46}{space 3}0.549{col 54}{space 4}-.2994108{col 67}{space 3} .1591342
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-.0678294{col 26}{space 2} .1171416{col 37}{space 1}   -0.58{col 46}{space 3}0.563{col 54}{space 4}-.2974655{col 67}{space 3} .1618067
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-.0214306{col 26}{space 2} .1114497{col 37}{space 1}   -0.19{col 46}{space 3}0.848{col 54}{space 4}-.2399087{col 67}{space 3} .1970474
{txt}{space 9}CO  {c |}{col 14}{res}{space 2}-.0195502{col 26}{space 2} .1171642{col 37}{space 1}   -0.17{col 46}{space 3}0.867{col 54}{space 4}-.2492305{col 67}{space 3} .2101302
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-.0939331{col 26}{space 2} .1145905{col 37}{space 1}   -0.82{col 46}{space 3}0.412{col 54}{space 4}-.3185681{col 67}{space 3} .1307019
{txt}{space 9}DC  {c |}{col 14}{res}{space 2} .0605638{col 26}{space 2} .1436351{col 37}{space 1}    0.42{col 46}{space 3}0.673{col 54}{space 4}-.2210082{col 67}{space 3} .3421358
{txt}{space 9}DE  {c |}{col 14}{res}{space 2} -.067357{col 26}{space 2} .1302149{col 37}{space 1}   -0.52{col 46}{space 3}0.605{col 54}{space 4}-.3226209{col 67}{space 3} .1879069
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-.0258506{col 26}{space 2} .1130265{col 37}{space 1}   -0.23{col 46}{space 3}0.819{col 54}{space 4}-.2474196{col 67}{space 3} .1957184
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-.0048204{col 26}{space 2} .1132604{col 37}{space 1}   -0.04{col 46}{space 3}0.966{col 54}{space 4}-.2268479{col 67}{space 3} .2172071
{txt}{space 9}HI  {c |}{col 14}{res}{space 2}-.0214612{col 26}{space 2} .1696751{col 37}{space 1}   -0.13{col 46}{space 3}0.899{col 54}{space 4}-.3540801{col 67}{space 3} .3111578
{txt}{space 9}IA  {c |}{col 14}{res}{space 2} .0021689{col 26}{space 2} .1249127{col 37}{space 1}    0.02{col 46}{space 3}0.986{col 54}{space 4} -.242701{col 67}{space 3} .2470387
{txt}{space 9}ID  {c |}{col 14}{res}{space 2} .0465725{col 26}{space 2} .1398395{col 37}{space 1}    0.33{col 46}{space 3}0.739{col 54}{space 4}-.2275589{col 67}{space 3}  .320704
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-.0133481{col 26}{space 2} .1132838{col 37}{space 1}   -0.12{col 46}{space 3}0.906{col 54}{space 4}-.2354217{col 67}{space 3} .2087254
{txt}{space 9}IN  {c |}{col 14}{res}{space 2} .0149993{col 26}{space 2} .1206869{col 37}{space 1}    0.12{col 46}{space 3}0.901{col 54}{space 4}-.2215867{col 67}{space 3} .2515852
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}  .032779{col 26}{space 2} .1335435{col 37}{space 1}    0.25{col 46}{space 3}0.806{col 54}{space 4}-.2290102{col 67}{space 3} .2945681
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-.0251639{col 26}{space 2} .1166545{col 37}{space 1}   -0.22{col 46}{space 3}0.829{col 54}{space 4} -.253845{col 67}{space 3} .2035172
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-.0400003{col 26}{space 2} .1160452{col 37}{space 1}   -0.34{col 46}{space 3}0.730{col 54}{space 4} -.267487{col 67}{space 3} .1874864
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-.0020593{col 26}{space 2} .1180767{col 37}{space 1}   -0.02{col 46}{space 3}0.986{col 54}{space 4}-.2335284{col 67}{space 3} .2294098
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-.0235829{col 26}{space 2} .1149057{col 37}{space 1}   -0.21{col 46}{space 3}0.837{col 54}{space 4}-.2488359{col 67}{space 3} .2016701
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-.0304748{col 26}{space 2} .1202981{col 37}{space 1}   -0.25{col 46}{space 3}0.800{col 54}{space 4}-.2662986{col 67}{space 3}  .205349
{txt}{space 9}MI  {c |}{col 14}{res}{space 2} .0040437{col 26}{space 2} .1145352{col 37}{space 1}    0.04{col 46}{space 3}0.972{col 54}{space 4}-.2204829{col 67}{space 3} .2285703
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-.0579365{col 26}{space 2}    .1134{col 37}{space 1}   -0.51{col 46}{space 3}0.609{col 54}{space 4}-.2802377{col 67}{space 3} .1643648
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-.0145835{col 26}{space 2} .1143071{col 37}{space 1}   -0.13{col 46}{space 3}0.898{col 54}{space 4}-.2386629{col 67}{space 3} .2094958
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-.0212853{col 26}{space 2} .1219307{col 37}{space 1}   -0.17{col 46}{space 3}0.861{col 54}{space 4}-.2603095{col 67}{space 3} .2177388
{txt}{space 9}MT  {c |}{col 14}{res}{space 2} .1096343{col 26}{space 2} .2222119{col 37}{space 1}    0.49{col 46}{space 3}0.622{col 54}{space 4}-.3259741{col 67}{space 3} .5452426
{txt}{space 9}NC  {c |}{col 14}{res}{space 2} .0374558{col 26}{space 2} .1151906{col 37}{space 1}    0.33{col 46}{space 3}0.745{col 54}{space 4}-.1883557{col 67}{space 3} .2632673
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-.0520313{col 26}{space 2} .1475924{col 37}{space 1}   -0.35{col 46}{space 3}0.724{col 54}{space 4} -.341361{col 67}{space 3} .2372983
{txt}{space 9}NE  {c |}{col 14}{res}{space 2} .1457505{col 26}{space 2} .1355394{col 37}{space 1}    1.08{col 46}{space 3}0.282{col 54}{space 4}-.1199513{col 67}{space 3} .4114523
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-.1235752{col 26}{space 2} .1168379{col 37}{space 1}   -1.06{col 46}{space 3}0.290{col 54}{space 4}-.3526159{col 67}{space 3} .1054655
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-.0500503{col 26}{space 2} .1142534{col 37}{space 1}   -0.44{col 46}{space 3}0.661{col 54}{space 4}-.2740244{col 67}{space 3} .1739238
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-.0901311{col 26}{space 2} .1229983{col 37}{space 1}   -0.73{col 46}{space 3}0.464{col 54}{space 4}-.3312482{col 67}{space 3} .1509859
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}-.0317608{col 26}{space 2} .1312028{col 37}{space 1}   -0.24{col 46}{space 3}0.809{col 54}{space 4}-.2889614{col 67}{space 3} .2254399
{txt}{space 9}NY  {c |}{col 14}{res}{space 2} -.067906{col 26}{space 2} .1117921{col 37}{space 1}   -0.61{col 46}{space 3}0.544{col 54}{space 4}-.2870553{col 67}{space 3} .1512434
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-.0449957{col 26}{space 2} .1128685{col 37}{space 1}   -0.40{col 46}{space 3}0.690{col 54}{space 4}-.2662551{col 67}{space 3} .1762637
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-.0157574{col 26}{space 2} .1202318{col 37}{space 1}   -0.13{col 46}{space 3}0.896{col 54}{space 4}-.2514512{col 67}{space 3} .2199364
{txt}{space 9}OR  {c |}{col 14}{res}{space 2} .0091775{col 26}{space 2}  .116212{col 37}{space 1}    0.08{col 46}{space 3}0.937{col 54}{space 4}-.2186362{col 67}{space 3} .2369911
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-.0084292{col 26}{space 2} .1130679{col 37}{space 1}   -0.07{col 46}{space 3}0.941{col 54}{space 4}-.2300794{col 67}{space 3}  .213221
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-.1024432{col 26}{space 2} .1386632{col 37}{space 1}   -0.74{col 46}{space 3}0.460{col 54}{space 4}-.3742685{col 67}{space 3} .1693822
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-.0615668{col 26}{space 2} .1140703{col 37}{space 1}   -0.54{col 46}{space 3}0.589{col 54}{space 4} -.285182{col 67}{space 3} .1620485
{txt}{space 9}SD  {c |}{col 14}{res}{space 2}-.0140283{col 26}{space 2} .1861798{col 37}{space 1}   -0.08{col 46}{space 3}0.940{col 54}{space 4}-.3790018{col 67}{space 3} .3509452
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-.0826165{col 26}{space 2} .1140697{col 37}{space 1}   -0.72{col 46}{space 3}0.469{col 54}{space 4}-.3062306{col 67}{space 3} .1409977
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-.0287858{col 26}{space 2} .1122682{col 37}{space 1}   -0.26{col 46}{space 3}0.798{col 54}{space 4}-.2488684{col 67}{space 3} .1912968
{txt}{space 9}UT  {c |}{col 14}{res}{space 2} .0063031{col 26}{space 2} .1206095{col 37}{space 1}    0.05{col 46}{space 3}0.958{col 54}{space 4}-.2301312{col 67}{space 3} .2427374
{txt}{space 9}VA  {c |}{col 14}{res}{space 2} -.011401{col 26}{space 2} .1137165{col 37}{space 1}   -0.10{col 46}{space 3}0.920{col 54}{space 4}-.2343227{col 67}{space 3} .2115207
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}-.0940663{col 26}{space 2} .1248572{col 37}{space 1}   -0.75{col 46}{space 3}0.451{col 54}{space 4}-.3388273{col 67}{space 3} .1506947
{txt}{space 9}WA  {c |}{col 14}{res}{space 2} .0154444{col 26}{space 2} .1141314{col 37}{space 1}    0.14{col 46}{space 3}0.892{col 54}{space 4}-.2082906{col 67}{space 3} .2391794
{txt}{space 9}WI  {c |}{col 14}{res}{space 2} .0249662{col 26}{space 2} .1187174{col 37}{space 1}    0.21{col 46}{space 3}0.833{col 54}{space 4}-.2077588{col 67}{space 3} .2576913
{txt}{space 9}WV  {c |}{col 14}{res}{space 2} .0625606{col 26}{space 2} .1675314{col 37}{space 1}    0.37{col 46}{space 3}0.709{col 54}{space 4}-.2658559{col 67}{space 3} .3909771
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-.0221725{col 26}{space 2} .1665138{col 37}{space 1}   -0.13{col 46}{space 3}0.894{col 54}{space 4}-.3485942{col 67}{space 3} .3042492
{txt}{space 12} {c |}
{space 7}2.Q33 {c |}{col 14}{res}{space 2} .0484369{col 26}{space 2} .0110863{col 37}{space 1}    4.37{col 46}{space 3}0.000{col 54}{space 4} .0267041{col 67}{space 3} .0701696
{txt}{space 7}2.Q34 {c |}{col 14}{res}{space 2}-.0049543{col 26}{space 2} .0221187{col 37}{space 1}   -0.22{col 46}{space 3}0.823{col 54}{space 4}-.0483142{col 67}{space 3} .0384056
{txt}{space 7}Q35_1 {c |}{col 14}{res}{space 2} .0493248{col 26}{space 2} .0348095{col 37}{space 1}    1.42{col 46}{space 3}0.157{col 54}{space 4}-.0189133{col 67}{space 3}  .117563
{txt}{space 7}Q35_2 {c |}{col 14}{res}{space 2}-.0157253{col 26}{space 2} .0362651{col 37}{space 1}   -0.43{col 46}{space 3}0.665{col 54}{space 4}-.0868169{col 67}{space 3} .0553663
{txt}{space 7}Q35_3 {c |}{col 14}{res}{space 2}  .037342{col 26}{space 2} .0351769{col 37}{space 1}    1.06{col 46}{space 3}0.288{col 54}{space 4}-.0316162{col 67}{space 3} .1063003
{txt}{space 7}Q35_4 {c |}{col 14}{res}{space 2} .0500504{col 26}{space 2}  .041652{col 37}{space 1}    1.20{col 46}{space 3}0.230{col 54}{space 4}-.0316012{col 67}{space 3} .1317019
{txt}{space 7}Q35_5 {c |}{col 14}{res}{space 2}-.0706928{col 26}{space 2} .0681842{col 37}{space 1}   -1.04{col 46}{space 3}0.300{col 54}{space 4}-.2043563{col 67}{space 3} .0629707
{txt}{space 7}Q35_6 {c |}{col 14}{res}{space 2} .0469212{col 26}{space 2} .0430668{col 37}{space 1}    1.09{col 46}{space 3}0.276{col 54}{space 4}-.0375039{col 67}{space 3} .1313462
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.6290228{col 26}{space 2} .1212926{col 37}{space 1}   -5.19{col 46}{space 3}0.000{col 54}{space 4}-.8667962{col 67}{space 3}-.3912495
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est20{txt} stored)

Linear regression                                      Number of obs ={res}    5524
                                                       {txt}F( 75,  5448) ={res}    3.11
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0343
                                                       {txt}Root MSE      = {res}  .4486

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     IncKurt{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}age_g {c |}
{space 1}Middle-age  {c |}{col 14}{res}{space 2}-.0319296{col 26}{space 2} .0332991{col 37}{space 1}   -0.96{col 46}{space 3}0.338{col 54}{space 4} -.097209{col 67}{space 3} .0333499
{txt}{space 8}Old  {c |}{col 14}{res}{space 2}-.0601369{col 26}{space 2} .0418228{col 37}{space 1}   -1.44{col 46}{space 3}0.151{col 54}{space 4}-.1421263{col 67}{space 3} .0218526
{txt}{space 12} {c |}
{space 7}edu_g {c |}
Medium Ed..  {c |}{col 14}{res}{space 2} .0037145{col 26}{space 2}  .022108{col 37}{space 1}    0.17{col 46}{space 3}0.867{col 54}{space 4} -.039626{col 67}{space 3}  .047055
{txt}High Educ..  {c |}{col 14}{res}{space 2} .0377749{col 26}{space 2} .0217111{col 37}{space 1}    1.74{col 46}{space 3}0.082{col 54}{space 4}-.0047875{col 67}{space 3} .0803373
{txt}{space 12} {c |}
{space 7}inc_g {c |}
Middle In..  {c |}{col 14}{res}{space 2} .0541178{col 26}{space 2} .0180358{col 37}{space 1}    3.00{col 46}{space 3}0.003{col 54}{space 4} .0187604{col 67}{space 3} .0894752
{txt}High Income  {c |}{col 14}{res}{space 2} .0614299{col 26}{space 2} .0175834{col 37}{space 1}    3.49{col 46}{space 3}0.000{col 54}{space 4} .0269594{col 67}{space 3} .0959003
{txt}{space 12} {c |}
{space 4}cohort_g {c |}
{space 2}1957-1972  {c |}{col 14}{res}{space 2}  .014223{col 26}{space 2} .0261913{col 37}{space 1}    0.54{col 46}{space 3}0.587{col 54}{space 4}-.0371224{col 67}{space 3} .0655685
{txt}{space 2}1973-2000  {c |}{col 14}{res}{space 2}  .048453{col 26}{space 2} .0428802{col 37}{space 1}    1.13{col 46}{space 3}0.259{col 54}{space 4}-.0356094{col 67}{space 3} .1325153
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2}-.0277259{col 26}{space 2} .0196912{col 37}{space 1}   -1.41{col 46}{space 3}0.159{col 54}{space 4}-.0663285{col 67}{space 3} .0108766
{txt}{space 7}2015  {c |}{col 14}{res}{space 2}-.0151147{col 26}{space 2} .0188062{col 37}{space 1}   -0.80{col 46}{space 3}0.422{col 54}{space 4}-.0519823{col 67}{space 3}  .021753
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0121152{col 26}{space 2} .0192358{col 37}{space 1}   -0.63{col 46}{space 3}0.529{col 54}{space 4} -.049825{col 67}{space 3} .0255945
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0001379{col 26}{space 2} .0208893{col 37}{space 1}    0.01{col 46}{space 3}0.995{col 54}{space 4}-.0408134{col 67}{space 3} .0410892
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0268989{col 26}{space 2} .0244122{col 37}{space 1}   -1.10{col 46}{space 3}0.271{col 54}{space 4}-.0747565{col 67}{space 3} .0209587
{txt}{space 12} {c |}
{space 4}state_id {c |}
{space 9}AL  {c |}{col 14}{res}{space 2} .0267225{col 26}{space 2} .0970063{col 37}{space 1}    0.28{col 46}{space 3}0.783{col 54}{space 4}-.1634487{col 67}{space 3} .2168937
{txt}{space 9}AR  {c |}{col 14}{res}{space 2} .0410196{col 26}{space 2} .0983422{col 37}{space 1}    0.42{col 46}{space 3}0.677{col 54}{space 4}-.1517703{col 67}{space 3} .2338096
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2} .0281988{col 26}{space 2} .0963756{col 37}{space 1}    0.29{col 46}{space 3}0.770{col 54}{space 4}-.1607359{col 67}{space 3} .2171336
{txt}{space 9}CA  {c |}{col 14}{res}{space 2} .1005973{col 26}{space 2} .0893803{col 37}{space 1}    1.13{col 46}{space 3}0.260{col 54}{space 4}-.0746239{col 67}{space 3} .2758185
{txt}{space 9}CO  {c |}{col 14}{res}{space 2} .1219065{col 26}{space 2} .0987795{col 37}{space 1}    1.23{col 46}{space 3}0.217{col 54}{space 4}-.0717407{col 67}{space 3} .3155537
{txt}{space 9}CT  {c |}{col 14}{res}{space 2} .0104605{col 26}{space 2} .0925884{col 37}{space 1}    0.11{col 46}{space 3}0.910{col 54}{space 4}-.1710497{col 67}{space 3} .1919706
{txt}{space 9}DC  {c |}{col 14}{res}{space 2} .1618956{col 26}{space 2} .1274372{col 37}{space 1}    1.27{col 46}{space 3}0.204{col 54}{space 4}-.0879321{col 67}{space 3} .4117234
{txt}{space 9}DE  {c |}{col 14}{res}{space 2} .0587724{col 26}{space 2} .1134532{col 37}{space 1}    0.52{col 46}{space 3}0.604{col 54}{space 4}-.1636412{col 67}{space 3}  .281186
{txt}{space 9}FL  {c |}{col 14}{res}{space 2} .1031372{col 26}{space 2} .0916507{col 37}{space 1}    1.13{col 46}{space 3}0.260{col 54}{space 4}-.0765347{col 67}{space 3} .2828091
{txt}{space 9}GA  {c |}{col 14}{res}{space 2} .1223106{col 26}{space 2} .0927537{col 37}{space 1}    1.32{col 46}{space 3}0.187{col 54}{space 4}-.0595237{col 67}{space 3} .3041448
{txt}{space 9}HI  {c |}{col 14}{res}{space 2} .1701788{col 26}{space 2} .1799402{col 37}{space 1}    0.95{col 46}{space 3}0.344{col 54}{space 4}-.1825758{col 67}{space 3} .5229334
{txt}{space 9}IA  {c |}{col 14}{res}{space 2} .0949531{col 26}{space 2} .1029659{col 37}{space 1}    0.92{col 46}{space 3}0.356{col 54}{space 4}-.1069012{col 67}{space 3} .2968074
{txt}{space 9}ID  {c |}{col 14}{res}{space 2}  .221017{col 26}{space 2} .1352598{col 37}{space 1}    1.63{col 46}{space 3}0.102{col 54}{space 4}-.0441462{col 67}{space 3} .4861801
{txt}{space 9}IL  {c |}{col 14}{res}{space 2} .0933685{col 26}{space 2} .0914582{col 37}{space 1}    1.02{col 46}{space 3}0.307{col 54}{space 4} -.085926{col 67}{space 3} .2726631
{txt}{space 9}IN  {c |}{col 14}{res}{space 2} .1398361{col 26}{space 2} .1026326{col 37}{space 1}    1.36{col 46}{space 3}0.173{col 54}{space 4}-.0613647{col 67}{space 3} .3410369
{txt}{space 9}KS  {c |}{col 14}{res}{space 2} .1874199{col 26}{space 2} .1210654{col 37}{space 1}    1.55{col 46}{space 3}0.122{col 54}{space 4}-.0499166{col 67}{space 3} .4247564
{txt}{space 9}KY  {c |}{col 14}{res}{space 2} .0966177{col 26}{space 2}  .097699{col 37}{space 1}    0.99{col 46}{space 3}0.323{col 54}{space 4}-.0949113{col 67}{space 3} .2881468
{txt}{space 9}LA  {c |}{col 14}{res}{space 2} .1027027{col 26}{space 2}   .09729{col 37}{space 1}    1.06{col 46}{space 3}0.291{col 54}{space 4}-.0880247{col 67}{space 3} .2934301
{txt}{space 9}MA  {c |}{col 14}{res}{space 2} .0886281{col 26}{space 2} .0945563{col 37}{space 1}    0.94{col 46}{space 3}0.349{col 54}{space 4}-.0967401{col 67}{space 3} .2739962
{txt}{space 9}MD  {c |}{col 14}{res}{space 2} .0709515{col 26}{space 2} .0927028{col 37}{space 1}    0.77{col 46}{space 3}0.444{col 54}{space 4}-.1107831{col 67}{space 3}  .252686
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}  .055547{col 26}{space 2} .1003689{col 37}{space 1}    0.55{col 46}{space 3}0.580{col 54}{space 4}-.1412162{col 67}{space 3} .2523102
{txt}{space 9}MI  {c |}{col 14}{res}{space 2}  .104322{col 26}{space 2} .0928072{col 37}{space 1}    1.12{col 46}{space 3}0.261{col 54}{space 4}-.0776173{col 67}{space 3} .2862613
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}  .020198{col 26}{space 2} .0905288{col 37}{space 1}    0.22{col 46}{space 3}0.823{col 54}{space 4}-.1572747{col 67}{space 3} .1976707
{txt}{space 9}MO  {c |}{col 14}{res}{space 2} .1307683{col 26}{space 2} .0942065{col 37}{space 1}    1.39{col 46}{space 3}0.165{col 54}{space 4}-.0539141{col 67}{space 3} .3154506
{txt}{space 9}MS  {c |}{col 14}{res}{space 2} .1074749{col 26}{space 2} .1044276{col 37}{space 1}    1.03{col 46}{space 3}0.303{col 54}{space 4} -.097245{col 67}{space 3} .3121947
{txt}{space 9}MT  {c |}{col 14}{res}{space 2} .2598292{col 26}{space 2} .2453515{col 37}{space 1}    1.06{col 46}{space 3}0.290{col 54}{space 4}-.2211577{col 67}{space 3} .7408161
{txt}{space 9}NC  {c |}{col 14}{res}{space 2} .1731764{col 26}{space 2} .0948413{col 37}{space 1}    1.83{col 46}{space 3}0.068{col 54}{space 4}-.0127504{col 67}{space 3} .3591032
{txt}{space 9}ND  {c |}{col 14}{res}{space 2} .0666903{col 26}{space 2} .1391309{col 37}{space 1}    0.48{col 46}{space 3}0.632{col 54}{space 4}-.2060619{col 67}{space 3} .3394426
{txt}{space 9}NE  {c |}{col 14}{res}{space 2} .2863402{col 26}{space 2} .1247148{col 37}{space 1}    2.30{col 46}{space 3}0.022{col 54}{space 4} .0418494{col 67}{space 3}  .530831
{txt}{space 9}NH  {c |}{col 14}{res}{space 2} .0142445{col 26}{space 2} .0954068{col 37}{space 1}    0.15{col 46}{space 3}0.881{col 54}{space 4} -.172791{col 67}{space 3}   .20128
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2} .0572583{col 26}{space 2}  .093411{col 37}{space 1}    0.61{col 46}{space 3}0.540{col 54}{space 4}-.1258646{col 67}{space 3} .2403813
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}-.0039636{col 26}{space 2} .1028952{col 37}{space 1}   -0.04{col 46}{space 3}0.969{col 54}{space 4}-.2056794{col 67}{space 3} .1977521
{txt}{space 9}NV  {c |}{col 14}{res}{space 2} .1153942{col 26}{space 2} .1190697{col 37}{space 1}    0.97{col 46}{space 3}0.333{col 54}{space 4}  -.11803{col 67}{space 3} .3488185
{txt}{space 9}NY  {c |}{col 14}{res}{space 2} .0437392{col 26}{space 2} .0894685{col 37}{space 1}    0.49{col 46}{space 3}0.625{col 54}{space 4}-.1316548{col 67}{space 3} .2191332
{txt}{space 9}OH  {c |}{col 14}{res}{space 2} .0757734{col 26}{space 2} .0915233{col 37}{space 1}    0.83{col 46}{space 3}0.408{col 54}{space 4}-.1036489{col 67}{space 3} .2551957
{txt}{space 9}OK  {c |}{col 14}{res}{space 2} .1042946{col 26}{space 2}   .10398{col 37}{space 1}    1.00{col 46}{space 3}0.316{col 54}{space 4}-.0995478{col 67}{space 3}  .308137
{txt}{space 9}OR  {c |}{col 14}{res}{space 2} .1406591{col 26}{space 2} .0971345{col 37}{space 1}    1.45{col 46}{space 3}0.148{col 54}{space 4}-.0497634{col 67}{space 3} .3310816
{txt}{space 9}PA  {c |}{col 14}{res}{space 2} .1250988{col 26}{space 2} .0921121{col 37}{space 1}    1.36{col 46}{space 3}0.174{col 54}{space 4}-.0554777{col 67}{space 3} .3056753
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-.0170897{col 26}{space 2}  .123348{col 37}{space 1}   -0.14{col 46}{space 3}0.890{col 54}{space 4} -.258901{col 67}{space 3} .2247216
{txt}{space 9}SC  {c |}{col 14}{res}{space 2} .0653318{col 26}{space 2} .0936452{col 37}{space 1}    0.70{col 46}{space 3}0.485{col 54}{space 4}-.1182501{col 67}{space 3} .2489137
{txt}{space 9}SD  {c |}{col 14}{res}{space 2} .1315865{col 26}{space 2} .2318701{col 37}{space 1}    0.57{col 46}{space 3}0.570{col 54}{space 4}-.3229715{col 67}{space 3} .5861446
{txt}{space 9}TN  {c |}{col 14}{res}{space 2} .0326078{col 26}{space 2} .0933903{col 37}{space 1}    0.35{col 46}{space 3}0.727{col 54}{space 4}-.1504745{col 67}{space 3} .2156902
{txt}{space 9}TX  {c |}{col 14}{res}{space 2} .1094873{col 26}{space 2} .0912867{col 37}{space 1}    1.20{col 46}{space 3}0.230{col 54}{space 4}-.0694711{col 67}{space 3} .2884457
{txt}{space 9}UT  {c |}{col 14}{res}{space 2} .1390968{col 26}{space 2} .1013648{col 37}{space 1}    1.37{col 46}{space 3}0.170{col 54}{space 4}-.0596187{col 67}{space 3} .3378123
{txt}{space 9}VA  {c |}{col 14}{res}{space 2} .1052925{col 26}{space 2} .0921162{col 37}{space 1}    1.14{col 46}{space 3}0.253{col 54}{space 4}-.0752919{col 67}{space 3}  .285877
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}  .012434{col 26}{space 2} .1061754{col 37}{space 1}    0.12{col 46}{space 3}0.907{col 54}{space 4}-.1957123{col 67}{space 3} .2205803
{txt}{space 9}WA  {c |}{col 14}{res}{space 2} .1541886{col 26}{space 2} .0931078{col 37}{space 1}    1.66{col 46}{space 3}0.098{col 54}{space 4}-.0283399{col 67}{space 3} .3367171
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}  .153753{col 26}{space 2} .0989997{col 37}{space 1}    1.55{col 46}{space 3}0.120{col 54}{space 4} -.040326{col 67}{space 3}  .347832
{txt}{space 9}WV  {c |}{col 14}{res}{space 2} .2017389{col 26}{space 2} .1805879{col 37}{space 1}    1.12{col 46}{space 3}0.264{col 54}{space 4}-.1522856{col 67}{space 3} .5557634
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}  .127235{col 26}{space 2} .1766077{col 37}{space 1}    0.72{col 46}{space 3}0.471{col 54}{space 4}-.2189866{col 67}{space 3} .4734566
{txt}{space 12} {c |}
{space 7}2.Q33 {c |}{col 14}{res}{space 2}  .040256{col 26}{space 2} .0125095{col 37}{space 1}    3.22{col 46}{space 3}0.001{col 54}{space 4} .0157324{col 67}{space 3} .0647795
{txt}{space 7}2.Q34 {c |}{col 14}{res}{space 2}-.0116309{col 26}{space 2} .0256398{col 37}{space 1}   -0.45{col 46}{space 3}0.650{col 54}{space 4}-.0618952{col 67}{space 3} .0386335
{txt}{space 7}Q35_1 {c |}{col 14}{res}{space 2} .0322391{col 26}{space 2} .0380452{col 37}{space 1}    0.85{col 46}{space 3}0.397{col 54}{space 4}-.0423448{col 67}{space 3} .1068229
{txt}{space 7}Q35_2 {c |}{col 14}{res}{space 2}-.0268946{col 26}{space 2}  .039541{col 37}{space 1}   -0.68{col 46}{space 3}0.496{col 54}{space 4}-.1044108{col 67}{space 3} .0506216
{txt}{space 7}Q35_3 {c |}{col 14}{res}{space 2}  .041086{col 26}{space 2} .0396564{col 37}{space 1}    1.04{col 46}{space 3}0.300{col 54}{space 4}-.0366564{col 67}{space 3} .1188284
{txt}{space 7}Q35_4 {c |}{col 14}{res}{space 2} .0347987{col 26}{space 2}  .044758{col 37}{space 1}    0.78{col 46}{space 3}0.437{col 54}{space 4}-.0529448{col 67}{space 3} .1225423
{txt}{space 7}Q35_5 {c |}{col 14}{res}{space 2}-.1036672{col 26}{space 2} .0782046{col 37}{space 1}   -1.33{col 46}{space 3}0.185{col 54}{space 4}-.2569794{col 67}{space 3}  .049645
{txt}{space 7}Q35_6 {c |}{col 14}{res}{space 2} .0335602{col 26}{space 2} .0492925{col 37}{space 1}    0.68{col 46}{space 3}0.496{col 54}{space 4}-.0630728{col 67}{space 3} .1301932
{txt}{space 7}Q4new {c |}{col 14}{res}{space 2} .0002503{col 26}{space 2} .0002809{col 37}{space 1}    0.89{col 46}{space 3}0.373{col 54}{space 4}-.0003004{col 67}{space 3}  .000801
{txt}{space 7}Q6new {c |}{col 14}{res}{space 2} .0008652{col 26}{space 2}  .000268{col 37}{space 1}    3.23{col 46}{space 3}0.001{col 54}{space 4} .0003398{col 67}{space 3} .0013907
{txt}{space 5}Q9_mean {c |}{col 14}{res}{space 2}-.0025494{col 26}{space 2} .0010373{col 37}{space 1}   -2.46{col 46}{space 3}0.014{col 54}{space 4}-.0045829{col 67}{space 3}-.0005158
{txt}{space 6}Q13new {c |}{col 14}{res}{space 2} .0002657{col 26}{space 2} .0003185{col 37}{space 1}    0.83{col 46}{space 3}0.404{col 54}{space 4}-.0003587{col 67}{space 3} .0008902
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.7710454{col 26}{space 2} .1066375{col 37}{space 1}   -7.23{col 46}{space 3}0.000{col 54}{space 4}-.9800975{col 67}{space 3}-.5619933
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est21{txt} stored)

{com}. 
. esttab using "${c -(}sum_table_folder{c )-}/mom_group.csv", ///
>              se r2 drop(0.age_g 0.edu_g 0.inc_g 0.cohort_g  *.year *state_id 1.Q33 1.Q34 _cons) ///
>                          label replace
{res}{txt}(output written to {browse  `"/Users/Myworld/Dropbox/IncExpProject/WorkingFolder/Tables/mom_group.csv"'})

{com}. 
. 
. log close 
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/Myworld/Dropbox/IncExpProject/WorkingFolder/indSCE_Est_log.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 7 Nov 2019, 13:54:07
{txt}{.-}
{smcl}
{txt}{sf}{ul off}